{"title": "Adam Grant Picks 15 New Leadership Books for a Summer in a Quarantine", "data": [{"type": "subtitle", "content": "There’s plenty of reading to keep you occupied during your socially distant vacation"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*AedL3gcNyAFiT8iuLhMGWQ.jpeg"}, {"type": "sentence", "content": "It’s often said that leaders shouldn’t let a crisis go to waste. If your idea of using isolation time well is learning about leadership, here are the new and upcoming releases I’ve been reading over the past few months."}, {"type": "sentence", "content": "They’re not exactly beach books, but you might not be going to the beach anyway. With topics that range from negotiation tactics to decision-making, these new titles will help you expand your thinking and improve yourself as a leader. Some are familiar names; others are first-timer authors."}, {"type": "subtitle", "content": "1. Manifesto for a Moral Revolution by Jacqueline Novogratz (May 5)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*9Qmenu8onpnx-S8VI57ahw.png"}, {"type": "sentence", "content": "Novogratz is one of the most inspiring leaders on the planet. As the founder and CEO of Acumen, she’s spent the past two decades waging a global war on poverty and putting impact investing on the map. Now she’s poured her heart into a moving book on how we can do more to make a difference. I can’t think of a better time than right now to start learning how to improve at improving the world."}, {"type": "subtitle", "content": "2. Ask for More by Alexandra Carter (May 5)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*6d_cRKQUOwv0ozaIxGtzuQ.png"}, {"type": "sentence", "content": "Carter has trained diplomats in the United Nations in negotiation skills. She’s won the highest teaching award at Columbia University, where she directs the law school’s conflict mediation clinic. She’s written an immediately actionable resource for getting the results you want — and building better relationships along the way."}, {"type": "subtitle", "content": "3. Leading Without Authority by Keith Ferrazzi (May 26)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*l7WlWYOO-f0E43TyzMGiJA.png"}, {"type": "sentence", "content": "When most people talk about leading without authority, they’re up in the clouds. As a master networker, Ferrazzi has gone down into the trenches to figure out what it really takes to empower people. In Never Eat Alone, he taught us how to make connections that advance our careers, and now he’s showing us how to make teams more than the sum of their parts."}, {"type": "subtitle", "content": "4. Leadership by Algorithm by David De Cremer (May 26)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*h8iqI2iT3WoI97xB4yujNw.png"}, {"type": "sentence", "content": "Everyone is buzzing about artificial intelligence, but few people have a clue how it will affect the way organizations are managed. After spending years studying leadership and trust, De Cremer has written the most informative book I’ve read on how algorithms will change leadership — and which parts are unlikely to be replaced by a machine."}, {"type": "subtitle", "content": "5. Humankind by Rutger Bregman (June 2)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*PvBpkgjWm7xXrV-jza4Oyg.png"}, {"type": "sentence", "content": "This book demolishes the cynical view that humans are inherently nasty and selfish, and paints a portrait of human nature that’s not only more uplifting — it’s also more accurate. Bregman is an unusually original thinker, and by taking us on a guided tour of the past, he reveals how we can create a future with more givers and fewer takers."}, {"type": "subtitle", "content": "6. Inclusify by Stefanie Johnson (June 2)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*zo1HLtOndilh3erolaWeAQ.png"}, {"type": "sentence", "content": "Many leaders are talking about the need for more diverse, inclusive workplaces, but few are making real progress. Enter Stefanie Johnson, a leading expert. She draws on her background as a researcher, consultant, and adviser to offer rigorous evidence and practical ideas for making sure that people who stand out are able to fit in too."}, {"type": "subtitle", "content": "7. The Biggest Bluff by Maria Konnikova (June 23)"}, {"type": "image", "content": "https://miro.medium.com/max/592/0*YykqteC2aXWt17Yu"}, {"type": "sentence", "content": "This book probably won’t turn you into an international poker champ overnight, and it definitely won’t make you as smart as Konnikova. But it will do something just as valuable: It will teach you to think more like her. It’s rare enough to find a memoir this transfixing or a behavioral science book this insightful. To have them combined in one place — by a psychologist who mastered one of the most competitive games on earth — is a real treat."}, {"type": "subtitle", "content": "8. The Power of Ritual by Casper Ter Kuile (June 23)"}, {"type": "image", "content": "https://miro.medium.com/max/600/0*M148fG_xWNPklOxo"}, {"type": "sentence", "content": "It’s not often you come across someone who’s been called a minister for non-religious people. Meet ter Kuile, who co-hosts a podcast on spiritual lessons from Harry Potter, which treats the book like a sacred text. His book brims with wisdom about how we can turn our daily habits into deeper sources of connection and meaning."}, {"type": "subtitle", "content": "9. You’re About to Make a Terrible Mistake! by Olivier Sibony (July 14)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*BjQ0T4L7Jc76WV6lVxrmHA.png"}, {"type": "sentence", "content": "You’re probably familiar with many of the biases that can ruin your decisions. The question is what to do about them when you’re developing your business strategy, and Sibony has some compelling answers. Drawing on his extensive experience as a consultant and his impressive knowledge of behavioral science, he explains how you can make your organization smarter than the people in it."}, {"type": "subtitle", "content": "10. The Making of a Leader by Tom Young (July 30)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*v-6DGZA6SArzn4msLpTMmA.png"}, {"type": "sentence", "content": "Although elite athletes understand the keys to excellence, you rarely have the chance to get inside their heads. But now, you’re in luck. As a performance psychologist, Young has worked closely with some of the world’s best in both individual and team sports. In this fascinating read, he shares rich stories and keen insights on the science — and the practice — of achieving and sustaining success."}, {"type": "subtitle", "content": "11. What Girls Need by Marisa Porges (August 4)"}, {"type": "image", "content": "https://miro.medium.com/max/596/0*pVyGcDTW2A3tjiol"}, {"type": "sentence", "content": "This is a powerful book about how we can raise girls to become strong, ambitious leaders. The ideas are timely, and the stories are relatable — Porges has lived them herself. She flew fighter jets in the Navy and now runs a girls’ school."}, {"type": "subtitle", "content": "12. Making Sense by Sam Harris (August 11)"}, {"type": "image", "content": "https://miro.medium.com/max/600/0*__tWGnu1xH4w9967"}, {"type": "sentence", "content": "Harris is a true public intellectual: He thinks deeply about a wide range of issues and engages fearlessly with controversial topics and unpopular opinions. This book features some of the most compelling conversations from his hit podcast. You don’t have to agree with him to learn from him — he has a gift for surfacing new ideas as well as new questions."}, {"type": "subtitle", "content": "13. The End of Food Allergy by Kari Nadeau and Sloan Barnett (August 11)"}, {"type": "image", "content": "https://miro.medium.com/max/596/0*vnlRMUdVG9ou-KwG"}, {"type": "sentence", "content": "As a pioneering scientist, Nadeau has steered the allergy world out of the dark ages and into the light of evidence-based cures. For anyone who has suffered from food allergies or lived in fear of them, this book is a ray of hope—and fascinating a window into how a leading scientist works. It’s an illuminating read on why our own immune systems sometimes hold us hostage after we eat — and how we can stop it from ever happening again."}, {"type": "subtitle", "content": "14. Humanocracy by Gary Hamel and Michele Zanini (August 18)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*6bb-G3ZayBDB3yUBycmYQQ.jpeg"}, {"type": "sentence", "content": "If an organization has ever crushed your dreams, this book just might help to rejuvenate you. It’s hard to imagine a better guide to busting bureaucracies and designing workplaces that live up to the potential of the people inside them."}, {"type": "subtitle", "content": "15. 2030 AD by Mauro Guillen (August 25)"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*wjkcW604rDHolC2n1fLuAg.png"}, {"type": "sentence", "content": "For too long, the public’s understanding of social science has been dominated by economists and psychologists. But we’re surprisingly uninformed about how social structures are transforming the world around us. As a brilliant sociologist, Guillén is here to change that. His bold, provocative book illuminates why we’re having fewer babies, the middle class is stagnating, unemployment is shifting, and new powers are rising."}], "topic": "productivity"}