{"title": "You’re a marketing victim, admit it!", "data": [{"type": "image", "content": "https://miro.medium.com/max/1280/1*4YtF6sJnOsMhszxUrJBx_A.jpeg"}, {"type": "sentence", "content": "We’ve all been there. In the grocery store, staring glossy-eyed at the 100 different pasta boxes without knowing which to choose. And then, without really giving it a second thought, we go for one brand over all the others. More often than not, our decision is influenced by age-old marketing practices. It’s another definite win for advertising — and we become a “victim” to marketing yet again."}, {"type": "sentence", "content": "But let’s not beat ourselves up over it. As we know, there are many marketing tactics at play here, making it almost impossible for us to make an unbiased decision. Frequency is one of them. Campaigns held on a regular basis substantially influence our purchasing behaviour. The more times you heard about a product or saw its advertisement, the more likely you will be to buy it."}, {"type": "sentence", "content": "Another is visual content. The more appealing it is, the more people trust it. A strong case in point is Nespresso. It’s almost impossible not to see George Clooney’s irresistible face when thinking about that leader in coffee capsules. Then again, what else?"}, {"type": "image", "content": "https://miro.medium.com/max/1024/1*lZQbzvD5C1AjZbcC59_QPg.png"}, {"type": "sentence", "content": "Whether you like it or not, we are all marketing victims, it’s just that some of us are more conscious about it than others. Admit it, you choose Coke over Pepsi or you buy beauty products online after seeing an ad on Instagram. Even if these two examples don’t apply, there are surely others."}, {"type": "sentence", "content": "You may not even remember noticing a particular ad, but when you see the product, your brain will instantly associate it with the particular emotion or persona (happiness, confidence, youth, coolness, etc.) that you felt when you saw the ad the first time. And because you like this feeling, the product ends up on your credit card statement at the end of the month."}, {"type": "sentence", "content": "We conducted an amateur experiment using simple neuromarketing techniques to prove their effectiveness. We tested two of our favourite office staples:"}, {"type": "sentence", "content": "First, we asked everyone to write down which chocolate and soft drink was their favourite. They were then submitted to a blind test with samples of each. After tasting, they had to choose which one they liked best."}, {"type": "sentence", "content": "It will come as no surprise that not everyone chose the same product they wrote down before trying!"}, {"type": "sentence", "content": "Why is that? Our brain conditions our reaction. For example, if you think you prefer Coke, then you’ll be happy to drink a Coke and therefore like it. And if you’re convinced Pepsi is bad, then you’ll already be grimacing before it reaches your taste buds."}, {"type": "sentence", "content": "Even though the two drinks are nearly identical in chemical composition, people routinely favour one over the other. Brain scans of people — done by professionals this time, we don’t have that kind of equipment here — reveal that knowing which drink you’re tasting affects your preference and activates memory-related brain regions that recall cultural and emotional influences."}, {"type": "sentence", "content": "For the past 30 years, Coke has been focusing its advertising on the brand and its messaging. The soft drink is a shared experience that is supposed to remind you of friendship, family, adorable polar bears and a joyful Santa Claus."}, {"type": "sentence", "content": "Pepsi is what we call a “challenger brand”, trying to find its place against an icon. Marketing has often emphasized the idea of Pepsi being new, more youthful and representative of the new generation, as a way of turning its second-place status into an advantage. But despite decades of efforts, none of its slogans, logos or celebrity endorsements have ever put it in front of Coke."}, {"type": "sentence", "content": "OK, time to come clean. We didn’t come up with the blind test idea. Pepsi did, in 1975, with the “Pepsi Challenge”. The brand went to malls around the US and invited people to participate in a blind test between Coke and Pepsi. Results were very surprising: the majority of people actually picked Pepsi over Coke! The happiness giant got scared at the time and changed the secret formula to be more like its competitor, who seemed to have an upper hand. Bad idea: hundreds of thousands of people wrote letters demanding the brand change it back. Which is when they decided to keep both recipes: New Coke and Coke Classic — yes, that is why original is written on your Coke bottles."}, {"type": "subtitle", "content": "I am what I drink"}, {"type": "sentence", "content": "Do you realize what this means? The brand attachment to Coke was so strong that people were willing to look past the taste to keep the brand. It was more important for them to see themselves as “Coke drinkers”. Once you’ve identified yourself to a brand and entered its community, it’s really hard to leave it — or even want to. Getting out means giving up on the whole community, on this feeling of belonging to a group, the group of “Coke drinkers” who come with friendship, happiness and cute bears."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*MyiaaA1DdFhiLpugYBI_MA.jpeg"}, {"type": "sentence", "content": "Marketing has more impact on our minds and behaviour than we think and care to admit. The line between what you think you want and what marketing makes you think you want is so blurred that it’s almost gone. In most cases, brands influence consumer behaviour without them even knowing it. This explains why it’s impossible to leave IKEA without buying things you never thought you needed in the first place, let alone have room for in your apartment. Hence, the idea of a marketing victim."}, {"type": "sentence", "content": "But marketing isn’t the cause of everything. Behavioural preferences for food and beverages are modulated by an enormous number of sensory variables, like expectations, personal factors, social context and more. Your choices are also based on what your friends and family think. In many cases, cultural influences dominate what we eat and drink: if you’re Swiss, it’s unlikely you’re ever going to think (admit) that Belgian chocolate tastes better, and vice versa."}, {"type": "subtitle", "content": "Taking it further"}, {"type": "sentence", "content": "But then again, marketing, clever devil, uses these cultural components to its advantage. Marketers will study consumer purchase patterns and figure out buyer trends. Even if we are more and more aware of marketing strategy we are no less immune. I still hear my mother saying “this must be better because it’s more expensive”."}, {"type": "sentence", "content": "As we become more savvy, marketers step it up a notch and invent “influence marketing”, which uses friends and familiar experts to influence you into buying, because you trust their opinion. But this is another subject altogether, for another time."}, {"type": "sentence", "content": "While the scope, breadth and impact of marketing is mind-boggling, let’s not get emotional about it. Simple awareness is enough. In the long run, we all benefit from it. Brands build loyalty in return for offering you, the consumer, much more than a product. The competition is so fierce that earning your attention and investment requires offering bargain prices, unique experiences, and much more. It’s a win-win."}, {"type": "sentence", "content": "Before we finish, please be honest: after reading this article, you’re craving chocolate and a soft drink, aren’t you?"}, {"type": "sentence", "content": "And marketing wins again!"}, {"type": "sentence", "content": "A The Consultancy Group article, written by Justine Gilliot"}, {"type": "sentence", "content": "Follow us on Linkedin , Instagram and Facebook!"}], "topic": "marketing"}