{"title": "Emptily", "data": [{"type": "subtitle", "content": "Fiction"}, {"type": "subtitle", "content": "He always seemed to know what I wanted, even when I didn’t"}, {"type": "image", "content": "https://miro.medium.com/max/4238/1*NToqioW1kpwXwxnRMhfnJg.jpeg"}, {"type": "sentence", "content": "I liked that he called me Kid. Nice going, Kid. Good work, Kid. Like where your head’s at, Kid. It was a manly combination of the film noir gumshoe and the well-meaning misogynist. I was quickly possessed. Because when a man gives you a nickname, he somehow comes to own you."}, {"type": "sentence", "content": "He had blue eyes and a good smirk. He would roll his tongue around his mouth and look like that Marlon Brando GIF everyone posts on Reddit. When I got my first promotion and I moved to a cubicle closer to his, I got my first good glimpse at his face. Never mind the scar where he took a lacrosse stick to the jaw."}, {"type": "sentence", "content": "“I prefer solitary sports now,” he said to me. And he invited me to one of those obstacle course events, something like a steeplechase for human beings."}, {"type": "sentence", "content": "So many fitness freaks, all decked out in free white T-shirts, similarly powerful calves weaving in and out of truck tires, and yet it was easy to spot him. Those gemstone eyes underneath a mask of mud and sweat. “You came,” he said, and he wrapped his sinewy arms around me. I took a deep sniff into the furry forest of his underarm."}, {"type": "sentence", "content": "I liked that when he invited me to lunch, none of our other colleagues joined us. So we would sit on the patio at Florence and order gluten-free crusts without judgment. We agreed that Jim Leyland was a badass and that RoboCop 3 was flawlessly written. We discussed Borges, the Patriot Act, and reality TV. We shared gelato, but made sure to never touch spoons. We always got the same waitress, Janice, and she had really big tits, and I liked that he never made a joke about them like the older, sleazier businessmen from the office above ours did. He glanced and stared at them carefully, from the polite corner of his eye."}, {"type": "sentence", "content": "I told him I was from Waukegan and that I knew all about hip bars with names like The Apartment and The Living Room and Work."}, {"type": "sentence", "content": "“Where are you?” the one person you never want to call asks."}, {"type": "sentence", "content": "“Work,” you reply, and the person assumes you are very ambitious."}, {"type": "sentence", "content": "I liked that when I told him this joke, he started telling other people his own version of the same punch line. Imitation really is as flattering as they say."}, {"type": "sentence", "content": "I liked that he listened to musicians I’d never heard of, and when he invited me to a concert at the Aragon, I spent days researching the band. I bought two new dresses: one that fit me that day and another that would fit if I ate nothing but celery for 72 hours."}, {"type": "sentence", "content": "In my nervousness, I arrived at the venue a little drunk, the second dress a little snug, my feet sweating in new sandals. But it was crowded and tight with people, so I don’t think he noticed. He stood behind me and kept getting closer and closer to touching my back with each song. “Don’t you know the words?” he asked. I pretended that it was too loud to hear."}, {"type": "sentence", "content": "I liked that he wouldn’t allow me to ride the train back home by myself, and so he rode with me. Along the way, we shared his headphones, one earbud for me and one for him, and we listened to the band we had just seen. This will be our song, I thought."}, {"type": "sentence", "content": "The nervous kiss on the platform was awkward, like all first kisses. He had really bad timing. No rhythm. I invited him back to my place, but he politely declined, and he disappeared on the Red Line back downtown."}, {"type": "sentence", "content": "I liked that we had a secret. During meetings, we deliberately sat very far from each other. But I could feel his steely blue eyes walk across the collar of my shirt. Whenever I made a remark to the boss, I just knew he could feel his influence punctuating my every word. At company happy hours and picnics, we greeted each other with the same enthusiasm we gave to Uber drivers and distant cousins."}, {"type": "sentence", "content": "I liked that when he ran his first marathon, he didn’t want me to wait at the finish line. “You’re too short and you’d never see me,” he joked. But afterward, we lay in bed for hours, binge-watching bad TV, lazily discovering each other."}, {"type": "sentence", "content": "I liked that when he went grocery shopping, he did so very conscientiously. “You could lose a few,” he said. And from then on, he made sure that all our meals were calorie-appropriate and protein-rich."}, {"type": "sentence", "content": "I liked that when my lease was up, he made sure to remind me. “Don’t forget to look for new apartments,” he said. “You don’t want to pay double the rent.” And this was good because I was spending so much time at his place, I’d almost forgotten I had my own."}, {"type": "sentence", "content": "When our firm finally got the go-ahead for the Wilson Project, he and I didn’t throw our hats into the ring. It required three months of constant travel. Research in Berlin, Lisbon, Milan. That was just the first week of interviews. Then off to Tokyo and Taipei. I had always wanted to travel, but three months was too long. We both agreed it was too long."}, {"type": "sentence", "content": "I liked that when the team was assembled, he refused to recommend me when others did. “No, no,” I replied. “You’d be great for it,” they said. My bosses agreed. I’d put in the work. I was ready to moderate the discussions. I knew the translators quite well. I had prepared for this sort of assignment since graduation. I had always wanted to manage international focus groups, bring American culture to the Far East, explore Sao Paulo, swim in Mexican cenotes on my days off, wrestle with the mugginess of Manila in April, locate the paths of Hannibal and Napoleon, see the towers of Dubai, find myself in a small Spanish village where I would drink Carlsberg for breakfast and have five different kinds of wine from siesta until dawn. I would pretend to like skiing, I would see real castles for the first and maybe only time, buy gaudy jewelry in the Grand Bazaar, party on a Croatian island, and make my parents proud."}, {"type": "sentence", "content": "But no, I told my boss."}, {"type": "sentence", "content": "And I liked that our romance resumed."}, {"type": "sentence", "content": "He didn’t want to go either, he said."}, {"type": "sentence", "content": "“How exhausting,” he said. “And how I’d miss you.”"}], "topic": "fiction"}