{"title": "Are You Emotionally Distant?", "data": [{"type": "subtitle", "content": "I can relate."}, {"type": "image", "content": "https://miro.medium.com/max/11776/1*AC9pMRMOoCrIRI2wkcU57g.jpeg"}, {"type": "sentence", "content": "I grew up in a home where my parents were emotionally distant from one another. There was constant conflict behind closed doors and the tension was suffocating. My mom was more open and honest with me about her true feelings for my father than she was with him, and vice versa. As a child, I was repeatedly put in the middle of adult issues and often felt torn between my two parents."}, {"type": "sentence", "content": "Now a young adult, I’ve formed relationships and friendships of my own. In these relationships, I have begun to show symptoms of being emotionally distant."}, {"type": "subtitle", "content": "Let me give you an example:"}, {"type": "sentence", "content": "Recently I reconnected with somebody that I used to know. My disillusionment leads me to believe that we could pick up where we left off, but that’s not what happened."}, {"type": "sentence", "content": "Instead, I took one look at him and instantly had a hunch this boy I’d met in recovery was no longer a recovered addict, but an addict in full-blown addiction again. His face was skinny, sunken in, and he had dark circles under his eyes like he was sleep-deprived and depressed. His hair appeared matted and unwashed, I wondered when was the last time he showered? Signs of drug use were clear as we continued to hang out. He’d nod off mid-conversation, could hardly keep his eyes open, and was aggressive and easily agitated with me for the littlest reasons. Red flag after red flag struck out at me."}, {"type": "sentence", "content": "This was a boy that I used to like, a boy I used to be attracted to, and we were both under the impression we’d be having sex upon meeting up with each other. This was sort of pre-established before I got to his house, although once there, I began to have second thoughts. I wasn’t sure if I wanted to go through with the sex anymore, but I felt stuck in the situation and feared refusal would spike anger in him."}, {"type": "sentence", "content": "And so we had sex, and the sex was almost as bad as the time I lost my virginity. My needs weren’t met and I was left dissatisfied. The first chance I got to be done, I stood up and quickly retrieved my clothes, hoping to leave.My therapist pointed out that this is a destructive cycle I often put myself in; disillusionment followed by disappointment and dissatisfaction. How will I break the cycle? I don’t know yet."}, {"type": "sentence", "content": "Just when I thought I could flee the scene and make a sweet escape, he asked if I would drive him and his friend to a nearby Dollar Tree. Jesus Christ, I just want the heck out. But again, I feared that saying no would trigger his anger, so I agreed. In the car, he could tell something wasn’t right with me. What’s wrong? Why do you look so disappointed? And he was right, I was holding back tears. Fearing his anger, and also mindful of his friend in the back seat, I decided not to tell him how upset I was about the sex or the fact he was on heroin."}, {"type": "subtitle", "content": "An Epiphany"}, {"type": "sentence", "content": "It was at this moment, in my succumbed silence when I really felt like screaming, that I realized something. I realized that it doesn’t matter how physically close a person is, whether they’re sitting next to you in the car, sleeping by your side, or literally on top of you in the bedroom is not relative. It doesn’t matter how physically close a person is (to you) because they can still be mentally far, far away. Giving him my body won’t make him love me."}, {"type": "sentence", "content": "I felt alone in my feelings. I feared his anger, so the less I told him."}, {"type": "sentence", "content": "Do feelings of being numbed or muted apply to you too? Can you relate to my feelings of loneliness, even when you’re not alone?Do others often complain about your lack of attention or say you seem distant, or not entirely present?Do you have trouble committing in relationships?"}, {"type": "sentence", "content": "If the answer is yes, you may also be an emotionally distant individual."}, {"type": "subtitle", "content": "Understanding Emotional Detachment"}, {"type": "sentence", "content": "Healthline defines Emotional Detachment like this: an inability or unwillingness to connect with other people on an emotional level."}, {"type": "sentence", "content": "These people lack empathy, or the ability to understand or relate to another person’s emotions. They may hold back their true thoughts and feelings about a situation."}, {"type": "sentence", "content": "To some people, talking about their feelings and emotions can be like speaking a foreign language. They don’t have the words you want to hear. This person may be incapable of giving you the closeness you seek."}, {"type": "subtitle", "content": "But why? Why are they Emotionally Distant?"}, {"type": "sentence", "content": "Those of us with strong communication skills may have difficulty dealing with a person (friend, family member, partner) who is emotionally distant. It can be extremely frustrating and hurtful. Some people are more capable of being open and honest than others, and the others are seemingly more reserved."}, {"type": "sentence", "content": "Being emotionally distant isn’t always a bad thing. Some people do it purposefully as a coping mechanism. Being emotionally detached can help you set boundaries and stay at an arms length from needy and demanding individuals, jobs, etc. It is a way for them to separate themselves."}, {"type": "sentence", "content": "But if you’re unable to control your detachment and aren’t doing it purposely, then it can become a problem. If indeed it’s not voluntary, emotional detachment is likely the result of trauma and/or abuse in past encounters."}, {"type": "subtitle", "content": "Because I’ve been hurt before."}, {"type": "sentence", "content": "One guy, in particular, told me he was still in love with my best friend after we’d been sleeping together for months. Talk about OUCH. Past betrayals such as this, scare me and make me wary of future people because I don’t want to be burned twice."}, {"type": "sentence", "content": "So many lies fed to me for so long, how could I ever trust again? I’m not so naive anymore, and my relationships are usually rocky and full of doubt and distrust."}, {"type": "sentence", "content": "Building emotional intimacy takes time. Show me (your partner) that you care enough about me (our relationship) to invest some time into breaking down my walls."}, {"type": "subtitle", "content": "What I Suggest:"}, {"type": "sentence", "content": "If I was to feel emotionally distant with my partner, I may have many reasons for doing so. I may feel like I’m too much, so I try to minimize my thoughts and feelings to appear less dramatic.Maybe I feel like my presence is annoying them, or that I like them more than they like me.Or perhaps I feel like I’m being cheated on or lied to."}, {"type": "sentence", "content": "Whatever the case may be, what has always helped me before in the past is this: Reassurance."}, {"type": "sentence", "content": "Remind me again that you love me, and that you are a safe place for me, and that I can openly express myself with you. Sometimes that's all it takes to make me feel safe and secure in my relationship again."}, {"type": "sentence", "content": "If your partner is emotionally detached, check-in with them. Ask them about their feelings in a safe environment, make “I” statements, use the 80/20 rule, and be willing to listen. Don’t interrupt and don’t keep pushing, either. If you caught them off guard and they don’t want to talk right then, that’s okay. It’s not the right time, but never talking about feelings is not okay."}, {"type": "sentence", "content": "Also, note that repeatedly pushing someone to open up to you will likely have the opposite effect, and they will retreat even further. Take it from me, I learned the hard way."}, {"type": "subtitle", "content": "Move on and thank me later."}, {"type": "sentence", "content": "If the person you’re interested in seems hesitant to commit, wishy-washy, or giving you mixed emotions, I suggest you pursue someone new. Why? A person who can’t even connect with their own thoughts and feelings cannot possibly connect with yours, so don’t waste your time."}, {"type": "sentence", "content": "If the person you’re with is emotionally distant and you can’t seem to get through to them, let them go."}, {"type": "sentence", "content": "Why? Because you deserve complete and total intimacy from your partner, nothing less. You want someone who is willing to develop a deep, long-lasting, emotional connection with you. You should be with someone who you love and who loves you back just as much."}, {"type": "sentence", "content": "If the feeling isn’t mutual, don’t force it.A relationship should be full of balance and mutual emotion."}, {"type": "sentence", "content": "Don’t settle for someone who is only giving you a portion of themselves, settle with someone who desires the world for you."}, {"type": "sentence", "content": "LanguageofLiv"}], "topic": "mental-health"}