{"title": "How To Eliminate Anxiety In Four Minutes", "data": [{"type": "subtitle", "content": "The simple answer: pay attention to your daily habits"}, {"type": "image", "content": "https://miro.medium.com/max/11122/1*Ef3-pJKmIL3LtFOO7EZ5Tw.jpeg"}, {"type": "sentence", "content": "How much time do you spend overthinking each day?"}, {"type": "sentence", "content": "If you’re anything like my former-self, your response will be something like “a lot.” Without knowing you, I can tell that you want to live each day with a feeling of optimism and mental clarity. But no matter how hard you try to rid negative thoughts from your mind, nothing seems to work."}, {"type": "sentence", "content": "I understand how you feel."}, {"type": "sentence", "content": "Over the past few years, I’ve had to deal with anxiety & depression many times. But I’ve discovered that the best way to improve your mental health is by eliminating any bad habits that trigger negative thoughts. Abdul Kalam said it best:"}, {"type": "sentence", "content": "My friend, there is a solution to your current state of unhappiness. Because if bad habits are causing your anxiety, eliminating them will enable your life to change for the better."}, {"type": "subtitle", "content": "Start By Paying Attention To Your Sleep Schedule."}, {"type": "sentence", "content": "You need to study for school. You have to finish a work assignment. You need to stay up until 3 am, and text your friends until the early hours of the morning."}, {"type": "sentence", "content": "Does any of that sound familiar? At some point in our lives, we’ve all made excuses for not getting enough sleep. But if it happens frequently, the negative effects of sleep deprivation are much worse than a lack of cognitive function. Quoting an article published by the NHS:"}, {"type": "sentence", "content": "I used to be kept awake at night by a fear of not getting good grades in college. So instead of going to sleep, I’d try and study until the early hours of the morning."}, {"type": "sentence", "content": "The problem is that I had to be on campus before 8 am. When I arrived, I was tired and unable to focus throughout the day. Consequently, my lack of mental energy made me fall behind in class. So more often than not, I’d stay awake until 3 am, in an attempt to catch up with everyone else."}, {"type": "sentence", "content": "This negative thought loop created a habit of sleep deprivation and made it difficult to gain mental clarity on things that matter. But when I started improving my sleep schedule, I noticed that my mental health quickly improved for the better."}, {"type": "sentence", "content": "It’s important to remember that you can start making positive changes in your life today. For example, I’ve discovered that going to bed at a reasonable time and getting the recommended amount of sleep is an excellent place to start."}, {"type": "sentence", "content": "Unfortunately, you’re not going to get rid of your anxiety overnight. I’m not going to make any false promises. But if you can take daily steps towards improving your sleep hygiene, your mental health will undoubtedly improve as a result."}, {"type": "subtitle", "content": "Then, Stop Running From Your Problems."}, {"type": "sentence", "content": "If you don’t learn to control your thoughts, they will always be in control of you. That might be a hard pill for you to swallow. But it’s true."}, {"type": "sentence", "content": "Suppressing negative emotions has no benefit. You’re just burying them inside your head, desperately hoping they will never re-emerge. But sooner or later, they’ll hit you like a ton of bricks, keep you awake at night, and make any feelings of anxiety even more prominent."}, {"type": "sentence", "content": "Over the years, I’ve learned that you cannot change what happens to you in life. But you can always choose how you respond to any given set of circumstances. Like the Roman Emperor, Marcus Aurelius once said:"}, {"type": "sentence", "content": "For the longest time, I was kept awake by imaginary scenarios of what may happen in the future. It destroyed my mental health, ruined my social life, and made it difficult to maintain any relationships. I tried to suppress those negative thoughts and pretend they didn’t exist. But as you can imagine, that strategy didn’t work."}, {"type": "sentence", "content": "You see, anxiety is often a fear of the unknown. You’re scared of what may happen in the future. But when you take a moment to accept everything you cannot change, you can focus on what you can."}, {"type": "sentence", "content": "I know this mindset shift is difficult to make. However, it’s much better than playing the victim card and not doing anything to create a positive change in your life. Because if worrying about something won’t change the outcome, what’s the point? There is none."}, {"type": "sentence", "content": "Similarly, Epictetus wrote, “It’s not what happens to you, but how you react to it that matters.” So when you focus on everything that you can control, you’ll spend much less time worrying about what you can’t."}, {"type": "sentence", "content": "So every day, ask yourself: “What actions can I take right now to eliminate any bad habits that are destroying my mental health?” Do that, and every aspect of your life will quickly change for the better."}, {"type": "sentence", "content": "Starting now."}], "topic": "mental-health"}