{"title": "The Impact of Company Layoffs on Green Card Filings", "data": [{"type": "sentence", "content": "It is critically important for HR professionals and company decision-makers to realize that layoffs in particular role types will have negative impacts on the Green Card processes for international employees in the same or related roles. Let’s consider this more closely."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*ail0sj4rbm1iFX79"}, {"type": "sentence", "content": "Please note that this post is not legal advise but is instead intending to make readers aware of certain issues to then work through with legal counsel."}, {"type": "sentence", "content": "Over the last several weeks, due to Covid-19 I have received this email in various forms:"}, {"type": "sentence", "content": "The unfortunate reality is that layoffs do have a serious implication when it comes to certain types of green card applications. It is not impossible to continue or move ahead with a new Green Card application but often times it leads to practical issues that stop a Green Card process in is tracks."}, {"type": "sentence", "content": "Of course, not all green card processes are the same and some are not impacted by layoffs at all. Here we will focus on the impacts that layoffs have on green card cases that require a test of the US labor market as one of the steps in the process. This is referred to as the PERM labor certification process or PERM for short. This PERM process is the first stage of three on the path towards an employee’s green card. The Green Card grants permanent residency and takes an employee out of the temporary non immigrant visa realm, such as out of the H-1B and into a more stable immigration status that have a legal permanent resident."}, {"type": "sentence", "content": "What are the Impacts on PERM Based Green Card Applications?"}, {"type": "sentence", "content": "Alright, so how do layoffs impact the PERM based Green Card process, which is generally the most common Green Card sponsorship route taken by companies? Well, unfortunately, layoffs often have very serious real world impacts on this process due to the recruitment phase that is a mandatory step in the process. So to really grasp the reason for this, it’s worth laying out a couple of general timelines and steps that make up this PERM labor certification process."}, {"type": "sentence", "content": "Generally, the first requirement of this process is for the company to determine the minimum actual requirements for the role that is the subject of the Green Card filing. So this includes deciding on a degree level field of study, work experience, and importantly special skills That the company might require for the role."}, {"type": "sentence", "content": "Second, the company will file a prevailing wage request with the Department of Labor to obtain a wage level and occupational classification that sets the minimum salary that can be offered for the role. This is currently taking about four months or so to complete. And it’s normally obtained prior to moving on to the actual recruitment phase testing the US labor market, although it’s not required to first occur."}, {"type": "sentence", "content": "Then the third step is the actual test of the US labor market, which involves placing various ads in different types of media to see if there are others in the US labor market able and willing to take the role and satisfy the minimum job requirements that were laid out. This process usually takes at least two months by law, but can take a little bit longer as well."}, {"type": "sentence", "content": "Now, if there are no qualified applicants found during the labor market test, then the fourth step is actually to prepare and file the PERM labor certification application with the Department of Labor. This can take three to six months roughly assuming that there are no major delays, such as audits from the Department of Labor. And on this topic of audits before we move on, based on the current economic climate, it would not be surprising if the number of audits increase quite dramatically."}, {"type": "sentence", "content": "Okay, so now we get to the impact of layoffs themselves. The rules related to layoffs are actually laid out directly in the language of the PERM labor certification application themselves. So when one is ready, and at the stage of filing the PERM labor certification, there is a question that asks whether the employer has had a layoff in the area of intended employment in the occupation involved in the application or in a related occupation within the six months immediately preceding the filing of the application. So the inquiry turns on a few considerations."}, {"type": "sentence", "content": "First, whether a company has had layoffs in the same location where the PERM job is being offered. So this is a geographic element. Second, whether the layoffs are in the same or a related occupation to the PERM job. Now, this adds a job comparison component. And lastly, whether the layoffs happened within the last six months from the time that you are now set to submit the application to the Department of Labor. Each of these questions have a few nuances to them, as you can see, for example, or the positions that were the focus of past layoffs, in fact, overlapping enough to be seen as related by the Department of Labor, and therefore triggering of this disclosure. And then there’s also the geographic consideration. These are items that should be discussed closely with counsel."}, {"type": "sentence", "content": "Now, if the answers to all three of those questions is, in fact, yes, then an additional and burdensome recruitment requirement is triggered and must have been satisfied as part of the recruitment process that had actually already occurred prior to you getting to the stage of filing the PERM. In short, this added recruitment requirement adds a very challenging burden on the company by forcing direct notice of the open Green Card roll be provided to prior employees who have been laid off in related occupations over the last six months. This is normally done very directly via email or mail. Then if a qualified applicant in fact applies as a result of this notice and satisfies the minimum requirements, which they often will, the green card process must be halted and cannot continue."}, {"type": "sentence", "content": "So layoffs in similar roles in the same geographic location, which occurred over the last six months will trigger this very challenging additional form of recruitment. So now, where does this leave companies and their international employees who have already started the process, or who were about to kick off this process when layoffs took place? Oftentimes in a position where the PERM process needs to be halted midstream, or where the process needs to be delayed, allowing for this required six months period to pass before getting to the point where the PERM is actually filed."}, {"type": "sentence", "content": "Where this becomes very problematic is where US visa holders are running out of time on their maximum allowable period of stay in the United States. So we can look at H-1B employees, for example, who have a six year maximum and who thereby don’t have much wiggle room related to delaying a green card process."}, {"type": "sentence", "content": "So this is an area where companies have to lay out the current status and timing issues for their entire international employee population. Identify who is at most risk if Green Card cases cannot move forward now, and then figure out if there are other solutions, or what arguments can be made to avoid triggering these layoff related burdens, if any. This is an area that is sometimes overlooked by companies, but it is of critical importance."}, {"type": "sentence", "content": "Rule Summary"}, {"type": "sentence", "content": "To summarize the key takeaways: A recruitment burden that oftentimes will end the possibility of continuing with a green card process is triggered when an employer has had a layoff in the area of intended employment in the occupation involved in the application or in a related occupations. Further the layoffs must have occurred within the six months immediately preceding the filing of the application. If this is the case, then the company must have provided additional direct notice to those employees who were laid off in a similar role. And if these individuals apply for the role as with the other recruitment requirements, the PERM process cannot continue and the company will have to wait for a period of time to pass before attempting this again."}], "topic": "leadership"}