{"title": "Walking to relief anxiety", "data": [{"type": "sentence", "content": "Every time I walk down a street, a yard, a field, a path, my thoughts start rambling on and a maze develops within my mind. I might scream, cry or even beg, the possibilities are basically endless when no one is around to stop me. I spent many days of my life laying in a bed of self-commiseration, waiting for a brave soul to come to my rescue. It never happened."}, {"type": "image", "content": "https://miro.medium.com/max/6556/1*urJFjZT-AUE2D0DKF9_4wQ.jpeg"}, {"type": "sentence", "content": "It took much time, but if there is anything that such bad periods have taught me is that after all, the only person who can actually save you is yourself. And I am sure this might come off as a cliché, but let’s be honest: clichés exist for a reason. In my case, my inability to realize how inefficient and self-disruptive I was, resulted in a lack of control and in behaviours which affected me as well as those who cared about me."}, {"type": "subtitle", "content": "I just could not take it anymore"}, {"type": "sentence", "content": "I had — and still have — to put myself back together and pull off the most positive attitude ever. It did not last long, since that was just not me: I need to be alone when my emotions start overflowing; ANYthing/one can be a trigger and straightforwardly worsen my symptoms (by that, I do not mean that somebody or something could not get me back on tracks; it would just be very hard, if unsolicited); I can simply NOT appear happy when I am not in the mood."}, {"type": "subtitle", "content": "Meditation was not the answer nor talking it out"}, {"type": "sentence", "content": "Over and over again, websites and friends advised me to try meditation as an outlet for my emotions…but it did not work out. Thinking about it, how could I make out of such a relaxed, still and calm activity an outlet for so many impetuous feelings. Obviously, it can be a powerful tool for a lot of people, but it cannot be the solution to everyone’s difficulties either."}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*Bd-JCTeh6PPEHcBh2tENwg.jpeg"}, {"type": "sentence", "content": "Consequently, I tried talking about it and I ought to admit that it helped indeed — chiefly since it led to strenuous cathartic releases, following which I would feel utterly drained and exhausted. It made some friendships grow and root deeply, understanding that what I was experiencing was normal and that I should not have been ashamed of it. Instead, it requires prowess to expose oneself so much and own it, even though tears were flooding my cheeks and pouring down my jawbone, warm and salty like sea water during the summer and with the same intensity of emotions of when you break through the surface of a wave and your body was not ready for such impact; or at other times, like when you fall in a dream and right before hitting the ground, you abruptly wake up, your heart racing in an attempt to get a hold of your breath which has then gone out of control and turned into pure hyperventilation."}, {"type": "sentence", "content": "I just wanted something less emotionally nerve-wracking and “useful” in a way, so to avoid wasting time in bed or wasting someone else’s crying uncontrollably."}, {"type": "subtitle", "content": "When “leaving” makes the trick, but it is not exactly that"}, {"type": "sentence", "content": "Around a year before I moved to the UK, my parents and I rented a house in Italy and we used to have this breathtaking view in front of it: a whole hill covered in olive trees, in the heart of Tuscany; once I started walking all around the hill at night, I discovered an entirely different scenario to the one I was used to seeing during the day."}, {"type": "image", "content": "https://miro.medium.com/max/9000/1*IPAo7U-Zjo8cRGP5Zj1RNw.jpeg"}, {"type": "sentence", "content": "The wildlife proliferated with all kinds of animals, from a fox that after a few weeks became my friend (I would sit on the ground and it would walk one yard away from me, analyzing all my moves and why was I there in the first place), but also deer running like children at an astonishing speed and even wild boars!"}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*JuIYBgxR05wbddqtBrPpzQ.jpeg"}, {"type": "sentence", "content": "Luckily, I never got to meet one face to face — consider that they are the size of Fiat 500 when adult, more or less — and can easily destroy the car body of a family van. They are pretty standard for us and almost anyone has seen one, yet nobody would fight them and you would most definitely not want to find yourself alone in front of one of these big guys — chiefly if there is the possibility of them having piglets, because then they become hyper-protective and would fear NOthing."}, {"type": "sentence", "content": "But what do boars and nighttime lonely getaways have to do with my anxiety?"}, {"type": "subtitle", "content": "A lot, really!"}, {"type": "sentence", "content": "In fact, I did not realize until later that summer that what was actually taking my negative moods away was the exercise, walking more and more; while letting my mind ramble freely over and over."}, {"type": "sentence", "content": "When I was alone, I could do anything and think whatever I desired, since nobody would have been affected. It was a pure win-win situation!"}, {"type": "sentence", "content": "It has almost been three years since I stopped going to that hill, but my ways have not changed. Now, when the situation gets tense and burning sparkles begin to blaze, I prefer to call myself out and reset my mind. I do not forget — ever — ; it is simple ignorance in favor of communal survival."}, {"type": "image", "content": "https://miro.medium.com/max/6672/1*AwXbN612irmuPZJWcz3tlg.jpeg"}, {"type": "sentence", "content": "If you would like to delve further into the sciencey reasons behind the relations of walking and physical exercise and anxiety, you can check out these articles:"}, {"type": "sentence", "content": "Physical Exercise & Anxiety, Exercise for Stress and Anxiety, One Step At a Time: Why Taking a Daily Walk Can Ease Anxiety and Stress, How Walking Helps Anxiety, See your mental state from your walk: Recognizing anxiety and depression through Kinect-recorded gait data."}], "topic": "mental-health"}