{"title": "How to Build a Great Website Fast", "data": [{"type": "subtitle", "content": "Tools for New Businesses During COVID-19"}, {"type": "sentence", "content": "This article is a part of the series “Digitize Your Side Hustle: Making Money in the Time of Corona”"}, {"type": "sentence", "content": "You have decided to take one of your side hustles public, to build a community around your ideas and make some money while doing so. One of the things you will need is a basic website. Websites help people find out about your services and forces you to understand what the core value is that you deliver to customers."}, {"type": "sentence", "content": "In this article you will learn how to use Wix, Pexels.com, and Domain.com to set up the structure of your website, and advice on what content to put in to make sure you create a compelling and professional website. This will take around 2 hours to complete."}, {"type": "subtitle", "content": "A Compelling Value Proposition"}, {"type": "sentence", "content": "We will start off by going to Wix.com. You can let Wix create a basic template for you, but I like to start off as simply as possible. Select “Create Your Website with the Wix Editor.”"}, {"type": "image", "content": "https://miro.medium.com/max/2612/1*nXOo2eX2Hp33_z-wRVS9HQ.png"}, {"type": "sentence", "content": "Once you’re in the Mix Editor, you can choose to use either pre-made templates with styling or Blank Templates. We’ll choose Blank Templates. Here again you can decide whether you want to keep it classic or go fancy with a Gallery layout. I like to start entirely from Scratch."}, {"type": "image", "content": "https://miro.medium.com/max/2748/1*-d3rUFWeyH8cThktv_vg7w.png"}, {"type": "sentence", "content": "When you get to the Blank web page, on the left panel will be a Plus icon > Strip > Welcome. Choose a strip that matches the “vibe” of your side hustle. Do you want to look polished and professional? Maybe choose a bold, Sans Serif font. Going for quirky and creative? Play around with Serif fonts and off-centered formatting."}, {"type": "image", "content": "https://miro.medium.com/max/1458/1*vdNjIYPtISZHbrs0B5n4_Q.png"}, {"type": "sentence", "content": "Once you’ve chosen the aesthetic for your strip, you’ll need three things:"}, {"type": "subtitle", "content": "Names"}, {"type": "sentence", "content": "A lot of people stress about the “perfect” name for their business. Right now you are just testing out whether your side hustle can be something more. A lot of people stress about names, to the point that they do not start building a business. There might never be the “perfect” name for your business, but the best one is the one that gets you started."}, {"type": "sentence", "content": "As you’re thinking , here is some general advice to follow:"}, {"type": "subtitle", "content": "Tag Line"}, {"type": "sentence", "content": "You’ll want to have a short phrase at the top of your website to tell people succinctly what they will get from your website. Your tag line should get across two different things: what you do, and who you do it for. Bonus points if you can get across your specific “personality.”"}, {"type": "sentence", "content": "For example, on the SkinnyTaste website the tagline is “Delicious Healthy Recipes From My Family to Yours.” The product is healthy recipes, and the customer is specifically families."}, {"type": "image", "content": "https://miro.medium.com/max/996/1*aggdgc0I9-u63vVy2pkk3g.png"}, {"type": "sentence", "content": "Tattly’s tagline “Fake Tattoos by Real Artists” makes it clear that they are selling fake tattoos to people who like tattoos but do not want them permanently."}, {"type": "image", "content": "https://miro.medium.com/max/2740/1*abijF9y-EF8c-UFZoS2NmA.png"}, {"type": "sentence", "content": "Juliana clearly says their customer is women, and what they sell is mountain bikes."}, {"type": "image", "content": "https://miro.medium.com/max/2178/1*VJvs1oLoekIDO_yvoY2Zpw.png"}, {"type": "sentence", "content": "Edsey Art is very clear about what they do is to make explainer videos for other people who want to sell products."}, {"type": "image", "content": "https://miro.medium.com/max/1966/1*XMUc37nZosRanh26bAHNfA.png"}, {"type": "sentence", "content": "Write down your tag line as succinctly as possible. Then, go away for an hour and when you come back, see if you can cut out any words. Then, share your tag line with three other people, and then ask them: what does it seem like I am selling? It is important to understand what inferences people draw from your tag line."}, {"type": "subtitle", "content": "Cover Photo"}, {"type": "sentence", "content": "A great photo can go a long way towards telling people what kind of product you will deliver without needing a long explanation. Tattly shows you the kind of artsy tattoos you can find on their website. Juliana showcases what an example of their mountain bikes look like."}, {"type": "sentence", "content": "To change the cover photo on your website, Select the Welcome strip and go to “Change Background Image.” From there you can upload a cover photo. If you do not have a photo on hand, I love Pexels.com with a database of professional-grade photos that you can search through. When you find a photo you love, purchase it (it’s usually only 5–10 dollars). All of the photos on the site are user-generated, and you are helping people who are also trying to monetize their hustles."}, {"type": "image", "content": "https://miro.medium.com/max/2840/1*i0PF0zqJfKOdDiaY0r-iFg.png"}, {"type": "sentence", "content": "Some things to keep in mind:"}, {"type": "subtitle", "content": "Next Step!"}, {"type": "sentence", "content": "All together we have a name for our hustle, a compelling tag line, and an interesting cover photo that will get people to read more. In Part 2 we will go into detail about how to introduce yourself, showcase your services, and connect your website to a domain."}], "topic": "freelancing"}