{"title": "Five Things I Learned at Top Agencies", "data": [{"type": "sentence", "content": "#3 Speak Truth to Customers"}, {"type": "image", "content": "https://miro.medium.com/max/7200/0*bRkpRhxe5Z0Ug0Ud"}, {"type": "subtitle", "content": "1. The Client Is Not Always Right"}, {"type": "sentence", "content": "And they can blame you if you blindly follow their lead."}, {"type": "sentence", "content": "This is my number one rule, and it comes from a decade with marketing managers at some of the world’s largest brands."}, {"type": "sentence", "content": "Especially in professional services businesses, it is not uncommon that clients don’t actually know what they want. It doesn’t matter where they got their fancy MBA or how many years they’ve had on the job."}, {"type": "sentence", "content": "Sometimes they genuinely don’t know that there is a better, faster, cheaper way to achieve their objective. They will appreciate it if you show them. And, on other occasions, well, they’re just flipping you a request from someone else without carefully thinking about what they really want or how to get it."}, {"type": "sentence", "content": "There is, however, a difference between the client not being right, and you proving them wrong. The best client service experts know that pushing back on client requests requires a gentle touch and consensus building."}, {"type": "subtitle", "content": "2. It’s Easy to Sound Like a Hyperbolic Hack"}, {"type": "sentence", "content": "When I first started out in public relations, I took the easy path. I used exaggerated descriptions without even try to prove their truth."}, {"type": "sentence", "content": "Every product was market-leading. Each new offering was, well, the first of its kind. My clients’ solutions were always the best, the fastest and the most innovative on the market."}, {"type": "sentence", "content": "Tricking customers into buying your service or solution may get you a short term bump in business, but that’s not how you build a repeat customer."}, {"type": "image", "content": "https://miro.medium.com/max/15904/0*sisDDXOYl2Ntsa1v"}, {"type": "subtitle", "content": "3. Honesty and Credibility Are Underrated"}, {"type": "sentence", "content": "The corollary to point number two is that truth in marketing is something that is respected and prized by customers. If you make grandiose claims and don’t deliver, you’ll lose a customer for life."}, {"type": "sentence", "content": "If you are honest and genuine, you can ensure that customers will keep coming back, sometimes, even if they don’t like the product they just bought."}, {"type": "sentence", "content": "Customers have grown skeptical from years of marketing gimmicks and BS exaggeration. Honesty is like a nice tall, cool glass of water on a hot day: Refreshing until the last drop."}, {"type": "subtitle", "content": "4. You Don’t Always Get the Information You Need"}, {"type": "sentence", "content": "When you pull together a wish list of information before starting a project, don’t expect that you’re going to get everything you want. There are a million reasons why this will happen. Information can be siloed in various different groups, executives can be hard to reach, and what you desire might not even exist."}, {"type": "sentence", "content": "Don’t let that stop you dead in your tracks, sometimes you just need to forge ahead with what you’ve got."}, {"type": "image", "content": "https://miro.medium.com/max/14720/0*KqB6tGk_kK44LRH_"}, {"type": "subtitle", "content": "5. No One Cares about Industry Jargon"}, {"type": "sentence", "content": "I can already hear the push back bubbling up. “But my manager wants to say it.” “But the competitors are doing it.” “But it’s the way it’s always been done.”"}, {"type": "sentence", "content": "I’ve heard it all before. Too many times. Even organizations that self-proclaim themselves to be “challenger brands” or “disruptors” often refuse to upset their marketing status quo. I’ve got news for them: customers don’t care about their naming conventions."}, {"type": "sentence", "content": "You might also like these stories. But no pressure, time is money. I get it."}, {"type": "sentence", "content": "###"}], "topic": "leadership"}