{"title": "You Can Actually Just Start Writing Anything", "data": [{"type": "sentence", "content": "Seriously."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*6VUkX3CbwYik_Q9p"}, {"type": "sentence", "content": "The online writing space is saturated with articles on how to turn a profit, maximize productivity and other aspects of career-oriented writing. While generating income through writing is perfectly doable, centering revenue can have the opposite affect. I’ve spent more time in front of a blank page with a flashing cursor urging me to create a masterpiece than I care to admit. Eventually, I began feeling inadequate and closed my laptop for a week or 3. It took me a while to remember you can actually just start writing anything. First, I had to forget."}, {"type": "sentence", "content": "Forget Business"}, {"type": "sentence", "content": "Once I began earning income as a freelance writer, I started moving further away from what prompted me to write in the first place — the sheer enjoyment. Conveying stories and ideas took the backseat to asking myself, what’s selling right now? I’ve read stories about writers surrendering themselves to the hustle to the point of losing complete interest in their craft. When I took a break from creating for others, I became inspired and ideas returned to me. Pitching was no longer my driving force."}, {"type": "sentence", "content": "Forget Aesthetics"}, {"type": "sentence", "content": "I can count on no hands how many times I’ve sat down to my laptop with a perfectly organized office space decorated with rose gold embellishments. My non-existent iPad is never resting underneath a phone protected by a pink crystallized case. I’ll never place a cup of coffee directly next to my thousand-dollar machine. I’m never sitting on a balcony with my knees pulled up to my chest staring into the void with a full draft eagerly waiting on my screen. You won’t find me in coffee shops because I don’t like creating in noisy environments. I don’t even have a dedicated work space aside from a small desk that I rarely use because it begins feeling like work. I can’t speak of a daily routine or inspiring process that can offer a template to other writers. Sometimes I’m just sitting on my couch or bed."}, {"type": "sentence", "content": "Forget Social Media"}, {"type": "sentence", "content": "While I’ve found topics through social media that inspired me to produce articles and have been able to network with other writers, it can be a counterproductive environment. I follow some amazing writers whose content I greatly admire and the vitriol slung at them by anonymous (and not so anonymous) trolls can be discouraging. Most of them are advocates for justice and social issues so it hits harder because I sometimes write in this space. I began wondering what type of comments I’d receive if my writing was posted. This only deterred me from engaging in my own way. Stepping away from the toxic mess of comment sections that proved detrimental not just to my own mental well-being, but my creative process allowed me to focus without negativity."}, {"type": "sentence", "content": "Forget Lists"}, {"type": "sentence", "content": "The most annoying habit I picked up throughout the course of freelancing has been thinking in terms of the dreaded listicle. Structuring the content of my writing in terms of listing the most “valuable” portions felt counterintuitive. By trying to extract pre-packaged headlines from my writing I felt that the rest became unimportant. Some storytelling just can’t be broken up into key points designed to hold readers’ attention. While I do indulge in a good listicle from time to time, I’m not letting the format run all willy-nilly throughout my writing process."}, {"type": "sentence", "content": "Forget Trends"}, {"type": "sentence", "content": "For a while I fell victim to chasing news cycles and closely following trending discourse. Even though it didn’t always interest me, I followed almost every trending topic and hashtag. What the hell was I doing? By committing to remaining extremely online, I wasn’t using that time to focus on writing anything. My mind automatically began searching for my place in the messy discourse. While this occasionally paid off, it circled right back to centering capital to be made. Keeping a thumb on the pulse of popular culture and online discussion can be valuable for writers until it becomes expected."}, {"type": "sentence", "content": "The pressure to create content that pays the bills can cause serious burnout and leave writers feeling like they’ve failed. This goes hand in hand with the expectation that every piece of writing put into the universe should meet an impossible standard. Writing anything means literally just that. I’ve had days since exercising this groundbreaking idea where word vomit turns into something meaningful. Even if it doesn’t, I’ve devoted my time to something that I enjoy. On my own terms. Without pressure."}], "topic": "freelancing"}