{"title": "How Does Instagram Show Me Ads About What I Have Searched On Google", "data": [{"type": "subtitle", "content": "Understanding Re-targeting of Ads"}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*qaLEA5y_5YO7YZKr1phg5w.jpeg"}, {"type": "sentence", "content": "I have always wondered how does Instagram know what I am searching about on Google when I am not even signed into Instagram using my Google account. A few days ago, I got a little time to read up on how its done. So I thought I will write a small blog on the same in case there are others like me who are also wondering about how it happens. 😇"}, {"type": "subtitle", "content": "Introducing Re-targeting of Ads"}, {"type": "sentence", "content": "So Instagram makes use of a concept called re-targeting of ads to personalize our feed."}, {"type": "subtitle", "content": "But First, Why are Ads Re-targeted?"}, {"type": "sentence", "content": "Let us take an example.Suppose you are browsing through an e-commerce site looking for books. You come across a collection of classics by Charles Dickens you always wanted to buy. But then you remember that you have already bought a lot of books for this current month, so it would be better to buy the Charles Dickens books next month. So you just add it to your cart and leave the site. And then when you go on Instagram and are scrolling through it in your leisure, an ad about that very Charles Dickens collection pops up in your feed. Your interest in the product (books) is taken as a lead and later shown to you as a reminder to convert it into a sale. That is the main motivation behind re-targeting of ads."}, {"type": "subtitle", "content": "What is Re-targeting of Ads?"}, {"type": "sentence", "content": "To put it in the most simple of terms, re-targeting is a technique through which ads follow an user across the internet after an user has clicked on or purchased a particular product. The main aim behind this is to convert a lead into a successful sale by examining consumer activity and personalizing the ads that a consumer sees. I would like to cite a small fact here for your better understanding, only about 2% of web searches get converted to a successful sale in the first go."}, {"type": "image", "content": "https://miro.medium.com/max/1864/0*wBPlrvPLgC6ZgHec.png"}, {"type": "subtitle", "content": "Re-targeting Behind The Scenes"}, {"type": "sentence", "content": "When we visit a website through a Google search, the website we are visiting may be hosting cookies."}, {"type": "subtitle", "content": "These cookies are in turn used by Instagram and Facebook to keep a track of -"}, {"type": "sentence", "content": "Going back to the example mentioned above, when you visited the site and clicked on the Charles Dickens book collection link but didn’t buy it, the cookie on the site stored this information as a potential future purchase. That information was also used to find other similar books that have been already bought by others who were also interested in the same Charles Dickens collection as you. And then when you go to another site (say Instagram), the ads of those very books tracked by the cookie are repeatedly shown to you as a reminder to make the purchase. This is also called re-marketing or re-advertising."}, {"type": "sentence", "content": "This helps advertisers identify what kind of ad should be positioned where to maximize profits."}, {"type": "subtitle", "content": "So, how effective is re-targeting?"}], "topic": "marketing"}