{"title": "Building a survival kit for Twin Peaks — a UX case study", "data": [{"type": "sentence", "content": "I took a design challenge to build a Survival Kit for Twin Peaks. I heard about this exercise from design instructor Chris Do teaching at the creative online school the Futur. As my objective I chose to work on the fictional mysterious universe of Twin Peaks — a 3 season TV show directed by David Lynch released in 1990, 1991, and 2017."}, {"type": "subtitle", "content": "Welcome to Twin Peaks"}, {"type": "sentence", "content": "Here are some of the characters you might meet upon arrival to the town."}, {"type": "image", "content": "https://miro.medium.com/max/9922/1*mnC1Xt5Ozvfbt-7S3WHZWQ.jpeg"}, {"type": "subtitle", "content": "Where You Might Go"}, {"type": "sentence", "content": "Twin Peaks is located in a charming mountain area of Washington state close to the Canadian border. It is covered with beautiful green forest and looks like a perfect place to have some quiet time away from Seattle. Although, depending on your preferences and choices, you might face a few unexpected turns during your visit. Review this flow map to see where the adventure might take you."}, {"type": "subtitle", "content": "What Might Get You in Trouble"}, {"type": "sentence", "content": "Watch out for owls in the woods. The town is full of secrets and some of its mysteries might come your way. Everyone here is somehow connected to the secrecy between reality and the Black Lodge."}, {"type": "sentence", "content": "The love affairs in Twin Peaks evolved several storylines. I mapped the characters’ affections that bridge all the romantic associations."}, {"type": "subtitle", "content": "Does and Don’ts in Twin Peaks"}, {"type": "sentence", "content": "To be fully equipped read these simple guidelines. In addition, you might find more answers through your dreams. Or, as it often happens in Lynch’s movies, ― more questions."}, {"type": "subtitle", "content": "DO:"}, {"type": "subtitle", "content": "Proceed with Caution"}, {"type": "subtitle", "content": "DON’Ts"}, {"type": "subtitle", "content": "Key Survival Components"}, {"type": "image", "content": "https://miro.medium.com/max/10390/1*Bqr8QYLer_t-wV8nqPX2Xg.jpeg"}, {"type": "subtitle", "content": "Damn Fine Cup of Coffee and Cherry Pie"}, {"type": "sentence", "content": "Agent Cooper’s obsession with the town’s cuisine could be interpreted as an appreciation of life’s simple pleasures. Anyone visiting Twin Peaks should have an opportunity to experience it, so I designed a coupon for the famous Double R treats under a few conditions:"}, {"type": "image", "content": "https://miro.medium.com/max/2790/1*1p7ImZDCBHg4AU3nMkJwEA.jpeg"}, {"type": "subtitle", "content": "Timeless Room Key from the Great Northern"}, {"type": "sentence", "content": "You are most probably going to stay at the the Great Northern while enjoying your time in Twin Peaks. Because of all the business and drama happening behind its wooden walls, I suggest you stay in room # 315 to be a part of the story."}, {"type": "subtitle", "content": "The Freddie’s “Me Destiny” Glove"}, {"type": "sentence", "content": "I greatly enjoyed Freddie’s story as I lived in East London myself for 2 years. Luckily for you, there is no need to argue with the shopkeeper buying an open pack for the lone glove. If Bob from the Black Lodge tries to attack you, just put the Glove on. Fireman approved!"}, {"type": "subtitle", "content": "The Survival Kit"}, {"type": "sentence", "content": "As the major survival tools have been revealed, I created the kit box made of sycamore tree wood and red velvet. Preferably accompanied by a blue rose."}], "topic": "design"}