{"title": "Biophysicists found a way to take a peek at how membrane receptors work", "data": [{"type": "image", "content": "https://miro.medium.com/max/1024/0*LaprgY32NEDOpg9S.png"}, {"type": "sentence", "content": "In a study published in Current Opinion in Structural Biology, MIPT biophysicists explained ways to visualize membrane receptors in their different states. Detailed information on the structure and dynamics of these proteins will enable developing effective and safe drugs to treat many sorts of conditions."}, {"type": "sentence", "content": "Every second, living cells receive myriads of signals from their environment, which are usually transmitted through dedicated signaling molecules such as hormones. Most of these molecules are incapable of penetrating the cell membrane so for the most part, such signals are identified at the membrane. For that purpose, the cell membrane is equipped with cell-surface receptors."}, {"type": "sentence", "content": "That receive outside signals and “interpret” them into the language the cell can understand. Cell surface receptors are vital for proper functioning of cell and the organism as a whole. Should the receptors stop working as intended, the communication between cells becomes disrupted, which leads to the organism developing a medical condition."}, {"type": "sentence", "content": "GPCRs (G protein-coupled receptors) is a large family of membrane receptors that share a common structure; they all have seven protein spirals that cross the membrane (fig. 1) and couple the receptor to a G protein situated on the inside of the cell. Interaction of the signal molecule with the receptor triggers a change in the 3D structure, or conformation, of the receptor, which activates the G protein. The activated G protein, in turn, triggers a signal cascade inside the cell, which results in a response to the signal."}, {"type": "image", "content": "https://miro.medium.com/max/1634/0*N1dc5ypsT_Or-PAT"}, {"type": "sentence", "content": "GPCR family membrane proteins have been linked to a lot of neurodegenerative and cardiovascular diseases and certain types of cancer. GPCR proteins have also been proven to contribute to conditions such as obesity, diabetes, mental disorders, and others (fig. 2). As a result, GPCRs have become a popular drug target, with a large number of drugs currently on the market targeting this particular family of receptors."}, {"type": "image", "content": "https://miro.medium.com/max/2560/0*fkWpg4JpadeXLuaw"}, {"type": "sentence", "content": "One of the modern approaches to drug development involves analyzing 3D structures of GPCR molecules. But membrane receptor analysis is a slow and extremely laborious process and even when successful, it does not completely reveal the molecule’s behavior inside the cell."}, {"type": "sentence", "content": "“Currently, scientists have two options when it comes to studying proteins. They can either ‘freeze’ a protein and have its precise static snapshot, or study its dynamics at the cost of losing details. The former approach uses methods such as crystallography and cryogenic electron microscopy; the latter uses spectroscopic techniques,” comments Anastasia Gusach, a research fellow at the MIPT Laboratory of Structural Biology of G-protein Coupled Receptors."}, {"type": "sentence", "content": "The authors of the study demonstrated how combining both the structural and the spectroscopic approaches result in “the best of both worlds” in terms of obtaining precise information on functioning of GPCRs (fig. 3). For instance, the double electron-electron resonance (DEER) and the Förster resonance energy transfer (FRET) techniques act as an “atomic ruler”, ensuring precise measurements of distances between separate atoms and their groups within the protein. The nuclear magnetic resonance method enables visualizing the overall shape of the receptor molecule while modified mass spectrometry methods (MRF-MS, HDX-MS) help trace the susceptibility of separate groups of atoms constituting the protein to the solvent, thus indicating which parts of the molecule face outwards."}, {"type": "sentence", "content": "“Studying the GPCR dynamics uses cutting-edge methods of experimental biophysical analysis such as nuclear magnetic resonance (NMR) spectroscopy, electron paramagnetic resonance (EPR) spectroscopy, and advanced fluorescence microscopy techniques including single-molecule microscopy,” says Alexey Mishin, deputy head of the MIPT Laboratory for Structural Biology of G-protein Coupled Receptors."}, {"type": "sentence", "content": "“Biophysicists that use different methods to study GPCRs have been widely organizing collaborations that already bore some fruitful results. We hope that this review will help scientists specializing in different methods to find some new common ground and work together to obtain a better understanding of receptors’ functioning.” adds Anastasia Gusach."}, {"type": "image", "content": "https://miro.medium.com/max/2328/0*BPaKOjIjO1GKUcqO"}, {"type": "sentence", "content": "The precise information on how the membrane receptors function and transfer between states will greatly expand the capabilities for structure-based drug design."}, {"type": "sentence", "content": "The study was carried out with support from Russian Foundation for Basic Research and the Russian Science Foundation."}, {"type": "sentence", "content": "Header image. Illustration. Credit: Daria Sokol/MIPT Press Office"}, {"type": "sentence", "content": "Originally published at https://mipt.ru."}], "topic": "science"}