{"title": "How to Become a Product-Centric Organization", "data": [{"type": "sentence", "content": "For companies to remain flexible and digitization processes to continue to succeed, organizations must move from project-based episodic delivery to continuous integration and delivery. Adopting this type of product-centric model allows organizations to build trust across the organization and foster better engagement between IT and business stakeholders as people work toward a common goal and see results. Clearing the path to product delivery allows your IT team to drive faster, higher-quality business outcomes while improving customer satisfaction and employee engagement. Let’s look at how to become a product-centric organization, which technical barriers to product-centricity exist, the human issues that can occur when making the cultures shift to product-centricity, and how to build relationships with stakeholders while communicating the value of IT for digital business."}, {"type": "sentence", "content": "Organizations create what they feel that customers need"}, {"type": "sentence", "content": "Product-centric organizations are driven by the desire to focus their attention on building and bringing products to the market rather than the customers that purchase their products. These organizations seek to develop new products using the most innovative technology and processes that are available to them. Organizations that maintain product-centricity defines their entire culture by the products that they develop. Products that these companies develop don’t necessarily fulfill a need for the customer, but instead are sold and marketed broadly based solely on the product itself. This is done for the direct purpose of extending the reach of each product in the company’s portfolio to anyone and everyone."}, {"type": "sentence", "content": "According to a survey* by Gartner, Inc., 85% of organizations have adopted, or plan to adopt, a product-centric application delivery model in the future. Making this transition to adopt this culture of product centricity can be daunting, but as long as teams focus on areas where there is scope to innovate digital initiatives, the new business model will be easy to implement. Before diving into this new approach, it’s best to understand which initiatives fall under which department’s umbrella."}, {"type": "sentence", "content": "PR Director EMEA for Gartner, Laurence Goasduff, states that “[the act of] redesigning the organization as a digital business should be on every CIO’s mind.” This is an important notion to grasp for product-centric organizations as the CIO is a key player in nurturing the growth of the new business model in many ways. The company’s product and project managers form the foundation of the product-centric workflow supporting the model and the CIO’s plan, thereby sustainably driving innovation. The act of maintaining these roles and keeping everything organized is a bit like a juggling act, which is why many product-centric organizations are manage their product developments better when they’re products."}, {"type": "sentence", "content": "In a product-centric environment, the product itself evolves to match the market’s evolving needs with the focus being on continually making the best products possible to sell the most units. Teams don’t necessarily have strict guidelines for a buyer persona in place when they construct their product(s). Instead, these organizations create what they feel that customers need, rather than creating the perfect product that can be molded to fit the current needs of customers which is inherent to a customer-centric approach."}, {"type": "sentence", "content": "Product-centric organizations operate on an agile, product-centric model that focus on out-innovating their competitors by all means necessary. These organizations understand that their customers are only going to stay with them as long as they keep your commitments to them. When those commitments are continuously based on promises of innovation, then customers will expect that from the organization in the future."}, {"type": "image", "content": "https://miro.medium.com/max/1944/0*lhe33Ab0caCMaGrg"}, {"type": "sentence", "content": "Technical Barriers to Product-Centricity"}, {"type": "sentence", "content": "Large, built to order products in a product-centric organization are typically made by a team or committee, not an individual. Therefore, this development process does not take into account that each stakeholder has a different need and may even have their own agenda for promotion. This can lead to tense technical discussions between stakeholders and development teams when preparing to go to market. Since speed to market is critical in a product-centric approach, disagreements on the intended usage of a product that is set to go to market can be devastating."}, {"type": "sentence", "content": "Another tough situation that may arise in a product-centric organization is that even though a Request for Quote (RfQ) is sent to a Product Owner by the Purchasing department, they still have to wait until the organization’s Product Engineers specify and/or design the product specifications (which can take quite some time). In this way, product-centric decisions are made by a collective mindshare of specifiers rather than the needs of the functional buyer. This focus on optimizing product efficiencies without commensurate emphasis on effectiveness as defined by customers can lead to teams being unable to communicate why the work is being done to stakeholders because they’re too fixated on how it is done."}, {"type": "sentence", "content": "President at Intellyx, Jason Bloomberg, tells us that “product-centricity is one important aspect of the disruptive change that digital transformation is bringing to enterprise. The shift from project to product-centricity is a critically important, but rarely discussed aspect of the DevOps cultural shift.” Overall, this shift from a project-centric to a product-centric application approach does not come without challenges. As organizations gain more experience with product-centric approaches, product and technical leadership must separate from administrative line management."}, {"type": "sentence", "content": "Make the Shift from Project to Product-Focused Mindset"}, {"type": "sentence", "content": "When businesses begin to make the transition to a product-centric business model, they must adopt agile methods to allow them to treat the results as products since they will be used by external customers. Distinguished research Vice President at Gartner, Bill Swanton, explains how “the increase in how quickly and broadly organizations are adopting the product-centric application model doesn’t arise randomly. It goes hand-in-hand with the adoption of agile development methodologies and DevOps.” These methodologies consist of cross-functional teams that allow your organization to pivot its attention to the question of how to validate benefits once that functionality is configured."}, {"type": "sentence", "content": "Keeping DevOps teams focused and reminded that they are building a product as part of an organizational objective that ties back to over-arching business strategy is key. Providing product teams with a continuous flow of work will help provide continuous value to the end users. This helps to align the business strategy to product development and execution, while empowering the teams to decide what is best for their product."}, {"type": "sentence", "content": "Making the shift to product centricity requires stable teams that are aligned along business capabilities with more emphasis on Outcome rather than the Output. In this approach, there isn’t a ramp up and down based on projects. Instead, teams are responsible for the complete lifecycle of the product and are tasked with building the use cases. Without the necessary infrastructure in place to support this type of business model, it will be near impossible to shift an entire organization to a product-centric approach."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*Airm3Tk2hGjN2yQT"}, {"type": "sentence", "content": "The Human Element Inherent in Product Centricity"}, {"type": "sentence", "content": "One difficulty that product-centric organizations may encounter is that some industries may not actively be searching for that company’s products on a daily basis. This makes it difficult to sell a solution without first raising awareness that a problem actually exists. When businesses focus on products rather than customers, they may be at risk of losing touch with the market, missing new trends and being replaced by more responsive competitors."}, {"type": "sentence", "content": "Product centric businesses understand that an initial boom in profit from a successful product launch will be short lived. This is why an ideal product-centric team is empowered (and expected) to solve problems and improve business outcomes, rather than deliver scope on schedule. Teams in this setting should be more closely attached to the products being developed rather than being parachuted in to support development on an as-needed basis."}, {"type": "sentence", "content": "With this in mind, teams focus on having a plethora of irons in the fire to hedge their bets for innovation in the future. What will accelerate a team’s product development in the future will be their understanding of the problem being solved coupled along with approaches that they have tried in the past. This type of intuition can only be understood by those product owners and CIOs who have a deep understanding of the company’s track record with product development."}, {"type": "sentence", "content": "Product-Centric Organization Examples"}, {"type": "sentence", "content": "You may not realize it, but some of the most successful global organizations have been carried to the top echelon of their markets thanks to a keen product-centric approach. These product-centric companies focused their attention on developing newer and more advanced products irrespective of the demand that is existent in the market. They took huge risks at the time to become what we know them now as: innovators. Even though demand may have been relatively non-existent for their product(s) at the time of development (or even at the time of launch!), the utility and the quality of the introduced product had the effect of creating a new customer segment for the product."}, {"type": "sentence", "content": "One of the best examples of a product-centric organization is Apple. Steve Jobs was integral to the culture of innovation that positioned the company for a $1+ trillion valuation not too long after his untimely demise. When you look at the organization structure of Apple, you’ll find that the company is divided based on the products that they sell. There are teams specific to creating iPads, iPhones, and Macs. These teams are experts in their respective products and are rewarded for the number of new products that are developed or a number of new patents that have been achieved."}, {"type": "image", "content": "https://miro.medium.com/max/1400/0*XjWkaBscyGKDc20n"}, {"type": "sentence", "content": "Apple typically doesn’t release and iterate their products based on the mass market consumer wants or needs. Instead, they focus on making simple, elegant products that prioritizes the quality and function of the product that a small niche of customers will evangelize. In turn, this product evangelism comes from the customer, not from the company itself, thereby creating a natural consumer appeal based on the value of the product itself."}, {"type": "sentence", "content": "Opportunities and Takeaways"}, {"type": "sentence", "content": "A product centric approach has the potential to provide even bigger benefits for companies who opt to institutionalize the use of production analytics to obtain data for validation purposes. This new focus enables the delivery of incremental value to the organization more often, so that the business receives a cadence of constant value delivery. Lars Van Dam, Vice President Analyst, Gartner mentions that “while 66% of leaders think that they are digitally transforming their business, only 11% of CEOs are actually doing so.” CEOs that find that their organization is more concerned about the lifecycle of its capabilities, including costs, from idea to launch, and are not as concerned about the delivery medium, are adequately positioned to transform their business via a shift to a product-centric approach."}, {"type": "sentence", "content": "The next step in your company’s quest for product centricity would then be to adopt continuous delivery to ensure your teams can make frequent, small releases that allow for granular validation of benefits. This type of solution could help solve workflow issues with less effort and help construct new solutions for communicating product related information to your intended market. Building an experienced, laser-focused, cross-functional team will keep your product-centric organization in the driver’s seat on your way to consistent innovation."}], "topic": "business"}