{"title": "Why You Write Better When You Travel", "data": [{"type": "image", "content": "https://miro.medium.com/max/8964/1*oc2lQQRi5zh8eSHeJlIdhw.jpeg"}, {"type": "sentence", "content": "Some of my best writing happens in hotel bars and unfamiliar cafes. When I’m traveling, my brain just seems to click and flow better. But what explains these strange creative bursts? How and why does travel broaden the mind?"}, {"type": "sentence", "content": "Travel can both help you relax and get you out of your comfort zone. These two effects might sound contradictory, but getting out of your comfort zone is a great way to calm your mind by distracting it from your everyday worries. If you psychologically disconnect from your normal responsibilities when you travel, the new experiences and challenges will reset your stress levels— scientists refer to this as a “recovery experience”."}, {"type": "sentence", "content": "A 2019 survey of 800 Japanese workers found that recovery experiences on vacation boosted both creativity and wellbeing back at work. Taking a break from your daily routines and stresses can help you to realistically process your anxieties with a fresh mind, which ultimately gives you the mental space to be creative."}, {"type": "sentence", "content": "But it isn’t just about relaxation. Getting out of your comfort zone does much more than relax your mind. Perhaps most importantly, it allows you to directly experience and learn from other cultures. Unfamiliar traditions and viewpoints provide a window into new ways of doing things, which can inspire you with your own creative insights. Blake Mycoskie came up with the shoe brand Toms after helping to deliver shoes for rural children during a vacation in Argentina. Intercultural experiences foster creativity, and meeting diverse people outside of your typical circle can open you up to new experiences and increase the flexibility of your thinking."}, {"type": "sentence", "content": "Creative experts are good at imagining scenarios that are far outside their immediate reality. They show similar patterns of brain activity to non-creative people when imagining common scenarios. But when creative experts imagine more obscure scenarios, they show greater activity in areas of their brain such as the dorsomedial prefrontal cortex — an area frequently involved in imagining different points of view. If you struggle with creativity, traveling among different cultures might help to engage exactly the kind of thinking that transcends your immediate experiences."}, {"type": "sentence", "content": "After you’ve traveled abroad and immersed yourself in new experiences, you can actually boost your creativity simply by remembering the times you learned something new about a different culture. Nothing should stop you traveling again when you have the opportunity, but once you’ve acquired intercultural experiences, you’ve already earned access to a powerful creative mindset. So when you sit down at your work computer and your creative juices just aren’t flowing, spend five minutes thinking or writing about an important learning experience from your past travels. That may break the dam blocking all those creative juices."}, {"type": "sentence", "content": "Travel experiences even explain the relationship between socioeconomic status and creativity. A 2019 study on over 200 undergraduates found that students from rich backgrounds tended to be more creative than students from poor backgrounds. But this was almost entirely because the richer students had more diverse life experiences. In other words, well-traveled poor students were just as creative as well-traveled rich students. Intercultural experiences and diverse interests are responsible for lifting the ceiling on a person’s creativity. The evidence suggests that immersing yourself in a different culture, especially by living in it rather than simply traveling through, is a great way to stimulate a creative mindset."}, {"type": "sentence", "content": "When you’re not exploring new environments, you’re stuck in your existing habit loops and operating on autopilot. Autopilot can be great for knuckle-down productivity, but it’s rarely great for open-minded creativity — it’s specifically used when you want to limit novelty and risk-taking, such as when you’re flying an airplane 30,000 feet above the Atlantic ocean! On autopilot, you end up doing and seeing the things that you do and see every day, and this lack of novelty leads to a lack of stimulation. Instead of bombarding your brain with new sensations that inspire fresh perspectives, you lock yourself into unimaginative tasks or bog down your mind with distracting worries and regrets."}, {"type": "sentence", "content": "So get out of autopilot by getting out of your regular world. If you don’t yet have the time or money to take a trip abroad, you can start by checking out new towns closer to home, and mixing with crowds you don’t normally mix with. When you’re exploring different environments and cultures, you’re also exploring different solutions to your problems and even finding entirely new questions to ask about your life. Traveling might not make you the next Beethoven or Shakespeare, but it will help you to achieve your own creative potential."}], "topic": "neuroscience"}