{"title": "My Music Hero Turned Out to Be a Nightmare Client", "data": [{"type": "subtitle", "content": "5 lessons learned from this experience that changed how I do business as a freelancer"}, {"type": "image", "content": "https://miro.medium.com/max/4136/1*ONNCG7UIEp5Ft0o0g9TaGA.jpeg"}, {"type": "sentence", "content": "Becoming your own boss and doing freelance work can be exciting. You never know what will happen or who you’ll end up working with. There are many lessons to learn, most of which come at a cost. However, that cost is almost always worth it."}, {"type": "sentence", "content": "After years of handling online marketing for local small businesses, I decided to pivot and help musicians with their marketing. Except I knew nothing about the music industry."}, {"type": "sentence", "content": "My lack of experience didn’t matter. I’ve always been passionate about independent music and supporting the artists who create it so I’d learn along the way. After all, I credit music with having saved my life when I was a youth dealing with mental health issues."}, {"type": "sentence", "content": "I ventured blindly into an industry about which I lacked expertise. What I did have was a motivation to pursue my passion and desire to get out of my comfort zone. Perhaps my story is a bit uncommon, but my journey has been surprisingly great so far as a music marketing freelancer."}, {"type": "sentence", "content": "My highlights in my first few years include:"}, {"type": "sentence", "content": "This is what I’ll focus on: that one hellish client."}, {"type": "sentence", "content": "Let’s call this guy Richard. Work with Richard started off well enough. But after a rough year, I finally came to terms with reality: he had turned into the worst client ever."}, {"type": "sentence", "content": "It made me rethink how I’d been operating as a freelancer. I’ll share with you what I’ve learned from this experience."}, {"type": "subtitle", "content": "1. Establish a Firm Policy"}, {"type": "sentence", "content": "I mainly operate on a monthly retainer model. It’s the most efficient way for me to conduct online marketing services and consulting. There’s no need to track hours, and I have a consistent income. One of the perks I offer such clients is priority treatment over those who pay for one-off or hourly projects."}, {"type": "sentence", "content": "For a while, I didn’t have a firm policy in place. Instead, I took the figure-it-out-as-I-go route. It may take some experience working with people to nail a personal policy down, especially the clients for whom nothing can ever go right."}, {"type": "sentence", "content": "If you ever hear the words “it should take you five minutes to…” (insert the four-hour project they’ve described) run. And for those, maybe there is no firm policy, aside from ditching them."}, {"type": "sentence", "content": "I was lax about my policies when it came to Richard. Business aside, I have been a huge fan of his music for over 15 years and I got to know him on a personal level."}, {"type": "sentence", "content": "And he took advantage of that."}, {"type": "sentence", "content": "Even when he wasn’t paying, I gave him the benefit of the doubt and did the work."}, {"type": "sentence", "content": "My compassion ended up biting me in the end. After several missed payments without explanation, I pushed Richard’s work aside and took longer to respond to him. This felt like a fair policy."}, {"type": "sentence", "content": "He accused me of slacking and being “too nonchalant.” He used that perception as an excuse to continue not to pay me."}, {"type": "sentence", "content": "I calmly (with gritted teeth) explained that I had clients who did pay consistently and on time. It wouldn’t be fair to them for me to give Richard, a non-paying “client”, priority because that would take away the time they’d paid for."}, {"type": "sentence", "content": "This leads to the next lesson. It’s important to tell your clients what they can expect from you, and what you expect from them."}, {"type": "subtitle", "content": "2. Communicate Boundaries, Standards, and Expectations"}, {"type": "sentence", "content": "Richard waited until the last minute to get anything done. Which meant that I became a victim of that same habit. I was asked to do a lot of work within impossible timeframes."}, {"type": "sentence", "content": "As a professional, you need to set boundaries and communicate them. Otherwise, some clients will trample them."}, {"type": "sentence", "content": "As for expectations, those must be laid out clearly. Tensions can arise when both parties aren’t on the same page. Richard had certain expectations that I never agreed to when it came to certain tasks, which he could use to justify why he shouldn’t pay."}, {"type": "sentence", "content": "In any relationship, there needs to be compromise."}, {"type": "sentence", "content": "One of my most important policies is that I don’t work for artists, I work with them. I’m not someone you pay to do a bunch of things without your involvement unless specific tasks require it. Unfortunately, I wasn’t aware at the time that this was a stance I could take, and my professional relationship with Richard suffered from it. As well as from a lack of clarity on both ends."}, {"type": "subtitle", "content": "3. Problems Stem from Poor Communication"}, {"type": "sentence", "content": "We can’t control how our clients communicate, but we can control how we communicate. I failed to do that with Richard, and while I lost time and money, I gained knowledge through that experience."}, {"type": "sentence", "content": "Things may have been different if Richard would have told me upfront that he had issues paying me a monthly retainer. Or if I had drawn up a contract that would obligate him to pay it."}, {"type": "sentence", "content": "I could have better communicated what my expectations were, as well as outlined my personal standards when it came to doing business."}, {"type": "sentence", "content": "My biggest mistake: not warning Richard that I was stepping back from his work due to lack of payment. I’m not a confrontational person, so I chose passive aggression. While that can be satisfying, it’s rarely the proper way to handle business."}, {"type": "subtitle", "content": "4. Be Clear About Payment Expectations"}, {"type": "sentence", "content": "Even though things didn’t work out, I still believe Richard’s a good person; he was simply terrible with money and conducting business. When I doubted which side the fault lay on, his peers confirmed that he had a reputation for such behavior. However, I could have handled the situation better myself."}, {"type": "sentence", "content": "He never paid me. Surprise! Well, he did the first few months, then payments became sporadic, until they stopped."}, {"type": "sentence", "content": "I would come to learn that Richard felt a retainer model wasn’t fair because he didn’t “need my services constantly”. Had he brought this up in the beginning, I would have accommodated him. That’s the tragedy of poor communication."}, {"type": "subtitle", "content": "5. Know When to Go"}, {"type": "sentence", "content": "No one wants to lose a client, especially if it’s someone you’ve respected for quite a while. At the end of the day, if they’re stiffing you, being difficult, or not respecting your time, you need to let them go."}, {"type": "sentence", "content": "Knowing your worth and respecting yourself will go a long way when it comes time to say bye-bye to a toxic client."}, {"type": "sentence", "content": "The best thing for your sanity (and a great partnership), is to make sure that your client understands and respects teamwork and proper communication. That they don’t feel they’re better than you, or the other way around."}, {"type": "sentence", "content": "It’s never worth keeping toxic clients at the expense of your self-respect, no matter how famous or accomplished they are. Let them go."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "I’ve since moved on and picked up a more prominent client, but it’s funny how negative experiences can stand out more in your mind than your greatest accomplishments. It doesn’t need to be that way. And you don’t need to work with your dream-turned-nightmare client to figure out how to better operate as a freelancer."}, {"type": "sentence", "content": "If it ever happens to you, don’t hold any grudges or resentments. We often don’t know what clients are going through in their personal lives. It’s best to move on and let it be. Forgive, forget, and focus on a brighter future with better clients who appreciate and respect you."}, {"type": "sentence", "content": "Has anyone else had a similar experience with a “dream” client? Would love to hear your stories."}, {"type": "sentence", "content": "David “D4” Nguyen is a freelance music marketer and content creator for D4 Music Marketing, an online resource he created to help emerging independent artists improve their chances of making a living off music. As a non-musician, his interest in music is fueled by its power to connect us and change lives for the better, as it did for him."}], "topic": "freelancing"}