{"title": "Backpacking the Best of the Sierra Nevada", "data": [{"type": "sentence", "content": "Years back I formed the opinion while on a thru hike of the John Muir Trail that the Sequoia/Kings Canyon area is perhaps the best section of the Sierra Nevada range. Of course an opinion like this is largely personal but the SEKI area seems to be blessed with all the requisite ingredients for alpine adventure: rugged, undulating granite, grand vistas, the range’s largest concentration of high peaks, bountiful lakes and streams, and best of all relative solitude for those willing to tuck into the lesser traveled corners of the park."}, {"type": "sentence", "content": "With that as inspiration I spent the winter studying my reference books and maps to come up with a route that would afford an extended trip, preferably a loop as to not cover the same ground twice, and hopefully with a logistically easy resupply point. By spring I had a half baked trip plan and secured a permit for my girlfriend “Mo” and I."}, {"type": "sentence", "content": "I read snow accumulation reports all spring and watched CalFire maps all summer. Luckily once August came around the high passes were mostly clear, the water crossings fordable, and there were no major, uncontrolled fires burning in the southern Sierra. The trips start however would coincide with the hottest heat wave of the summer which increased the likelihood of two always present summertime hiking challenges: The mosquitos would not yet have been deterred by overnight freezing, and there would be an increased likelihood of thundershowers. In the end both would present themselves, but would be nothing more than minor inconveniences."}, {"type": "sentence", "content": "Our trip began at Roads End in Kings Canyon where the oppressive 92°F afternoon temperature and the incessant face flies on the Bubb’s Creek trail were an instant reminder that backpacking isn’t always wildflowers and stunning views. We were happy to turn off at Sphinx Creek where the steep trail up the canyon wall provided an escape from the bugs and a steady breeze helped quell the heat. We limped into camp under the light of our headlamps, wolfed down our dinner and crashed for the night; punch drunk from the evening’s exertion."}, {"type": "sentence", "content": "Day 2 took us up and over Avalanche Pass (10.0K’) and gave us the first far off views of the areas we’d be traveling through, including our first glimpse of Deadman Canyon. After a midday swim and a brief chat with the resident ranger at Roaring River we started up Deadman. This area isn’t heavily traveled, the trail is quite overgrown, and it was here that we had our first bear encounter. I apparently walked right by momma bear and Mo tried to tell me but fear had taken the volume from of her voice and I couldn’t hear her whispers behind me until about her tenth attempt, after which I turned to see momma with two cubs in tow, scurrying far up the canyon side. That evening was spent eating, dodging mosquitos and playing Open-faced Chinese Poker in the tent before 7:30pm came sending us to bed."}, {"type": "sentence", "content": "Day 3 found us climbing through what Mo dubbed the “car wash”; densely overgrown flowers and other flora that all but completely obscured the trail. By early afternoon the we finally reached the tree line and the path opened up. At the top of Elizabeth Pass (11.4K’) we soaked in the expansive views of the canyon behind, and peered ahead to the descent that would eventually join us with the High Sierra Trail. As we descended we realized we were both pretty wrecked and upon finding an excellent place to camp, we decided to cut the day a few miles short, take a swim, set up the tent, and stare at Eagle Scout Peak and surrounding mountains as the ever changing evening light danced over them."}, {"type": "sentence", "content": "Day 4 put us smack in the best section of the High Sierra Trail. We took in the sights of picturesque Hamilton and Precipice Lakes as we ascended toward Kaweah Gap (10.7K’). Once there the views of the Kaweah Range and into Nine Lakes Basin were magnificent, as were the down trail views of Big Arroyo. At the junction for Little Five Lakes the mosquitos were ravenous. We slapped at them manically and sprinted up the climb to try and escape, but with diminishing daylight we were forced to admit defeat and retreat to the safety of the tent in a less than stellar but serviceable campsite at the edge of the trail."}, {"type": "sentence", "content": "Day 5 started early in an effort to make up some miles. After passing Big Five Lakes we quickly lost elevation as we approached the mouth of Lost Canyon. The trail through this beautiful canyon soon vanished when we reached a large tree fall area where a winter avalanche had snapped hundreds of trees in half 15’ to 20’ above the ground, their debris littering the trail and rendering it completely impassable, and requiring an unwelcomed bushwhack work-around. We paused for a long swimming and lunch break at the base of the climb proper, before heading up to lovely Columbine Lake (10.8K’). As I waited for Mo I whipped up a mountain margarita - snow, dehydrated lime and whiskey - and took in the views. From there the trail to Sawtooth Pass (11.6K’) then deteriorates into more of a “route” with some, (dare I say “fun” — cover your ears Mo!), class 2 boulder scrambling. After reaching the top of the pass we carefully scree skied our way down to Monarch Lake (10.3K’) where we pitched camp for the night."}, {"type": "sentence", "content": "Day 6 was another early start as we gleefully charged down to Mineral King (7.6K’) to retrieve our resupply, previously driven out to and stashed in the rangers storage shed. After getting an update on weather forecast and wildfire status we quickly converted the empty bear bin to a beer bin and chilled the couple of Sculpins I’d stashed in the resupply. We sipped beer, snacked on smoked trout and cheesy poofs, and did bucket laundry. Fully restocked and with all our chores done, we thumbed a ride from a vacationing British family that were kind enough to let us sit on the floor behind the third row seat of their very full minivan. Back on the trail it was raining intermittently and the 15 pounds of new food was an unwelcome impediment, but I was just able to hang on Mo’s heels as she set a blistering pace up the 4K’ climb to Franklin Pass (11.6K’). We crested Franklin then quickly descended to camp on a ledge just below, both of us feeling completely depleted."}, {"type": "sentence", "content": "Day 7 had us immediately descending into Rattlesnake Creek, a place name probably not intended to encourage visitorship. At the top of the canyon we bumped into 3 hikers that confirmed the area was indeed aptly named, telling us their stories of run ins with two large rattlers while on the trail. This had me beating every trail side bush with my trekking poles just to make sure I didn’t spook any of the critters. Fortunately we made it all the way down to the Kern River (6.6K’) with nary a sighting and quickly found a small beach to have a rest, a swim, a cup of coffee and some snacks. Rested and refueled we started up the Kern eventually reaching Kern Hot Springs (7.7K’). To my astonishment there was nobody at the springs nor camped in the immediate area, and with little left of the evening we decided to go for a soak and camp nearby."}, {"type": "sentence", "content": "Day 8 was more steady climbing toward the headwaters of the Kern. The views into the Milestone Bowl/Colby Pass area, with all their peaks and waterfalls was mesmerizing and had me already dreaming of a future trip into that area. As we approached 10.0K’ the clouds to the south became increasingly nasty looking and it was evident the rain would be upon us shortly. The wind quickly became abusive with powerful gusts dislodging small pinecones from the trees, hurling them violently, occasionally peppering Mo and I as we frantically tried to climb away from the ridgeline. We eventually found a spot to set camp and shelter from the weather."}, {"type": "sentence", "content": "Day 9 had me up early assessing the impact from the overnight storm. The morning light peeking through the rain clouds brilliantly illuminated the Great Western Divide in the distance. A few shakes of the rain fly got rid of most of the water and once packed up we headed cross country to find the John Muir Trail and climb toward Forester Pass (13.2K’). From far off the pass is a real head scratcher, it’s headwall appearing completely impassable. It’s only when you are right there near the top of the pass that you see how the engineers routed the trail through a tiny notch, up and over. On the down side we cruised the gradually descending trail to a camp with an excellent swimming hole around the corner from the crowded meadow junction."}, {"type": "sentence", "content": "Day 10 had us awake early and as we lounged drinking coffee three bears strolled by the tent. Again it was mom with two cubs closely in tow presumably returning from their predawn raid of campers uptrail in Vidette Meadow. The cute cubs were no bigger than full grown bulldogs and as they made their way down the trail they’d occasionally pause for a little play fighting, one whacking the other in the head then sprinting down the trail to escape retaliation. We packed up and slowly made our way down Bubb’s Creek then eventually back to the car, talking the whole way about the bountiful feast of Italian food we were going to have once back to civilization!"}, {"type": "sentence", "content": "Statistics & Resources"}, {"type": "sentence", "content": "Trip began late Aug’17 & covered 117 miles w/26K’ of elevation gain/loss: https://caltopo.com/m/LSQV"}, {"type": "sentence", "content": "General/Permit Information:"}, {"type": "sentence", "content": "Sequoia & Kings Canyon NPS: https://www.nps.gov/seki/planyourvisit/backpacking.htm"}, {"type": "sentence", "content": "Campfire Permit: http://www.preventwildfireca.org/Campfire-Permit/"}], "topic": "travel"}