{"title": "Entering the Design Industry", "data": [{"type": "sentence", "content": "We’re living in some weird-ass times. One of the unfortunate results of a global pandemic is loss of jobs and financial security. While people continue to deal with this, the prospect of entering a new field — especially one that’s slightly better equipped to handle these circumstances — may be interesting."}, {"type": "sentence", "content": "Below, you’ll find a handful of valuable tips for folks looking to enter the fields of Product/User Experience Design. These tips are based on my own experience of transitioning into the field as well as years of mentoring, managing, and hiring designers at companies like Airbnb, Khan Academy, and Big Cartel."}, {"type": "subtitle", "content": "1. Understand the Different Roles"}, {"type": "sentence", "content": "Technology companies can have Brand Designers, User Experience/Product Designers, Motion Designers, Production Designers, User Researchers, and more! Besides design, there’s also Product Management, Software Engineering, Customer Support, and Data Science."}, {"type": "sentence", "content": "All of these won’t exist at every company, but it’s worth understanding these roles and how they may or may not align with your interests."}, {"type": "subtitle", "content": "2. Focus On Your Craft Early"}, {"type": "sentence", "content": "Fight the urge to perfect your resume, portfolio, or interviewing skills if you haven’t yet devoted enough time to improving your design skills. Your design skill is usually apparent right away and that’s what hiring managers will care most about!"}, {"type": "sentence", "content": "This industry is competitive — take the time needed to get better first. This of course assumes you’ve got the luxury of some other way to earn income as you develop, which isn’t a luxury we’re all afforded."}, {"type": "subtitle", "content": "3. Own Your Past as a Non-Designer"}, {"type": "sentence", "content": "Design experience is important for a design job, but there’s great value in the experience you’ve gained in your prior career!"}, {"type": "sentence", "content": "Good design teams know that building a diverse team is critical to building successful products. In addition to ethnic and gender diversity — which are most critical — diversity of education, career path, and location is also valued."}, {"type": "subtitle", "content": "4. Find a Mentor"}, {"type": "sentence", "content": "A mentor with professional experience in your desired field can make a huge difference in your career trajectory!  Good mentors can provide all sorts of value for new designers. For example, they can provide feedback on your projects, help you refine your resume and portfolio, connect you to others in the industry, share learnings they’ve had throughout their career, and more. Having a resource like this can be a difference maker when it comes to succeeding."}, {"type": "subtitle", "content": "5. Join Design Communities."}, {"type": "sentence", "content": "Just like having a mentor, it’s useful to have peers you can share with and learn from. Many design communities encourage sharing job postings, giving feedback to one another, and uplifting folks who have been laid off by sharing their portfolios and resumes."}, {"type": "sentence", "content": "Having access to these resources and to people tackling similar challenges can be super helpful as a newcomer to the industry."}, {"type": "subtitle", "content": "Closing"}, {"type": "sentence", "content": "I hope you find these tips useful as you consider a potential career shift. Here’s some additional thoughts I’ll leave you with:"}], "topic": "design"}