{"title": "The Trifecta of Effective Language Learning", "data": [{"type": "image", "content": "https://miro.medium.com/max/11520/0*PdlausQL-Vnq8CeM"}, {"type": "subtitle", "content": "First, some questions"}, {"type": "sentence", "content": "Let’s call an ‘everyday language learner’ an adult learner who is seeking to achieve long-term success in a language that they began learning in high school or later."}, {"type": "sentence", "content": "And let’s call ‘success’ the ability to use the language for effective communication in a wide range of situations and settings and in order to achieve a range of goals that you are already comfortable accomplishing in your first language(s)."}, {"type": "sentence", "content": "In other words, think of being able to use the language as a vehicle for communication…"}, {"type": "sentence", "content": "All of these questions, though, are just a few of those being posed by Second Language Acquisition (SLA) researchers in a number of ways over the past four decades the field has been in existence, questions which have led down all sorts of paths in their efforts to peel off the layers of the language learning onion."}, {"type": "sentence", "content": "And it has been a difficult onion to peel, to say the least."}, {"type": "subtitle", "content": "The bigger picture"}, {"type": "sentence", "content": "But for a language learner who wants to know what the research says about the best way to learn another language, how can you begin extracting practical insights from jargon-packed research articles? Or should you even bother?"}, {"type": "sentence", "content": "A lot of the research in SLA is very focused."}, {"type": "sentence", "content": "Whether it be on how specific languages are acquired by learners from certain linguistic and cultural backgrounds, investigating the development of language competence from more cognitive or social theoretical perspectives, or critically examining the ever-expanding language learning market that seeks to profit on the desire among pretty much everyone on the planet to improve their proficiency in another language."}, {"type": "sentence", "content": "But rather than spending too much time on all of that, I’d like to zoom out a bit, get a ‘bigger picture’ of SLA and hopefully offer up a few insights from the SLA research for the average, everyday language learner."}, {"type": "sentence", "content": "This is because I feel the research on language learning has not only helped me to get a better grip on what the process of language learning involves, but has also helped me see how I can begin relating the numerous theories, findings, and insights in SLA to my own language learning practice."}, {"type": "sentence", "content": "Wading through the swamp of SLA research can be a bewildering experience and at first seemingly in a small supply of concrete strategies for language learning."}, {"type": "sentence", "content": "This is because much of the research is concerned with the complex social and cognitive processes involved in language learning, and not so much with prescribing practical strategies for learners (although there is a growing body of research on language learning pedagogy aimed at providing useful insights for teachers and learners)."}, {"type": "sentence", "content": "Andrew Cohen who researches strategies for learning and using a second language defines a ‘language learning strategy’ as:"}, {"type": "sentence", "content": "These include language learning strategies like:"}, {"type": "sentence", "content": "But in this post I‘ve tried to pull some of the biggest clumps of insight from a range of different research approaches in the field."}, {"type": "sentence", "content": "These insights have helped me to see the language learning process from diverse vantage points and, perhaps most importantly, begin making connections to my daily practice as a language learner."}, {"type": "subtitle", "content": "A trifecta for effective language learning"}, {"type": "sentence", "content": "These three approaches to language learning are somewhat obvious but have been described in various ways by researchers coming from all sorts of different perspectives in SLA:"}, {"type": "subtitle", "content": "1. Learn the language in context."}, {"type": "sentence", "content": "What do I mean by learning a language in context?"}, {"type": "sentence", "content": "I think SLA researcher Bonnie Norton puts this well when she writes,"}, {"type": "sentence", "content": "This is all to say, language should be seen as embedded in social and cultural practices, and finding language learning resources that give you access to these different interpersonal, linguistic, and community contexts when learning the language is a good way to go."}, {"type": "subtitle", "content": "2. Learn the language by using it for specific purposes."}, {"type": "sentence", "content": "Learning by doing seems to be one of the keys to learning another language as it allows people to both gain knowledge of various aspects of the language as well as gain experience using the language."}, {"type": "sentence", "content": "Through using the language from the very first day, and for purposes that allow you to experience the language in meaningful ways by doing specific tasks with the language, you can build your language competency up holistically as one holistic experience at a time rather than just one noun or verb at a time."}, {"type": "subtitle", "content": "3. Learn the language in face-to-face interaction."}, {"type": "sentence", "content": "Lastly, learning language in interaction with other, real-life human beings is an obvious point for anyone who has had the experience of studying a language on their own prior to a trip, only to be met later with disappointment when they struggle to start up a simple conversation with a native speaker."}, {"type": "sentence", "content": "While the process of language learning should involve all kinds of receptive interactions with literature, movies, podcasts, social media, and more, the original home of language learning is in face-to-face conversation."}, {"type": "sentence", "content": "Having to negotiate meaning with other speakers on the fly seems to be one of the key ways to develop our language ability. And with a range of new online language learning resources now available for motivated language learners to take part in second language interaction, this is getting much easier to do."}, {"type": "subtitle", "content": "Develop a daily practice: hone your language learning intuition"}, {"type": "sentence", "content": "Through systematic research we can provide fantastic descriptions and theories of the various facets of the language learning process, but things get a bit less crisp when we begin making general prescriptions for how best to go about learning another language."}, {"type": "sentence", "content": "The ‘science’ of SLA can tell us a lot about both the universal aspects of language learning as well as the individual idiosyncrasies that make each of our language learning journeys unique. The key for the language learner, however, is to become a researcher of yourself in a way, bridging your knowledge of both the language and the language learning process along with your own experiences in developing a unique path towards your language learning goals."}, {"type": "sentence", "content": "This might be a good point to ask what your goals are exactly?"}, {"type": "sentence", "content": "The journey of learning another language is just as much a journey in learning to develop a daily practice, just as with writing, meditation, and exercise. By this I mean that learning another language is about fostering the energy, motivation, and consistency that any kind of skill-learning requires of someone."}, {"type": "sentence", "content": "Perhaps, most importantly, this is why whatever path you choose towards learning a new language, the most effective one will be the one that most resonates with you, and as a consequence, will be the one that you stick with for the long haul."}, {"type": "sentence", "content": "“Intuitions are formed at the crossroads of knowledge and experience,” says H.D. Brown, a researcher of second language acquisition."}, {"type": "sentence", "content": "By learning about the language learning process, paying attention to our own experience as language learners, and by constantly taking risks on our language learning journey that might reveal insights into our own language learning practice, we can begin developing our ‘intuition’ about how best to begin, and persist on one of the most awesome, enriching and rewarding journeys there is if I might say so myself."}, {"type": "sentence", "content": "The process of language learning is complex, as complex as the individual quirks of people who embark upon the journey of learning a new language, and as complex as the multitude of languages and language learning situations that people find themselves in around the world."}, {"type": "sentence", "content": "“Each language lesson is in some ways a unique drama” one researcher writes, and understanding these ‘unique dramas’ that populate our lives as language learners is what, I think, makes both researching SLA and learning another language so fascinating, and inevitably a challenging but rewarding process of self-discovery."}, {"type": "subtitle", "content": "Not just a technical feat but an expansion of perspective"}, {"type": "sentence", "content": "Learning another language isn’t just about the acquisition of a new skill. Language learners know from their own experience that it is also about an ‘expansion of perspective’ of the world they live in. This point is echoed in Bialystock and Hakuta’s 1994 book on second language acquisition:"}, {"type": "sentence", "content": "Just remember that when cultivating your daily language learning practice, the important thing is to maintain a constant sensitivity to your own unique insights and intuitions about your language learning journey as you build it up one experience at a time."}, {"type": "sentence", "content": "Best of luck!"}, {"type": "sentence", "content": "Notes:"}, {"type": "sentence", "content": "¹ This was one of the first posts I wrote as a freshly admitted Ph.D. student in 2014. I thought it had vanished when I deleted my old blog, but lo and behold I recently discovered I had sneakily saved some of my writing from back then. My interest and research focus has shifted over the years from Second Language Acquisition to Environmental Communication. So, reading these essays again was like coming across a time capsule addressed to my future self, thanks pre-COVID-19/Trump-era-me! I hope those of you interested in the interface between language learning practice and theory find it interesting, although a tad bit dated. For clarity, I’ve lightly edited this piece for typos, broken links, and formatting."}], "topic": "education"}