{"title": "The Surprising Skill That Sets Apart Successful Leaders", "data": [{"type": "subtitle", "content": "How strategic thinking will help you succeed"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*gBLXlJdLpxoY99mzqZM12g.jpeg"}, {"type": "sentence", "content": "As part of my work as a consultant, I focus heavily on marketing strategy. A client of mine put it beautifully"}, {"type": "sentence", "content": "Charming hey. Still, now more than ever, my skills as a strategist (something I developed in over 10 years of faux pas and a gigantic learning curve) as becoming more and more prominent."}, {"type": "sentence", "content": "I have always known that strategic thinking was a great skill to develop and nurture, yet it has become painfully clear than now, more than ever, everyone needs to develop strategic thinking as part of their skillset."}, {"type": "sentence", "content": "In our volatile business environment, leaders are faced with constant major changes. As I was listening to a brilliant episode from the School of Greatness today with the one and only Gary Vee, the penny proverbially dropped."}, {"type": "sentence", "content": "Whether you are looking to grow a personal brand or a profitably business, you’ll need the ability to develop and implement strategies that respond to the changing conditions."}, {"type": "subtitle", "content": "Strategic thinking is a lot about business values"}, {"type": "sentence", "content": "Think about the way businesses have shifted — the Apples, Googles, and AirBnbs of today see success as something that goes beyond monetary reward. Success is a combination of strong values, the company culture of overall brand awareness."}, {"type": "sentence", "content": "Strategists in today’s world have to consider values and meaning, not just profit."}, {"type": "sentence", "content": "As consumers in an online-driven world, we want companies to provide us not just with nice things, but with meaning and a vision of the future. We want to know how companies will be paying it forward to build a better world."}, {"type": "sentence", "content": "That desire for meaning can’t be ignored."}, {"type": "sentence", "content": "Key takeaway: getting clear on your values and how they impact your audience is at the forefront of strategic leadership."}, {"type": "subtitle", "content": "Recognizing who your stakeholders are"}, {"type": "sentence", "content": "Personal brands and companies should be led in line with the interests of their stakeholders. Yet, as soon as you use words like stakeholders, people tend to switch off, hence a bit of reframing is in order."}, {"type": "sentence", "content": "Who are your stakeholders? They are the people or groups who get something out of the company and who influence it in return, including employees, investors, customers, and your wider audience as a whole."}, {"type": "sentence", "content": "As Richard Branson once said, “Happiness is the secret ingredient for successful businesses. If you have a happy company it will be invincible.”"}, {"type": "sentence", "content": "Strategic leaders will have to take all of these groups in mind when creating clear marketing communication, refining brand values, and looking at the growth of a company."}, {"type": "sentence", "content": "Different stakeholders (or audiences) might have different views of what a successful strategy looks like, and after studying the strategy departments in four major companies, a group of researchers have spotlighted crucial areas to focus on. They all revolve around the idea of integration and leadership."}, {"type": "sentence", "content": "The most important to master is content integration, which revolves around a clear understanding of strategy and objectives within a company."}, {"type": "sentence", "content": "Leaders need to work on creating better dialogue and negotiation with stakeholders. That way, they can be the interface between groups, mediating while leading when difficult decisions have to be made."}, {"type": "sentence", "content": "Key takeaway: Taking time to create a system, framework, or document that outlines key brand and strategy focus is going to be at the forefront of communication. Whether it’s a monthly, quarterly, or yearly calendar, clarity is 100% key."}, {"type": "subtitle", "content": "Learning from a volatile business environment"}, {"type": "sentence", "content": "Long gone are the days where you’d write a 5-year plan and religiously stick to it. These days, true success when it comes to strategy is about developing an externally-focused strategy. It means responding to and adapting with changes in the social and economic environment — something painfully obvious at this very moment."}, {"type": "sentence", "content": "Whenever I work with clients or members of our collective, I make time to"}, {"type": "sentence", "content": "And responding to them means not just recognizing and following trends, but also knowing that they don’t last forever."}, {"type": "sentence", "content": "Key takeaway implementing small sets of clear goals can help shape a sustainable and healthy strategy. A list of future-focused activities everyone can get clarity on is key to create a plan of action for the future of your brand."}, {"type": "subtitle", "content": "Which type of strategic leader are you?"}, {"type": "sentence", "content": "The Model of Strategic Leadership Competence — or MSF Model for short — is a detailed analysis of competencies based on observing how successful leaders behave."}, {"type": "sentence", "content": "This allowed to recognize a few selected types of successful strategic leaders, based on this corporate model (which I adapted):"}, {"type": "sentence", "content": "Is one of these types of leaders better than others? Not really. Yet, depending on the description you think you fit best, you’ll find more inclined to lead your brand and communicate in a unique and different way."}, {"type": "sentence", "content": "Remembering that you are the main product of your personal brand is key."}, {"type": "sentence", "content": "As the world is changing, and business models are turned on their heads, leaders should look at how their brand is interacting with all the different audiences involved in making their business great. They need to find ways to clearly communicate values and the overall brand vision."}, {"type": "sentence", "content": "As a strategist, you officially are the architect of the future."}, {"type": "sentence", "content": "Unlike an architect, you are asked to constantly innovate and evolve, instead of creating immovable structures sent in stone forever — and that is truly where the magic happens."}, {"type": "sentence", "content": "My name is Fab Giovanetti. I am a writer, author, marketing consultant, founder of Creative Impact Group, and pun master. I help people grow their online audience and monetise their content and unleash their potentials as creatives."}, {"type": "sentence", "content": "Want more? Get my Medium marketing toolkit."}], "topic": "leadership"}