{"title": "My Life Is a Nightmare and There’s No One to Blame But Me", "data": [{"type": "subtitle", "content": "I’m not sure how to talk about this wave of depression."}, {"type": "sentence", "content": "I’ve been running on an ineffective brand of autopilot for most of 2020. Like a lot of other people, I’m sure, coping has only become harder as the year has progressed."}, {"type": "sentence", "content": "March 13. I keep going back to that day, keep remembering how I already felt as if I was drowning when the news came that my daughter’s school was extending spring break for one week due to the risk of the coronavirus."}, {"type": "sentence", "content": "There went all my grand plans. There would be no grand adventures over spring break, no days spent at the bounce house so my daughter could play while I worked. No overnights at Nana’s so my daughter could have a nice visit while I got some alone time."}, {"type": "sentence", "content": "So much fun was canceled, but we’d hunker down and make the most of it. We’re fortunate. Things could have been much worse."}, {"type": "sentence", "content": "They could always be much worse."}, {"type": "sentence", "content": "School got out on March 13, and the physical space never reopened. More fun plans were canceled."}, {"type": "sentence", "content": "We survived."}, {"type": "sentence", "content": "Yesterday was my daughter’s last day of school over Zoom. Last summer, I enrolled her into preschool late for her age. She was already old enough to enter kindergarten, but I choose to give her the extra time to get more acclimated to school. It was a wonderful experience and I have zero regrets, but I know it also puts her in an interesting place for starting kindergarten in August if current events put her more “behind.”"}, {"type": "sentence", "content": "I’ve browsed the CDC guidelines on reopening schools, and while my daughter’s private school is quite small, I still can’t imagine anyone being able to enforce some of these restrictions upon children. It’s not like I’m against any of the social distancing rules, but I question how they could be realistically implemented and adhered to."}, {"type": "sentence", "content": "Of course, I’m looking ahead to the next academic school year, when I’m not even sure how to get through the summer. The truth is that I have been coming apart at the seams for a while. And it’s not just the pandemic. My life is falling apart, but I can’t blame my current state on COVID-19."}, {"type": "sentence", "content": "I am currently drowning beneath the weight of so much stuff. Too much stuff. I am drowning in this body that is way too fat and fatigued. Drowning beneath piles of laundry I’ve yet to fold or hang. I am drowning beneath the clutter I always seem to come back to whenever I feel too stressed or depressed. And I’m drowning beneath the weight of so much housework which only accumulates when it isn’t done."}, {"type": "sentence", "content": "Obviously."}, {"type": "sentence", "content": "Lately, there’s this horrible, almost foreboding feeling on my chest. Every night, I tell myself that tomorrow is going to be better. That I’m going to make different choices and choose to clean up my act. And then every morning I wake up with the same damn fatigue — maybe even apathy — where I ask myself if I should clean or write."}, {"type": "sentence", "content": "Writing always wins."}, {"type": "sentence", "content": "Yet the reality is that I’m writing very slowly and I am much more easily distracted. Despite not getting too much done, I’m overwhelmed by everything I should be doing. Everything I am not doing."}, {"type": "sentence", "content": "I understand that I’m a wreck who’s making poor choices. I know I’ve got nobody to blame but me."}, {"type": "sentence", "content": "Yet I keep making the same choices which lead me to feel consistently unfulfilled, overwhelmed, and exhausted."}, {"type": "sentence", "content": "Sure, there are these brief glimmers where I feel good about something I’ve done. Maybe I really like a story I wrote or it makes me feel cleaned out inside to finally tell it. I might spend some time with my daughter making snow cones, watching movies in bed, or roasting marshmallows at home and I feel good. It’s a fleeting good, but they’re still real memories."}, {"type": "sentence", "content": "And there has to be something good about that."}, {"type": "sentence", "content": "But every day, as I make one more useless (even detrimental) pile of clutter, or take out only “some” of the trash, there’s this aching sorrow within me. It whispers quietly that I’m depressed."}, {"type": "sentence", "content": "It’s true — I know it’s true. I am in a losing stretch of some dark game. This is my life and I am no stranger to depression since it’s haunted me for half my time. And yet I still don’t really know what to do."}, {"type": "sentence", "content": "It’s a good thing that I spend so much time at home. My hands are constantly rubbing at my eyes. My palms keeps grasping my head at the temples as if I can somehow work this mess that is my mind. Lately there’s this edge and irritation to everything. I feel razor sharp and dull all at the same time."}, {"type": "sentence", "content": "Over the past couple of months I keep taking two steps forward and one step back. Every time I think I’ve got a handle on things it turns out I was wrong. Each day I dream of making progress in the areas of my life that are killing me and every day I stumble just to get by. To cope."}, {"type": "sentence", "content": "I feel like one of those memes where your body is telling you what you really need and you’re not listening. There are countless variations, but all feel pretty true to my life right now."}, {"type": "image", "content": "https://miro.medium.com/max/1000/1*ZGpQPZ0hYTbMTU7fwiPPZQ.png"}, {"type": "sentence", "content": "To be fair, I’ve taken baby steps. I am eating more fruits and vegetables while consuming less diet soda. I’m still not moving around enough, however, and I’m still nursing the occasional binge on ice cream or you know, whatever. I still don’t drink enough water. I keep putting off making a doctor appointment although I've been bleeding since March 13. Between endometriosis and polycystic ovarian syndrome (PCOS), I'm used to abnormalities."}, {"type": "sentence", "content": "If I’m absolutely honest with myself, I know that I’m allowing hours to pass every day while getting next to nothing done, yet I’m constantly repeating the refrain that there’s no time."}, {"type": "sentence", "content": "I’d be lonely as hell right now if I wasn’t so damn exhausted by parenting and by my own haphazard survival. I’d be lonely if I felt I had any real time for friendship. But no, I am instead drowning, drowning, drowning in what feels like a humiliating sea of self-pity. One I don’t talk about to my daughter beyond simply letting her know it’s a hard time for me. That I’m terribly sorry things are so messy and I’ll eventually get myself back on track. That she and I need to be kind and gentle with each other since this is a tough time on everyone."}, {"type": "sentence", "content": "Honestly, I’m lucky because my kid is a champ who’s really coping well with the past couple of months and I’m so grateful for her presence, even when it’s hard being a mom."}, {"type": "sentence", "content": "But that doesn’t erase the guilt I feel about the fact that I am struggling so deeply. I know that a tidy house would reduce my stress and hers. I know that weight loss would be a welcome shift right now. There are a million little healthy habits that I am positive could make my life better these days, yet I’m just hanging by one lone loose thread."}, {"type": "sentence", "content": "Over the past few months, I have frequently debated how much I should share about my current bout of depression. The longer I make my living by writing about my life experiences, the more guilty I feel about currently struggling."}, {"type": "sentence", "content": "It’s possible that other people don’t put these weights upon me. I have a strong sense that they are actually self-inflicted burdens. I feel as if I cannot be honest about my depression because I’m in a better financial place than I used to be. I feel like I’ll somehow only turn others off by talking about what’s really going on inside my head."}, {"type": "sentence", "content": "Regardless of anything people say about me, though, I am convinced that I’m a coward. I’m angry with myself for not knowing what to do with this depression. Angry that I haven’t found a way to use it for some good."}, {"type": "sentence", "content": "And most of all, I’m ashamed. I am so ashamed of myself for not making better choices. So ashamed for failing to turn this episode around. All in all, I’m ashamed that I struggle so much to be honest about the depth of my depression and just how ugly it’s gotten around my house."}, {"type": "sentence", "content": "There’s so much of my past that I’m willing to share. But there’s this piece deep inside of me that insists I keep my present to myself. I don’t want anyone to actually see my house filled to the brim with clutter. I don’t want anyone to see my current state in shambles."}, {"type": "sentence", "content": "I’m just not brave like some folks think."}, {"type": "sentence", "content": "I am scared and I am wounded. These deep flaws still etch their marks on me."}, {"type": "sentence", "content": "And there’s this voice, this child in me. She’s scared. She doesn’t know who can forgive her for being such a nightmare person. For being the sort of person who cannot juggle even the appearance of normalcy."}, {"type": "sentence", "content": "The girl is broken but she feels the full weight of it all being within her power to change."}, {"type": "sentence", "content": "The guilt is gripping."}, {"type": "sentence", "content": "I’ve debated so hard over sending out this stream of consciousness. I know it’s not the sort of writing most people want to hear. Worse yet, it’s so woefully incomplete. So, even if you wanted to hear about my current battle with depression, this is hardly an accurate snapshot of what that looks like."}, {"type": "sentence", "content": "It’s more like me taking a sheet of tracing paper and setting it on top of my life. I then take out a waxy crayon and rub it hastily across my existence, giving you the blurry shape of some things. The paper slips, my hand wobbles — none of this is perfect. None of this is honest, not really."}, {"type": "sentence", "content": "If I was truly, brutally honest, I would share actual snapshots with you. I’d be absolutely explicit about my struggles. Maybe I’d tell you how few showers I’m taking or what I ate yesterday. If this were really honest, I’d show you every single ugly and cringe-worthy side of me. But that’s not what you ever really get from me, is it?"}, {"type": "sentence", "content": "Instead, I give you shadows of the sadness and overwhelm. Far away descriptions of a dysfunctional day. For now, this seems to be the best that I can do. To tell you I am struggling. To be honest that I am at least seeking help and getting back into therapy. Remotely, of course."}, {"type": "sentence", "content": "My daughter and I still haven’t set foot inside a store since March 14. And we’re okay. Or, at least, she’s okay. If I want to keep it that way, though, I know it’s time to get more mental health help and quit white knuckling this whole thing."}, {"type": "sentence", "content": "I just want to be clear that I know."}, {"type": "sentence", "content": "My life is falling apart and I’m not making the right choices. None of that falls on anyone else but me."}], "topic": "mental-health"}