{"title": "The Implosion of the American Economy", "data": [{"type": "subtitle", "content": "How America Now Faces Economic Disaster Unprecedented in Modern History"}, {"type": "sentence", "content": "Let me put it plainly. There is an economic catastrophe unfolding in America. Let’s do a quick run through the latest numbers — which point to unprecedented disaster."}, {"type": "sentence", "content": "This week, another 2.4 million filed for unemployment. That brings the total since the beginning of the pandemic to about 40 million. That sounds like an absolutely colossal number, because it is."}, {"type": "sentence", "content": "To put in context, the American labour force is 165 million people. That means that 25 of the labour force is now unemployed. A full quarter of the economy is now out of work. What consequences do you think that has for political stability? For families, households, businesses? We’ll come to that — first, more numbers."}, {"type": "sentence", "content": "America’s working age population is about 245 million people. There are now just 125 million people employed. That means that the employment-population ratio has cratered about 50%. Just half of America is employed."}, {"type": "sentence", "content": "The question, of course, is what happens next. Are those jobs coming back? What happens if they don’t?"}, {"type": "sentence", "content": "I have some bad news, and I have some worse news. Those jobs aren’t coming back. At least not many of them. Just today, Stanford economists estimated only about half of the jobs lost so far are coming back. That — as most estimates by American economists prove to be — is wildly optimistic. The number will probably be far higher than that. How high? Up to perhaps 75%, I’d say. Why?"}, {"type": "sentence", "content": "Imagine for a moment that you’re the CEO of a mega-corporation. Suddenly, those consultants you hired to tell you what to do — which always amounts to cost-cutting and “synergies” — have a brilliant idea. You can make do with far, far fewer employees — hasn’t the pandemic proven that? Automate this, algorithmize that, leave those stores closed, deliver this stuff online. Bam! Your profit margin goes through the roof — by a whole percentage point or two. And because that’s all that Wall St cares about — which is how you keep your job, bonus, and stock options — you smile in happiness. You’re getting an extra big payout this year! Your shareholders — who are mostly computer programs operated by hedge funds — are going to love you for cutting labour costs by 25%, 50%, more."}, {"type": "sentence", "content": "Those jobs aren’t coming back, at the level of mega-corporate monopolies — which now make up altogether too much of the American economy, whether finance, food, or healthcare."}, {"type": "sentence", "content": "But the picture only gets bleaker the more that you think about it."}, {"type": "sentence", "content": "Now imagine you own a small or medium sized business. You’re not part of the rapacious machine of Wall St, mega-monopoly, predatory capitalism. You think of those dozen, hundred, five hundred people you employ as a family, and you’ve always tried to do your best by them. For you, business is somewhere between a moral calling and a social duty — and you’ve tried your hardest, your whole life, to keep this little extended family of enterprise prosperous and thriving. It’s been hard, it’s never been simple, but you managed. And now?"}, {"type": "sentence", "content": "The more the economy “reopens,” weirdly, the less customers seem to lighten your door. Before, you had two hundred customers a day. Now you have twenty. Before, you had twenty. Now, you have two. And you can’t figure out quite why. Isn’t the economy supposed to be open? Then where the devil is everyone?"}, {"type": "sentence", "content": "But because you don’t have the demand yourself, you have to begin cancelling orders. Your cancelled orders ripple down your supply chain. You hate to do it — you think of your suppliers as family, too. The people who baked or brewed for you, built and hammered for you. But what can you do? And before you know it — some of them are telling you they’re shutting their doors, and not reopening them. You weren’t the only one cancelling orders, it turned out. The further down the supply chain a business was, the more it was affected by an ongoing lack of demand."}, {"type": "sentence", "content": "That’s why — and here’s another number of ongoing American catastrophe — the Purchasing Managers’ Index, how much businesses are ordering to meet demand, fell through the floor, and never recovered."}, {"type": "sentence", "content": "That lack of demand just goes on and on. You can weather it for two weeks, dipping into your meagre savings. Another two, by taking your hat in hand, and asking that bank — who gets endless free money from the government — for a loan, just to keep those people who you think of as an extended family putting bread on the table. But by the end of the month — or maybe the next one — you’re out of options."}, {"type": "sentence", "content": "You have to begin laying people off. You start with 25%. But two weeks later, it’s 50%. Then it’s 90%. And after three months of this — you’re on the razor’s edge of bankruptcy yourself."}, {"type": "sentence", "content": "And as you enter the lawyer’s office, to sign the papers which put your life’s dream, passion, and vocation into liquidation, you realize. Demand had dried up because reopening the economy too soon had caused the virus to spread again, which had made people stay at home. The whole dismal strategy had backfired. And it had caused a wave of bankruptcies, just like yours — as the bottom fell out of the economy."}, {"type": "sentence", "content": "What demand there was now took place online. The big winners, it turned out, were Amazon, Google, Facebook, and so forth. But what kinds of economies did they really create?"}, {"type": "sentence", "content": "That brings to another number of ongoing American catastrophe. The bulk of job losses are concentrated in lower wage jobs. The jobs that are being lost are cashiers, waiters and waitresses, checkout clerks, administrators, and so forth — the invisible workers of the industrial economy. But just as big business is learning it can get along without them, so too small and medium sized business going bankrupt in a tidal wave is going to leave far, far fewer of those jobs at all. How many of those neighborhood cafes, bakeries, breweries, and so on are really coming back? But if they’re not, what about all their suppliers, and so forth."}, {"type": "sentence", "content": "The grim truth is this. A transformation has long been happening in the American labour market — and the pandemic is the final nail in its coffin. Yesterday’s good, decent, stable jobs — the ones with basic benefits like healthcare, retirement, pensions — are being replaced by fractured, fragmented, go-nowhere jobs. Economists call them “low-income service jobs.” And even those are changing. Yesterday’s small business owner might have had to work at Walmart, out of desperation. Today. tomorrow? He drives an Uber by day, delivers Instacarts by night, and then moonlights selling pallets on Amazon. He has no benefits. She has no protection. No stability, no rising income, no upwards mobility. No future."}, {"type": "sentence", "content": "That brings me to the long-term consequences of the economic catastrophe that Coronavirus has been allowed to turn into. It’s going to accelerate three great trends, which are each extinction events. Extinction event one: the middle and working class in America becoming one giant class of new poor, the 80% of people who live paycheck to paycheck, struggle to pay basic bills, die in debt, and will never retire. Extinction event two: small and medium sized business dying off as the spine of the economy, replaced with mega-corporations dominating every sector and industry. Extinction event three: American entrepreneurship and creativity slowly dying off, because, well, what reason do the mega-monopolies that now control almost everything have to really be entrepreneurial and or creative?"}, {"type": "sentence", "content": "As a result of all that, American living standards — already the lowest in the rich world — will fall off a cliff. Let me give you a simple example. America’s the only country in the rich world where fresh food is far, far more expensive than processed food — result, Americans are obese, unhealthy, and malnourished. That’s because, though, mega-corporations have come to dominate food itself, unlike, say, in most of Europe, where there’s still a baker, butcher, and cafe on every block, serving up fresh food, and because there are so many, competition keeps prices cheap. Extend that to everything, from finance to healthcare to media and so forth. Mega-monopolies charge Americans prices the rest of the rich world finds astonishing — for quality so low the rest of the poor world finds it astonishing. Result? Americans live effectively poor lives: living and dying in debt, consuming vastly lower quality everything than other rich countries, whether food, media, healthcare, finance, education, and so forth."}, {"type": "sentence", "content": "The ultimate effect of America’s ongoing economic catastrophe will be just that, because that is what an economic catastrophe is. People live poorer lives. Not just in terms of money, although certainly in terms of having less income and fewer assets. But also in terms of what money can buy. Money just can’t buy you certain things in much of America anymore. Good food? Decent healthcare? A good education? You can be rich — but these things are just unavailable, though if you’re European or Canadian, they’re in abundance."}, {"type": "sentence", "content": "That is because the American economy can’t supply these things to people anymore — at least enough of them. It exists now in a state of perpetual scarcity. Why else do Americans go without basics like decent healthcare, good food, working media, or even enough money? The shortages are there for a very simple reason: to make the rich richer. When things are in artificial shortage, you can charge people ever more for them, and a lower quality of them, too. Whether those things are apples and oranges, or incomes, retirements, savings, jobs, and futures."}, {"type": "sentence", "content": "The economic catastrophe unfolding in America today means that America is going to be a poorer nation — as in one with much lower than it’s already much lower than the rest of the rich world living standards — permanently, as in, forever. Those jobs aren’t coming back, and neither are those incomes, assets, savings, opportunities, chances, trajectories. As mega-business replaces small business, as the middle and working class become “low-income service workers,” aka servants all over again to the nouveau riche, as the last chances at entrepreneurship and making something of yourself wink out — what really goes to waste? Human potential."}, {"type": "sentence", "content": "There you are, desperately trying to make ends by driving that Uber today, delivering that Instacart tomorrow, selling junk on Amazon by night. What did you never become? The scientist who discovered the vaccine, the entrepreneur who set up those businesses, the artist who gave it all meaning, the author who chronicled it all. You were just a cog in a dying machine. And dying machines have to work their cogs ever harder, just to make generate the same power — burning them out faster, turning them to heat and dust quicker and more mercilessly. Potential goes to waste in dying machines. And that is what America’s economy now is — because for too long, nobody has cleaned the gunk from the wheels, rebuilt the engine, polished the chrome."}, {"type": "sentence", "content": "Even this is all needless: the government should have invested on a mass, unprecedented scale, just like the crisis. Banks get endless free money that magically just appears…by way of accounts at the central bank, the Fed — why don’t you enjoy the same privilege? The answer to that question is the American Idiot doesn’t know and doesn’t care about such things: he’s too busy drinking bleach. His jaw-dropping stupidity might have just doomed everyone else, too, in the end."}, {"type": "sentence", "content": "This is what the beginning of a Coronavirus Greater Depression looks like. I’ll see you on the breadlines, brother."}, {"type": "sentence", "content": "UmairMay 2020"}], "topic": "economy"}