{"title": "Dungeons and Dragons Made Me a Better Scrum Master", "data": [{"type": "image", "content": "https://miro.medium.com/max/10368/0*4d74FQbcXHeQYuLU"}, {"type": "sentence", "content": "If you draw a Venn diagram showing the sort of folk who become software developers and the stereotypical basement dwelling mouth breathers who play Dungeons and Dragons, you would probably expect a reasonable overlap, if only because in days of yore, these two callings were considered the realm of the nerd."}, {"type": "sentence", "content": "Nowadays, both are enjoying something of a renaissance. Writing code may not be cool in the traditional sense, but it is certainly trendy. And spurred along by its adoption into mainstream cultural landmarks such as Stranger Things, D&D has attracted hordes of new players who might have otherwise passed the hobby by. It was thanks to that particular show that my wife and I were asked by a couple of our friends about D&D in the same way that the uninitiated might tentatively ask about sex toys or drugs. I have learned since then that if you casually mention your hobby to “mundanes” (think muggles), they will often take you off to one side for a discrete conversation to ask how they get started, and would you mind running a short game some time to show them the ropes. So it was that I began running a regular game of Deadlands for a group of colleagues and their families, who were stuck indoors due to the Coronavirus lockdown. Thank Gygax for Roll20."}, {"type": "sentence", "content": "When I say D&D, I often mean the hobby rather than the specific game by Wizards of the Cost. There are many pen and paper RPG games, such as Dungeons and Dragons, Savage Worlds, Call of the Cthulhu, but D&D is the brand name most people have heard of."}, {"type": "subtitle", "content": "What has this got to do with Scrum Mastering?"}, {"type": "sentence", "content": "D&D and the many games it has inspired over the years are not often associated with the kind of interpersonal skills that one expects from a good team leader or scrum master. But it actually builds confidence in a way that few other hobbies can. As a scrum master, the big challenges I faced were never to do with Agile, but with people. Getting my team to express their opinion publicly is like wringing blood from a stone, leaving retrospectives and backlog refinement sessions a quiet affair. I would often feel like I’m the only one doing any talking, which would make me very self conscious. The exact same is true of being a GM (game master, while DM, or dungeon master usually refers specifically to D&D). Typically I will describe a scenario to players and hand over the reins, trying to illicit some kind of action or opinion from them. If they don’t immediately answer, a little voice in my head tells me that I screwed up, and I have the urge to say more; to correct my mistake by filling the silence with words. But just as with scrum mastering (I just noticed that both disciplines are referred to as masters), it sometimes pays to be silent. Given my penchant for summoning words from thin air, maybe the group are just waiting for an opportunity to talk."}, {"type": "sentence", "content": "Of course, I have tried that, and in both cases it doesn’t always work. My participants aren’t always used to the process. A mature development team, just like a seasoned group of players, knows what is permissable (i.e. everything) and understands that all opinions are valid. Sometimes it’s just that nobody wants to be the first to speak up."}, {"type": "sentence", "content": "This is especially true of new teams or new player groups. When an established group or team invites a new participant into the mix, there is an established pattern of behaviour that allows the newcomer to observe first and participate when they feel comfortable. But when the whole group is new, having never worked or played together before, then everyone is the newcomer. Everyone is in observer mode, and the pattern of acceptable behaviour is still a blank canvas. The scrum master, like the GM, has the greatest responsibility here, in ensuring that the participants feel comfortable enough to express themselves. Because both groups will rely greatly on communication."}, {"type": "sentence", "content": "Often I found that individuals were more willing to communicate. In a game of D&D, I often have one on one sessions with my players to help them build their character before a new campaign starts. This puts the player and their character at centre stage, but without a group audience. Providing that the player knows me well enough, they are usually forthcoming with the kind of ideas and interactions that make for a great game. I tried applying this to being a scrum master, introducing 1-on-1 sessions with my team to gather feedback or refine stories. This runs contrary to the open communication encouraged in Scrum, but served as a good starting point. It allowed me to understand my team better, and when we came to the next retrospective or backlog refinement session, I could stimulate the conversation with the seeds I had gathered from individuals."}, {"type": "sentence", "content": "That only covers the “nobody will talk” dynamic, though. What about the dominant player dynamic? Sometimes you have one particularly enthusiastic player who is happy to be centre stage, pushing all other players into supporting roles. This is not necessarily because the player is self centered or egotistical, but because they are engaging with the desired behaviour (to communicate) and others are not. The GM’s job is to recognise this and gently provide space for others to flower. This might be as simple as turning to a player and saying “what do you think?” or deliberately thrusting the character into the limelight — “the bartender approaches Balgar and says quietly ‘you look like someone who can handle himself in a fight — I need help dealing with a couple of troublemakers. Interested?’” This shifts focus, giving the player permission to take centre stage. Most players engage happily with this. Now think about a typical team meeting, such as a retro. You ask the whole room a question, and one person answers, because that one person has an opinion and is rightly engaging with the conversation. The same person seems to answer every question. But the goal is to engage everyone, to make every voice heard, not just one. Try asking an individual team member the same question and they probably have an opinion. By asking one person you give them the imperative to speak, whilst giving everyone else the imperative to listen."}, {"type": "subtitle", "content": "Getting Up to the Podium"}, {"type": "sentence", "content": "I’ve been a confident public speaker for some time, but not necessarily a good one. And like anything, you get better at public speaking the more you practice. Speaking to a group, even one as small as a typical adventuring party, requires clarity and confidence. It benefits from a measured pace, which is somewhat different to the rushed and haphazard rambling that I usually employ."}, {"type": "sentence", "content": "Being a scrum master is no different. When nervous, some of us tend to hurry with our words in an effort to get it over with. This isn’t great for our audience, especially for those who don’t share the same first language. Instead, let a point sink in and invite questions by inserting moments of silence. If you struggle with this, having a glass of water nearby can help, as it encourages you to sip regularly. Or take time to shift your gaze from one person to the next, gauging their reactions. In either case you will be resetting your pace each time you pause so that you don’t get carried away and rush through what you’re saying."}, {"type": "sentence", "content": "Just remember that if you want to engage your audience, you need to provide them room to speak. I didn’t do this for a long time, because I was nervous. When you ask a question, make eye contact. Make it clear that anyone can answer by looking everyone in the eye (not all at the same time) and waiting."}, {"type": "subtitle", "content": "Making It Up As You Go"}, {"type": "sentence", "content": "As a GM I frequently have to think on my feet but sound like I know what I’m talking about. In fact, running my weekly game of Savage Worlds a couple of years back really helped me when I was speaking at a regular development lecture at work. I’d be be up in front of a room of 20–30 developers who I didn’t know, having to write code while talking about it and dealing with problems that arose on the spot. I frequently felt like a fraud, even though the feedback I got from the sessions was nothing but praise."}, {"type": "sentence", "content": "The imposter syndrome also affected my games. Both disciplines require a certain amount of ad-libbing. Players frequently try to do things you weren’t expecting, and rather than lift back the curtain to show the empty space in your world, ruining the immersion, you have to think on your feet and put something there. Moreover, you have to make it sound like it was there all along. Savage Worlds makes this especially easy because it is quite rules light compared to D&D. If I need to throw in a bad guy, I don’t need to look it up in a rulebook, but can just make up stats as I need them. The players can’t tell the difference."}, {"type": "sentence", "content": "This happened so often that I found myself becoming better at the live coding lectures. The key, I find, is not to rush. It’s ok to pause and think for a few seconds. Sometimes that’s all you need."}, {"type": "sentence", "content": "Sometimes you know there is an answer, and you decide to go hunting for it while everyone waits. You’re in a hurry before everyone is watching and it feels like it’s taking forever to find it. Hell, I have this problem when I’m pair programming, which I often use as a teaching tool. As soon as I have to look something up I feel like I’m on a ticking clock, with my pairing partner judging me."}, {"type": "sentence", "content": "As a GM, instead of looking through the rulebook for something I don’t know, I often make up something on the spot and resolve to look it up later. This doesn’t work so well in a live coding exercise, because if you don’t know something, your code won’t compile and you’re blocked. But as a scrum master, it works great. Knowing when to say “let’s move on for now and get the answer later” is a key way to keep meetings moving, rather than getting bogged down in the detail. But it helps to know what you’re discussing beforehand, so that you can preemptively get answers to questions that will come up later. This works as a GM too because you usually have a rough idea of what is happening in each game session. If you think a car chase might happen this week then look up the rules beforehand, but don’t force the players to the car chase if they want to go elsewhere. As a scrum master, don’t force the conversation in one direction too much of the whole team is engaged in a different topic. It is important to keep the discussion on track, but there are times to just sit back and let the room decide."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "As usual, this doesn’t really have a conclusion, because I just write as I think. I guess if I was to pick anything I’d say that more scrum masters should run D&D. We’d have better scrum masters and more games to play."}], "topic": "leadership"}