{"title": "Can Harley Davidson Roar Back to the Future?", "data": [{"type": "subtitle", "content": "BUSINESS"}, {"type": "subtitle", "content": "A discussion about Harley Davidsons’ 1980s transformation that they may need to revisit to convince the millennial generation"}, {"type": "sentence", "content": "The heavyweight motorcycle industry leadership has changed hands a couple of times over the past 70 years. Competition, innovation, economic, social, and buyer behavior are some influencing factors."}, {"type": "sentence", "content": "Competition was and continues to be aggressive, as companies jostle for market share while continuously improving productivity through operational advancement and strategic marketing to gain an edge."}, {"type": "sentence", "content": "Product development and design are also commonplace, to counter potential market threats while reducing the time to launch new models."}, {"type": "sentence", "content": "There are five main players that dominate the heavy motorcycle industry:"}, {"type": "sentence", "content": "Prior to the influx of Japanese competitors, Harley Davidson enjoyed the position of being the world’s largest ‘heavy-motorcycle’ manufacturer."}, {"type": "sentence", "content": "The initial threat to Harley came in the late ‘50s when Honda entered the US market. By 1965 one of two motorcycles sold in the US was a Honda. From ‘65 to ‘73 a rise in demand meant that Honda grew by 33% percent."}, {"type": "sentence", "content": "This article will discuss events that brought Harley to the brink of bankruptcy and what they did to survive, as soon they might have to dust down this old manual."}, {"type": "subtitle", "content": "Strengths"}, {"type": "sentence", "content": "One unique benefit in the motorcycle industry is that owners are enthusiastic about the product and loyal to a brand. This means more influence among friends and family members improving retention, which equates to a higher percentage of second-time buyers."}, {"type": "sentence", "content": "Harley Davidson is particularly strong in this field with over a million registered members across the world. More than Honda and Yamaha."}, {"type": "sentence", "content": "Also, the company logo is synonymous with other US emblems such as the bald eagle and indeed the US flag itself. This allowed the company to build unrivaled brand loyalty among US consumers, in the early days in its largest market, the heavyweight motorcycle segment."}, {"type": "sentence", "content": "In the 50s, with few players in the heavyweight motorcycle sector, Harley easily led the segment. With little competition, Harley outsold the only other US player, the Indian, by a ratio of 2 to 1."}, {"type": "image", "content": "https://miro.medium.com/max/13440/0*hDXluaIfFRfG327f"}, {"type": "sentence", "content": "Every Harley Davidson motorcycle was hand-built by skilled craftsmen. Initially, the manufacturing process was the epitome of mass customization, more expensive, but the quality of the finished product was second to none."}, {"type": "sentence", "content": "Harley built brand appeal by highlighting the use of its cycles not only by the US military and highway patrolmen but also by the Hell’s Angels and Hollywood rebels like James Dean and Marlon Brando."}, {"type": "subtitle", "content": "Innovation"}, {"type": "sentence", "content": "Early innovation meant that Harley boasted components such as electric starters, balloon tyres, and a four-cylinder engine, ahead of its competition. This meant that by the mid-1950s the company was the undisputed market leader with over 60 percent market share."}, {"type": "sentence", "content": "The now-famous V-twin engine design meant that the motorcycle owners could service their own bikes, a factor that was important to consumers during times of economic downturn."}, {"type": "sentence", "content": "Political influence heavily favored Harley when the US president, Ronald Reagan, granted the company a five-year, self-liquidating tariff, in 1983. This gave the company breathing room to survive, protecting the brand from Japanese competitors in their core heavyweight market segment."}, {"type": "subtitle", "content": "Weakness"}, {"type": "sentence", "content": "Being the market leader in the heavy motorcycle market meant that the product offered by Harley was more expensive than its competitors’ motorcycles, brands that initially focused on different market segments."}, {"type": "sentence", "content": "This price differential further alienated the brand from non-Harley Davidson customers who opted for cheaper cycles available on the market."}, {"type": "image", "content": "https://miro.medium.com/max/16384/0*P4ie-LTuF2Mp3ck_"}, {"type": "subtitle", "content": "Cost"}, {"type": "sentence", "content": "The cost to produce a Harley was high, mostly due to the manufacturing processes deployed. Harley argued that every motorcycle was hand made by skilled workers, this in itself raised the quality."}, {"type": "sentence", "content": "In truth, their manufacturing processes were inefficient. This pushed up the retail price for consumers to purchase the much sought after cycle."}, {"type": "subtitle", "content": "Cash"}, {"type": "sentence", "content": "Harley’s operational processes required high levels of inventory during the build phase. This meant that capital was tied up in stock. Harley would not realize a return on this investment until a bike was sold. The average sales cycle was six months, further compounding the problem."}, {"type": "sentence", "content": "High inventory reduced working capital, a weakness that was magnified in comparison to the capital at the disposal of other manufacturers. Particularly the Japanese, pioneers of just-in-time and lean synchronization methods."}, {"type": "subtitle", "content": "Marketing"}, {"type": "sentence", "content": "In terms of marketing, the company had little or no presence in the female, sports, or young rider segments. Their absence allowed Japanese competitors to strengthen their brand by targeting these segments, positioning the likes of Honda as the segment leader."}, {"type": "sentence", "content": "Japanese manufacturers capitalized on this space. Their sales growth brought plenty of cash to expand. Soon they could make a play in Harleys’ core market segment, the heavy motorcycle arena."}, {"type": "subtitle", "content": "Opportunities"}, {"type": "sentence", "content": "Harley had little or no presence in the female, sports, and young rider segments. This presented an opportunity for Harley to grow its pool of customers across a wider demographic."}, {"type": "sentence", "content": "Through various marketing campaigns, Harley made steps to align the brand with consumer groups not typically associated with Harley riders. Also, they released a range of sporty motorcycle models like the V-Rod."}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*QdAHh0BR3UTV5eBL"}, {"type": "sentence", "content": "Sales of accessories to new and existing customers brought a significant revenue stream. Branded merchandise proved to be popular with customers and also non-customers."}, {"type": "sentence", "content": "Having successfully lobbied Ronald Reagan to impose tariffs on foreign competitors, Harley created a vulnerability for Japanese competitors. This political influence changed the playing field."}, {"type": "sentence", "content": "Emerging markets were another opportunity. The company could leverage off brand-heritage to penetrate new market segments with cycles that could offer unique USPs, such as the Harley brand."}, {"type": "sentence", "content": "Acquisition opportunities, for smaller motorcycle players, were actioned such as when Harley Davidson bought Buell."}, {"type": "subtitle", "content": "Threats"}, {"type": "sentence", "content": "The biggest threat for Harley is the continued aggression from competitors who want to grow their share of the heavy motorcycle market. Japanese competitors demonstrated their ability to enter this segment with the Goldwing."}, {"type": "sentence", "content": "Advances in competitor manufacturing techniques, if unmatched by Harley, will mean that the brand will struggle to compete on a cost or quality level, which happened in the 70s."}, {"type": "image", "content": "https://miro.medium.com/max/16384/0*wUZLPz52cnWUZ25L"}, {"type": "sentence", "content": "Should market forces cause the value of the company to drop, access to working capital will be challenging once again."}, {"type": "sentence", "content": "The Harley product is heavily reliant on a skilled workforce, necessitating the need for Harley to continuously invest in training and recruitment."}, {"type": "subtitle", "content": "Transformation"}, {"type": "sentence", "content": "To assess the transformation process that took place at Harley Davidson, it is helpful to draw reference from Kotter’s 8 steps of transformation."}, {"type": "sentence", "content": "When the new owner, a consortium, took over Harley in 1981 they inherited an insolvent business. On paper, Harley was bust, on the verge of bankruptcy."}, {"type": "sentence", "content": "In the years prior to the takeover, the previous owner, AMF, damaged the Harley brand. Operations were inefficient, and profitability and share-price had fallen dramatically."}, {"type": "sentence", "content": "The takeover was highly leveraged, cash was extremely tight so the company needed a quick turnaround to survive. The consortium was made up of senior managers, all Harley people, bikers who attended bike rallies at the weekend."}, {"type": "sentence", "content": "They had a strong emotional attachment to the brand."}, {"type": "sentence", "content": "As any highly leveraged buyout, they were exposed to extreme financial risk if the project failed. Everything bets were on black. As such, the company had a sense of urgency, a powerful guiding coalition that Kotter described as essential for a successful business transformation to succeed."}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*M-g0yeXrUU07O06T"}, {"type": "sentence", "content": "The former CEO Richard Teerlink said:"}, {"type": "sentence", "content": "The new owners developed a strategic vision for the company which reversed much of the direction that AMF had embarked upon."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "Harley followed Kotter’s eight-step change model to transform. The third step in Kotter’s eight-step change model is to develop a compelling vision for change. Harley embraced this ethos to realize a new strategic direction."}, {"type": "sentence", "content": "The core elements of the new strategy were:"}, {"type": "image", "content": "https://miro.medium.com/max/6000/0*mnwH5KTIh0aN4dEq"}, {"type": "sentence", "content": "Harley also adopted the following transformational steps:"}, {"type": "subtitle", "content": "The results"}, {"type": "sentence", "content": "Within one year, the results were clear for all to see:"}, {"type": "sentence", "content": "The new owners consolidated an empowerment culture under participative leadership. They also implemented a leadership institute that fostered a culture of continuous learning, personal development, and up-skilling."}, {"type": "sentence", "content": "The leadership team at Harley Davidson my need to dust down their transformational successes of the past to engage the millennial generation."}, {"type": "sentence", "content": "While the company continues to grow the Harley Owners Group, the next generation of riders is proving to be a hard nut to crack so Harley may soon embark on another transformational journey."}, {"type": "subtitle", "content": "References"}], "topic": "business"}