{"title": "A Whole New Level of Smart — Bright or Gifted?", "data": [{"type": "image", "content": "https://miro.medium.com/max/3830/1*D5qzFF5mcUMJ21RZm8t_1A.png"}, {"type": "sentence", "content": "I’ve been drifting towards the gifted subject for a while now. Mailny because the topic is something I come across in my filed of work a lot. I’m very interested in the development of gifted and special children. I even chose this subject (developing children with special needs) as my field of study when getting my master’s degree. While children with special needs get a lot of attention and support in the educational system, gifted kids are often overlooked."}, {"type": "sentence", "content": "My other reason for this interest is more personal. As every normal parent I want to see talents in my kids. And while no one ability stands out my kids seem to be super smart by nature. I’m not saying they are gifted but there’s definitely potential. They always seem to be thinking outside the box. So that got me to thinking – where do you draw the line between a bright child and a gifted learner?"}, {"type": "subtitle", "content": "Both bright and gifted kids are smart above average"}, {"type": "sentence", "content": "The main distinction between them is how they get their knowledge. According to Psychology Today a bright child knows the answers, but a gifted child asks more questions. And it’s not because gifted children don’t know the answers, it’s because they need to know more. They have this internal need to go deeper with every subject that interests them. For instance, when we go out for a walk or read a book with my three-year-old she has hundreds of different questions. But when I ask her a question for a change, she thinks about it and usually says “I don’t know” with more follow-up questions. She does know the answer, but she wants to know if there could be more than one answer to every question. That’s how she learns — she needs to go deep and thorough with every new subject."}, {"type": "sentence", "content": "Psychology Today says that bright kids are usually determined as great learners but they have to work hard to achieve this level. Gifted learners, much like their title, are gifted with intellectuality. They are smart by nature. Bright students need their teacher’s support in order to learn and achieve a certain level of knowledge. They are often led by praise and good grades. In fact, they enjoy school and interacting with their peers. Gifted students are driven by inner motivation — they just want to know more and everything form every aspect. They are mentally absorbed in interesting subjects and are mostly self-eductaing. They make their own connections of how our world works. They still need adult guidance, in fact they prefer adults or older kids to their peers."}, {"type": "subtitle", "content": "Some qualities of a gifted learner"}, {"type": "sentence", "content": "While every child is unique and every experience with a bright or a gifted learner is different, there are some traits that seem to stand out with a gifted one. Keep in mind that gifted learners are born with their gift so they will probably start standing out and advancing at a very young age. A gifted child could have several to many of these traits, and some that are not listed here."}, {"type": "sentence", "content": "Read more about these traits: We Have Kids or National Association for Gifted Children"}, {"type": "subtitle", "content": "Supporting a gifted learner"}, {"type": "sentence", "content": "Being gifted is in the genes. It can’t be learned or developed try as you might. If it’s not in a person since birth one can’t become gifted. But once you discover or reassure yourself that your child is indeed gifted, you have to give your best to develop this amazing trait. A child’s extraordinary abilities need to be recognised and developed further. Developing in this case doesn’t mean pushing towards academic success or learning dry facts. It’s about broadening the child’s mind and offering a variety of activities so they can grasp more information and experience things on their own. Simply put, let them think and explore outside the box."}, {"type": "sentence", "content": "When gifted learners ask questions, they don’t expect easy answers. Much like my toddler, a gifted learner needs explanations. And if your answer is not enough be ready for a lot of follow-up questions until the topic is completely researched. Some of these questions could be not age-appropriate but I’ve decided to answer these questions as honestly and understandably as I can, keeping her age in mind, of course."}, {"type": "sentence", "content": "Sometimes gifted learners get bored. There could be several reasons, for instance the subject is too easy or the concept is already known to them. In this case they need extra stimulation or new ideas to think about. It is very crucial not to ignore a gifted child. Because a mind that great will probably come up with some sort of new activity that stimulates it. It doesn’t matter if the activity is good or frowned upon as long as it’s interesting to them. That’s why some gifted kids are mistakenly called badly behaving. They misbehave because they are bored or not stimulated enough. Please keep in mind that not all gifted kids misbehave, and not all misbehaving kids are gifted."}, {"type": "sentence", "content": "Giftedness is something people are born with. Some kids are very smart but they have to work hard in order to learn new things and shine with knowledge. Gifted kids are born with their natural intelligence. They don’t need to learn facts or follow academic curriculum. All they need to do is explore freely and experience the world around them and somehow they grasp every new thing very quickly. But they also need support, explanations and guidance. They need teachers and parents to be patient with them as they achieve new heights in knowledge. Having a gifted child is a blessing and a challenge all in one."}], "topic": "education"}