{"title": "The Persuasive Language of Objects", "data": [{"type": "subtitle", "content": "3 ways to make a concrete impression in meetings"}, {"type": "image", "content": "https://miro.medium.com/max/4200/0*s8zV3dNlEnbJxf_8.jpeg"}, {"type": "sentence", "content": "What this story suggests is that, when it comes to speaking to the imagination, objects have better power of manifestation in the mind than mere words. They are effective weapons in terms of easily reaching people’s minds and having an impact on them."}, {"type": "sentence", "content": "The social psychologist Robert Cialdini relates this demonstrative power of objects to their ability to suggest associations of ideas, which direct the thoughts of our interlocutors without imposing conclusions on them."}, {"type": "sentence", "content": "If you have ever been in a meeting where your words lacked impact, either because your partners were inattentive to your words or because your words were not concrete enough, the evocation of objects can help you."}, {"type": "sentence", "content": "Let me explain to you the psychological effect of objects and 3 cases in which you can use objects to better convince."}, {"type": "subtitle", "content": "The Influence of Objects"}, {"type": "sentence", "content": "When we seek to impose the direction of our ideas, there is a natural tendency to rely on the power of words to reach minds."}, {"type": "sentence", "content": "We seek to persuade people with sound arguments, reasoning, and experiences based on evidence and real data."}, {"type": "sentence", "content": "While such an approach is effective in terms of communicating intent and information, it shows its limitations when it comes to making an impression on minds that is clear, memorable, and effective."}, {"type": "sentence", "content": "The problem with words is that they don’t easily make us feel things and reach our emotions, therefore unable to solicit commitments and actions."}, {"type": "sentence", "content": "Another method is what Robert Cialdini in his book Pre-suasion suggests as a technique to address minds by association."}, {"type": "sentence", "content": "The value of provoking associations of ideas in minds is to precondition them with images and emotions, indirectly influencing their thought flow and making them reach conclusions by themselves."}, {"type": "sentence", "content": "Cialdini refers, for example, to techniques playing on the first impression, linked to appearance, context, environment, or timing: by reminding a prospect of good times before asking him to decide in your favor, by making the meeting in a bright and open space to give more optimistic feelings…"}, {"type": "sentence", "content": "These techniques come together in that they use the materiality of objects or their evocation to move the mind towards associations favorable to our goals."}, {"type": "sentence", "content": "Object as such naturally fascinates us, spontaneously attracts the attention of our brain by its materiality, the curiosity, and lust we have for them- hence the sacred importance of relics, the feeling of possession of a book, a souvenir, a collector’s item, giving us the illusion of control over them."}, {"type": "sentence", "content": "By their presence, they express a symbolic language speaking directly to our emotions and very effective in pushing us into action."}, {"type": "sentence", "content": "Here are 3 ways to use these objects to influence minds in your daily business meetings just when you need them."}, {"type": "subtitle", "content": "Using References and Images to Illustrate Your Words"}, {"type": "sentence", "content": "In speeches to prospects or business partners, words can sometimes fail to make the information you bring clear on their own."}, {"type": "sentence", "content": "This is why in your presentations you generally use figures and diagrams to show the significance of your figures or the evidence of your arguments."}, {"type": "sentence", "content": "But sometimes simply referring to the concrete results of your studies, with specific examples that arouse the imagination, can be enough to make your words immediately simple and clear."}, {"type": "sentence", "content": "Do you want to show your client the worrying situation of their site traffic? Don’t just draw a downward curve, but also draw on the board the pictures of the customers they are losing."}, {"type": "sentence", "content": "Do you want to show that your company’s sales figures, although progressing a little less, are still encouraging? Don’t just draw a rising curve, but also picture the other discoveries and lessons you get from the period and you’ll get next year."}, {"type": "sentence", "content": "Do you want to express the importance of one product line over another? Increase the size of the images of this product in your slides, and decrease the size of the others."}, {"type": "subtitle", "content": "Presenting Objects To Raise Issues"}, {"type": "sentence", "content": "It may happen that in a meeting you have identified an issue that seems to be of some importance to you and you want to insist on these issues in front of your colleagues."}, {"type": "sentence", "content": "Language may then not be enough in terms of emphasizing the significance of certain situations, because it does not allow you to simply express the state of affairs, or because your colleagues are distracted by other issues and are not paying enough attention to your ideas."}, {"type": "sentence", "content": "Presenting an object as it is, for example through product demonstrations, the display of physical evidence, or even the intervention and testimony of individuals can make a real difference."}, {"type": "sentence", "content": "Do you want to stress the importance of changing suppliers to produce your cans? Demonstrate the effect that certain conditions have on these cans by damaging them or rendering them unusable."}, {"type": "sentence", "content": "Do you want the design and functionality of your product to stand up to the innovations of your competitors? Run your product live and show how your product is deficient compared to these other products."}, {"type": "sentence", "content": "Want to show how frustrated employees are with the amount of their salary? Let them talk in a meeting or collect money in 2 pots to compare what they earn with what they could earn."}, {"type": "subtitle", "content": "Sharing Material Evidence to Push for Action"}, {"type": "sentence", "content": "Sometimes even these demonstrations are not enough to make your intervention memorable in the minds of your interlocutors."}, {"type": "sentence", "content": "After the meeting, memory can quickly forget the significance of our speeches and actions, especially when the meeting took place a long time ago. To make your speech memorable in the long term, it is a question of playing on the possessive feeling linked to the object."}, {"type": "sentence", "content": "An object has all the more emotional effect the more we receive it, acquire it, or possess it."}, {"type": "sentence", "content": "Do you want to increase the loyalty of your workers and customers? Make and give them keyrings in the form of your brand, give them something they can take home with them, and that will be useful every day."}, {"type": "sentence", "content": "Do you want to remind your investors of the confidence and hope you have in your product? Deliver the product to them at home with a convincing letter."}, {"type": "sentence", "content": "The possibilities for expressing your feelings and ideas through objects are unlimited."}, {"type": "sentence", "content": "It’s up to you to invent a unique way to use the poetry of objects."}], "topic": "leadership"}