{"title": "The Covid-Cost of a Close Trade Relationship With China", "data": [{"type": "sentence", "content": "The Chinese Communist Party withheld critical data on Covid-19 human-to-human transmission: Two of China’s closest trading partners suffered most."}, {"type": "image", "content": "https://miro.medium.com/max/1880/1*JmDGepHEoEMsmt8XHkSq5Q.jpeg"}, {"type": "sentence", "content": "By its own admission, the Chinese government is taking heavy international criticism for its failures to provide accurate and timely information on the novel coronavirus to world governments and global health organizations."}, {"type": "sentence", "content": "Chinese officials had clear evidence of clusters caused by human-to-human transmission on January 14. Concealing this knowledge and denying the risk, officials of the Chinese Communist Party scaled-back Chinese exports of medical supplies like masks and gloves- and began importing them instead."}, {"type": "sentence", "content": "The Chinese government waited until January 20 to publicly confirm the risk of human-to-human transmission."}, {"type": "sentence", "content": "The virus originated in Wuhan, which was placed under lockdown with most travel in and out of the city halted by Jan. 31. On Jan. 26, however, the Mayor of Wuhan, Zhou Xianwang, revealed that over 5 million residents had fled Wuhan before the lockdown."}, {"type": "sentence", "content": "Wherever many of these early travelers from Wuhan went, they brought Covid-19 with them."}, {"type": "sentence", "content": "While the world’s scientific community doesn’t know as much as it should about how widely the outbreak spread within China- the Chinese Communist Party is still concealing the extent of the outbreak- there is a great deal of information about early outbreaks in other nations."}, {"type": "sentence", "content": "Seeded by travelers from China, Covid-19 hit two of China’s closest trading partners early and hard."}, {"type": "subtitle", "content": "Italy"}, {"type": "sentence", "content": "Italy was the first EU country to issue a flight ban halting flights from China and declare a national emergency due to two confirmed cases in Rome."}, {"type": "sentence", "content": "Several provinces in northern Italy were placed under lockdown on Mar. 8, extending to a nationwide lockdown the next day due to 9,172 confirmed cases of the virus."}, {"type": "sentence", "content": "Italy is part of the “One Belt, One Road” Initiative, which opened an array of Italy’s economic sectors to Chinese investment. From infrastructure to transportation, Chinese state-owned companies now hold a stake in four major Italian ports."}, {"type": "sentence", "content": "Fortune Magazine reports over 300,000 Chinese nationals living in Italy, and over 90 percent of them work in Italy’s garment industry. Many of these Chinese workers flew to China from Italy to celebrate Chinese New Year. They then returned to their jobs in Italy just before the flight ban was introduced."}, {"type": "sentence", "content": "In less than a month, Italy went from three cases of COVID-19 to the highest number of cases and deaths outside of China. Lombardy and Veneto, two of the richest, most dynamic and most export-intensive in Italy became the epicenter of the COVID-19 crisis in Italy."}, {"type": "sentence", "content": "Lombardy’s outsize role in the Italian economy pointed to the reason the government did not immediately implement a total shutdown in Lombardy."}, {"type": "sentence", "content": "Because the rate at which the Italian government dealt with the COVID-19 pandemic was inconsistent with the rapid spread of the virus, Italy’s selective approach at containing the spread of the virus by locking down the northern region allowed the virus to spread to southern regions where it was not perviously present."}, {"type": "sentence", "content": "Shortly after Italy was criticized for its handling of the virus, Iran also faced backlash for failing to effectively implement quarantine measures to prevent the spread of COVID-19."}, {"type": "subtitle", "content": "Iran"}, {"type": "sentence", "content": "The Iranian government banned its airlines from flying to and from China on Feb.1, excluding the airline Mahan Air, an unofficial airline for the Islamic Revolutionary Guard Corps."}, {"type": "sentence", "content": "The Wall Street Journal reported that Mahan air “had carried out eight flights between Tehran and China between Feb. 1 and Feb. 9 to transfer Chinese and Iranian passengers to their respective home countries,”."}, {"type": "sentence", "content": "This may explain why so many high-level Iranian officials have been infected by the virus."}, {"type": "sentence", "content": "On Feb. 19 Iran reported two Covid-19 deaths in Qom, a Muslim holy city to which thousands of pilgrims flock daily. Iranian officials were slow to react."}, {"type": "sentence", "content": "Even when Iran had reached 61 confirmed cases, Iranian deputy Health Minister Iraj Harirchi said that “With regard to quarantines- we are absolutely against them. Quarantines belong to pre-WWI –to the Plague, cholera, stuff like that.”"}, {"type": "sentence", "content": "During this time Iran’s Health Ministry reported the number of infections at 61 and the death toll at 12."}, {"type": "sentence", "content": "A lawmaker from Qom, Ahmad Amiriabadi Farahani, debunked these claims to the ILNA news agency, reporting that 50 people had died from the virus in Qom alone. Ahmad raised concerns that the government was lying about the scale of the outbreak and added “I have not seen any particular action to confront corona by the administration.”"}, {"type": "sentence", "content": "In early March, Iranian men videotaped themselves licking holy shrines in Qom, which had quickly become the epicenter of the outbreak in Iran. After the original videos went viral, more videos appeared on social media of worshipers licking and kissing shrines. Despite restrictions on who was allowed in and out of Qom, it had not been locked down during the crisis."}, {"type": "sentence", "content": "On Mar. 16, Iran closed three Shia pilgrimage sites until further notice: The holy shrines of Imam Reza in Mashhad; Fatima Masumeh in Qom; and Shah Abdol-Azim in Tehran."}, {"type": "sentence", "content": "The closures of these shrines was necessary for public health reasons, as the shrines continued to attract Muslim pilgrims who traditionally kiss the walls of the shrines where important religious figures are buried."}, {"type": "sentence", "content": "Iran’s failure to close down these pilgrimage sites early and restrict travel to the city of Qom resulted in significant spreading of the virus amongst the Shia Muslims population. Many of the recorded infections throughout the Gulf region are linked to travel to Iran for these sacred shrines, which prompted several countries to place restrictions on travel to and from the Islamic Republic."}, {"type": "sentence", "content": "On Mar. 12, Iran asked for a $5 billion loan from the International Monetary Fund, its first request since the country’s 1979 Islamic Revolution."}, {"type": "sentence", "content": "Dr. Amir A. Afkhami, an associate professor at George Washington University who studies Iran, says that this loan “speaks volumes to how dire the situation is getting and them realizing that it’s spun out of control.”"}, {"type": "sentence", "content": "The official number of infections reported in Iran as of Thursday is is 103,135 and the current death toll is 6,486, though these numbers aren’t considered reliable by experts."}, {"type": "sentence", "content": "The current number of infections as of Thursday in Italy is 214,457 and the death toll is 29,684."}, {"type": "sentence", "content": "(contributing writers, Allegra Nokaj and Brooke Bell)"}], "topic": "economy"}