{"title": "Designing inclusive products: How to make your digital products accessible", "data": [{"type": "sentence", "content": "Back in January, which seems like ages ago, I gave a talk at Ghent Inclusive Design Meetup about creating inclusive digital products. I talked about using native components to make your digital products more inclusive, because often come packed with a lot of accessibility features."}, {"type": "sentence", "content": "I’m not going to go in-depth on that, because I want to help you out making your custom components more inclusive. I’m going to focus mostly on iOS, but the principles are the same on Android."}, {"type": "subtitle", "content": "Make your digital products accessible"}, {"type": "subtitle", "content": "1. Use vector assets"}, {"type": "sentence", "content": "When scaling or zooming your interface some icons might also scale with the text. To keep them sharp and recognisable make sure that you use vector assets as much as possible."}, {"type": "sentence", "content": "On iOS you can use .pdf as vector asset, however, when your application is built, the .pdf file is automatically rendered as a .png so you will no longer be able to scale your image without quality loss."}, {"type": "sentence", "content": "You can easily fix this by turning on Preserve Vector Data in the image catalogue, this way your icon will stay sharp and scale nicely."}, {"type": "image", "content": "https://miro.medium.com/max/1296/1*QkxPe4wmg9ulsNSecg5MWg.png"}, {"type": "sentence", "content": "This might be useful when using a Large Content Viewer for example. This allows a user to hold down on an element and it will be displayed larger to make it easily readable."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*s7Qmv5iI85hkKyin3EABTw.gif"}, {"type": "subtitle", "content": "2. Implement accessibility labels"}, {"type": "sentence", "content": "While most of us navigate interfaces with our eyes, not everyone can do so. Voice over is a great way for people with impaired vision to interact with your product. Most of your interface will be read out correctly when you’re using the right labels and components."}, {"type": "sentence", "content": "But sometimes you might have a button with the very descriptive icon name “pencil-icon-24-homescreen-white”, this might be readable for a designer or developer, but not for screen readers. Your user will not know what to do with this button and will be lost. You can easily fix this by adding an accessibility label. It works just like an alt tag and will help the screen reader read it correctly to the user."}, {"type": "subtitle", "content": "3. Include high contrast colors"}, {"type": "sentence", "content": "You should always aim to get a good contrast ratio so all of your users can easily read and see your product. But some users might just need a bit more contrast. You can provide them with a higher contrast product without having to change your whole design."}, {"type": "sentence", "content": "Xcode works with an asset catalogue that manages colors and images, this catalogue also gives you some great built-in options. One example is high contrast colors, you can set an alternative appearance for colors that will only be displayed for users with the setting “Increase contrast” turned on."}, {"type": "image", "content": "https://miro.medium.com/max/1300/1*BGTP5wecuJUo20yUMkBUXg.png"}, {"type": "subtitle", "content": "4. Don’t truncate text"}, {"type": "sentence", "content": "If your goal is to make pixel-perfect designs, don’t. Once your design gets translated into code and get populated by real data, you often see that the design doesn’t work with real content."}, {"type": "sentence", "content": "You might have foreseen a “perfect” 10 letter name, but all of your actual users have long names that don’t even fit on one line. If you use a bigger font or your text size scales because of the user’s device preferences, you might only be able to see just a few letters. As a designer, you should already think about it and work out a design that would work for most cases."}, {"type": "sentence", "content": "By default labels on iOS are limited to 1 line, to prevent that you can set .numberOfLines to 0. This way the label can have as many lines as the content requires. When possible, try to avoid setting a fixed number of lines to prevent names or any other text to be truncated."}, {"type": "image", "content": "https://miro.medium.com/max/2312/1*Pg0M0rb_WeZbj9tQR0QwLw.png"}, {"type": "subtitle", "content": "5. Include colors for dark mode"}, {"type": "sentence", "content": "Similar to how you set high contrast colors, you can also set colors for dark mode. This is not only useful for when you’re looking at the interface in a dark environment, but it might also help users to see your content better because dark mode often has a higher color contrast."}, {"type": "sentence", "content": "You can do so by selecting the color in your Xcode asset catalogue and select “Any, Dark” next to appearances. Now you can set an alternative color for dark mode."}, {"type": "image", "content": "https://miro.medium.com/max/1296/1*Fc0nyWHdD8-4fr_62Pmw_Q.png"}, {"type": "sentence", "content": "The color will now automatically switch whenever the user turns on or off dark mode."}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*WlEe4WgOUuiQ0fSt4AukEw.gif"}, {"type": "subtitle", "content": "6. Bold fonts"}, {"type": "sentence", "content": "When choosing a typeface for your product, make sure you include a bold font weight. Even if you don’t use it in your design, adding a bold weight will make it possible to display your text bolder when the user has the option Bold fonts enabled."}, {"type": "subtitle", "content": "7. Reduce motion"}, {"type": "sentence", "content": "Animations can greatly improve the user experience of your product. But some users might suffer from motion sickness or have trouble focussing on the content being presented. You can help these users out and look for the Reduce Motion setting. You can slow down your animations or pause them all together. You can do this by choosing an exact frame to pause the animation on or you can set a marker in After Effects so you can reuse this for all components with different animations (example uses a Lottie)."}, {"type": "subtitle", "content": "8. Dynamic type"}, {"type": "sentence", "content": "Accessible typography is probably the most underrated aspect of digital products. While most people think accessibility is only for people with disabilities, they are wrong. Everyone will have reduced vision as they get older, so make sure the text of your product adapts to the preference of the user. According to SPDFKit over 25% of their users have a different text setting than the default text size. We often make changes to our products for less than half of that percentage. So why not make our text sizes dynamic."}, {"type": "sentence", "content": "It’s quite easy to do. You can go all out and define all text styles manually or you can use your current text styles and map them to one of the preferred text styles headline, body, caption, … These styles will define the scaling of the text, a headline will already be displayed quite large, so it doesn’t need to scale a lot to be readable. A caption is small and that will scale more because it will help the user by making it more readable."}, {"type": "subtitle", "content": "9. Review your product"}, {"type": "sentence", "content": "Even tough you now have some ideas to make your product more accessible, you might not know where to start. If you’ve been working on a project for a long time, it might be overwhelming to see where you should start improving."}, {"type": "sentence", "content": "The easiest thing you can do is go to your accessibility settings (Settings app > Accessibility) and play with the different options and see how it interacts with your app. This way you can identify what accessibility features you are not yet supporting."}, {"type": "sentence", "content": "If you want to have a more in-depth look into your product, connect your device to a Mac and open Accessibility Inspector. It should come installed with Xcode. When you open it you can select a connected device and you can start inspecting any app you have installed."}, {"type": "image", "content": "https://miro.medium.com/max/1812/1*4NKHHWeh352XE6OtPVwnXg.png"}, {"type": "sentence", "content": "You can go through your app with voice over or it will give you fix suggestions for elements on the screen. It will tell you for example when a hit area is too small, an element has no description (accessibility label) or you don’t yet support Dynamic Type."}, {"type": "sentence", "content": "When you click on the help icon you will get some more info on how you can fix this issue:"}, {"type": "image", "content": "https://miro.medium.com/max/1074/1*_Vnt7xZBCoq1f-8MdYujBw.png"}, {"type": "sentence", "content": "So go through your app write down a list of to-do’s and start small, you will not be able to fix everything at once. But with incremental updates, you can make your product more inclusive and easier to use for all users."}, {"type": "subtitle", "content": "10. Get data"}, {"type": "sentence", "content": "When you’re not sure where you should focus on when improving the accessibility of your application or you need to convince some stakeholders to put more focus on it. You can use analytics to see the device preferences of your actual users. As mentioned before in Dynamic Type, SPDFKit used analytics to see how many users preferred a different text size than the default."}, {"type": "sentence", "content": "Those numbers can be very useful, but text preferences aren’t the only preference you can track. You can access a number of accessibility elements to see what options your users prefer (always keep privacy in mind!)."}, {"type": "sentence", "content": "Here are a few examples of preferences you can read out and track to your analytics platform:"}, {"type": "sentence", "content": "Hopefully, I’ve inspired you to make your products more inclusive, so we can make the digital world a bit more accessible."}, {"type": "sentence", "content": "If you have any questions or more ideas, don’t hesitate to reach out!You can find me on twitter @nielsboey"}], "topic": "ux"}