{"title": "The Best Way to Develop Your Team Isn’t Feedback", "data": [{"type": "subtitle", "content": "Management"}, {"type": "subtitle", "content": "If you want to help your team improve their performance, feedback isn’t always the best way."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*Z_fB7kvz1Np_722KnNowQQ.jpeg"}, {"type": "sentence", "content": "Every leader wants to get the best performance from their team. In startups, the importance of learning on the job and continuous employee development can’t be overstated."}, {"type": "sentence", "content": "But how do you create an environment that helps people learn faster?"}, {"type": "sentence", "content": "For many years, I followed conventional wisdom, which says that the best way to help a team improve is by giving them plenty of feedback. I spent copious amounts of time learning how to give ‘good feedback’. I described specific situations, pointed to concrete behaviours, and explained their impacts from my perspective, all in a caring and professional way."}, {"type": "sentence", "content": "Sometimes, my feedback led to behavioural improvements. But other times, it didn’t. The results were patchy at best."}, {"type": "subtitle", "content": "What’s Up with Feedback?"}, {"type": "sentence", "content": "The term feedback has become so widely used that it’s now virtually a synonym for communication. However, it’s worth being specific about what feedback means:"}, {"type": "sentence", "content": "Feedback refers to someone’s reaction. Under this more precise definition, advice isn’t feedback. Asking questions isn’t feedback. And a conversation isn’t strictly feedback either."}, {"type": "sentence", "content": "This is an important distinction. The conventional wisdom suggests that managers should share their reactions about a teammate’s behaviours and performance to help them improve."}, {"type": "sentence", "content": "But is this the best thing managers can do?"}, {"type": "sentence", "content": "Sadly, neuroscience suggests it isn’t, particularly if the feedback is not positive."}, {"type": "sentence", "content": "When people receive feedback, they can instinctively interpret it as a threat, triggering a defensive response (also known as fight or flight). Scientists have discovered that once this response is active, learning is inhibited. In other words, constructive feedback may prevent people from learning."}, {"type": "sentence", "content": "Luckily, I stumbled on a way to improve learning that doesn’t rely completely on feedback."}, {"type": "subtitle", "content": "The Development Pipeline"}, {"type": "sentence", "content": "David Peterson is the Director of Executive Coaching & Leadership at Google. In an article published in the Evidence-Based Coaching Handbook, Peterson lays out a framework called the Development Pipeline, which captures the five ‘necessary and sufficient conditions for learning’:"}, {"type": "image", "content": "https://miro.medium.com/max/2190/1*wTpzhGf2wijeur9tG2AxKw.jpeg"}, {"type": "sentence", "content": "All five of these conditions need to be met for effective learning to take place. So, if you want to change behaviours, you have to ‘unblock’ the narrowest part of the pipeline."}, {"type": "sentence", "content": "Peterson realised that optimal learning is a constraint problem: unblock the constraint and increase the learning."}, {"type": "sentence", "content": "Let’s look at an example. Imagine a teammate who’s taking on too much work. They already understand that they need to delegate more to their team, but they’re concerned that they don’t have the time to delegate effectively."}, {"type": "sentence", "content": "In this scenario, the teammate has the insight, capability, and opportunity to delegate but they lack motivation and accountability. (We often say we don’t have time for things we aren’t motivated to do)."}, {"type": "sentence", "content": "You might think that feedback helps increase people’s insight and motivation in situations like this. But, according to Peterson, there might be a more powerful approach."}, {"type": "subtitle", "content": "How to Increase Insight and Motivation"}, {"type": "sentence", "content": "Peterson describes another framework that illustrates the information people need to increase their insight and motivation. It’s called GAPS:"}, {"type": "image", "content": "https://miro.medium.com/max/2056/1*-a1xduZGhfo3rzLnl7FrXQ.jpeg"}, {"type": "sentence", "content": "Feedback fits into the bottom left corner: perceptions. However, it’s not the only factor. It’s important to also clarify someone’s overarching goals and values, their beliefs about what they can and can’t do, and the factors determining success in their role."}, {"type": "sentence", "content": "Here, Peterson has a deep insight:"}, {"type": "sentence", "content": "This is a powerful reframe: leaders who want to maximise their team’s learning should replace ‘giving feedback’ with ‘having conversations about development’. In other words, less feedback, more coaching."}, {"type": "subtitle", "content": "How to Accelerate Your Team’s Development"}, {"type": "sentence", "content": "To be clear, I’m not saying you should stop giving feedback to your team. As I’ve written before, encouraging everyone in your company to give feedback has its benefits. However, one-on-one conversations about development can help you go deeper and increase your team’s learning beyond simple feedback."}, {"type": "sentence", "content": "Here’s how a development conversation might look:"}, {"type": "subtitle", "content": "Step 1: Hypothesise the constraint"}, {"type": "sentence", "content": "Where is your teammate in the development pipeline? Do they know what to develop next? Are they motivated to do so? Do they have the necessary capabilities and a chance to put them into practice?"}, {"type": "sentence", "content": "There may be multiple constraints. At this stage, you won’t know for sure. But forming a hypothesis will help you focus the conversation on the most productive questions."}, {"type": "subtitle", "content": "Step 2: Investigate and iterate"}, {"type": "sentence", "content": "As you know by now, I’m a fan of asking questions. To focus your curiosity in the service of your teammate, consider where they might be constrained in the pipeline and adjust your questions accordingly. Here are some examples of questions you might ask:"}, {"type": "image", "content": "https://miro.medium.com/max/2190/1*-ckKqGarLCdeI4abgQvcUQ.jpeg"}, {"type": "sentence", "content": "Your goal is not to improve your insight and motivation for them to change — it’s to help them find clarity. Remember, learning happens in their head, not yours."}, {"type": "subtitle", "content": "Step 3: Conclude with takeaways and a concrete next step"}, {"type": "sentence", "content": "During a conversation, your teammate might uncover new insights, capabilities, and motivation to develop. To finish, ask them to share their takeaways with you. Challenging them to say out loud what they’ve learned is a useful way to increase learning."}, {"type": "sentence", "content": "Ask them what they will do next. Insights are, sadly, fleeting so you need to clarify the next step as soon as they find clarity. The smaller and more concrete the step, the more likely it will be to happen. Once they have described it, ask them this question: ‘Would you like some extra accountability on that?’"}, {"type": "subtitle", "content": "Feedback vs. Coaching"}, {"type": "sentence", "content": "Next time you have the urge to give your team feedback, pause and reflect. Which would be more valuable for them — feedback or coaching?"}, {"type": "sentence", "content": "Using one-on-ones to coach your team in the areas most important to them is the biggest opportunity you have to accelerate their development. Take this chance to coach them — and the results will follow."}], "topic": "leadership"}