{"title": "Brain Dominance: Left vs Right", "data": [{"type": "subtitle", "content": "Are you like Sherlock Holmes or Vincent van Gogh?"}, {"type": "sentence", "content": "The concept of left/right brain theory is so popular that when you google it, you’ll get no less than a million hit. Books, YouTube videos, television programmes, online courses, quizzes, links to posts on social media, and even ‘experts’ claiming to identify your ‘dominant’ side. But this concept of left/right brain dominance is one of the several oldest myths of the brain."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*vFDju7_u6z5QDcUZRgKNFg.jpeg"}, {"type": "sentence", "content": "Weighing only 2% of the body weight, the brain is capable of astonishing feats — No other object in the known universe matches its complexity. The brain is divided into two halves, called hemispheres — the right and the left. They look indistinguishable, but they process information in totally separate ways as if they’re two different brains."}, {"type": "subtitle", "content": "The roots of the left/right brain theory"}, {"type": "sentence", "content": "According to the theory, each hemisphere of the brain control a specific type of thinking, and people favour one side over the other. The left side influences critical thinking, logic, reasoning, and objectivity, while the right said takes care of creativity, emotions, being artistic, and subjectivity."}, {"type": "sentence", "content": "The theory stemmed from the experiments conducted in the early ’50s by Roger W Sperry. To calm the electrical storm in the brain of those suffering from seizures, Sperry severed the connection between the two hemispheres of the brain."}, {"type": "subtitle", "content": "When the information expressway is quietened"}, {"type": "sentence", "content": "When the connection was cut between the left and right hemispheres, the person, while they appeared normal, behaved very differently, as if they’re two different persons in one body."}, {"type": "sentence", "content": "Also, they were unable to name objects when the image was processed on the right side of the brain. When processed on the left side, they were able to name the objects, but the visual comprehension was ineffective. This led to the conclusion that language was controlled by the left side of the brain and the spatial and visual comprehension is taken care of by the right side."}, {"type": "subtitle", "content": "Science debunks the myth"}, {"type": "sentence", "content": "Several warnings of over-interpretation were issued from the scientific community when Roger Sperry’s results were published. In fact, even Sperry had warned: “…it is important to remember that the two hemispheres in the normal intact brain tend regularly to function closely together as a unit.”"}, {"type": "sentence", "content": "Research now shows that although both sides of the brain function very differently, they are co-dependent and complement each other’s functions. Whether you’re thinking through a problem or being artistic, inputs from both sides of the brain are equally important. A study conducted by scientists at the University of Utah showed that while the neural activity was sometimes higher in certain brain regions, both sides contributed equally to a task."}, {"type": "subtitle", "content": "Bottom line"}, {"type": "sentence", "content": "Even though the left/right brain theory has been proved to be a myth, the buzz around it hasn’t settled and the theory is as popular as ever. It’s kind of become a law in its own right, as many are unaware that the theory is now obsolete."}, {"type": "sentence", "content": "Whether you’re reading articles or books or taking quizzes that promise to identify your brain dominance — the right-brained creativity or your left-brained reasoning, it is important to not take the results too seriously. After all, your personality or your interests don’t translate to you being right or left-brained."}], "topic": "neuroscience"}