{"title": "A Time Without Precedent is a Time to Innovate…Especially in the Classroom", "data": [{"type": "image", "content": "https://miro.medium.com/max/4644/1*DzWWEFs0pqyX93gE_C2eyQ.jpeg"}, {"type": "sentence", "content": "Teaching during quarantine has been a challenge for even the most seasoned educators. Unreliable access to tech for students. Unstable schedules. Trying to adapt classroom lessons to a digital landscape. In many cases, teachers have been thrust into the situation without adequate warning or preparation. But like teachers do, they square their shoulders, plant their feet, and take to the task at hand."}, {"type": "sentence", "content": "What many teachers are doing has never been done before. Digital learning in so many districts has previously been utilized as a band-aid to cover a small gap in learning due to a weather emergency without having to add days to the calendar. Lessons typically review previous material or offer skill drills. Perhaps there’s a flipped-classroom model here and there (but those depend heavily on the in-class time with the teacher to complement the lecture vods)."}, {"type": "sentence", "content": "Educators have been thrust into uncharted territory. And looking ahead to the horizon that is this fall, the territory beyond appears to be similarly unmapped."}, {"type": "sentence", "content": "So what can be done about the unknown pitfalls the lurk in this mysterious new world?"}, {"type": "sentence", "content": "Embrace them. Confront them. Dare them."}, {"type": "subtitle", "content": "Learning from the Past…Anticipating the Future"}, {"type": "sentence", "content": "It can be tempting to fall back on tried-and-tested methods from previous experiences with digital learning, when digital learning days were an occasional snack in the otherwise steady diet of regular classroom instruction. But snacks don’t make for a healthy, sustainable diet on their own."}, {"type": "sentence", "content": "No one has expectations for what the kind of full-scale digital learning schools have been thrust into should look like. Obviously we want to align with standards and best practices. Obviously we want it to be engaging and authentic and differentiated…but that can look like anything!"}, {"type": "sentence", "content": "The rise of Scantron sheets in the 70s altered the landscape of testing to prioritize multiple choice over written response or essay. And just because this has become a popular framework for testing doesn’t make it the best or the most appropriate. The number of tools and applications popping up now to address the needs of life in quarantine might well produce the next big “Scantron” change in the way public education operates. But that’s going to take time."}, {"type": "sentence", "content": "While we’re waiting on the concrete to set, it’s a perfect opportunity to get our hands dirty!"}, {"type": "subtitle", "content": "Stronger Together"}, {"type": "sentence", "content": "Communication becomes even more essential at times like this. Communicating with students to solicit feedback about what is and isn’t working, about what expectations they have. Communicating with families about how this new world is going to work, since it’s definitely not something they’re going to recognize (New Math, anyone?). Communicating with peers about what is and isn’t working, about what shortcuts and hacks are saving your life. And not just the peers in your building."}, {"type": "sentence", "content": "If your school hasn’t appointed a representative to communicate with other schools at other districts to coordinate ideas, consider becoming that person. Everyone isn’t using the same software or hardware, but the spirit of the work can translate to just about any platform. Consider how you can share your ideas organically with other educators outside your normal sphere of influence. Reddit threads? Blogs? Video diaries? Teachers Pay Teachers has been a useful resource for more traditional classroom content, but who’s to say where the next evolution of this platform for a more digital learning landscape will come from?"}, {"type": "sentence", "content": "If you can make student work visible and shareable (safely), consider doing that as well. Years ago, when I was working to make writing more authentic in my classes, I changed the way my freshmen students wrote their film analysis essays. The format was boring and dry and showed that they weren’t taking the work seriously, just going through the motions. So I had them examine film reviews from IMDB and Rotten Tomatoes, and students made Google Sites pages to share their writing, designed to look more like a film review than an analysis essay. They had to develop a rating system, mention (and link) actors to roles, credit source material for photos used."}, {"type": "sentence", "content": "And because the writing was posted online for their classmates (and the world!) to see, they wanted to make it look good. Students shared their tricks with each other for creative formatting and writing that would engage their peers. Those who finished earlier would act as mentors for the ones who still struggled. And students ended up creating some of the more engaging writing I had seen from them, writing I was excited to read because it didn’t sound canned or like “an assignment.”"}, {"type": "sentence", "content": "Students grow when they take the work seriously and treat it as real. If you tell your students that you’re going to be sharing their work with your friend one district over so they can show it to their students and do the same project, you’ll be surprised how big of a transformation in the end result you’ll see."}, {"type": "sentence", "content": "And just like students grow, educators also grow when the work has stakes. When they see what’s possible, it gives them license to dream big and take those risks."}, {"type": "sentence", "content": "And what could be more necessary now than dreaming big?"}, {"type": "sentence", "content": "I have always believed — and I continue to believe — that as educators, our best resources are each other. Please continue to share yourself with the world, even when that world feels unfamiliar and overwhelming."}, {"type": "sentence", "content": "If you have ideas or tools or information to share on how educators can support each other and their students during this time, please don’t hesitate to leave a comment down below and pass your knowledge on!"}], "topic": "education"}