{"title": "The Haunting World of the Mirrorverse", "data": [{"type": "subtitle", "content": "Three scientific mysteries which suggest a parallel world"}, {"type": "sentence", "content": "The simulation was a simple one. There were just 1,000 particles ambling about on the screen, living in their digital world governed by Newtonian physics. At their highest complexity the particles were spread away from one another as if curiously exploring the boundaries of their artificial landscape, perhaps hoping to find one of its sharp edges. They interacted under the guidance of gravity. Some of the particles would pull together into familiar clusters resembling galaxies or stars. The simulation was a representation of our universe; magnificent and complex celestial bodies were reduced down to just flat, smooth points on a screen. At their lowest complexity the points joined together to form a tightly-packed region not unlike the astoundingly dense state of the early universe."}, {"type": "sentence", "content": "The most interesting observation came at the moment of the simulation’s Big Bang: the particles were close together in one central crowded point, then they expanded outward along not one but two separate paths. They’d float away, cluster into planet systems and galaxy shapes. The points speckled the screen as a rudimentary but exciting representation of our real world. Except there weren’t two paths in the real world. There was only one…right?"}, {"type": "image", "content": "https://miro.medium.com/max/1700/1*GBhqRReu614ZTzKlAqZoRA.jpeg"}, {"type": "sentence", "content": "For the simulation’s Big Bang to have led to two separate paths implied that there had formed two separate universes, each a mirror of the other. The experiment was itself an attempt to better understand time — more specifically, it was an attempt to understand the arrow of time. Why do we experience life as unfolding in one direction and not any other? Events happen and we then create treasured memories of them, we do not first have the memories and then experience the event. The arrow of time is a persistent mystery in physics. None of the most famous laws like relativity or electrodynamics have any preference. They don’t care nor do they dictate in which direction time flows."}, {"type": "sentence", "content": "Up until now the most popular explanation for this phenomenon has been entropy. Time moves forward because the second law of thermodynamics requires that the universe be constantly in a state of greater and greater disorganization. This disorganization is called entropy. But that’s exactly what this 1,000 point simulation aimed to challenge. Instead of relying on fine-tuning parameters and entropy, the physicists behind the experiment showed that gravity alone could result in us perceiving a certain direction to time."}, {"type": "sentence", "content": "But it also showed that we aren’t the only observers. Time would be moving backwards on the second path (or what we would perceive as backwards, though to the observers in this universe time would be moving forward). This is the universe’s second future. A mirror world emerging from the same moment of birth as ours."}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*nbsh9CgZuTacn_atFUv4IQ.png"}, {"type": "sentence", "content": "The simulation, however, doesn’t incorporate quantum mechanics or relativity into the model. Its simplicity is both what makes it so appealing and what brings into question how accurate it could be. We may see two universes blossoming from the central state in the simulation, but does that mean it’s something that’s happened in the real world?"}, {"type": "sentence", "content": "The idea of a mirrorverse really began in the1950’s with the surprising results of the Wu experiment."}, {"type": "sentence", "content": "Physics has three kinds of symmetries. Reflection, rotation, and translation. The symmetry of reflection is also known as parity and comes in either left or right-handedness. Of the four fundamental forces of nature — electromagnetism, gravity, the strong nuclear force, and the weak nuclear force — only the weak nuclear force shows a break in parity. When particles interact at the quantum mechanical scale their interactions are more often left-handed so that the universe we live in has an overall preference for left-handedness. We are missing left-right symmetry."}, {"type": "sentence", "content": "This is similar to the problem of the arrow of time. We experience something in this universe which has no reason to be there. Just as there is no reason why time must move forward, there is no reason left-handedness would prevail over right-handedness. So to explain the break in parity the idea of the mirror world came into play."}, {"type": "sentence", "content": "It’s a straightforward solution. If there exists a mirror world just out of reach from ours, that universe would experience a preference for right-handedness and there would again be a balance to the bigger picture. The matter of this world is known as mirror matter. The mirror particles would be identical to ours — with identical forces — but would interact with our world only in the weakest and most fleeting way. Mirror matter would even produce light, but any interaction between the matter of that world and this world would be extremely difficult to detect. Over the years mirror matter has been brought up as a possible explanation for that all-too-present and yet ambiguous ghost we call dark matter."}, {"type": "sentence", "content": "Some scientists believe the slippery, finicky mirror matter is dark matter. We have such a difficult time understanding dark matter because the great bulk of it is hidden away in the mirror world where it manifests for our telescopes only by way of gravity. If this is true, it would mean the mirror world is 5 times larger than ours since there is 5 times as much dark matter as there is regular matter. Their cosmos would be not only elusive, but palatial."}, {"type": "sentence", "content": "Yet the most fascinating mystery pointing to a mirror world is that of neutron decay."}, {"type": "sentence", "content": "Neutrons are part of atomic nuclei. When they’re taken out of atomic nuclei these neutrons decay into protons, electrons, and antineutrinos. Since all neutrons are the same, they should all decay in the same way and in the same timespan. This is where the mystery comes in."}, {"type": "sentence", "content": "There were two experimental setups. The first was to see how long a beam of neutrons took to decay. This gave scientists a time of 14 mins and 48 seconds. The second setup involved placing the neutrons in a scientific bottle, resulting in a decay time of 14 mins and 38 seconds. A difference of 10 seconds. There was no reason for there to be any difference at all between how one neutron decayed versus another. No matter the setting, all neutrons should have become protons in the same amount of time."}, {"type": "image", "content": "https://miro.medium.com/max/2880/1*l01uXYH52eVVybVIkCbM6g.jpeg"}, {"type": "sentence", "content": "At first this was attributed to experimental error. There were any number of parameters that could have been wrong. Neutron beam intensity and the efficiency of the detector are just two. But the test has been repeated throughout the years, each time with refined tools and refined methods of observation. One of the most accurate measurements ever taken still showed around a 9 second difference between the beam and bottle neutron decays. If there is such a land as the mirrorverse, it could affect our observations of neutron decay by absorbing some of the particles from our world. Neutrons in the bottle experiment, for instance, would cross into the mirror world and become mirror matter. Because they are no longer detectable in our world it would then influence what we consider to be the neutron decay time."}, {"type": "sentence", "content": "The mirror realm would be an answer to many of our modern mysteries. It’s not a land where mirror versions of ourselves would be living mirrored lives, sleeping in copies of our houses and with copies of our family. Instead the mirrorverse is a sibling to our world. The reflected particles perhaps form homey large-scale structures. These planets and stars abide by a backwards notion of time, pinned to the sky of a spacious universe cut off from ours."}, {"type": "sentence", "content": "Our world, distorted. Under the microscope the particles of that world would even look like particles of Earth. And that is why the mirrorverse is haunting — we might be seeing traces of it bleeding into our cosmos, inexplicable by any normal means. Yet it remains unwilling to completely show itself or be touched by us. It lingers out there. Ghostly and familiar, close and yet impenetrable."}], "topic": "science"}