{"title": "4 Ways Reading Fiction Makes You More Charismatic", "data": [{"type": "subtitle", "content": "Successful, incredibly busy people still find time to read novels, and here’s why you should too."}, {"type": "sentence", "content": "When I was 17, I met one of the most charismatic people I can remember. He was the local director of the Red Cross organization where I was doing a one-month internship."}, {"type": "sentence", "content": "Not only was this guy brilliant and highly competent, but he was also funny, very approachable, amazingly confident. He had a huge aura and the whole team just loved him. Every word coming out of his mouth was incredibly impactful and everything he did seemed in perfect sync with our expectations. (And no, I wasn’t in love with him, but I must admit I was totally fascinated.)  One day he drove me and one of my colleagues to our local office. The minute I got in his car, something struck me: he had books lying all over the place. Next to his seat, on the floor, on the backseat."}, {"type": "sentence", "content": "I said something bland like ”wow, you like reading.” His eyes lit up and he replied: ”Yes, reading books every day got me where I am today. I read whenever I can, even if it’s only for 5 minutes”."}, {"type": "sentence", "content": "More than 20 years later, I can still remember his words."}, {"type": "sentence", "content": "Reading is not only a sure way to become smarter, it’s something that hugely impacts your personality, your charisma, and the way you influence people around you."}, {"type": "sentence", "content": "Here’s how:"}, {"type": "subtitle", "content": "1. The more you read, the greater the impact of your words."}, {"type": "sentence", "content": "It doesn’t matter if you read novels, short stories, children’s books, etc. Reading fiction of any kind makes your vocabulary richer."}, {"type": "sentence", "content": "You won’t learn a new word every day. But your brain will get used to dealing with a larger amount of concepts each day. As a result, when you engage in a conversation, you unconsciously use a wider range of words, more diverse concepts, stronger images. Your words are your everyday tools, and now you have more of them."}, {"type": "sentence", "content": "Sometimes when you meet someone, you only have time to speak a few words. Shouldn’t they reflect the best of your potential?"}, {"type": "sentence", "content": "Persian poet Hafez said:"}, {"type": "subtitle", "content": "2. The more you read, the greater your knowledge."}, {"type": "sentence", "content": "Again, it doesn’t matter what you read (of course, you get more benefits from reading quality fiction, or classic literature rather than some cheap novel, but every book has something to teach)."}, {"type": "sentence", "content": "As you read, your memory stores a certain amount of knowledge and information. Often, this information is not related to your interests or your profession. However, a HUGE amount of it will be useful at some point during your social interactions."}, {"type": "sentence", "content": "For example, I recently read a book of one of my favorite french novelists, Amélie Nothomb (she’s a fabulous writer by the way). I learned that according to the tradition, a Japanese doesn’t deserve to be called a true Japanese until they have climbed on top of the Mount Fuji at least once in their lifetime. Did you know this? I didn’t."}, {"type": "sentence", "content": "Is this useless information? Some people would say it is. But I disagree. It’s something I will definitely use in a conversation one of these days, and not necessarily with a Japanese person. (Doesn’t this make you wonder if other nations have similar beliefs? Have you ever wondered what it takes for a Canadian to be called a “true Canadian”?). Maybe one of my future clients is passionate about traveling and this small talk about Mount Fuji will help me connect with him."}, {"type": "sentence", "content": "One thing is for sure: charismatic people always have a ton of fun facts or interesting stories to tell, like they’ve lived a hundred lives!"}, {"type": "subtitle", "content": "3. The more you read, the more you can focus."}, {"type": "sentence", "content": "Focusing is a great skill, that most people struggle to improve. And reading is excellent training that doesn’t even require hard work! If you find the book you’re reading interesting, your brain will stay focused, and you won’t even notice it."}, {"type": "sentence", "content": "Remember the last fascinating book you read? You made no effort to concentrate on the words, you were deeply absorbed in it. It was 100% pleasure, while also being tremendously useful to train your concentration."}, {"type": "sentence", "content": "Reading is to your brain what physical training is to your body: the best way to be in great shape. And isn’t a sharp mind the most irresistible quality of a charismatic person?"}, {"type": "subtitle", "content": "4. The more you read, the more empathetic you become."}, {"type": "sentence", "content": "When you read, especially something captivating, you forget about your thoughts and you become a part of the story. You walk in the shoes of the narrator or the characters."}, {"type": "sentence", "content": "Even if you don’t identify completely with a character, a sort of ”emotional transfer” takes place, more or less intensely. The process of immersing yourself in different situations and imagining the character’s joys, adventures, emotional roller coasters, it all trains your mind to be more empathetic in real life. Being able to imagine what a person goes through is the basics of empathy."}, {"type": "sentence", "content": "People who have great charisma also have great empathy. They have the ability to make people around them feel understood, respected, and considered. The power of empathy is a fact. When you’re able to really listen to someone and suspend your disbelief, put your own views aside, really put yourself in the other person’s shoes, everyone will notice it. People love empathetic persons and they tend to trust them. This is why empathy is part of the magnetic power of charismatic people."}, {"type": "sentence", "content": "Of course, there are other ways to develop your charisma. But reading is one of the easiest (and most pleasant) because it helps you develop simultaneously:"}, {"type": "sentence", "content": "I encourage you to read fiction every day, even if you don’t have much time. I found that even 10 minutes read is better than nothing. To me, reading is like yoga: 10 minutes of practice every day brings more benefits than one hour once a week. So do you have a fascinating novel waiting for you on your nightstand right now?"}], "topic": "fiction"}