{"title": "The kaiseki approach to online learning", "data": [{"type": "subtitle", "content": "How microlearning helps you design online learning experiences"}, {"type": "image", "content": "https://miro.medium.com/max/8192/1*8VXxtRPIc4pnxBGf_kBC5g.jpeg"}, {"type": "sentence", "content": "A kaiseki meal is considered to be the finest meal in the world. It is a Japanese multi-course dinner, made up of small meticulously prepared and exquisitely looking dishes. Each small plate is in itself a masterpiece and the entire meal creates a memorable experience."}, {"type": "sentence", "content": "Can this work of culinary art teach us something about designing online learning experiences? Having worked with faculty for more than a decade, I know that content plays a central role in the course design process. That is why, especially when designing for the online environment, decisions related to content — from the amount to the structure and sequencing- are extremely important."}, {"type": "subtitle", "content": "Rethinking content for the online world"}, {"type": "sentence", "content": "The traditional course setup, with weekly lectures and seminars, creates a familiar routine that in itself answers many of the questions about how course content should be organised. At least so we like to think. The content students need to “absorb” is broken into the number of weeks a semester has, long presentations are prepared, reading lists and essay topics compiled. Even so, the two hour sessions often seem too short for everything we are convinced we need to cover. Sounds familiar? Then let’s move to the “online classroom” for a change of context with new challenges and opportunities."}, {"type": "sentence", "content": "Online courses are not bound by the traditional structure of face-to-face-courses. You can freely choose how you organise your content, how often and in which way you communicate with students. This may sound like a blessing but it takes a substantial amount of thinking as well as the willingness to experiment with different formats until you’ve found a suitable structure. Instead of a weekly two hours lecture you can, for, instance, post three short (10 minutes) videos with related tasks every two days and provide students with feedback. One thing you have to be mindful of is the amount of workload. We don’t need to overburden them with more work than we would do in a regular course to compensate for our absence. Try to find the right timing and pace to introduce new topics. Communicate with your students more than you would usually do. Communicate with your colleagues teaching at the same time to make sure your approaches are coherent for students."}, {"type": "sentence", "content": "One of the advantages of the online environment is that it can accommodate a variety of formats: text, images, video, instant chat, videoconferencing, social media, etc. To make the best use of this, try to revisit and redesign your learning materials. Take some time to think of your subject creatively and use more visual elements. Think of that one time when you had a brilliant idea but could not put it into practice because it simply would not work without technology- like having your students discuss with an expert from another continent over Twitter for instance."}, {"type": "sentence", "content": "The attention span when using technology is known to be rather short and this is something to consider when finding the best way to present your content. Even if the first instinct is to record lectures or use videoconferencing in an attempt to replicate the classroom dynamic, it often pays off to use asynchronous tools that allow students to connect with your content at a deeper level. You can find some suggestions for designing interactive online activities here. Just remember that students are now spending most of their time behind a screen (weren’t we complaining they did that anyway?) and you have to compete with other courses but also with different distractions for a slice of their attention. Make your content stand out, not through size or complexity but by being relevant, to the point, memorable and engaging."}, {"type": "subtitle", "content": "Microlearning: the kaiseki learning experience"}, {"type": "sentence", "content": "One approach that could provide some inspiration for the intimidating task of structuring your online course is microlearning. Pretty much like a kaiseki meal, microlearning essentially means delivering your content in small units, each one clearly targeting a specific learning objective, either knowledge or skill-related. Think of a microlearning unit as a 10 minute lesson, where you can use different media (text, video, images, links) to introduce students to a part of your course. Multimodality enhances the learning experience and the fact that students have to come back to the course for a short focused session every few days (spaced learning, in pedagogic speak) can lead to overall better learning outcomes."}, {"type": "sentence", "content": "Here are some important things to consider when designing for microlearning:"}, {"type": "sentence", "content": "Content is a key element of each course and the way it is structured and presented has a great impact on the learning experience. Moving into the online space gives us the opportunity to rethink our relation to the content of our courses. Just like in a kaiseki meal, let’s try to design an elegant looking and meaningful sequence of learning events that will give our students an unforgettable experience. It is not an easy task, quite on the contrary. It takes time, patience, a deep connection with your students and with your content. But the results will speak for themselves."}, {"type": "sentence", "content": "Thanks for reading! I am looking forward to reading your thoughts or suggestions in the comments below. For more insights, analysis and tips on (higher) education, online teaching and UX design, follow me on Twitter and/or sign up to my brand-new newsletter!"}, {"type": "sentence", "content": "Photo: CC BY 2.0 Nishimuraya Honkan"}], "topic": "education"}