{"title": "Deep Rock Galactic Review", "data": [{"type": "subtitle", "content": "The best game on the market for beard customisation"}, {"type": "sentence", "content": "Deep Rock Galactic is a co-op space dwarf mining simulator that speaks to my Welsh mining roots. Up to four dwarves shoot and pickaxe their way through procedurally-generated networks of caves and tunnels, seeking precious ore and mowing down swarms of bugs. Light is as important as ammo in this mine-’em-up, and with several different traversal options available between four different classes, this all adds up to a gameplay experience that will shake you to your core."}, {"type": "sentence", "content": "That’s not the best thing about this game, though. The best thing about this game is the overwhelming amount of facial hair options and combinations available. All other developers, take note: this game has set the bar for beard pride."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*AoD9T9y2atJYEYmgvAMTDg.jpeg"}, {"type": "sentence", "content": "Previously in development in Steam’s Early Access platform, Deep Rock Galactic is now a full product available for purchase where you can take control of one of four dwarf classes, each with their own individual strengths and weaknesses. You start as the Gunner, with immense stopping power and explosive capability at the expense of slower movement options (although you still get a very useful zip wire for navigating chasms). You can also choose from the grappling hook-toting Scout, the mining specialist Driller, or the Engineer, with his array of defensive structures and turrets. You begin with a questline where the game takes you through the different gameplay modes available, and from the start, your abilities and weapons feel like they make a very real impact, despite starting out with default gear and no perks. Unlike some co-op games where you’re only really effective at the max rank available, your contribution to the team matters from the first time you put pickaxe to rock."}, {"type": "sentence", "content": "The game pits many, many aliens against you, but that’s not the only enemy you face. The environment itself works against you, with earthquakes causing parts of the ground to rupture into fiery cracks. Poorly-lit areas could hide holes in the ground where you could end up falling to your death. Sand and snowstorms whip around and through you with fury, obscuring your vision and sometimes freezing you in place temporarily."}, {"type": "sentence", "content": "Procedural generation has become something of a cursed phrase with some games. People could read this term and infer a lack of gameplay, content or originality in the game that they play. This is not the case with Deep Rock Galactic, with varied biomes containing their own dangers and quirks. The tunnel network is fully destructible in a Red Faction-esque way that means you can tunnel your own bunkers, paths and pitfalls to navigate your own way through to your objective. The content is generated in such a way as to make the gameplay feel consistently tense and meaningful, and while the combat can eventually feel a bit samey after some time, levels can also contain modifiers that lower oxygen supplies or create low-gravity environments. The level design and environment is the star of the show in this game, and it is satisfying to navigate a safe path through the level, especially in sections where you are digging against the clock to get to the safety of your escape pod."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*DO4BXmY3yypyGpjJdFEJNA.jpeg"}, {"type": "sentence", "content": "The aliens themselves provide a throwback to Starship Troopers, where you have to face off against legions of bugs that crawl everywhere. The AI doesn’t just charge towards you — bugs can fly around from a distance, or clamber up and around you very quickly that looks very swarm-like and is an effective way of making you take notice of an impending horde. Abilities range from the standard bullet sponges to the tanky armored gigantic bugs with weakpoints. Some enemies can teleport. Some enemies can grab you and fly you away to a distant part of the map. Some can explode. Very occasionally, you can face off against an invulnerable ghost that will follow you for the entirety of the level, meaning you’re constantly watching your back in case you get a nasty, acid-filled surprise."}, {"type": "sentence", "content": "With all of this in place, it may feel like the game can quickly become unfair and too difficult, but the kit available to each dwarf is generous and effective. Weapons feel and look powerful, and more can be unlocked as the game progresses. Each weapon is customisable with skins, perks, and add-ons that can increase accuracy, power, or ammo capacity. Your equipment is as valuable as your weapon, here, and they too can be upgraded — you can make your flares last longer, or you could instead choose to increase your flare carrying capacity, for example. This all adds up to scenarios where you have many options at your disposal when trying to find an elusive cluster of ore. You could choose to directly tunnel your way to the core, or you could set up a network of wires to make your journey easier. You could mine out an area to fend off an army of bugs, or you could create a platform in a higher section of a cavern to gain some much-needed high ground."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*SC1RPqXpN0mQaD81JbxIWw.jpeg"}, {"type": "sentence", "content": "This means that each mission is a new challenge in exploration and shoot-’em-up gameplay that feels exciting and rewarding. This is helped along with some fun and appropriately-gruff dwarven voiceovers that speak to their allies and their robotic pals with rock-headed camaraderie, lead by an overseer-type that radios in from the HQ of the company you work for to ensure you’re not slacking off on the job. This is joined with a vast array of customisation options that puts AAA publishers to shame with the amount of stuff available without a sniff of microtransactions. You can change the look of your dwarf’s pickaxe, weapons, armour, hats, beards, and more. You can very quickly find the beard of your dreams and wear it with pint-sized pride."}, {"type": "sentence", "content": "The hub area of the game is also noteworthy for the level of detail afforded to the simple pleasures of messing about between missions. Dwarves like to drink, and so it follows that there is a bar where you can order a round of drinks for yourself and your allies. Some drinks have fun effects, or give you unique perks for the next time you go deep-diving into an asteroid. You can also try your luck at a barrel-kicking game, or you can dance to whatever’s playing in the jukebox. Winding down after half an hour of splatting insects acts as a nice contrast to the job you’re contractually obligated to do."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*Dhw5YxHlmehU6cevbeGGSA.jpeg"}, {"type": "sentence", "content": "Being a co-op game, the experience is truly enjoyed with a set of friends to mine with, but random groups can also work effectively with a ping system that ensures people can work together with ease. If you’re determined to enjoy an experience on your own, you are instead joined by Bosco, a robot that can mine, shoot or light up parts of the cavern at the whim of a button press, and is effective and useful in its own way. Endgame options exist as you eventually promote and train up your dwarves, with more options in the pipeline for cosmetics, gameplay options and enemy types. This game contains a treasure trove of content that is waiting to be tapped into, with more gold yet to be delivered from the depths."}, {"type": "sentence", "content": "At a price point of £24.99 for the base game, it’s hard to find many faults with the game. The graphical style is somewhat low-poly, which looks good in its own way but may put some players off who seek a GPU-punishing experience. Very occasional spikes in gameplay can render a particularly long mining run dead in the water in the space of a few moments. One time, my escape shuttle landed in a way where the escape was hidden behind a thick layer of rock, which I couldn’t mine away in time before the alien bugs turned me into a hairy soup. Unfortunately, the game has not completely mastered the art of controlling its procedural generation, and in rare moments you may end up with a challenge that either seems a little bit buggy (if you’ll pardon the pun) or simply unfair."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*abaPHW51uXRvYRP1w51u4g.jpeg"}, {"type": "sentence", "content": "If we’re looking for smaller gripes, then I would also say that the game’s wealth of content is a little hard to chew on when first starting up. You’re thrown into the hub area with a starting quest to begin mining with, but it’s not really explained how you promote your dwarf in order to tackle Deep Dive endgame content, nor is it sufficiently explained how you might unlock more weapons or perks for your character. It’s not too hard to eventually stumble upon this content for yourself, but it might be a source of mild frustration for some players newer to co-op shooters and their tropes."}, {"type": "sentence", "content": "These are relatively minor criticisms, though. The difficulty of knowing where to start is a blessing in disguise because the content on offer is so generous. It is crystal-clear that the developers have enjoyed creating this game, because it is bursting with charm and fun little touches that give Deep Rock Galactic its light-hearted space dwarf theme. More content and DLC has been promised, as well. The game is well worth its asking price alone, but if you ever find this game on offer for 20% or more, then you have struck gold. This is the best co-op shooter game since the time of Left 4 Dead 2."}], "topic": "gaming"}