{"title": "An Unexpected Gift from My Late Mother-In-Law", "data": [{"type": "subtitle", "content": "How bargain hunting and tragedy led us to a dreamy escape"}, {"type": "sentence", "content": "As the sun rose over our new continent, an olfactory cocktail of fresh baguettes, diesel car exhaust, and second-hand smoke tickled my nose hairs."}, {"type": "sentence", "content": "“This is what adventure must smell like in France,” I mused."}, {"type": "sentence", "content": "Exiting our budget hotel on a muggy August morning, my wife and I beckoned our troupe of four small boys to jump in line and off we marched into the heart of downtown Lyon, France."}, {"type": "sentence", "content": "Our destination on Day 1 of our new life in France had been established two years earlier on a bleak winter night."}, {"type": "sentence", "content": "The first week of January is typically one of the most depressing weeks of the year."}, {"type": "sentence", "content": "Who besides masochists could find this time of year enjoyable?"}, {"type": "subtitle", "content": "It turns out, my late mother-in-law."}, {"type": "sentence", "content": "Unbeknownst to me, the first week of January is also the best time to buy the junk shopkeepers were hoping to sell before the holidays but didn’t either because shoppers had been too cheap or too lazy. Hoping for the former, many shops kick off the new year with killer sales."}, {"type": "sentence", "content": "And of all the possible products you could buy, none are more deeply discounted than Christmas decorations and wall calendars."}, {"type": "sentence", "content": "I can state this authoritatively as my mother-in-law was a registered third-degree black belt in discount hunting."}, {"type": "sentence", "content": "She was the kind of woman who, bless her soul, wouldn’t hesitate to wake you at midnight just to let you know canned tuna was on sale."}, {"type": "sentence", "content": "She was also the type to drive thirty miles across town for a “bargain” that actually cost more than the regular price by the time a sane person would factor in travel time and gas money."}, {"type": "sentence", "content": "Thankfully for her children, she was insane when it came to deals. Not only was she a serial bargain hunter, but she’d then often drop off her catch to one of her children’s doorsteps, like a cat lovingly delivering its kill."}, {"type": "sentence", "content": "For over a decade, my mother-in-law had her own post-holiday tradition."}, {"type": "sentence", "content": "A woman of habit, she would drive to the local shopping mall the first week of January to buy her annual “365 Days Picture-A-Day Wall Calendar.” She alternated between Italy and France each year. 2013 had been France’s year."}, {"type": "sentence", "content": "Now, if you’ve never seen a “365 Days Picture-A-Day Wall Calendar,” they’re really quite a sight. Each month has one large image promoting a city or region that stretches across the top, followed by smaller images framed within each day of the month."}, {"type": "sentence", "content": "The 365 Days company promises “a dreamy escape at every glance.” This might be a bit of an exaggeration but they sure do beat a blank wall."}, {"type": "sentence", "content": "I honestly can’t recall any of the hundreds of dreamy escapes, save one small picture in February of 2013. The highlighted region that month was Lyon, France and somewhere down around the second or third week, there was a picture of a pristine pool, practically sitting on top of a river on the perfect summer day."}, {"type": "sentence", "content": "“If we ever visit Lyon on the perfect summer day…” I thought to myself while standing in my mother-in-law’s kitchen on that cold winter night."}, {"type": "sentence", "content": "Eight months later, she was tragically killed."}, {"type": "sentence", "content": "It was a normal Monday evening at home. Our four boys were fighting needlessly over toys as my wife Marisa tried to get dinner on the table when the phone rang."}, {"type": "sentence", "content": "It was her father, who rarely called."}, {"type": "sentence", "content": "She picked up the phone."}, {"type": "sentence", "content": "Three seconds later I knew something was horribly wrong."}, {"type": "sentence", "content": "On weeknights, Marisa’s mother would go out for an evening walk with a best friend. They would walk and talk for miles, burning off both calories and steam accumulated during the day."}, {"type": "sentence", "content": "This particular night was no different than the hundreds of previous nights. Being a woman of habit, the walking route had been the same, the conversation had been similar. As they approached a particularly busy crosswalk, my mother-in-law offhandedly remarked what she always said at this point."}, {"type": "sentence", "content": "Little did she know how tragically true her statement would be that night."}, {"type": "sentence", "content": "“It was an auto-pedestrian accident,” my father-in-law continued numbly on the other end of the line. “The paramedics said she didn’t feel a thing.”"}, {"type": "sentence", "content": "Nothing makes you feel quite as helpless as watching the person you love most crumble under unimaginable despair."}, {"type": "sentence", "content": "There would be no more 365 Days Picture-A-Day Wall Calendars, no late-night calls about tuna or unannounced visits bearing bargain gifts. These and a million other annoying and endearing habits of my mother-in-law had instantaneously vanished into thin air."}, {"type": "sentence", "content": "“She hadn’t felt a thing,” they said."}, {"type": "sentence", "content": "If only we could say the same."}, {"type": "sentence", "content": "Marching through the streets of Lyon, it was obvious we were an anomaly."}, {"type": "sentence", "content": "Almost every pedestrian we passed stopped to watch us as if we were a circus parade."}, {"type": "sentence", "content": "It was only later that I learned the French don’t walk around in swimming attire or workout attire or any other informal attire unless they’re formally doing the associated informal activity."}, {"type": "sentence", "content": "Case in point, once I dropped my children off at our French village school in my sweatpants, only to have one of the parents stop and inquire whether I was going for a run."}, {"type": "sentence", "content": "“No, I’m just American,” seemed like a stupid answer at the time, so I lied and pretended I was indeed headed out for a jog."}, {"type": "sentence", "content": "It was the last time my children allowed me to drop them off in pajamas."}, {"type": "sentence", "content": "Undeterred by the stares of Franco strangers, we pressed on through the picturesque tree-lined streets of Lyon, triumphantly arriving at the Centre Nautique Tony Bertrand 20 minutes later."}, {"type": "sentence", "content": "I was pleased to see that the people at 365 Days Picture-A-Day Wall Calendar Company hadn’t lied. Everywhere we looked, it was a dreamy escape."}, {"type": "sentence", "content": "The pool is built alongside the Rhône, one of Lyon’s two famous rivers, with four enormous white pillars shooting up from the poolside towards the sky, each topped with a giant flag flapping effortlessly in the summer breeze."}, {"type": "sentence", "content": "Across the river are sweeping views of Lyon’s most distinguished neighborhoods, including its old town which is guarded over by Lyon’s most famous Fourviere basilica on the hillside."}, {"type": "sentence", "content": "Looking out on the scene, it was impossible to forget who had brought us here."}, {"type": "sentence", "content": "Without my mother-in-law’s quirky bargain-hunting habits, we never would have known about this place."}, {"type": "sentence", "content": "Even in death and across oceans, she was still delivering gifts to our doorstep."}], "topic": "travel"}