{"title": "The Coffee Hut app — a UX case study", "data": [{"type": "subtitle", "content": "I decided to set myself another practice UX project. Like before, this project is totally fictional but I’ve approached it as if it were a real project."}, {"type": "sentence", "content": "Brief: Design an application for Coffee Hut’ customers to click and collect their hot drink order."}, {"type": "sentence", "content": "Operating for over 30 years, family is at the heart of everything Coffee Hut does. Looking at new ways to move the company forward, the owner of Coffee Hut wants to launch a click and collect service at her coffee shop. Although footfall is strong, she feels having this option where customers can order ahead of time and collect, will encourage more people to use her local coffee shop over competitors."}, {"type": "sentence", "content": "The Coffee Hut is a small stall based in the business district of Bristol. The majority of its customers are people travelling to work and offices within the city and the most popular hours are through the morning rush (6am-10am)."}, {"type": "sentence", "content": "The most important thing for the new app design is the ‘Click and Collect’ feature. I’ve been told by the client that this must be at the feature point of the app so that customers can find it easily."}, {"type": "sentence", "content": "The client wants the app to:"}, {"type": "subtitle", "content": "Interview the client"}, {"type": "sentence", "content": "It’s vital to get more information from the client so that you can get more insight into their aims of the app and what it is from a business perspective that they hope to achieve."}, {"type": "subtitle", "content": "Questions:"}, {"type": "sentence", "content": "What are the goals for creating this app?"}, {"type": "sentence", "content": "Why are you creating this app and not just sticking to face to face shop orders?"}, {"type": "sentence", "content": "How will we know that this app is successful?"}, {"type": "sentence", "content": "Who will be the users of your app?"}, {"type": "sentence", "content": "Why would your customers use this app? What problem will be solved by having this app?"}, {"type": "sentence", "content": "With this information to hand, I can now start researching and thinking about the strategy documentation. First up a persona."}, {"type": "subtitle", "content": "Persona"}, {"type": "sentence", "content": "For this project, I thought it would be good practice to create a persona for Coffee Hut. A persona is great for getting to know the type of user that would use the app, as well as their interests and likes/dislikes, technology use etc. Below is the persona I created for the coffee app:"}, {"type": "image", "content": "https://miro.medium.com/max/4172/1*oEyOcvaJv9CpcFS_iAM3Yw.png"}, {"type": "sentence", "content": "Next I need to work out the business and user goals. To help me with this, I use observational research by observing people as they order a coffee on an app. Please note due to the current virus situation, I was unable to carry out observational research but here’s what I would have done. I chose to research middle aged people, who commute into work and enjoy takeaway coffee. They need to be comfortable with using a smartphone and using apps. They will also need to be keen on using an online ordering system, instead of the usual walk in and order method."}, {"type": "sentence", "content": "The research that could be carried out could include observing a selection of users as they commute into work and order a coffee on an app to collect on the way to their place of work. To help me with my research I use an Empathy Map:"}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*VAshNWU_I6jsbJk2cCmryQ.jpeg"}, {"type": "subtitle", "content": "Business Goals:"}, {"type": "subtitle", "content": "User Goals:"}, {"type": "subtitle", "content": "Archetypes:"}, {"type": "subtitle", "content": "Why do they use the product?"}, {"type": "sentence", "content": "To make it quick, easy and convenient to purchase a coffee and skip the queue."}, {"type": "subtitle", "content": "Behaviours and environments?"}, {"type": "sentence", "content": "Busy morning commute to work. Travelling on public transport or walking on foot."}, {"type": "subtitle", "content": "Goals, needs and motivations?"}, {"type": "sentence", "content": "Avoid waiting and queueing by purchasing coffee via the app and collecting with minimal effort."}, {"type": "sentence", "content": "The user is a busy commuter who wants to order a coffee to collect with minimal effort on their way into work."}, {"type": "sentence", "content": "I’m now starting to get a clearer understanding of what it is that the app needs to do and how the experience can be shaped for the user. I find that it’s extremely important that the app is responsive and most importantly performs well on a mobile device, as this seems to be the device of choice for commuters. The UI also needs to be simple and clean with a straightforward user journey. Commuters often have lots of distractions around them. Some may even be stood up, especially if the bus or train is cramped and busy. When using an app to order there needs to be as few steps as possible in order for the user to reach their end goal."}, {"type": "subtitle", "content": "Storyboard"}, {"type": "sentence", "content": "My next task is to storyboard, making sure that I focus on the users actions and environment. Here’s the storyboard I came up with."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*vgOY4pGHgVIZIjWopwVZ-Q.jpeg"}, {"type": "subtitle", "content": "User Journey"}, {"type": "sentence", "content": "Next I start to map out the user journey. This provides a great insight into the steps that your app should have. It’s handy to do this before wireframing because you can start understanding what it is that your app should do and how the user is likely to use it. I also map out the users emotions to understand how the user may feel at each point of the journey."}, {"type": "image", "content": "https://miro.medium.com/max/3772/1*OfxJ7E8X_S2uJwapLp2Ksw.png"}, {"type": "subtitle", "content": "Scenario"}, {"type": "sentence", "content": "The scenario goes hand in hand with the user journey. This allows me to map out any problems or scenarios that the user may come across when using the app and the suggested solutions to those problems. This is really important as I can take these scenarios and shape the wireframes around them. It’s always a good idea to think of these things before thinking about any app design or functionality."}, {"type": "image", "content": "https://miro.medium.com/max/3892/1*NSn32nKSyWwcQgg0Jgyagw.png"}, {"type": "subtitle", "content": "Wireframing"}, {"type": "sentence", "content": "Now that I have the storyboarding and user journey complete, I can now start to think about how the app can function for the user."}, {"type": "subtitle", "content": "1. COMPONENTS (Below):"}, {"type": "sentence", "content": "First I wireframed some of the components, looking at individual atoms and molecules."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*hLVzfj0K0P1p__SzK7hPPQ.jpeg"}, {"type": "subtitle", "content": "2. LARGE SCREEN (Below):"}, {"type": "sentence", "content": "Next I moved onto wireframing the landing page and the click and collect page for large screens."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*VBic5s701mvKHTPuDFX2zQ.jpeg"}, {"type": "sentence", "content": "When thinking about layout, I wanted the click and collect button to be nice and big and take prime position on the page. The client really wants focus on the click and collect feature and to make sure that her customers know where to go, so this is a way of achieving that. Open hours and location was also important to the client, so I’ve placed these just below the click and collect button on the landing page, so that this information is nice and clear to the user."}, {"type": "sentence", "content": "On the click and collect page, I’ve made sure that the process of ordering a drink is as simple as it can be with very little steps and inputs to fill in. There is a large ‘Place Order’ button at the bottom of the form. When choosing this layout I had the my persona in mind, thinking about them ordering a drink on a busy commute, so the form is designed to be easy and clear to use."}, {"type": "subtitle", "content": "3. MEDIUM SCREEN (Below):"}, {"type": "sentence", "content": "Next I moved onto wireframing for medium screens. The landing page layout doesn’t differ from large screens but the click and collect form field inputs are now on top of each other. Again the click and collect button is central to the page with open hours and location information prime position."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*jXi2m15NL4c5KdglhQ6C8g.jpeg"}, {"type": "subtitle", "content": "4. SMALL SCREEN (Below):"}, {"type": "sentence", "content": "The final step was wireframing for small screens. Similar to the medium layout, the click and collect form fields for small screens are now stacked on top of each other to avoid it looking cramped. The elements on the landing page are also stacked on top of each other. Again a nice big click and collect button on the landing page so that the user can go to the ordering form with just one single click and the open hours are nice and clear to the user."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*w123oy8_9-XbUwOVb1vZBQ.jpeg"}, {"type": "subtitle", "content": "Prototyping"}, {"type": "sentence", "content": "Now that I had wireframing done, the next step was to move onto prototyping. As with my previous practice project, for this I used a Low Fidelity prototype on paper. I move onto more High Fidelity prototypes later."}, {"type": "subtitle", "content": "1. LARGE SCREEN LANDING PAGE (Below):"}, {"type": "sentence", "content": "This is the landing page prototype for large screens. Keeping to my wireframing layout, I have the click and collect button in the centre overlapping the hero image. I also have the open hours and location below that button, as this is very important to the client. Prototyping allowed me to see how much excess space I had, so within this space, I’ve created a section that promotes the coffee that Coffee Hut uses. I thought this was a nice touch and is a selling point to many coffee lovers."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*Wr0meVjdzW-INS5cT5cV0Q.jpeg"}, {"type": "subtitle", "content": "2. LARGE SCREEN CLICK & COLLECT (Below):"}, {"type": "sentence", "content": "Here is the prototype for the ‘Click & Collect’ page. Here I have a heading stating ‘Click & Collect’ and I have a very simple order form. I’ve kept it as simple as possible, as I don’t want users to be overwhelmed which could result in them abandoning the user journey."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*kC-rOWkPNWFuxqtU96OMKw.jpeg"}, {"type": "subtitle", "content": "3. LARGE SCREEN ORDER SUCCESS (Below):"}, {"type": "sentence", "content": "I thought it would be good to prototype how the order success screen of the click and collect order will look. Here I have kept it very simple for the user, stating their order number, chosen collection time and the address of Coffee Hut with a map, so that they know where to go. Here I have thought about new Coffee Hut customers who may not be entirely sure where to go."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*lTC2ZHC0NNQa3v4J6WpwIA.jpeg"}, {"type": "subtitle", "content": "4. MEDIUM SCREEN LANDING PAGE & ‘CLICK & COLLECT’ (Below):"}, {"type": "sentence", "content": "My medium screen prototype is similar to large screen particularly on the landing page. However, on the ‘Click & Collect’ page the field inputs are now stacked as putting them side by side would make the UI look cramped."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*uImhuYg6QOIczD_a_vWlsQ.png"}, {"type": "subtitle", "content": "5. SMALL SCREEN LANDING PAGE (Below):"}, {"type": "sentence", "content": "Next, I move onto small screens. Here I’ve kept the content the same but it’s now stacked on top of each other to avoid it looking cramped. I have also replaced the nav bar with a burger menu, you can see how it looks when clicked on below."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*lSS4rcZfYj_N_p5tYydxfg.jpeg"}, {"type": "subtitle", "content": "6. SMALL SCREEN CLICK & COLLECT (Below):"}, {"type": "sentence", "content": "Again for the ‘Click & Collect’ page I’ve stacked the form fields on top of each other. Putting them side by side would have made the UI looked cramped and I want to keep enough white space to make it look easy on the eye for the user. There is still a big ‘Place Order’ button at the bottom."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*2ysWdWilcL3GODNz-YxEgQ.jpeg"}, {"type": "subtitle", "content": "7. SMALL SCREEN ORDER SUCCESS (Below):"}, {"type": "sentence", "content": "With the same content as large screen but for smaller screens, the map is at the bottom of the element instead of at the side. There is also a ‘Home’ button to take them back to the landing page if the user wishes."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*KoSESnFb6xr-K_G8uK89nA.jpeg"}, {"type": "subtitle", "content": "8. SMALL SCREEN BURGER MENU (Below):"}, {"type": "sentence", "content": "In this prototype I map out what the burger menu will look like when the user clicks on it. Just a nice simple drop down menu with the three items. The menu is at the top as this takes priority."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*X5oxEoDEjhpY5rTJXHgMEQ.jpeg"}, {"type": "sentence", "content": "After prototyping on paper, I decided to look at more digital designs and how I see the app being developed moving forward. Below are my digital designs I’ve made for the Coffee Hut app."}, {"type": "subtitle", "content": "LARGE SCREEN LANDING PAGE (Below)"}, {"type": "sentence", "content": "Here I’ve made the click and collect button the centre piece. On the button there is an arrow icon indicating to the user that clicking this will take you elsewhere. Following the clients requests, the open hours and location are all visible. On the navigation bar, I’ve put the menu item first so that it’s easy to locate, should the user need this. I’ve gone for a large hero image which stays throughout the site and on the image I’ve included a quote that symbolises the pride that Coffee Hut has for operating for so long. I’ve kept to the brand colours that Coffee Hut use - Blue, Black and White."}, {"type": "image", "content": "https://miro.medium.com/max/4468/1*Un8k7BN3q-gjznpQQXzorg.png"}, {"type": "subtitle", "content": "LARGE SCREEN CLICK & COLLECT (Below)"}, {"type": "sentence", "content": "The ‘Click & Collect’ page sticks to the brand colours. I’ve kept the form short and easy to understand with very few fields to fill in, keeping the user journey nice and short. Since the paper prototypes, I added in a running ‘Total To Pay’, as I realised the user had no way of knowing the total of what they were paying. The second design is what the user will see upon completing payment. This is a confirmation with an order number, the time of collection and the address. There is also a convenient map that the user can click on. I’ve decided to put this within a box with a lighter blue background to make it stand out to the user. There is also a ‘Home’ button to take the user back to the home page if they wish."}, {"type": "image", "content": "https://miro.medium.com/max/4156/1*WsuClFzdD6BsmAiTrFtApg.png"}, {"type": "subtitle", "content": "MEDIUM SCREEN LANDING PAGE AND CLICK AND COLLECT (Below)"}, {"type": "sentence", "content": "Below is how the app will look on a medium screen. The landing page layout is pretty much the same and the ‘Our Coffee’ section sits at the bottom. The Click & Collect page is still easy to interpret with minimal fields to fill out. The only difference being the form fields are now stacked on top of one another."}, {"type": "image", "content": "https://miro.medium.com/max/4196/1*9Z1gzMqf5S4QPlFMSsriLw.png"}, {"type": "subtitle", "content": "SMALL SCREEN LANDING PAGE AND BURGER MENU (Below)"}, {"type": "sentence", "content": "The landing page for small screen has the same content only stacked on top of each other to utilise the space. I’ve put the open hours at the top as this is important to the client. The second design shows how the burger menu will expand when the user clicks on it. Again, I’ve put the menu as the first item as this is generally what the user looks at first when looking at a dropdown menu."}, {"type": "image", "content": "https://miro.medium.com/max/3604/1*dsGHRBlzvWhvQ94TQf0x5A.png"}, {"type": "subtitle", "content": "SMALL SCREEN CLICK & COLLECT AND PAYMENT SCREEN (Below)"}, {"type": "sentence", "content": "Similar to the medium screen design the form fields on the Click & Collect page are now on top of each other as putting them side by side would make the UI seem very cramped. The second design shows the order success page. Again with this design, I’ve put the contents in a box with a lighter blue background to make it stand out to the user. The third design shows what the payment screen could look like if the user pays via Apple Pay."}, {"type": "image", "content": "https://miro.medium.com/max/4084/1*JfZ2Fdmwc3y4Qll63voJvw.png"}, {"type": "sentence", "content": "There are of course more pages to this app but I’ve targeted the most important ones for this demonstration. The next stage for me would be to start coding an interactive prototype in HTML and CSS with working links and buttons, so that I can show the client how functionality works. If you have any further suggestions, please let me know!"}, {"type": "subtitle", "content": "🙋‍♂ ️Want to talk?"}, {"type": "sentence", "content": "I’m currently looking for employment. I understand times are very tough with the Coronavirus situation and it’s hard for everyone but maybe we can start talking? I’m always keen to learn new things and discuss ideas and I’m happy to talk remotely with the wonders of modern technology and send a CV and more info."}, {"type": "sentence", "content": "Please send me an email joshmarston@hotmail.co.uk or drop me a message on Twitter if you’d like to talk and I’ll get back to you."}], "topic": "ux"}