{"title": "Why Meditation is Easier for Some More Than Others", "data": [{"type": "subtitle", "content": "The role of attention, anxiety, and personality in mindfulness."}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*JmWQnWPPd8t-cdoVoi5nmA.jpeg"}, {"type": "sentence", "content": "Mindfulness has invaded the world of popular psychology (aka “pop psych”). Unlike some trends and fad treatment methods (e.g., pseudo-therapy apps), there seems to be a lot of empirical evidence to support that mindfulness training can, in fact, have a positive impact on mental health."}, {"type": "sentence", "content": "Specifically, practicing mindfulness over time can improve the control you have over your attention (Chambers, Lo, & Allen, 2008; Moore & Malinowski, 2009; Watier & Dubois, 2016) and decrease negative emotions, such as anxiety (Ortner, Kilner, & Zilazo, 2007)."}, {"type": "subtitle", "content": "What is mindfulness exactly?"}, {"type": "sentence", "content": "Mindfulness, often defined as the act of purposely and non-judgmentally paying attention to the present moment (Kabat-Zinn, 2003), derives from Buddhist contemplative techniques and traditions."}, {"type": "sentence", "content": "There are many different types of mindfulness meditations that you can engage in. For beginners, mindfulness meditations are often guided by an experienced instructor."}, {"type": "image", "content": "https://miro.medium.com/max/2250/0*4GeAqG-IO82mJAxB"}, {"type": "sentence", "content": "The mindfulness instructor may ask you to release any judgment or evaluation of the thoughts appearing in your mind. You simply have to observe them."}, {"type": "sentence", "content": "If you’ve tried this, you might have noticed that mindfulness can be really challenging. Let’s take a closer look at the way it works so we can understand why it can be a challenge for some more than others:"}, {"type": "subtitle", "content": "How does mindfulness work?"}, {"type": "sentence", "content": "Research indicates that there are mechanisms unique to mindfulness, compared to other emotion regulation techniques, that can explain why it helps us manage our emotions."}, {"type": "sentence", "content": "In comparison to emotion regulation strategies that aim to change your negative feelings (e.g. cognitive reappraisal), mindfulness aims to increase your awareness and acceptance of those feelings (Chambers et al., 2009). Ironically, observing and accepting your emotions can end up changing them a great deal, or at the very least, can reduce their intensity."}, {"type": "image", "content": "https://miro.medium.com/max/2520/0*LYWQXqnxREj8VWOt"}, {"type": "sentence", "content": "To help with acceptance, mindfulness first requires you to control your attention to your emotions, allowing you to merely observe them without distraction. Focusing your attention on something also requires ignoring information that may be distracting (Ochsner & Gross, 2005). For example, when you meditate, you will likely have unpleasant thoughts that automatically appear in your mind:"}, {"type": "sentence", "content": "“I feel uncomfortable.”"}, {"type": "sentence", "content": "“I’m bored.”"}, {"type": "sentence", "content": "“When will this start to work?”"}, {"type": "sentence", "content": "When you have these thoughts, mindfulness requires that you to notice them, and then reorient your attention back to your breath, for instance, or whatever it is you are aiming to focus on."}, {"type": "sentence", "content": "By using mindfulness techniques, you reduce brain activity related to negative thinking and increase activity in brain areas associated with attention. One neuroimaging study by Zeiden et al. (2014) found that reducing temporary feelings of anxiety through the use of mindfulness techniques increased activation in brain regions linked to attentional control (i.e., the prefrontal cortex)."}, {"type": "subtitle", "content": "Why is meditation easier for some than for others?"}, {"type": "sentence", "content": "Research suggests that, in general, meditating improves with practice. Experienced meditators show enhanced attentional control compared to non-meditators (Lutz et al., 2008; Moore & Malinowski, 2009)."}, {"type": "sentence", "content": "However, there are various factors that make meditation more difficult for some than for others."}, {"type": "sentence", "content": "To be clear, individuals scoring higher on these traits are not resistant to the benefits of mindfulness; they may just need more practice."}, {"type": "sentence", "content": "In fact, mindfulness training has proven to be an effective treatment for individuals with attentional deficits (Cairncross & Miller, 2016). Additionally, one meta-analysis of 209 different studies using mindfulness-based therapy (MBT) found that mindfulness significantly improved symptoms of anxiety and depression (with sustained benefits over time), and that participants showed improved mindfulness abilities after treatment."}, {"type": "subtitle", "content": "What can we take away from this?"}, {"type": "image", "content": "https://miro.medium.com/max/2254/0*_fvfFUW5UTW_Z8sa"}, {"type": "sentence", "content": "Mindfulness is widely advertised nowadays and made to look easy. However, the truth is that mindfulness meditation takes practice for most people and can be especially difficult for individuals struggling with their mental health."}, {"type": "sentence", "content": "If meditating is hard for you, patience and practice will be essential. In fact, practicing mindfulness may be even more beneficial for those who have difficulties with it, since it can lead to substantial, positive improvements in daily functioning. If you stick with it, you will likely experience a large improvement in your daily mood, concentration, and quality of life."}, {"type": "sentence", "content": "Those who experience more difficulties implementing mindfulness techniques may benefit more from guided, rather than self-directed, meditations where an instructor walks you through what to focus on. Guided meditations can be found through a quick search on Youtube.com (e.g., see “10-Minute Meditation For Anxiety” by Goodful)."}, {"type": "sentence", "content": "Many therapists who incorporate mindfulness techniques in their treatment methods (e.g., MBT or DBT) can also guide you through what steps to take."}, {"type": "sentence", "content": "Given the promising research on mindfulness’ potential to improve well-being, taking the time to meditate each day will be a worthwhile endeavor."}], "topic": "mindfulness"}