{"title": "How to Never Approach Someone on LinkedIn", "data": [{"type": "subtitle", "content": "And how I formed a connection that led to an actual sale"}, {"type": "image", "content": "https://miro.medium.com/max/12516/0*E8s2fSOzAlSRhQ_m"}, {"type": "sentence", "content": "A few days ago, a total stranger reached out to me on LinkedIn and said something along the lines of:"}, {"type": "sentence", "content": "After reading that cringe-worthy message, I asked myself: “Excuse me, but what the f**k just happened? God, does this ever work?”"}, {"type": "sentence", "content": "And that person also asked me to recommend them to someone. I don’t even know who they are. Not to mention their LinkedIn profile didn’t even have a human’s photo — the profile picture was some poorly designed logo and there was no cover photo. No website, no portfolio, no testimonials, and no endorsements."}, {"type": "subtitle", "content": "Why It Doesn’t Work"}, {"type": "sentence", "content": "“I love getting sold to,” said no one ever."}, {"type": "sentence", "content": "When you message your LinkedIn connection for the first time and try to sell them something, it sounds needy. We live in times of inbound marketing. If you don’t know what inbound is, it basically involves attracting customers through content marketing. For example, blogs, YouTube videos, or social media posts."}, {"type": "sentence", "content": "It’s the opposite of outbound marketing, which includes cold calling prospects and messaging complete strangers on LinkedIn."}, {"type": "sentence", "content": "Times have changed and people like to do their research by checking out a business’s website, social media accounts, and reviews before they make a purchase (instead of handing over their money to a person or business who just reached out to them out of nowhere)."}, {"type": "sentence", "content": "I would have possibly considered doing business with that stranger who sent me a message out of the blue if they had dozens of recommendations and skill endorsement. But if you’re just starting out on LinkedIn and your profile picture is a selfie, it’s probably not a good idea to have a needy sales pitch as your first message to someone."}, {"type": "subtitle", "content": "What to Do Instead?"}, {"type": "sentence", "content": "I can understand the frustration. Back in the day, even I used to send sales pitches to strangers — and not a single one got a response."}, {"type": "sentence", "content": "Then I studied marketing, went to networking events, met a bunch of seasoned marketers, worked as a copywriter, and figured out the right way to find clients on LinkedIn."}, {"type": "sentence", "content": "First of all, remember that LinkedIn is a social media platform — not a marketplace for you to sell your products/services all the time and try to get money out of people like a sleazy salesperson."}, {"type": "sentence", "content": "So what should you do on this social media website? It’s simple — socialize! Why not use the platform for what it’s actually meant?"}, {"type": "sentence", "content": "Start by adding people from your target audience to your network. Then genuinely engage with their posts. Also, post content that they find valuable on a regular basis, too."}, {"type": "sentence", "content": "Anyone can do this easily. Let them get to know you and find out if you’re a good fit for them or not. At the same time, keep an eye on their LinkedIn activity as well to make sure that they’re compatible with your business values, too."}, {"type": "sentence", "content": "One day, the opportunity to do business may arise. And when this happens, they’re more likely to favor you because people tend to like working with the people they know and trust."}, {"type": "subtitle", "content": "My Real-Life Example of Closing a Client Through LinkedIn"}, {"type": "sentence", "content": "I wanted to work as a freelance copywriter for one of the top digital agencies here in New Zealand. So I added the director of that company on my LinkedIn network. I liked his work ethic and the fact that he consistently posted high-value content on LinkedIn."}, {"type": "sentence", "content": "I used to watch all his videos, read all his articles, and leave comments on his posts about my thoughts on them. I was on his radar. I knew it because he visited my profile a few times (probably wondering who I was and whether he’d ever met me before)."}, {"type": "sentence", "content": "Then came the turning point. I saw him in a cafe, and honestly, I felt the same anxiety people feel while approaching an attractive person from the opposite sex. I sort of panicked. I pretended that I was trying to drink water, then I pretended that I’m trying to select my coffee. (Just so you know, I don’t even drink coffee.)"}, {"type": "sentence", "content": "“God! How do I approach this guy,” I thought. But the adventurous biker in me said, “You’ll keep thinking until he walks out of this cafe. And then you’re going to go home and cry about how it’s so hard to close clients. Do it now, jackass!”"}, {"type": "sentence", "content": "I walked straight up to him and introduced myself. “I follow you on LinkedIn and find your posts really informative.” “Oh yeah, I remember your face from your profile picture,” he said. We talked for about half an hour, mostly about my line of work (copywriting), and he said, “I was stressed out today but you came and cheered me up. Thanks, man.”"}, {"type": "sentence", "content": "Now the decision-maker knew who I was. Not only this, but he also acknowledged that he liked me as a person (which is huge in business), and I knew that he was going to hire me for freelance work sometime soon."}, {"type": "sentence", "content": "A week later, we met again. This time, he seriously meant business and asked me to send him some examples of my previous work. He liked it and explained the project to me. About five days later, I sent him a quote. He accepted it."}, {"type": "sentence", "content": "Sale closed!"}, {"type": "sentence", "content": "We’re lucky to be living in a time where you can build relationships with new people you’ve never met through social media."}, {"type": "sentence", "content": "But the main thing to remember here is the word social. Socializing comes first, sales come second. Just keep this in mind and you’ll see results for sure."}, {"type": "sentence", "content": "Also, building relationships with one decision-maker is far better than copy-pasting poorly written sales pitches to hundreds of unqualified prospects."}], "topic": "social-media"}