{"title": "Why You Shouldn’t Start a TikTok Account", "data": [{"type": "subtitle", "content": "Including the reasons why you should start one"}, {"type": "image", "content": "https://miro.medium.com/max/8064/0*ZOXDBSPvSq_KvlH2"}, {"type": "sentence", "content": "We’ve been hearing for the past few months that now is the time to be present on TikTok and stop trying to make it happen on Instagram."}, {"type": "sentence", "content": "Every single social media guru is jumping on that trend, convincing its audience to start posting content on TikTok."}, {"type": "sentence", "content": "They all take real-life examples of either themselves or their clients, going from 0 to tens of thousands of subscribers in the first week. They claim that you can make millions of views easily, in no time."}, {"type": "sentence", "content": "Even if it seems a little too good to be true, they’re not lying about these numbers. But there are a few things to keep in mind before you start making your first TikToks."}, {"type": "subtitle", "content": "TikTok Is The Perfect Platform for Marketing Consultants and Gurus"}, {"type": "sentence", "content": "Because of how viral TikTok can be, it’s very tempting to be recommending brands and content creators to get on the platform."}, {"type": "sentence", "content": "Picture this: you’re working for a client, helping him get more popular on social media. He’s been trying to make it on Instagram for the past three years, but his growth plateaued for the past year. His content is good, video-based, and highly engaging. If you tell this guy to go on TikTok, you know he’ll crush it, get lots of views and subscribers in no time, and he’ll be forever grateful because you fixed a problem that he’s been having for months."}, {"type": "sentence", "content": "TikTok is that new magic pill marketing consultants and gurus were looking to sell their services."}, {"type": "sentence", "content": "If you get a client that’s already making great content, all you have to do is tell them about TikTok, show them how to optimize their profile and how to post, and that’s it. You’ll give them amazing results that they would not even have been able to imagine while getting a big check for your “expertise.”"}, {"type": "sentence", "content": "From there, you can easily talk about these clients when you’re releasing a TikTok course or trying to sell your online classes or your coaching services."}, {"type": "sentence", "content": "TikTok is the way for marketers to get outstanding results in no time, then using these clients’ testimonies to boost their social proof and expertise, and eventually, increase their sales."}, {"type": "sentence", "content": "It’s in these marketers’ interest to make TikTok as big as possible. Then, just like Instagram, when the growth opportunities will slow down, they’ll sell more courses about how to beat the algorithm and how to monetize a small audience on the platform."}, {"type": "subtitle", "content": "Is TikTok Right For You?"}, {"type": "sentence", "content": "TikTok is very trendy, and I know that it’s hard to resist taking advantage of the growth possibilities the platform offers."}, {"type": "sentence", "content": "But before you start making TikToks, it’s worth wondering if TikTok is right for you and if you will take advantage of this platform or not."}, {"type": "sentence", "content": "The first thing would be to have realistic expectations about TikTok."}, {"type": "sentence", "content": "Do not get on there if you just want the big numbers because you think it’s easy, because it’s not. People that are performing well on TikTok are either expert content creators or very talented people. Content creation isn’t easy, and neither is being highly gifted at something."}, {"type": "sentence", "content": "TikTok isn’t always the magic pill everyone is talking about."}, {"type": "sentence", "content": "Do not get on TikTok if:"}, {"type": "sentence", "content": "Here are better reasons to start:"}, {"type": "sentence", "content": "Gurus are selling TikTok to your ego and your natural attraction to the popularity and big numbers. But the truth is: TikTok is hard, like every other platform. Unlike other platforms, the growth possibilities are still here. If you are good at what you do, you could probably expect impressive numbers and lots of subscribers. But it won’t be easy, and it won’t happen on your first day."}, {"type": "subtitle", "content": "TikTok Is Just Another Social Media Platform"}, {"type": "sentence", "content": "I agree with the hype, I agree with the opportunities, but I disagree with this idea that it’s now the only way to grow online, or that it turns every user into a successful social media celebrity."}, {"type": "sentence", "content": "Even if we don’t know much about TikTok’s algorithm yet, we can safely assume that it works just like every other social media platform. If your content is engaging and performing well to a small audience, it will get shown to larger audiences."}, {"type": "sentence", "content": "So here’s the secret to growing on TikTok: create good and engaging content."}, {"type": "sentence", "content": "If your content is not valuable and doesn’t spark interest to anyone, you won’t get views or followers, no matter what platform or format you’re using."}, {"type": "sentence", "content": "Be careful about what people tell you about TikTok, especially if they tell you that it’s easy and that you could become a star overnight. Instead, think about what you could share. Think about what you could teach the world, the problems you could fix, the needs you’re fulfilling."}, {"type": "sentence", "content": "That’s how you create good content."}, {"type": "sentence", "content": "Good content is the quickest and more durable way to build an audience. That’s not the truth gurus will share, but that’s the way it works online, particularly on social media."}], "topic": "social-media"}