{"title": "How Epic Battle Fantasy 5 Uses Music and Atmosphere To Change Mood", "data": [{"type": "image", "content": "https://miro.medium.com/max/3072/1*2G6Pgo9eH2fuXDqGTly1hg.jpeg"}, {"type": "sentence", "content": "The Epic Battle Fantasy series isn’t really a game series known for its deep and engaging storytelling. You can tell that much from the title and a few minutes of playing. Instead it’s a light-hearted and comedic parody of Final Fantasy and the JRPG genre in general. It’s a game of busty anime girls, ridiculous limit break attacks and fascists that really aren’t that bad once you get to know them. Since the first game over ten years ago, the series has never really taken itself seriously."}, {"type": "sentence", "content": "Which is why I was completely taken aback by how good certain parts of the game are at invoking emotion and flawlessly changing the mood. In particular, two moments stuck out to me, and inspired me enough that I’m writing about it in this article. Before I get into it however, keep in mind that I’ll be spoiling the game quite a bit. If you haven’t played Epic Battle Fantasy 5 yet, I highly recommend buying it on Steam and completing the game as well as all the Bonus Dungeons before reading this. I’d also recommend buying the game’s soundtrack on the musician’s website. They’re both more than worth the money."}, {"type": "sentence", "content": "Redpine Town"}, {"type": "sentence", "content": "As I said in the introduction, the game generally isn’t very serious. Over the course of the game, you journey through several different environments, none of which(except a few optional basement cults) really give a real sense of danger or terror. Even the literal warzone area is fairly tongue in cheek. The purpose of your journey is to investigate a meteor that crashed into the Southern Continent and fight off a possible alien invasion, but this goal was always at the back of your mind. All you know about the meteor is what’s mentioned by the characters, so despite being a threat, it also feels distant. It can’t be that bad right? Everything changes when you get to Redpine Town and this song kicks in."}, {"type": "sentence", "content": "You walk out of the calm, hypnotising music of the Frozen Valley into an abrupt alien tune that instantly snaps you to attention. The beautiful snow has transitioned into dead orange and red grass. At the entrance is a noose hanging from a tree and a cultist who tells you that there are only nightmares and to turn back. Nobody else in the town is outside. Right next to this is a huge graveyard where the characters comment on all the people who must have died due to the meteor and the resulting monsters. The town is home to two cults including one you almost certainly encountered at least a few times before reaching Redpine. This is where they came from."}, {"type": "sentence", "content": "You get some further context from the NPC’s and Lance. This was where Lance grew up. Redpine used to be a mining town and several lines of dialogue seem to give the impression that it wasn’t much better before the meteor hit. This was not a nice town and still isn’t. Redpine Town is just so unlike everything else in the game up to this point, and arguably the entire series. There’s an atmosphere of death and desolation and for the first time since the game started, the stakes feel real, and the characters realise this too. Up to this point you were just going on a light-hearted adventure to save the world from an alien invasion. Now you’re seeing the effects of the disaster first-hand. You’re in the endgame, and you don’t feel so heroic anymore. Redpine Town is a brutal snap back to reality, and it helps make this second moment in the game I want to talk about even more potent."}, {"type": "sentence", "content": "Fighting God"}, {"type": "sentence", "content": "In the premium version of the game, there are six bonus dungeons you can raid and complete. However, you can only unlock the sixth dungeon upon completing the five others. This sixth dungeon known as the “Temple of Trials” contains some of the most difficult bosses in the game, evil counterparts of the player characters that each have their own brutal gimmicks that force you to change and rethink your usual strategies to beat them. These bosses have horrific visages and are accompanied by intense, pulse-pounding music that gives the impression that you’re in a fight for your life."}, {"type": "sentence", "content": "But that isn’t the track I want to talk about, as good as it is. Once you’re done with four of the evil players, a portal opens up leading to the final trial. By this point, the only player that hasn’t seen the appearance of an evil counterpart yet is NoLegs, the cute mascot cat who also acts as the ‘rogue’ of the party. The characters comment as much themselves when you go through the portal and emerge on a floating chunk of rock in space. By this point you’re probably expecting some horrific, demonic eldritch god to be the final bonus boss. You’re probably expecting it to be accompanied by some more intense and terrifying boss music before you’re obliterated by some brutal gimmick you couldn’t prepare for. Instead, you enter the battle, and you hear this."}, {"type": "sentence", "content": "Instead of some pulse-pounding metal, you’re instead greeted by a simple and beautiful guitar melody. Your opponent is a cute, super saiyan cat in a Goku cosplay with a cartoonish hammer and shield. Its name: ‘God’. The series has had a number of gods as bosses over time, but none of them ever felt quite as final and imposing as simply ‘God’. Rather than taunt or threaten you, the boss asks whether enlightenment still alludes you in a friendly manner. Each of the characters has a status effect like with the previous bosses, but unlike those bosses, this status effect isn’t negative. In fact, it’s quite the opposite. The ‘epic’ status increases all your stats by a massive 25% every single turn providing a huge boost. The start of the fight is confusing to say the least. And then the vocals start."}, {"type": "sentence", "content": "This was the true turning point for me. The Epic Battle Fantasy series started as a simple flash game series on Newgrounds and Kongregate made by only two people. Over time, the series evolved and improved. Epic Battle Fantasy 3 was a phenomenon among free online flash games, Epic Battle Fantasy 4 released to overwhelming success on Steam, and now the game is on its 5th main entry. But not once did I realise just how far the series had come, not once until I heard this track as I fought a super saiyan cat in space."}, {"type": "sentence", "content": "‘God’s’ description simply reads “This is the ultimate being! His stats are incredible, the highest in the universe! There’s no way to beat him! Believe it!” as if challenging you to prove it wrong. It’s not completely wrong. He’s extremely tough, one of the hardest bosses in the game. He attacks twice per turn with non-elemental attacks that almost entirely ignore your gear and utilises probably the strongest ultimate attack in the game. But despite all that, the song and atmosphere make the fight feel relaxing and calm. Sure, he’s strong, but you’ve come this far haven’t you? You can beat him, the boss even wants you to. Even if you fail once you can come back and try again. ‘God’ feels like not just a celebration of the Epic Battle Fantasy series, but a celebration of just how far you’ve come and all you’ve achieved."}, {"type": "sentence", "content": "In my honest opinion, Epic Battle Fantasy 5 is the best game in the series, and it’s due to moments like these. Moments that make the game feel special and unique and subvert expectations in the most fantastic ways. You can tell that both Matt and Phyrnna put their souls into Epic Battle Fantasy 5, and it’s most apparent in these two moments that make up only a small part of the game."}], "topic": "gaming"}