{"title": "What Facebook’s Remote Work Policy Means for the Future of Tech Salaries Everywhere", "data": [{"type": "subtitle", "content": "‘For some kinds of jobs, it really could become a more national and less local labor market’"}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*aQm2l1Ly2tskugr4NuQ0KA.jpeg"}, {"type": "sentence", "content": "For many tech workers, the ability to do the job from anywhere — or more specifically, being able to do the job without paying Bay Area rents or spending thousands of hours every year driving on 101 or 280 — is the dream."}, {"type": "sentence", "content": "That may become a reality for more and more tech workers, with one little adjustment: a cutback on those generous salaries."}, {"type": "sentence", "content": "Facebook chief executive Mark Zuckerberg said on Thursday that the company will begin to offer remote work to new hires, beginning with senior engineers, and that current employees will soon be able to request switching to remote work. But, there will be salary adjustments: “If you live in a place where the cost of living is dramatically lower, then salaries do tend to be somewhat lower,” Zuckerberg told the Wall Street Journal."}, {"type": "sentence", "content": "Twitter and Square, both run by Jack Dorsey, have also said that they will allow “permanent” work from home. Many employees of large technology companies have been working from home since March, due to the coronavirus pandemic, with many extending return dates to the fall or even next year; Google for example has said that, for most employees, work will continue from home until 2021."}, {"type": "sentence", "content": "Zuckerberg’s announcement that he expects up to half of the company’s employees to work remotely in the next decade could radically revise how tech workers and observers think about the industry, and especially its impact on the Bay Area, whose spiraling cost of living — thanks to a combination of a lack of new housing and the riches from the tech boom — have led to tension among residents. Only five years ago, Facebook offered a $10,000 cash bonus to employees to live within 10 miles of its headquarters in Menlo Park, the Information reported."}, {"type": "sentence", "content": "In theory, “localization” — adjusting salaries for the cost of living where workers live as opposed to where the companies are based — makes sense. Many companies already localize salaries for remote workers either because they do not want to or cannot pay big city salaries. For a worker in a given location, their options are to find work at a local tech firm, or one of the national companies that are open to remote work. But if a substantial number of big tech companies like Facebook provide a remote option for their workers, the labor market everywhere has the potential to be transformed."}, {"type": "sentence", "content": "It may seem reasonable for Facebook to set a single “real wage” for a given role and say that an engineer living in Grand Junction, Colorado, (where the “fair market rent” for a two-bedroom apartment, according to the Department of Housing and Urban Development, is $1,035) should get less on her paycheck every two weeks than someone doing the same job in San Francisco (where HUD pegs a two-bedroom at $3,339 a month)."}, {"type": "sentence", "content": "But once that engineer in Grand Junction can quit Facebook and move over to Twitter or Square while still mountain biking a few miles from her home, the ability to “localize” her salary decreases, as Facebook still has to compete for the workers it wants to hire. Then, the engineer’s buddies in the Mission might learn from Instagram that Grand Mesa is a bit more impressive than Dolores Park. So they trade in their carbon-frame road bikes for something a bit rougher and pack up the U-Haul. Now there’s less pressure on the Mission housing market and prices in Grand Junction start to creep up. This actually happens — just ask anyone in, say, Missoula."}, {"type": "sentence", "content": "“For some kinds of jobs, it really could become a more national and less local labor market,” Jed Kolko, the chief economist at Indeed, the jobs site, told OneZero. “It’s an important distinction whether one firm on its own takes a different approach to where people work and how they’re compensated or whether the norm for the entire industry shifts.”"}, {"type": "sentence", "content": "And even if there’s still some salary differential, the wages Facebook pays to remote workers will likely be on the high end for those areas. Heather Doshay, the vice president of people at the San Francisco-based tech company Webflow, told OneZero that low costs of living could be eroded as they have been in cities where tech companies have expanded, like Austin, Nashville, Denver, or Portland."}, {"type": "sentence", "content": "“When the tech worker can afford rent or the purchase of a home that is multiples of what the average family income is in these cities, the cost of living will increase, and this hurts the average person,” Doshay told OneZero."}, {"type": "sentence", "content": "But Facebook is perfectly able to have employees in any number of regions that are less expensive than the Bay Area, which has the highest cost of living in the country according to the latest figures from the Census Bureau — with Silicon Valley specifically having the highest housing costs."}, {"type": "sentence", "content": "There must be something about the stretch of land between the Golden Gate and the Santa Cruz Mountains that makes software engineers more productive, more valuable, more able to negotiate for higher pay than they are anywhere else. We know why energy companies are in Texas and Oklahoma, but silicon is one of the most abundant natural resources on Earth."}, {"type": "sentence", "content": "A number of economists have developed a suite of theories to explain this. The economist Enrico Moretti argues that a software engineer in the Bay Area is more likely to find the best company for their particular set of skills, and companies are more able to find the most specialized employees if there are a lot of them in one place. Tech companies then have their choice of vendors: law firms that understand stock-based compensation, public relations firms that have experience with product launches. And there’s the ineffable part, what Moretti calls “human capital spillovers:” people learning from each other in unplanned ways or being motivated to work harder and try out new ideas because everyone around them is doing it, too."}, {"type": "sentence", "content": "“Firms aren’t paying more to live in a more expensive place as a perk — if it weren’t worth it to them the firm wouldn’t hire them to live in more expensive places,” Kolko said."}, {"type": "sentence", "content": "He added that “for businesses that are truly remote, and if people were equally productive regardless of where they were,” firms would pay the same everywhere and not account for cost of living."}, {"type": "sentence", "content": "But even for technology companies that have adopted full remote work, a truly standard wage that’s insensitive to the cost of living is rare. The software company GitLab has a publicly available database of “location factors” that adjust salaries from its San Francisco baseline. The company is straightforward about why they do this — it started because the prevailing wage for technology workers was different in different areas. (GitLab says it no longer asks about previous salaries.)"}, {"type": "sentence", "content": "“If we pay everyone the San Francisco wage for their respective roles, our compensation costs would increase greatly, and we would be forced to hire a lot fewer people,” GitLab chief executive Sid Sijbrandij has said."}, {"type": "sentence", "content": "Basecamp, another all-remote company, has the opposite approach. The company was founded in Chicago but it “pay[s] everyone as though they live in San Francisco and work for a software company that pays in the top 10% of that market,” its founder David Heinemeier Hansson wrote. “San Francisco was our benchmark because it’s the highest in the world for technology, and because we could afford it, after carefully growing a profitable software business for 15 years,” Heinemeier Hansson said last year."}, {"type": "sentence", "content": "But Basecamp is the exception."}, {"type": "sentence", "content": "“The only tech companies I’ve seen offer a single rate of compensation anchored in SF or NY market rates are intentionally small and unlikely to scale beyond 500 employees, ever. I do not know of a single tech company over 1,000 employees that offers SF or NY compensation to all employees regardless of location,” Doshay said."}, {"type": "sentence", "content": "But Basecamp has about 50 employees and is a steadily profitable business software company. It doesn’t have to satisfy growth-hungry venture investors or public markets. Heinemeier Hansson tweeted that Facebook’s salary adjustment policy was “barbaric.”"}, {"type": "sentence", "content": "And he wasn’t the only chief executive with a largely remote workforce to condemn Zuckerberg. Nick Francis, the chief executive of Boston-based customer service platform Help Scout, tweeted that localizing pay “isn’t the right way to do it.” But his company, which doesn’t adjust pay based on location, also doesn’t pay San Francisco salaries."}, {"type": "sentence", "content": "“We align with the ‘second-tier’ markets such as Boston, New York, and Seattle,” Francis wrote earlier this month. The implication is straightforward: “It’s not financially viable for us to compete for talent in the San Francisco/Silicon Valley region.”"}, {"type": "sentence", "content": "But if enough companies follow Facebook’s lead, that might change, San Francisco might become more like everywhere else — and everywhere else more like San Francisco. At least in theory."}], "topic": "business"}