{"title": "New Players are the Path to Growth", "data": [{"type": "subtitle", "content": "Why smaller game developers must think about big audiences"}, {"type": "sentence", "content": "The last decade marked a major turning point for the video game industry, especially for indie developers. The very idea of being able to make a living on game development (outside of a major studio) has become a reality, and has opened the door for thousands of smaller studios worldwide."}, {"type": "sentence", "content": "That newfound access — and the flood of developers who have walked through the door — has also raised important questions and concerns for these developers, not least of which being how to find players for their games. In this piece, I’m going to discuss a key lesson that major studios have learned but that indies are still struggling with: how to get new players interested in your game."}, {"type": "subtitle", "content": "Meet your new fans"}, {"type": "sentence", "content": "A few months ago I did a piece that focused on the new player’s experience, but this time, I’m going to focus on exactly what this means for an indie developer."}, {"type": "sentence", "content": "Indie development is not underground anymore thanks to digital stores and YouTuber and streamer culture. It’s never been easier for someone to show off a game they like, and you never know the impact that can have on your game sales."}, {"type": "sentence", "content": "This also means the spotlight is far more intense when it comes to issues or problems. You and your friends may love your game, but that doesn’t mean anything with regards to the greater market. I have seen games that had positive impressions locally, to only be blindsided by complaints and problems when the game was made available for sale."}, {"type": "sentence", "content": "Indie developers are now being put into the same position that massive studios are in when it comes to the consumer and making sure their game is approachable. I have lost count at this point of the number of indie games released with the following:"}, {"type": "sentence", "content": "There is a simple explanation for this."}, {"type": "image", "content": "https://miro.medium.com/max/6294/1*h5xdlPGrD5HWuWF_EjxlRg.jpeg"}, {"type": "subtitle", "content": "Development constraints"}, {"type": "sentence", "content": "In a perfect world there would be no problems with production or funding for any video game, but for many indie developers, we know that’s not the case. It is already a challenge to make a game, let alone polishing it to perfection. Many indie developers know that their game is not going to be a mass-market success — it could be the genre, the implementation, or the concept in general."}, {"type": "sentence", "content": "If you know that your game is already a niche experience, that means there is already a finite number of potential customers who are likely to buy it. As we all know from marketing 100: if you can keep costs down, you’ll earn more revenue. Speaking with veteran game developer Jeff Vogel, we discussed what it means to survive in the industry when working with a niche genre."}, {"type": "sentence", "content": "For indie developers making 2D platformers, they know their audience is well acquainted with platformer design, and there’s no need to explain that space bar or “A” would be the jump button. For smaller teams, it would be financially damaging to spend extra months doing further playtesting or trying to attract nonfans to your game."}, {"type": "sentence", "content": "I have previously discussed the point that there is no such thing as a ‘perfect game’ — something that will appeal to everyone. In fact, great games tend to be born from a focus on a specific gameplay loop and style of play. So, if you’re building an experimental strategy game, there’s no reason to include extraneous elements that cater to action fans for example."}, {"type": "sentence", "content": "Having said that, let’s turn our attention towards the question of why the new player’s experience matters, even to the most niche titles — and how paying attention to this can help you grow as a designer."}, {"type": "subtitle", "content": "Successful streamlining"}, {"type": "sentence", "content": "Here’s a dirty little secret when it comes to success: complexity and difficulty are not as important as approachability. There are genres which have failed to capture wider audiences because it’s difficult to get into them as a new player. Here’s a great example: consider Sid Meier’s Civilization versus Europa Universalis. Why is the former so much more well known than the latter? The reason, in large part, is because the former has been designed to be as approachable as possible. It’s important for developers to not only pay attention to their hardened, hardcore fanbase, but to also pay attention to new (and potential) players."}, {"type": "image", "content": "https://miro.medium.com/max/6102/1*je78ukfxyprmiuvF3TZJWg.jpeg"}, {"type": "sentence", "content": "User interface (UI) and user experience (UX) design are critically important components when it comes to game development, and they are often key points of failure for indie developers. There’s a whole lot to unpack about UI and UX, of course — that’s probably a topic for another article."}, {"type": "sentence", "content": "It may sound counterintuitive to suggest that displaying and explaining your game systems in a way that’s easy for a lay audience to understand is important. But coming to grips with the pain points in your design (and knowing how to fix them) will make you a better designer. There are foundational elements to good game design — both universal and genre-specific — for developers to learn. In fact, making your game UX more friendly can improve the experience for existing fans as well (bear in mind that your game may have issues that your hardcore audience has simply accepted as a reality and hasn’t raised a fuss about — thus making them invisible to you)."}, {"type": "sentence", "content": "One way of potentially understanding gaps or flaws in game UX is to play poorly-reviewed games within a developer’s particular genre of interest. This can be one way to see what other developers may have missed from a UX point of view. Remember, there’s a huge difference between someone who is not a fan of a genre and someone who is not a fan of your take on a genre."}, {"type": "subtitle", "content": "Welcoming new players"}, {"type": "sentence", "content": "Finally, it’s relevant to return to one of my favorite terms: playtesting. If you’re remotely concerned with earning money from your video game, then you’re going to need playtesters. Fans, newcomers, and everyone in between — the more, the better (bearing in mind your broader target audience, too)."}, {"type": "sentence", "content": "No matter what kind of game you are making, you should never ignore new players if you’re going to grow as a developer (and if you’re going to maximize the commercial opportunities for your game). If you only listen to your hardcore fans, you’re likely to encourage an echo chamber effect — this blunts any opportunities you have to expand your audience, but it also doesn’t lead to you being a better developer."}, {"type": "sentence", "content": "There are many developers out there who wonder why their game didn’t take off even though some players (and perhaps they themselves) enjoyed it. But when I get my hands on these titles, I can often quickly identify basic flaws and design issues that might drive new players away from the experience."}, {"type": "sentence", "content": "If you’re not learning and improving as a developer and designer, then you’re not going to be able to effectively grow your fanbase and reach. I don’t believe there’s such thing as a niche genre per se — only niche examples of a genre."}, {"type": "sentence", "content": "Readers, can you think of takes on otherwise impenetrable genres that managed to be approachable to new players?"}, {"type": "sentence", "content": "If you enjoyed my post, consider joining the Game-Wisdom Discord channel. It’s open to everyone."}, {"type": "image", "content": "https://miro.medium.com/max/1996/1*3lf9Y6mHxoxpSSFOw6gjlw.png"}], "topic": "design"}