{"title": "How Domino’s Won the Pandemic", "data": [{"type": "subtitle", "content": "The pizza franchise figured out cloud kitchens before they were cool"}, {"type": "image", "content": "https://miro.medium.com/max/9342/1*HZRUOo-ejRsgj-IruqzUrg.jpeg"}, {"type": "sentence", "content": "While food delivery apps like Grubhub, DoorDash, and Uber Eats have been a lifeline to the restaurant industry as shelter-in-place orders have kept people indoors, the fact is that they remain expensive options for consumers and restaurants, while also being largely unprofitable for the delivery businesses themselves."}, {"type": "sentence", "content": "Food delivery has high fixed costs. The courier requires a minimum wage. The ingredients can only be so cheap. There just aren’t a ton of things throughout the food delivery value chain that restaurants can innovate on without significant technological advances."}, {"type": "sentence", "content": "That’s why some ambitious entrepreneurs (like ex-Uber CEO Travis Kalanick) are getting into “cloud kitchens” to cut the biggest expense traditional restaurants deal with: real estate costs. If a kitchen makes its money by delivering food to those who order it over an app, there’s no point in paying for premium real estate — or extra staff to take care of customers who visit."}, {"type": "sentence", "content": "While cloud kitchens may seem like a new trend, the concept isn’t really that new. In fact, Domino’s Pizza has been reaping the benefits of cloud kitchens for years."}, {"type": "image", "content": "https://miro.medium.com/max/2912/0*BYK8PBxGXFjNOJXY"}, {"type": "sentence", "content": "Think about the similarities between cloud kitchens and Domino’s:"}, {"type": "sentence", "content": "And while Domino’s is certainly benefiting from the rise of delivery (especially during Covid-19), one of the main reasons they did so well over the past decade has been the alignment of their business and their business model."}, {"type": "subtitle", "content": "Strategic investments"}, {"type": "sentence", "content": "In 2009, Domino’s made a number of decisions to align their strategy to their business model."}, {"type": "sentence", "content": "First, they completely overhauled their product. The food went from tasting like cardboard to tasting like, well, real pizza. And they even ran an ad campaign owning up to their previously bland product and describing how they had improved it. It also helped that the product category (pizza) was extremely well-suited to delivery because it’s cheap: A single pizza can feed a family of four."}, {"type": "sentence", "content": "Then, they invested in technology. They were the first to both offer mobile ordering and to build a Pizza Tracker on their website, a concept that delivery startups have since copied. This not only helped them with ordering and logistics (stores and drivers utilize software as well) but also helped them build a strong digital brand in which they interact directly with consumers."}, {"type": "sentence", "content": "This brand advantage is especially important during quarantine, where the customer journey almost always begins online. A lot of other big takeout chains rely on aggregators like DoorDash or UberEats, and are forced to suffer the high fees that come with them. (We’re even starting to see restaurants migrate off these platforms towards building their own apps, similar to what Domino’s did a decade ago.)"}, {"type": "sentence", "content": "Finally, Domino’s stores are optimized for delivery and takeout, not in-store eating. In contrast, competitors have followed more traditional models: Pizza Hut has a dine-in focused model and mom and pop pizza shops don’t have the technology or delivery infrastructure (although Slice is trying to change that)."}, {"type": "sentence", "content": "While all of these decisions prepared Domino’s for the cloud kitchen era, one of the biggest drivers of investor returns was their franchise business model. It can’t be understated how closely their strategic decisions played into becoming one of the most successful franchises in history."}, {"type": "subtitle", "content": "The benefits of franchising"}, {"type": "sentence", "content": "Franchise businesses can be incredible. Here’s why."}, {"type": "sentence", "content": "Usually, when a business wants to grow, they need to use existing profits or raise new capital to fund that growth. However, a franchise business is the opposite. The franchisor can add new locations, but doesn’t need to front the capital themselves. Instead, they can source the capital required to open new locations through their franchisees."}, {"type": "sentence", "content": "In return for the brand awareness, trade secrets, and operating best practices, franchisees pay monthly commissions to the franchisor. For the parent company, it becomes a cost-free royalty, a perpetual stream of cash. And if a franchisor is performing well, they can actually distribute cash back to shareholders even as they grow, instead of needing cash to fund expansion."}, {"type": "sentence", "content": "So if franchises are so great, why doesn’t everyone run one? One reason is that not every business is built to entrust franchisees with quality control."}, {"type": "sentence", "content": "Consider a company like Starbucks. One big reason people went to Starbucks was to spend a few hours working in a comfortable place, or to enjoy their coffee with a friend. Additionally, many Starbucks customers decide to purchase a coffee because they walk past a store. Starbucks doesn’t do much delivery either: the low price of a coffee (about $5) means that the delivery costs up to 50% of the total order value. Much too high for most people."}, {"type": "sentence", "content": "These business characteristics make it harder for Starbucks to adopt a franchise model. The consumer value proposition is reliant on in-person experience: sitting in a comfortable lobby while enjoying the music, chatter, and aura of the environment. And that’s much harder to scale through a network of franchisees. Starbucks would be relying on independent operators to accurately replicate that unique environment, which is hard to do."}, {"type": "sentence", "content": "And that is one reason why none of the Starbucks stores are franchised. One hundred percent of them are owned by the company."}, {"type": "sentence", "content": "Contrast this with Domino’s. Pizza is a cheap and standard product that is easy to make. Dough, sauce, cheese, toppings — that’s pretty much it. Simple and repeatable."}, {"type": "sentence", "content": "Additionally, Domino’s invested in technology and built an independent, digital-first brand before anyone else. When you think, “I want to order pizza online,” do you picture the Domino’s pizza tracker? I do. It’s not as tied to a particular store as it is to the Domino’s brand and online portal (which is controlled by Domino’s corporate employees)."}, {"type": "sentence", "content": "Finally, their stores are optimized for delivery instead of dining in. Their store locations are selected based on the best delivery routes, not the most foot traffic. And because people typically order more than one pizza, the delivery expense tends to be a small percentage of the average order value."}, {"type": "sentence", "content": "All these decisions funnel quality control to the parent company and make it much easier to hand off a store to a franchisee. When more of the consumer experience is provided by the parent company, the only thing operators need to have is money and grit."}, {"type": "sentence", "content": "So while both Starbucks and Domino’s needed tasty food and beverages to grow, Domino’s structured its business to be much more suited for the franchise model. And it paid off."}, {"type": "subtitle", "content": "The Domino’s growth model"}, {"type": "sentence", "content": "From 2012 to 2019, Domino’s not only grew revenue by 12% per year, but also grew net earnings by 20% per year and returned almost $4.5 billion in cash to equity holders through dividends and repurchases. How did they do it?"}, {"type": "sentence", "content": "Domino’s opened lots of restaurants through this time period. But the most important factor is that they didn’t need to provide the cash up front to build the stores. Instead, the operators did. According to their 2019 10-K, capital expenditures totaled less than 1% of revenue for the international segment (the only segment that is 100% franchised)."}, {"type": "sentence", "content": "This allowed Domino’s to grow their high-margin franchise commissions (3.5% — 5.5% on every franchise) without bleeding very much cash."}, {"type": "sentence", "content": "Then — because of the capital efficiency of franchises, consistency of growing revenue, and a strong asset base — they were able to maintain a high debt level (four and a half to five times earnings before interest, taxes, depreciation and amortization). And with interest rates at all-time lows, their interest expense didn’t cripple their operations in the slightest."}, {"type": "sentence", "content": "They ended up issuing just under $6.5 billion in debt over that period, and while a decent chunk of it went to refinance old notes, another big chunk went to equity holders through special dividends and buybacks."}, {"type": "sentence", "content": "The result is quite unique: a company growing earnings 20% per year while still distributing loads of cash to shareholders."}, {"type": "image", "content": "https://miro.medium.com/max/1392/0*Icaj-HM1JsLfmL7W"}, {"type": "subtitle", "content": "The ideal cloud kitchen"}, {"type": "sentence", "content": "Several of the things that made Domino’s a great franchise model and equity investment also made them perfectly situated in a quarantined, delivery-first world."}, {"type": "sentence", "content": "Domino’s and Papa John’s are performing a lot better than the chains that are optimized for dine-in or personalized orders. They are the pizza chains that are most optimized for delivery and large orders, which is what consumers want right now."}, {"type": "image", "content": "https://miro.medium.com/max/1530/0*gtRpzcufPC4yr9cL"}, {"type": "sentence", "content": "And while Domino’s same-store sales only rose 1.6% in the first quarter, in the four-week period that followed (March 23 — April 19), same-store sales rose 7.1%, with reports that digital orders accounted for 80% of sales in one of those weeks. This is a much better fate than a lot of restaurants, some of which have had to shut down completely."}, {"type": "sentence", "content": "All this is to say that Domino’s is the platonic ideal of future cloud kitchens. The company’s foresight to optimize for delivery, place stores in low-cost and route-optimized retail locations, and build a digital brand and app that really works is now paying off."}, {"type": "sentence", "content": "Even before the coronavirus, home delivery was a growing trend that the biggest names in startups and food delivery had been trying to crack and turn into a venture-scale business."}, {"type": "sentence", "content": "It just turns out that the pizza guys got there first."}, {"type": "sentence", "content": "A version of this piece was originally published on Divinations."}], "topic": "business"}