{"title": "How to stop the battle between Product Managers and Designers", "data": [{"type": "subtitle", "content": "The 6 mistakes Product Manager should avoid to get better outcomes as a team."}, {"type": "sentence", "content": "A thin line between love and hate separates Product Managers and Designers. Generally, Product Managers aim do deliver more, while Designers aim to invest significant time in a unique experience. Product Managers don’t follow why so many details are essential, whereas Designers don’t understand why Product Managers want to remove many important aspects."}, {"type": "subtitle", "content": "The tension between the Product Manager and Designers"}, {"type": "sentence", "content": "Is a conflicting interaction between Product Managers and Designers the way to build delightful products? For sure, not. The more misunderstandings, the less collaboration. At some point in time Product Managers and Designers find no motivation to help each other."}, {"type": "sentence", "content": "Product Manager and Designers see the importance of details differently, which leads to countless disappointments."}, {"type": "sentence", "content": "I’ve worked as a Product Owner in scenarios without Product Managers, meaning I assumed such a role as well. I had many misunderstandings with Designers, which helped me to learn how to work as a team. Product Managers and Designers are not enemies. However, misalignments bring a significant tension in this relationship, holding us back from thriving."}, {"type": "sentence", "content": "As a Product Owner, I found some behaviors and attitudes to avoid so that as a Team, we can achieve terrific outcomes."}, {"type": "subtitle", "content": "Letting the Designer out in the beginning"}, {"type": "sentence", "content": "“We may not waste a Designer’s time now, and it’s just an idea.” This is how problems begin."}, {"type": "sentence", "content": "Product Managers face many opportunities. We need to choose which one to pursue and which to drop. Such decisions happen daily. A problem starts once the Product Manager decides to evaluate some ideas in-depth. How to proceed with the idea is vital to the outcome. A bad choice is to continue alone because the Product Manager will lack a broad enough perspective."}, {"type": "sentence", "content": "I love getting different perspectives from the beginning. I believe working collaboratively; we can identify better opportunities. In Agile, the 3 Amigos approach suggests involving Business, QA, and Development from the start. My approach is to add a Designer, as well. It brings an essential perspective to the discussion."}, {"type": "sentence", "content": "Once we have an idea, we should ask, “How can we make it better?” I approach ideas within an informal conversation. Generally, I invite a Designer, a QA, and a Developer for a coffee, and then I share what’s on my head. I learned that a 30 minutes informal talk produces astonishing outcomes. Collaboration fosters innovation."}, {"type": "subtitle", "content": "Focus on the solution instead of problems"}, {"type": "sentence", "content": "The perfect way to kill a Designer’s motivation is to bring a solution to discuss."}, {"type": "sentence", "content": "I know this pitfall pretty well, I’ve been already. Therefore, I start the talk by describing the problem, which leads to a productive and engaging conversation with Designers. Once Product Managers bring solutions, Designers have no idea what we are talking about. This approach is limiting and unproductive. Therefore, we should avoid it."}, {"type": "subtitle", "content": "Priorities without explanation"}, {"type": "image", "content": "https://miro.medium.com/max/7130/0*xbA6isxcAAZJgfx9"}, {"type": "sentence", "content": "Designer: What’s our priority?"}, {"type": "sentence", "content": "PM: Our priority now is customer acquisition. This is the most critical topic."}, {"type": "sentence", "content": "Designer: Hum. I thought we should focus on retention so that our Customers stay with us. Acquiring more customers without retaining the current ones sounds wrong to me. Could you explain your decision? Please."}, {"type": "sentence", "content": "PM: Well, customer retention is also necessary, but only after we have sustainable growth in customer acquisition. My gut tells me to keep customer acquisition as our priority."}, {"type": "sentence", "content": "Unfortunately, many Product Managers make decisions without criteria. Once the Product Manager cannot explain why he or she made the decision, it will be hard to get the other team members committed. It’s the Product Manager responsibility to ensure the team understands the motivation of the decision."}, {"type": "subtitle", "content": "Not validating assumptions"}, {"type": "sentence", "content": "Launch and forget. That’s the perfect way to fall into the feature creep trap."}, {"type": "sentence", "content": "Maximizing the business value is the goal of a Product Owner, yet, many times, we don’t measure the outcome. I call this scenario as the Feature Factory. We produce features, deliver, and forget about it. Where does value come in? At best, it pleases stakeholders by fulfilling their wishes, but those may not be the same wishes of the users/customers."}, {"type": "sentence", "content": "A great Product Owner or Product Manager is value-driven. Therefore, they create assumptions, define success factors so that it is possible to evaluate if the assumption was valid or not. Without assumptions, the results will be no better than ordinary."}, {"type": "sentence", "content": "More collaboration between Designer and Product Manager produces higher value to the business as well as to the users."}, {"type": "subtitle", "content": "Abrupt changes in the Product Backlog"}, {"type": "sentence", "content": "Without a clear Product Vision, everything can become a priority."}, {"type": "sentence", "content": "Many Product Managers work without a Product Vision, which holds them back from defining a clear direction. The Product Backlog becomes a mess because abrupt changes happen quite often, which demotivates not only the Scrum Team but also the Product Designers."}, {"type": "image", "content": "https://miro.medium.com/max/11300/0*DPUtRrDsMnRwpBAe"}, {"type": "sentence", "content": "Without a clear vision where we want to go, we may end up building a pointless product that nobody likes."}, {"type": "subtitle", "content": "Product Managers as the wireframe masters"}, {"type": "sentence", "content": "Do you want to limit and bias a Designer? Then bring him or her wireframes."}, {"type": "sentence", "content": "I used to create detailed wireframes because I worked a long time without a Designer. Once I started working with Designers, I had problems because I kept preparing wireframes. Designers were mad with me."}, {"type": "sentence", "content": "An excellent Product Team has multiple skills. Therefore, everyone focuses on his or her strengths. For example, Product Managers focus on organizing, structuring, and analyzing. Then, instead of bringing wireframes to Designers, bringing them problems to solve, which motivated Designers to find alternatives to tackle the problem."}, {"type": "subtitle", "content": "Wrap-up"}, {"type": "sentence", "content": "Product Managers and Design can thrive together. Each of them needs to focus on the strengths and trust each other. Then the outcome stands out. A healthy relationship has the following characteristics:"}], "topic": "ux"}