{"title": "You’re Failing at Blogging and I Know How You Can Flip That Around", "data": [{"type": "subtitle", "content": "I’m proof there is a guaranteed way to earn a living from blogging. And it’s not from writing on your blog"}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*GwEVL2LxOAoNJv7PeNnadQ.jpeg"}, {"type": "sentence", "content": "You love writing, don’t you?"}, {"type": "sentence", "content": "Maybe you’re not sure if you like writing, but you love reading blogs, so that must count for something, right?"}, {"type": "sentence", "content": "That’s probably why you love reading posts on Medium. Not only for the rich content or opinion-based pieces from your favorite influencers but also you want to learn all about this blogging world."}, {"type": "sentence", "content": "Something’s holding you back, though. You either don’t know how to succeed at blogging, or you’re scared you’re going to fail before you even begin typing your first word."}, {"type": "sentence", "content": "How can you guarantee you’ll make a living from blogging? Not just the few dollars you might receive from ads or affiliate marketing, but enough money to replace your full-time salary?"}, {"type": "sentence", "content": "Many are succeeding at blogging, but you can’t possibly imagine how you and your blog could achieve that."}, {"type": "sentence", "content": "I’m proof there is a guaranteed way to earn a living from blogging. And it’s not from writing on your blog."}, {"type": "sentence", "content": "It’s from writing on other people’s blogs."}, {"type": "sentence", "content": "If I can make a viable living from blogging on a part-time schedule, I know you can too."}, {"type": "subtitle", "content": "How This Mom Got a Handle on Blogging"}, {"type": "sentence", "content": "I’m a freelance writer. Most of my clients are blogging clients. In my first six months as a blog writer, I was able to replace my full-time income and work part-time hours."}, {"type": "sentence", "content": "See, I’m also a mother to twins. So, when my twins are at school, I work on my business and do the chores and cook. But, I never imagined this life for myself. All I wanted was to stay at home and raise my children."}, {"type": "sentence", "content": "I didn’t read blogs much; I didn’t even have a Twitter account. If someone asked me if I know what a good WordPress theme was, I would’ve looked at them funny."}, {"type": "sentence", "content": "With my background in education and psychology, after my maternity leave was up, the only thing I knew to do was to go back to work. My husband, fortunately, introduced me to the world of online freelancing."}, {"type": "sentence", "content": "I learned quickly that there were many moms — just like me — who decided to venture into freelance blogging and were making a decent go of it."}, {"type": "sentence", "content": "Armed with what little knowledge I had, I put up my writer website ­– with some help from my husband — and officially started to blog."}, {"type": "sentence", "content": "I wasn’t good at it. I had to learn how to format my posts and create engaging content."}, {"type": "sentence", "content": "But, I had the drive and passion for improving, and I built a loyal following over time."}, {"type": "sentence", "content": "Within a short time, I landed my first real client, who hired me to write for an online automotive newspaper. They paid me a recurring rate of $100 for an 800-word blog post. In my first official month of freelance blogging, I earned an easy $400."}, {"type": "sentence", "content": "And soon after, I broke $1000 a month."}, {"type": "subtitle", "content": "My Story Isn’t Unusual"}, {"type": "sentence", "content": "Don’t think you can’t achieve this with your own blog? If you have a blog and want to monetize it, instead of the traditional ways of sponsored posting and running ads, why not offer a service like freelance blogging instead?"}, {"type": "sentence", "content": "Michelle Schroeder-Gardner of the popular financial blog Making Sense of Cents is also a freelance writer. She was able to leverage her blog to land freelance writing gigs consistently."}, {"type": "sentence", "content": "And, what if you don’t have a blog? Can you still get paid to write? Just look at Harleena Singh. She’s recognized as the commenting queen and is the owner of one of the most popular self-development blogs online, A-Ha Now."}, {"type": "sentence", "content": "But, you know what? Before she had her blog and was named the commenting queen, she was a freelance writer."}, {"type": "sentence", "content": "So, if you love to write, and you’re a decent writer, then freelance writing can be your thing!"}, {"type": "sentence", "content": "Freelance writing gives you the freedom to:"}, {"type": "sentence", "content": "· Earn what you want"}, {"type": "sentence", "content": "· Work as many hours as you’d like"}, {"type": "sentence", "content": "· Choose what topics you want to write about"}, {"type": "sentence", "content": "· Develop expert knowledge of your niche"}, {"type": "sentence", "content": "· Write about fun and exciting topics"}, {"type": "subtitle", "content": "Earn Your First $1k From Blogging Now"}, {"type": "sentence", "content": "Not sure what steps to take to start your freelance writing path? Here are four steps you should follow if you want to open shop and get paid to write."}, {"type": "subtitle", "content": "1. Begin Guest Posting"}, {"type": "sentence", "content": "Are there several blogs you often frequent and enjoy reading? Take the opportunity to guest post on these blogs, and other blogs in your niche."}, {"type": "sentence", "content": "While it’s to your advantage to try and land guest spots on popular blogs like the Scary Mommy, don’t pull your hair out if it doesn’t happen."}, {"type": "sentence", "content": "You want to get your name out there and, for this to happen, you need to land several guest posts."}, {"type": "sentence", "content": "With each guest post you land, you can promote your services with your author bio. Mention you’re a freelance writer for hire and list your niches. When prospective clients read your post and see who you are, they may contact you for your services."}, {"type": "subtitle", "content": "2. Invest in Blogger Outreach"}, {"type": "sentence", "content": "It’s essential to network and connect with other bloggers."}, {"type": "sentence", "content": "I honestly believe I wouldn’t be where I am today if I hadn’t networked my butt off."}, {"type": "sentence", "content": "When I started freelance writing, I went to several blogs to learn about blogging and freelancing. I was ecstatic that bloggers took the time to respond to my comments, and doing this proved to help me gain more freelance writing jobs."}, {"type": "sentence", "content": "I’ve done this with other influencers as well, and it’s helped me increase my value as a writer."}, {"type": "sentence", "content": "So, part of your marketing strategy is to visit other blogs, comment on them, and share their posts. Connect with others in your industry and engage with them on social media."}, {"type": "sentence", "content": "You never know; one of these connections could lead to a paid gig."}, {"type": "subtitle", "content": "3. Grow Your Social Media Presence"}, {"type": "sentence", "content": "One thing I learned quickly was to start growing my social media presence. If I wanted the opportunity for bloggers to approach me, I had to be on social media promoting my content."}, {"type": "sentence", "content": "I started a Twitter and LinkedIn profile. I opened up a Facebook page for my business and also jumped on Youtube."}, {"type": "sentence", "content": "I tweeted my latest blog post and shared my client pieces. I also made sure to retweet any good posts I saw in my feed."}, {"type": "sentence", "content": "While I don’t have a lot of time in my day for social media, I dedicate a half-hour a day to update my profile and share other bloggers’ content."}, {"type": "subtitle", "content": "4. Get Out There and Pitch"}, {"type": "sentence", "content": "If you want to start landing writing gigs, the best way to do this is to pitch to job ads. Places like ProBlogger, Blogging Pro, and Freelance Writing Gigs post frequent job ads for bloggers and writers."}, {"type": "sentence", "content": "Visit them every morning and before you go to bed. You’ll have a better chance of landing a gig if you pitch close to the time the ad was published."}, {"type": "sentence", "content": "If you’ve done the first three steps, you can prove in your pitch that you are a legit writer (you have guest posts published) and are a credible writer (you have a strong online presence)."}, {"type": "sentence", "content": "I know it might seem scary to put yourself out there, but if you don’t try, you’ll never succeed!"}, {"type": "subtitle", "content": "Take the First Step"}, {"type": "sentence", "content": "Blogging can be a scary thing. You want it desperately to work out, but it’s a big risk. As a way to mitigate some risk, why not give freelance blogging a try?"}, {"type": "sentence", "content": "You can totally do this yourself."}, {"type": "sentence", "content": "What’s holding you back from getting out there and making blogging a living?"}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}