{"title": "Tardigrades — Microscopic Superheroes on the Moon", "data": [{"type": "image", "content": "https://miro.medium.com/max/864/1*iX25dArLvsyvd6_1T4Nonw.jpeg"}, {"type": "sentence", "content": "Boil! Deep-Freeze! Asphyxiate! Depressurize! Hyperpressurize! Starve! Irradiate with X-Rays! Dehydrate! Blast into Space! No, these aren’t a list of gruesome ways to kill a supervillain — they are methods that have failed to kill a certain creature, a few hair widths in size."}, {"type": "sentence", "content": "The 2018 Hollywood film Ant Man and The Wasp, had a breath-abating scene showing a deuteragonist, shrunk to microscopic size, dodging the probing appendages of a curious passing-by tardigrade. Although the superheroes in the movie were three human beings, these lingering laggards, casually drifting and chugging their way through the micro-world, have a formidable superpower repertoire."}, {"type": "sentence", "content": "On April 11th 2019, a private Israeli spacecraft crashed on the moon. The Beresheet lunar lander suffered an engine failure, crashed and spilt its contents, which besides the entire English Wikipedia library, the Torah, an Israeli flag and Israel’s declaration of independence, included thousands of these tiny creatures. The incident broached numerous ethical questions, including those of responsibility, accountability of private acts, and appropriating collective answerability. But why is the outlet of lifeforms in an anyhow inhospitable, unsustainable realm problematic? The catch lies in the nature of these wondrous beings. We apparently contaminated the lifeless chunk of rock with the most suitable candidates — the most resilient and persistent multicellular lifeforms of all."}, {"type": "image", "content": "https://miro.medium.com/max/1400/1*bbk77MChCvWEpxETmwCaZA.jpeg"}, {"type": "sentence", "content": "Also known as ‘water-bears’ and ‘moss-piglets’, tardigrades seem physically and environmentally invulnerable. These eight-legged, stocky, plump segmented animals measure half a millimetre when fully grown. They are ubiquitous — from the highest mountains to mudpools, Antarctica to Japanese hotsprings and brackish water to dense vegetation and soil. They have claws at the end of their stubby limbs. They are prevalent in mosses and lichens. They feed on tiny plankton, suck juices from algae, plant cells, mosses and lichens and eat small invertebrates like minuscule vermin, using their nozzled mouth equipped with sharp razorlike teeth. At times they even cannibalize."}, {"type": "sentence", "content": "In 1702, Dutch scientist Anton van Leeuwenhoek, one of the first to investigate a cellular basis to life, took some dust from a dry gutter and poured water on it. He then probed the sample with a self-made (sophisticated for his time) microscope. He observed that certain lifeforms, that he called “animalcules”, after their diminutive size, started crawling and swimming around soon after water was added. He reported his findings in a letter to the royal society. These were rotifers, a favourite food of the tardigrades. Tardigrades were discovered in 1773 by a German pastor named Johann August Ephraim Goeze. Italian clergyman and scientist Spallanzani, who discovered them residue procured from a rain gutter, named them such, meaning ‘slow-stepper’ after their laggard motility."}, {"type": "image", "content": "https://miro.medium.com/max/1012/1*9B14-JIOi20ojES1yqHmBA.jpeg"}, {"type": "sentence", "content": "The bulbous, stumpy-limbed appearance, and sluggish, foraging and scrambling motion of the tardigrades is deceptive. The animals are anything but helpless. They are adaptable in every regard, don’t fuss with any aspect of living, acclimatise easily, and have incredible resilience and endurance. In times of drought, they retract their limbs, contract and shrivel, turning into flaccid ‘resting’ stages called ‘tuns’, during which all metabolism almost ceases. It is this transformed phase that can endure exceptional excesses."}, {"type": "sentence", "content": "The Absolute Zero is the lowest limit of the thermodynamic temperature scale. It is commonly thought of as the lowest temperature possible. At this temperature, nearly all molecular motion ceases and near-perfect stasis is achieved. Particles practically stop moving, and a quasi-stasis is achieved. This occurs at -273.15 degrees Centigrade or 0 Kelvin. Tardigrades have been subjected to -272 degrees Centigrade, one-degree shyer of absolute zero, by immersion in liquid helium, and have rejuvenated. Tardigrades can resist appreciably, though not remotely as efficiently, temperature highs — they have been shown to withstand about 150 degrees Centigrade of temperature for short durations. (Very recent research has however found these to be a result of incomplete scientific investigation.)"}, {"type": "sentence", "content": "Tardigrades can take both high- and low-pressure excesses. They have been launched into space, tethered to satellites and exposed to potent, ionising cosmic radiation. Not only had numerous individuals survived in open space, where the triplet vagaries of vacuum, cold and radiation would respectively blow up, freeze and destroy your DNA, but females had laid eggs which hatched into healthy offspring. 68% of the tardigrades had reportedly made it. The radiation dosage incurred by casualties during the Chernobyl incident was of the order of a few ten to hundred Grays, the former can prove fatal. Tardigrades are able to withstand a few thousand Grays of gamma radiation. This enables them to survive outer space."}, {"type": "sentence", "content": "Humans, and most mammals for that matter, can bear few ten to hundred kilograms per square inch of sudden stresses and a sustained (gradually increased) pressure of a few hundred kilograms per square inch. A pressure of 21,000 kilograms per square inch will destroy any lifeforms, even bacteria. According to an experiment by scientists at the Kanagawa University, ‘tuns’ or dehydrated tardigrades can take twice as much, and survive (a vast majority of them). Their metabolism in this curled up, husk state, falls to 0.01% of their usual levels. This is a state of suspended animation, all but death."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*F87ISaFuu6bas65qQ2qmeQ.jpeg"}, {"type": "sentence", "content": "The key to a water bear’s survival is all but shutting down its life processes and metabolism and desiccating whilst maintaining its cellular structure. It can survive without water for several decades, even a century, which is hundreds of times its own lifespan. Once water is available again, following a drought spell, it can simply resume its life activities and go about as if nothing happened. Special secretions coat, crystallise and maintain various proteins in its body, into a stasis protected from lysing (cell-disintegration) and senescing (ageing) effects of free radicals, harmfully active chemical species, and radiation. They produce ice nucleation agents that offer crystallisation a ready alternative outside their body so that their cells don’t freeze. They protect their protein using special substances, as well. It seems dedicated secretions, and a host of chemical protections safeguard tardigrades. If Tardigrades were a comic book character, they could be an Alchemist or a “Potions-Man”, perhaps a warlock with a cauldron. But with radiation, they do suffer some damage — only that they can quickly repair it once they resume their animism. The exact measures underlying this multifaceted shielding, even that whether each individual defence has its own respective basis or stem from a singular bodily feature, is still dubious and ill-investigated."}, {"type": "sentence", "content": "“No animal has survived open space before,” Developmental biologist Bob Goldstein of the University of North Carolina was quoted in the New Scientist. “The finding that animals survived rehydration after 10 days in open space — and then produced viable embryos as well — is really remarkable.” This ability to survive in extreme conditions “might be important when we consider the habitability of other bodies in our solar system or beyond,” said astrobiologist Gerda Horneck of the German Aerospace Center in the same article."}, {"type": "sentence", "content": "Thus, our superheroes having likely contaminated an iota of the inhospitable bleakness of the moon with the resilience of life, and are resting there in their pods, very much alive."}, {"type": "sentence", "content": "The hardy creatures may not be individually immortal but as a species, they are veritably everlasting and will most likely survive a good time even after the Sun grows cold, for billions of years. Tardigrades have about 1150 species and have been around for over half a billion years ago, going by fossil records. They came into existence in the Cambrian Period, when complex multicellular organisms had just started to evolve. Mass extinctions are cataclysmic geological events or environmental catastrophes that prevail around the globe and obliterate most of the biota. There have been 5 such pan-planet events in Earth’s history. In their wake, life takes millions of years to recover to thriving and teeming proliferation. These great, pervasive phenomena include Global cooling and glaciation, aquatic anoxia, volcanism, the impact of extraterrestrial bodies and natural climatic change. Tardigrades have survived all these mass extinctions. It is time to see if they make it through the sixth — the most precarious, insidious and unfamiliar one — the human-brought Anthropocene mass extinction, the one we might just be living through."}, {"type": "sentence", "content": "Author: Pitamber Kaushik"}], "topic": "science"}