{"title": "My Facebook post went viral. It wasn’t what I expected.", "data": [{"type": "subtitle", "content": "Do you want to go viral? Think twice before answering."}, {"type": "subtitle", "content": "The lessons I’ve learned about marketing and hate."}, {"type": "image", "content": "https://miro.medium.com/max/6290/1*cNZ17AzCq8sIWYe_ggYjKw.jpeg"}, {"type": "sentence", "content": "It all started with a message asking to translate a sentence. The sender wasn’t somebody I know — just a stranger, who happened to visit my page. I did translate the sentence, asked for a like on the page, and thought that I could call it a day. Boy, was I wrong."}, {"type": "sentence", "content": "The person explained that I will help more from time to time (you read it correctly — explained, not asked) to which I responded that I don’t work for free and if a translation is needed — it will cost. As you probably already understood — it didn’t stop there, I’ve got a wave of messages with sentences to translate and just blocked the person."}, {"type": "sentence", "content": "I had a good laugh at the conversation and decided to share it in a Facebook group dedicated to freelancers. I took a few screenshots, removed anything that could give away the identity of the sender, and posted it in the group. I went on to live my life and didn’t think about it twice. Until the next morning."}, {"type": "sentence", "content": "I woke up, made myself a cup of coffee, and went to check what’s up on my socials. I had tons of notifications on Facebook, which is significantly more than my usual 3. What happened? Well, my post was approved by moderators a few hours ago and it already had hundreds of reactions and comments. Okay — that’s interesting, I thought to myself and went on to read what did people say. Rookie mistake."}, {"type": "sentence", "content": "D*ck, selfish, low-level, and so on. I’ve got called names. Online. In front of the entire world and by people I didn’t even know. I’m quite sensitive and I definitely wasn’t expecting that. My heart started beating like crazy and I felt anxiety coming around the corner. I made a mistake and it’s awful… I’m terrible… Stop. I put my phone away, took a few deep breaths, reassured myself that I’m not a genital and went on to evaluate the situation and learn what I can."}, {"type": "subtitle", "content": "People will hate"}, {"type": "sentence", "content": "I’ve always been afraid of negative comments — both to give and receive. Just by going to therapy and working with myself, I learned to not take it personally and be able to constructively express my emotion without being afraid of hurting somebody's feelings or looking weak. I’m learning to love myself and it’s a skill I’m nurturing daily, which, honestly, is way harder than I ever thought it could be. This post was the most serious test of my improvement yet."}, {"type": "sentence", "content": "People called me names and splashed me with negativity. I hadn’t experienced that since high-school and never thought I’d have to deal with it again. It made me question my integrity and whether I was actually a self-absorbed idiot. I felt bad and wanted to delete the post, but didn’t do it — I still stood behind what I wrote. My integrity and beliefs didn’t change and I still think that it’s ludicrous that people go around asking for free favors and others support this approach."}, {"type": "sentence", "content": "Before this incident, I never comprehended how much hate is out there and that so many people have time to just go and hate on others. I knew the saying “Haters gonna hate”, but I never experienced it with my own skin. Kudos to celebrities, who deal with that daily, I couldn’t do it. So I just turned off notifications and went on to work and focus on what matters."}, {"type": "subtitle", "content": "People will support"}, {"type": "sentence", "content": "On the other side of the table were people who supported me and laughed about the situation — which was my initial intention. They were replying to mean comments and telling there own stories of clients that were constantly trying to get freebies. I knew that I wasn’t alone. Others experienced such clients and had bad experiences too!"}, {"type": "sentence", "content": "Actually, the majority of reactions were positives and showing support, yet I had a hard time seeing them because my mind was focused on the bad ones. I consciously had to turn towards the good and, with the support of my family and close friends, rationalize this situation. Once I did it, I understood that this entire situation brought way more beneficial outcomes than not."}, {"type": "subtitle", "content": "Lessons"}, {"type": "subtitle", "content": "1. Conflict sells"}, {"type": "sentence", "content": "I analyzed why did this post do so well, while others where I genuinely tried to deliver value didn’t. The key component was the conflict between the two sides. I didn’t have to write a single comment and it got traction all by itself. People love arguing online and you just have to give them a topic to argue about."}, {"type": "subtitle", "content": "2. Be relatable"}, {"type": "sentence", "content": "My intension wasn’t to get known with this post or even get 10 likes. All I wanted to do was share a good laugh with fellow freelancers. I knew that people who work as freelancers experience this problem and that I’m not alone. I had a gut feeling that my chat will be relatable and the fact that it was made it grow and have a supporter-base. Even those who disagreed with me could relate to it — they could hate it. That’s what made it grow so quickly — the target audience was right."}, {"type": "subtitle", "content": "3. Focus and learn"}, {"type": "sentence", "content": "I could have spent all day replying to comments and trying to defend myself. I didn’t — I focused on delivering good content, making videos, writing articles, and doing what I can to help others and bring myself a better tomorrow. It can be extremely hard to stay focused on the main road and not distracted by all the fuzz that’s going around, but at the end of the day it doesn’t deliver value — nor to us, nor to the ones we care about. I took my lessons, understood my clientele better, and move forward better than I was. These are lessons that are insanely valuable and although my first viral post was driven by conflict — I got my first viral post and I could share my lessons with you!"}, {"type": "subtitle", "content": "Outcome"}, {"type": "sentence", "content": "The outcome as of now is that I’ve got new clients and followers. I’ve learned a bit about posting on Facebook and understood who my power clients are. It strengthened my character and now I feel prouder of myself than before. Doing something will lead to having people who will dislike and judge your actions, but as long as I know, who I am and what my values are — life goes on and I feel blessed for those lessons."}, {"type": "sentence", "content": "Let’s grab a coffee and up to the next challenges, cheers!"}], "topic": "social-media"}