{"title": "I Miss This Time, Already", "data": [{"type": "subtitle", "content": "THINGS I MISS"}, {"type": "subtitle", "content": "Why it’s possible to feel nostalgic for something that’s terrible and sad"}, {"type": "image", "content": "https://miro.medium.com/max/5978/1*eWNMBG9uitIFc0fxBq5mpg.jpeg"}, {"type": "sentence", "content": "In Regular Times, walking home through the East Village on the first warm evening of spring would be like swimming upstream. Groups of people would drink spritzes and rosés in the open-air bars on St. Mark’s Place. My neighborhood would normally be a noisy, multi-block fashion show of tourists and NYU students debuting their warm-weather ensembles."}, {"type": "sentence", "content": "But last week I took a walk around the East Village on a lovely, springy night and heard birds and the rustle of trees (debuting their new green leaves). It felt romantic even though, or maybe because, I was alone. It was nice to walk around a fairy-tale part of the city and not see couples caressing each other’s hair over a bottle of Lambrusco. On St. Mark’s, I was delighted by an unexpected scene: a jazz band played, wearing masks and toe-tapping at a distance from each other and onlookers, with a Venmo sign instead of a hat for cash and coins. People sauntered in the middle of the street. Bars had converted their big front windows into take-out operations, offering cocktails to go with ambiguous legal implications. The street had transformed into a New-Orleans-esque boulevard."}, {"type": "sentence", "content": "It’s the scene I’ll tell people about someday when they ask if I stayed in New York during the pandemic. Maybe they’ll ask if it was, in any way, kind of fun. I’ll squirm as I honestly reply, “Yeah, it was actually kind of fun… sometimes I miss it.”"}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*RM5EPg6dmAIslNK50I2qzA.jpeg"}, {"type": "sentence", "content": "In singular, beautiful moments like this, I feel something I call “pre-nostalgia”: preemptively missing the experience I’m already living. But how is it that I’m finding myself pre-nostalgic for the most egregious health crisis of our era? I think it’s the same reason I sometimes miss the time when I was in a hospital bed for weeks, or the way I get nostalgic for being in the throes of grief or heartbreak. We build a world in these times, and the world becomes our home, and we can get homesick even for places we hated."}, {"type": "sentence", "content": "It’s like how I miss the support group I joined after my father died, and I miss the occupational therapist who taught me how to walk again after an autoimmune disease temporarily took away my ability to move my legs. I have no reason to ever talk to these people again, and I feel nostalgic for our time together. Enduring a common storm is connective."}, {"type": "sentence", "content": "When the pandemic spread to New York and the city started to shut down, I kept wondering, “Will this ever feel normal?” Two months later, this is our shared world. It’s a manic and dangerous world, and the newspaper headlines read like a list of things to be upset and worried about. But even so, we’re doing what humans do exceedingly well — we’re adapting. And we’re forming bonds."}, {"type": "sentence", "content": "“Quarantine” is no longer a verb, but a distinct time in our lives. In the past couple months, many of us have experienced contentment or even joy in this new world we inhabit. I’ve discovered a bakery I really love because they’re the only one in my neighborhood doing takeout, and I know I’ll forever associate this era with thick slices of sourdough toast in the morning. I’ve discovered new bands I really like since March, and I wonder if I’ll forever hear them and think about this time with some strange and uncomfortable fondness. I’m already nostalgic for this time when a head of cabbage thrills me as much as ice cream or wine."}, {"type": "sentence", "content": "This has also been a time when we are all permitted to be a bit more raw and a lot more human. Just as St. Mark’s suddenly became an open-container free-for-all in which really anything goes, many social conventions have gone out the window, and traditional etiquette no longer feels relevant. Even the most professional of workplaces now acknowledge the existence of children as they’re likely to be running around during calls. Even the most down-to-business phone calls will often begin, “How’s your family’s health?” It’s a welcome change."}, {"type": "sentence", "content": "I know there will be a day when I’m sipping a spritz in a bar again, surrounded by people. It may be years from now but I believe it will happen — I can see myself trying to get a drink at the busy counter, the crowd elbowing each other to get the bartender’s attention. On that early evening, I see myself missing the creativity, appreciation, and connection that quarantine has kindled. I’ll recognize that it feels uncomfortable to miss something that has caused so much suffering, and yet, it’s the place where I lived for a time, along with every other person on the planet."}], "topic": "mindfulness"}