{"title": "Tell Yourself a Story From the Other Side", "data": [{"type": "subtitle", "content": "A mental exercise for when you’re feeling outmatched"}, {"type": "image", "content": "https://miro.medium.com/max/12096/1*xgjSYFDn0FtaKLhCJYxJIQ.jpeg"}, {"type": "sentence", "content": "Sometimes, when I feel outmatched by the thing in front of me, I do a little mental exercise: I pretend I’m on the other side and tell the story of what happened as if I’d nailed it. If I’m struggling to write, for instance, I might imagine being at some future book reading and telling the audience that I nearly gave up on the manuscript, but thanks to a push from my husband or an idea that came to me while I was making pancakes, I picked up the work again. I imbue my story with all the detail and color commentary that I might have otherwise attached only to the catastrophized version of my life. Call it a success fantasy."}, {"type": "sentence", "content": "This morning, I waited 54 minutes to check out at Safeway, standing in a line of carts that snaked up in the pet food aisle. The woman behind me, her hair and makeup perfect, had seven bottles of Martini & Rossi and nothing else. The young man behind her wore a full-face double-ventilator gas mask. No one was being particularly nice to each other, and I felt overwhelmed. So, right there, next to 25-pound bags of dog food, I told myself the story of the 2020 pandemic and how, in the end, we nailed it."}, {"type": "sentence", "content": "My success fantasy went like this:"}, {"type": "sentence", "content": "At first, it was awful. Nothing but bad news on top of bad news. A horrifying one-two punch of contagion, illness, and death, followed by unemployment, bankruptcy, and poverty."}, {"type": "sentence", "content": "But then we rose up."}, {"type": "sentence", "content": "We shared what we had. We made stews and soups for old people and dropped them off so they felt included and secure and nourished."}, {"type": "sentence", "content": "We read books to children over the internet."}, {"type": "sentence", "content": "We stepped outside our houses and clapped so each of us could see and hear that we were not alone. For the same reason, and others, we played saxophones from windows and pianos from balconies."}, {"type": "sentence", "content": "We sent pizzas and Chinese food to emergency rooms to sustain both our hospitals and our restaurants."}, {"type": "sentence", "content": "We walked every day, twice a day, six feet apart, saying hello to every neighbor and neighbor’s kid who had always been there but we were too busy to greet before."}, {"type": "sentence", "content": "We called old friends and told each other things we had forgotten to say: I miss you, I think of you, I still remember that time…"}, {"type": "sentence", "content": "We figured out how to use Zoom and Google Hangouts and Facebook Live so we could see each other’s expressions and hear the rise and fall of another human voice."}, {"type": "sentence", "content": "All of us turned up in our screens to keep businesses afloat, and in so doing, discovered the tender sides of our colleagues. Pets and children were, to our mutual benefit, now “in the frame.”"}, {"type": "sentence", "content": "We learned to draw, sew, and do magic tricks. We sang and danced and TikToked, creating a living art installation with a billion contributors."}, {"type": "sentence", "content": "People figured out they didn’t need fancy equipment to exercise."}, {"type": "sentence", "content": "We stopped flying around and jumping into cars without good reason. Everyone planted things they could eat. We cleaned out our pantries, finally."}, {"type": "sentence", "content": "We played cards with our families. We had very long conversations."}, {"type": "sentence", "content": "We stopped incarcerating so many for so little, seeing clearly that even in a home with people we love, containment is unnatural."}, {"type": "sentence", "content": "We discovered what kind of learning can be delivered online, freeing up classrooms to become places of lively debate and exploration. We discovered that teaching is the most complex, highest-impact profession known to humankind, and we started paying our educators properly for their irreplaceable work."}, {"type": "sentence", "content": "Everyone voted after the coronavirus. We were careful to look at past actions over slogans."}, {"type": "sentence", "content": "We discovered new heroes everywhere — a priest who, at the cost of his life, gave his ventilator to a younger person; brands and manufacturers that stopped making perfume and blazers and started making masks and hand sanitizers."}, {"type": "sentence", "content": "We became the first globally minded generation, making decisions in full knowledge that we are not immune from each other."}, {"type": "sentence", "content": "Kids who lived through the virus valued science above all, became researchers and doctors, kicking off the greatest period of world-positive discovery and innovation the planet has ever seen."}, {"type": "sentence", "content": "We came, finally and forever, to appreciate the profound fact of our shared humanity and relish the full force of our love for one another."}, {"type": "sentence", "content": "This essay was shared as a video piece on PBS NewsHour and can be seen here."}, {"type": "sentence", "content": "Consider yourself most welcome at BYOB, 15 minutes of notes and observations to get you over the hump. Live every Wednesday at 5 p.m. PST on my Instagram or whenever you want on IGTV."}], "topic": "mindfulness"}