{"title": "With Latinx Students Near 30 Percent of all Public School Students, Latinx Leaders Demand a Seat at the School Board Table", "data": [{"type": "sentence", "content": "It is time for Latinx communities to build the political power necessary to demand education reforms that benefit their children, several Latinx leaders argue."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*1LlUwjPDCKebwJO2sK8NOg.png"}, {"type": "sentence", "content": "by David Osborne, Director of the Reinventing America’s Schools Project"}, {"type": "sentence", "content": "It is time for Latinx communities to build the political power necessary to demand education reforms that benefit their children, several Latinx leaders argue. Within 16 months, 30 percent of all public school students will be Latinx, they pointed out during a recent Progressive Policy Institute webinar. But school boards often have no idea what these students need."}, {"type": "sentence", "content": "“A lot of the problem I see is that the people in power don’t even take the first step to understand who they’re dealing with,” said Ricardo Miguel Martinez, who founded and leads Latin American Parents for Public Schools (LAPPS), in Georgia."}, {"type": "sentence", "content": "“These systems were designed” generations ago by white people, added Cinto Ramos, president of the school board in Ft. Worth and the Mexican-American School Board Association in Texas. “Our whole system was designed in whiteness.” Latinx parents are rarely at the table when decisions are made, so “we district leaders have got to get ready to listen like we’ve never listened before.”"}, {"type": "sentence", "content": "Particularly now, the needs are acute. Many communities have suffered during the Covid-19 pandemic, but Latinx and black communities have suffered the most. They have lost jobs faster than white or Asians, and their death rates are higher."}, {"type": "sentence", "content": "“Most Latino families are low-income, and what we’re seeing is that low-income families are much more susceptible to health problems,” says Alma Marquez, who leads a public affairs firm called the Del SOL Group and founded La Comadre, a network of Latina women in California fighting to improve education for their children. “Only 15 percent of Latino parents can work from home, so most of them have to work outside the home, and that exposes them to this virus.”"}, {"type": "sentence", "content": "“We have people in our community that are already selling their cars and their possessions to pay for groceries and rent and keep the lights on,” Martinez added."}, {"type": "sentence", "content": "Martinez’s LAPPS organization has helped create a COVID Relief Fund, to provide money to Latinx and black families in crisis, and Ramos’s district has worked to get laptops and WiFi hotspots to Latinx students so they can continue learning from home. But all agreed that deeper reforms are necessary."}, {"type": "sentence", "content": "The first step, several argued, is to give Latinx parents real information about the quality of their children’s schools. LAPPS prepared an “Equity Report,” which showed the disturbing reality that in Atlanta Public Schools, only 16 percent of black students and 20 percent of Latinx students read proficiently. “We show people the graphs and charts about how we’re doing, and the first thing we see is the jaws drop,” Martinez said."}, {"type": "sentence", "content": "“If you do not have an Equity Report for your district, you need one.”"}, {"type": "sentence", "content": "The next step is to get parents to attend school board meetings and speak up. In Atlanta, LAPPS worked with the school board to pass the first language access policy in the state of Georgia. Other districts have begun to follow suit."}, {"type": "sentence", "content": "Parents should demand that the districts actively recruit quality Latinx teachers, the participants agreed. Districts should also create more options that fit the needs of Latinx students, such as specialized schools for recent immigrants, dual-language immersion schools, and career-tech high schools. In California, La Comadre is pushing the governor to mandate that districts create individualized learning plans for each English language learner, based on the success of a program in Modesto that has done that."}, {"type": "sentence", "content": "Rather than assign students to such schools based on where they live, districts should allow families to choose the school that best fits their needs, some participants added. “For Latino families, I think choice is something that could be of life or death importance,” Marquez said. “School choices really do dictate so much of family outcomes, socioeconomic outcomes, and as we’re seeing with this COVID crisis, health outcomes.”"}, {"type": "sentence", "content": "Both Marquez and Ramos noted that they had benefited from the opportunity, as Ramos put it, “to attend a better school than some of my neighbors were able to, than some of my siblings were able to.”"}, {"type": "sentence", "content": "They also stressed that schools need significant autonomy, so their leaders can hire more effective teachers and use their resources in more effective ways."}, {"type": "sentence", "content": "As an illustration, Beacon Network Schools Executive Principal Alex Magaña talked about the opportunity he had in Denver to transform a struggling district school — where 80 percent of the students were Hispanic and 96 percent qualified for subsidized meals — into an “innovation school,” with waivers from much of the bureaucracy’s red tape."}, {"type": "sentence", "content": "He and his teachers — all district employees — “redesigned the school to do something different for the population we were serving. We offer a unique program of enrichment activities [particularly through an extended day], personalized learning and blended learning [in which every student has a computer], and character development, or social-emotional learning.”"}, {"type": "sentence", "content": "Because innovation school status gave them the flexibility they needed to do all of this, Magaña and his staff succeeded. A few years later the district offered them a chance to take over another failing school, which they also turned around. Now they are an “innovation zone,” with its own board, which advocates for the school, defends its autonomy, and raises money to fund its many enrichment activities."}, {"type": "sentence", "content": "With their autonomy, the schools were able to pivot to remote learning almost immediately when the district closed down. “The students were not shocked,” Magaña said. “They knew where to go on their computers for their assignments. We can quickly make adjustments and changes to serve the needs of our kids; we don’t need to wait.”"}, {"type": "sentence", "content": "Marquez expanded on this theme in a subsequent interview: “We’ve got to trust educators at the local level, and too often, because of these big bureaucracies, and because people who work in them are disconnected from the daily realities that students and their families face, they just don’t have the connections to the students. We’ve got to trust that educators can make those decisions, and at the same time, we have to hold them accountable."}, {"type": "sentence", "content": "“We need to trust principals to hire their team. We need to trust that principals can be instructional leaders, who should have the autonomy to help others move out if they are not meeting the goals and vision of the school. In addition to hiring and firing their staff, we need to make sure principals are able to determine what resources are used where, with a very clear delineation that the kids who most need those resources get those resources. So we need to make sure that the money is being budgeted with an equity lens, that more of the money is going to kids who are furthest from opportunity. And we need to make sure that there is transparency and accountability about that money.”"}, {"type": "sentence", "content": "Martinez emphasized that schools should be made accountable to parents. “We‘re big on accountability,” Martinez explained, also in a follow-up interview. “Accountability means that the customers and the customer service are based on facts and decisions are based on facts and figures. The customers are the kids and their parents, and the customer service is the teachers and principals. The customer service in so many of these schools is horrible; parents are treated like dirt.”"}, {"type": "sentence", "content": "Marquez noted that accountability to parents can be made real by giving them the right to move their children to a better public school if they are not satisfied. “They deserve the same opportunity to choose a school for their children that upper income people have,” she said."}, {"type": "sentence", "content": "She added that parents should have the option of choosing public charter schools if they prefer them. “Latino families like the autonomy” charters have, she noted. “Latino families like the respect they get as customers” who can choose what’s best for their children."}, {"type": "sentence", "content": "But none of this will simply be given to Latinx families, Marquez and the others noted. Cinto Ramos, who described himself as “that pissed off parent who ran for the school board,” said Latinx leaders have not yet figured out how to mobilize their community to embrace its power. He quoted Martin Luther King: “You must have power with love. Power without love is reckless and abusive. And love without power is sentimental and anemic.”"}, {"type": "sentence", "content": "“We must lift our people into positions of power to fight for our children,” Marquez added. “Often those in power don’t want to hear from black and brown moms — and surely don’t want to give them any power. So we are raising our voices to them. We’re going to continue to push you, to embarrass you, to love on you, whatever it takes to make sure our kids get what they need. Because our kids only have one chance. They don’t get a do-over in 10 years.”"}], "topic": "education"}