{"title": "How to Start Meditating (It’s Easier Than You Think)", "data": [{"type": "subtitle", "content": "Let’s demystify meditation."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*GpxOimwpnqsmEIPw.jpg"}, {"type": "sentence", "content": "My eyelids fly open. For a moment, the world seems distant, but soon my brain starts firing in all directions. It’s morning, and that means another day of routines, chores, obligations, and racing thoughts."}, {"type": "sentence", "content": "This is just how my brain works. For the majority of the day, it doesn’t see relaxation as an option. Being lazy is an accomplishment for me because it means I was able to quiet my mind long enough to do nothing for a while."}, {"type": "sentence", "content": "I began dipping my toes into meditation years ago, though it took a lot of trial and error before it stuck. At first, it felt strange, even frightening, to look inward at my own racing thoughts when I spend so much energy trying to ignore them. Like a mosquito that survives countless attempts to swat it away, my inner monologue only became louder and more bothersome the more I tried to capture and quiet it."}, {"type": "sentence", "content": "But meditation doesn’t have to be scary, or complicated, or even difficult. It can be exactly what you need it to be in any given moment once you realize just how simple and straightforward the practice really is. Here are a few things I’ve learned that may help you start your own meditation journey and make the whole thing a little less intimidating."}, {"type": "subtitle", "content": "You’re not fixing anything"}, {"type": "sentence", "content": "I started meditating because I thought it could fix me. Fix my anxiety, my rumination, my mood, or whatever else what so out of whack inside my head. You’ll learn quickly, as I did, that practicing meditation isn’t an exercise in correcting thoughts but accepting them."}, {"type": "sentence", "content": "I know how ridiculous that sounds when you feel like all you want is for your brain to think differently, because I found it laughable at first, too. Fortunately, you’re not broken, so there’s really nothing to fix. Your thoughts are your thoughts, not a representation of who you are or your place in the world, and that’s a distinction that meditation instructors remind us of constantly."}, {"type": "image", "content": "https://miro.medium.com/max/15524/1*4HcDLjI2gCBMK_6h45IpzQ.jpeg"}, {"type": "subtitle", "content": "Thoughts come and go, if you let them"}, {"type": "sentence", "content": "Dwelling on certain thoughts or feelings — especially negative ones — is what leads many people to try meditation in the first place. They think (as I did) that meditating meant learning how to push out all the bad thoughts and welcome in the good ones. I’ve found that that’s not at all how it works."}, {"type": "sentence", "content": "Instead, the first exercises in any meditation course will teach you to let your thoughts flow with greater ease, rather than blocking them out."}, {"type": "sentence", "content": "Meditation instructors like to use different analogies for this. Some tell you to picture yourself on the side of a bustling highway, with your thoughts flying back and forth like cars in front of you. Others will ask you to imagine your thoughts as clouds passing overhead. Whatever the mental image you choose to conjure, the idea is the same: Let your thoughts come into view, acknowledge their presence, and then let them go. There will be another thought right behind it, and you repeat the process."}, {"type": "sentence", "content": "When you acknowledge your thoughts instead of spending energy to ignore them, it makes room for new, different thoughts. Those thoughts also pass, like cars on a highway or clouds overhead. Sometimes a thought comes by that looks a lot like a thought you had already. That’s okay, too. Acknowledge that thought without judgment, nod and smile, and see what thought comes next."}, {"type": "sentence", "content": "Some days you’ll notice a thought that just seems to be running laps in your mind. Treat that thought like all the rest. Acknowledge it and accept it as a thought and not as a reflection of who you are. Eventually, it becomes easier to spot those recurring thoughts, and, as you repeatedly observe them and accept them, they tend to get a lot less interesting."}, {"type": "subtitle", "content": "Live at your home base"}, {"type": "sentence", "content": "The concept of a home base comes up early in most meditation courses. It’s the idea of a centered feeling that you can return to whenever you need to refresh. The most common and popular home base is your breath. It’s easy to control your breath and breathing slowly and deeply is a great way to focus on the present moment rather than the past or the future."}, {"type": "sentence", "content": "This is really the core of most types of meditation. You find a comfortable, quiet(ish) place, close your eyes, get a feel for your body — any aches or pressure or tension should be acknowledged and accepted, rather than pushed away — and you focus on nothing but your breath. You follow each breath as it enters and leaves. Sometimes an instructor will tell you to visualize yourself breathing in healing energy and breathing out your worries and anxieties, but ultimately you’re focusing on your home base as much as possible."}, {"type": "sentence", "content": "Your mind will wander. It will always, always wander. When you notice it wandering, you bring yourself back to the breath. You’ll do this over and over and over again. You’ll focus on the breath, your thoughts will start to go off and do their own thing, and as soon as you notice it happening, you bring the focus back to your breath, your home base."}, {"type": "image", "content": "https://miro.medium.com/max/9824/1*HeFRcybpB8mNtXHkckZ6Qw.jpeg"}, {"type": "sentence", "content": "Don’t punish yourself for what your mind does. If it wanders off, you bring it back to your home base. That is the practice of meditation. It’s crucial to the entire process, and that’s something that took me a long time to grasp."}, {"type": "sentence", "content": "For some, the goal is to be able to return to their home base whenever they’re feeling stressed, even if they’re not sitting and meditating. For others, it’s a relaxation method that helps to clear the mind and refocus on what really matters at the moment."}, {"type": "sentence", "content": "Whatever your reason for considering meditation, science says it works. For conditions like anxiety and depression, research has shown that it can be as effective as medication. Or, it can be used in conjunction with medication, as an extra tool in your back pocket when you need it."}, {"type": "subtitle", "content": "Where to start?"}, {"type": "sentence", "content": "The really great news is that more people are practicing meditation today than ever before. It’s everywhere, but a few tools have emerged as being the best of the best for someone who is new to the practice."}, {"type": "sentence", "content": "Calm is my personal favorite. It’s packed with a lot of really useful stuff. It has everything from beginner courses to advanced lessons and calming music tracks and nature soundscapes. Calm’s Sleep Stories are relaxing readings voiced by celebrities like Matthew McConaughey, Laura Dern, and Stephen Fry. The Daily Calm, a new 10-minute meditation that pops up every day, is part of my daily routine."}, {"type": "sentence", "content": "Headspace is another super popular mindfulness and meditation app that many people swear by. I found it does a bit more hand-holding than Calm, which is great for beginners. It also has courses specific to anxiety, tools to get better sleep, and daily content."}, {"type": "sentence", "content": "Insight Timer takes a more community-based approach, with courses from thousands of different instructors that specialize in topics like anxiety, work stress, and relationships. Once you boot up the app you’ll see how many people are meditating using the app at that moment, bringing a real sense of connection to what you’re practicing."}, {"type": "subtitle", "content": "It’s a journey"}, {"type": "sentence", "content": "Whatever route you decide to take, remember that overnight transformations aren’t a thing. It takes time, practice, and dedication to not only get better at meditation but to notice the changes it can bring to your life. You can do it. ❤"}], "topic": "mindfulness"}