{"title": "Train Your Brain to Unleash Motivations and Get Things Done", "data": [{"type": "image", "content": "https://miro.medium.com/max/12032/1*QVVlnQbuFbcAd3JDJ3e7Ww.jpeg"}, {"type": "sentence", "content": "Let’s be honest. We’re in dire needs of motivations. Work from home was refreshing at first, but a couple of months have gone by, and our brains are getting tired of repeating the same routine. No one is perfect, so don’t blame yourself or feel guilty if you find your productivity slipping every once a while. We’re all humans. We’ve all been there."}, {"type": "sentence", "content": "I’ve been experimenting with lots of productivity techniques over the years. Well, it’s time to say that these techniques have stopped working during these unprecedented times. Our minds are confused, challenged, and starved of positive energy. As a result, this unexpected shift has made me rethink the framework to approach productivity."}, {"type": "sentence", "content": "Here comes my current framework of productivity thinking: The Brain Fitness. Train your brain the same way you train your body. To achieve this, I took some commonly known fitness training techniques and applied them to the types of work that require brainpower. Here are my favorite techniques you can try at home!"}, {"type": "subtitle", "content": "Warm-up, for your brain"}, {"type": "sentence", "content": "If you have ever done a HIIT workout or any kind of cardio, you know the hardest part is the beginning of the workout. Every time before I even get started, I already want to give up. After telling myself a hundred times that I need to get up and do this because it’s good for my body, I finally start the workout, with the first 10 minutes being absolutely miserable. My heart feels like it’s going to explode. I start to question why I am torturing myself. However, at some point, it gets easier, more enjoyable, and I feel stronger! I’ve never regretted any workout, and I always feel a sense of accomplishment afterward."}, {"type": "sentence", "content": "The beginning of a cardio workout, is similar to the moment when I decide to sit down at my desk every morning, staring at my to-do list. This was when I felt the least motivated. When I wasn’t feeling my best, I procrastinated on the tasks I knew I was supposed to start. I felt a sense of guilt after wasting a whole hour doing nothing. Then it got even harder to motivate myself. It was a vicious cycle."}, {"type": "sentence", "content": "What do we do to make a workout feel less miserable? Warm-up. We stretch and do simple, gentle moves to get our body ready for the real work. We don’t jump in and do 50 burpees right off the bat (at least it’s not recommended), so why do we expect ourselves to sit down at our desks and start tackling the difficult challenges right away?"}, {"type": "sentence", "content": "The way to motivate yourself in the morning is to ease into the harder part of the day. Try not to have an important meeting first thing in the morning. Don’t aim for solving the most difficult problems first thing in the morning. Instead, find simple, small tasks to do while sipping your morning coffee. And no, this doesn’t include checking your Instagram or Twitter feed. They do not count as brain warm-up activities. Mindlessly scrolling social media feed requires too little brain engagement. It’s like saying “I am going to sit here for 10 minutes to warm up for my HIIT workout.” 🙃"}, {"type": "sentence", "content": "Warm-up tasks to try in the morning:"}, {"type": "sentence", "content": "Depends on the type of work you do, this list could look different. As long as they don’t feel daunting to you, and don’t make you scratch your head for a solution, try doing them first thing in the morning for 20–30 minutes before marching on to more difficult ones. Once you’re done with the warm-up, you will feel like you’ve already accomplished something, and your brain is warmed up and ready for the day."}, {"type": "subtitle", "content": "Change it up!"}, {"type": "sentence", "content": "At the beginning of the quarantine, I set a goal for myself to work out every day. I did it for the month of March and April of 2020. What kept me going, was the variety of workout I tried. Cardio, strength, toning, pilates, yoga, dance, kickboxing, you name it. I didn’t care what type of workout I did or how long I did it for, as long as I did something, every day. I am very certain that if the goal was to do HIIT every day for two months, I would have given up one week in."}, {"type": "sentence", "content": "The process made me realize that both the body and the brain need novelty. It keeps the momentum going. Our brains need stimulation, otherwise, we get bored very easily and lose motivation. You can do this both at work and outside of work. If you’ve been doing the same thing for work, try a different way to complete your seemingly ordinary tasks. If work feels extremely boring to you, learn a new skill! You might end up finding something more enjoyable to do for a living. If you feel burned out after a whole day of being on conference calls, step away from your screen. Give your brain a real break. Change up the scenery, let your brain experience different things."}, {"type": "sentence", "content": "One of the best investments I made during quarantine, is a set of patio furniture I can do my work on. In the morning I sit indoors at my desk, when lunchtime comes around, I sit on my patio chair, close my computer, and enjoy lunch. Then I continue the rest of my day working on my computer in an outdoor environment. I didn’t realize how much effect this had on eliminating the sluggishness I sometimes have after lunch. I believe it can be attributed to a change in the environment. Plus the weather is so beautiful this time of the year! ☀️"}, {"type": "subtitle", "content": "Music"}, {"type": "sentence", "content": "What is absolutely necessary for a workout? For me it’s music. (If you work out in complete silence, my hat’s off to you.) When I was in the office, I didn’t want to keep my headphones on all the time, because I was afraid that I might look like I was ignoring others when they wanted to talk to me about something. Since WFH started, I’ve developed a habit to listen to background music the entire time I work. I can confidently say that music gives me a boost in motivation. I listen to a set of playlists dedicated to different types of work, so my brain associates different “working mode” with the playlists I listen to over and over again. Here they are."}, {"type": "subtitle", "content": "Morning playlists to lift the mood and boost motivation:"}, {"type": "subtitle", "content": "When I need deep concentration for solving hard problems:"}, {"type": "subtitle", "content": "When I need creativity:"}, {"type": "sentence", "content": "The idea is simple. Think of your 8-hour workday as a long workout. You start with a gentle warm-up to get ready for the journey. At first everything feels difficult but you just keep going, and eventually you reach a flow state. You are sweating (figuratively) but it feels good because you know you’re making progress towards the end goal. At some point your brain tells you’ve worked too hard and need a break. You change up your routine, do something different, and come back to the journey when your brain feels ready again. You repeat the same process, 3 to 4 times a day, all with the help of music. Before you realize, your long workout is over, and you feel so accomplished and ready to wind down. Happy WFH!"}], "topic": "productivity"}