{"title": "The best time to jump into business is now", "data": [{"type": "subtitle", "content": "Because the “perfect moment” may never arrive."}, {"type": "sentence", "content": "Although we don’t always notice it, little competitions are going on all around us. People compete to live in the best neighborhoods, raise smarter kids, get into the right schools, secure the best jobs, and have all the right connections."}, {"type": "sentence", "content": "The most enlightened among us realize that one person’s success in life doesn’t mean our success diminishes."}, {"type": "sentence", "content": "In other words, there’s room for all of us to succeed in life."}, {"type": "sentence", "content": "But for those of us still working on ourselves, the sense of envy and jealousy can sneak up on us without us even realizing it, especially when the spotlight is on one of our friends."}, {"type": "sentence", "content": "But what I’m not ok with is jealousy. It’s not a quality I like to see in myself or from anyone else. I believe it poisons our mind, warps our thoughts, and is a toxic substance to have coursing through our veins."}, {"type": "sentence", "content": "Yet here I was, soaking in a 55-gallon drum of it."}, {"type": "sentence", "content": "What prompted this feeling of competition/envy/jealousy in me?"}, {"type": "sentence", "content": "The morning news feed."}, {"type": "subtitle", "content": "The Professional Sideliners"}, {"type": "sentence", "content": "It was early Monday morning, and one of the headlines that flashed across my screen mentioned a hot new business concept opening up in Dallas. The idea was the handiwork of my friend, or should I say, a business acquaintance, named Harry."}, {"type": "sentence", "content": "And when I saw this headline, the first thought that slipped out of my mind was,"}, {"type": "sentence", "content": "I assumed Harry was semi-retired now after selling his last company, but here he was opening up a new business right in the front row of my industry. The spotlight was now on him in a big way, and I felt a shot of jealousy slip in through the back door of my mind."}, {"type": "sentence", "content": "Although this news story got a ton of hype online, the new business concept he was doing wasn’t — from my jealous perspective — that novel or original. It was an idea he, I, and others had openly kicked around for years as an emerging market opportunity and a new consumer desire."}, {"type": "sentence", "content": "I could have — and should have — done the concept myself."}, {"type": "sentence", "content": "I had all the right equipment, experience, and the expert team to do it. And I could’ve developed a much better business strategy, plan and concept than Harry."}, {"type": "sentence", "content": "But there was one giant difference between Harry’s business plan and mine:"}, {"type": "sentence", "content": "Because that’s what professional sideliners like me do: We study, research, investigate, analyze, assess, evaluate, model, and explore great ideas to consider doing “someday.” But making the commitment and investment to implement one of these great ideas, for real, right now?"}, {"type": "sentence", "content": "Hmmm."}, {"type": "sentence", "content": "“I’ll have to get back to you about this later.”"}, {"type": "subtitle", "content": "Dumb Luck"}, {"type": "sentence", "content": "I didn’t have much time to study Harry’s new concept in depth that morning because I had a full day of meetings ahead, “none of which,” I said under my breath, “Harry could ever lead.” (My sense competitiveness and need to compare myself to Harry was reeking out of me like the smell of foul insecurities.)"}, {"type": "sentence", "content": "While I needed to focus my mind and attention on the clients in the office right now, I had a storm cloud of emotional activity and questions swirling in my head."}, {"type": "sentence", "content": "The truth was, I had already achieved a decent level of success, and I had my time under the spotlight before. But now I wanted Harry’s success too, and the shine of his spotlight. That’s just greed and selfishness."}, {"type": "sentence", "content": "But I pressed on."}, {"type": "sentence", "content": "Harry was not nearly as strategic or analytical as me. He didn’t know how to read a spreadsheet or do a financial forecast, much less balance his checkbook. But, he didn’t need to do that now because he had a whopping sum of money in his bank account due to the sale of his last business."}, {"type": "sentence", "content": "Some called the success of selling his last business for a small fortune, “dumb luck.”"}, {"type": "sentence", "content": "Somehow that remark about “twice” was supposed to make us all feel better about ourselves, even though we hadn’t sold any businesses."}, {"type": "sentence", "content": "Yet here was Harry, about to do it again with his next big venture."}, {"type": "subtitle", "content": "The Deep End"}, {"type": "sentence", "content": "So what did Harry have over me — and the other 98% of people wanting to build a successful business?"}, {"type": "sentence", "content": "The ability to take action and make things happen."}, {"type": "sentence", "content": "He was impatient with theory and planning, and he preferred figuring the details out in the field."}, {"type": "sentence", "content": "Instead, Harry would jump right into the deep end of all his new business ventures, headfirst and often in the dark. He got bored with too much analysis. And he trusted his gut intuition far more than the expert advice."}, {"type": "subtitle", "content": "All Talk, No Action"}, {"type": "sentence", "content": "Most of us wannabe entrepreneurs and dreamers sit around all our lives pontificating about the great business ideas we’re going to do “someday” while critiquing and analyzing the concepts of others who’ve already implemented their plans."}, {"type": "sentence", "content": "We like to talk about what we’d do if we were in charge."}, {"type": "sentence", "content": "But guys like Harry don’t talk about their plans much at all. Nor do they waste time critiquing others’ work much, which makes them such a mystery and enigma. While we evaluate and assess, they take action and make things happen! And while we’re still waking up in the morning, Harry’s already opened the doors to a new business future."}, {"type": "sentence", "content": "The Harry’s of the World don’t ask for permission or consensus. They don’t need encouragement, green lights, the right opportunity, or the perfect moment. Instead, they just feel what the market wants intuitively, and do it before someone else does it."}, {"type": "sentence", "content": "They prefer action over clarity."}, {"type": "sentence", "content": "Execution over planning."}, {"type": "sentence", "content": "Actualization over speculation."}, {"type": "sentence", "content": "What’s ironic, though, is that as soon as guys like Harry announce their new business venture, it becomes evident to everyone else that this new idea is going to be a winner."}, {"type": "sentence", "content": "The next big thing, perhaps!"}, {"type": "sentence", "content": "Yet all of the armchair quarterbacks and sideline experts (me included)—who perhaps were the first to identify the curve on paper—grouse about how they were thinking about doing the same idea. But all they can do now is talk about what’s wrong with the concept Harry did and what they — in all their ivory tower, pointy-headed intelligence — would have done differently."}, {"type": "sentence", "content": "Thank God, Harry doesn’t listen to any of us. He doesn’t have time because he’s too busy making real stuff happen."}, {"type": "subtitle", "content": "The Caution"}, {"type": "sentence", "content": "Many of us, over-educated business “experts,” have a disease called paralysis. We’re too smart, analytical, logical, and precise to dare move forward with something bold. And we’re far too cautious, hesitant and, most of all, late in terms of getting into the pool."}, {"type": "image", "content": "https://miro.medium.com/max/5692/1*eNJMu_8f4yryf6gnCumxXQ.jpeg"}, {"type": "sentence", "content": "We claim to love the idea of swimming. And we like to talk about the big pool party were going to throw someday. But we get so fixated on waiting for the pool temperature to get just right. Making sure the chlorine levels are balanced, searching for the perfect bathing suit, putting on three different kinds of sunblock, and waiting for the lifeguard to arrive that we miss the whole swim season."}, {"type": "sentence", "content": "We then tell ourselves and our family, “Maybe we should wait until next year to get in the water.” And out of the extra measure of caution, everyone walks home with their brand new shorts on, dry towels in hand, and deflated pool floats."}, {"type": "subtitle", "content": "Time To Jump"}, {"type": "sentence", "content": "Despite what most believe, the hardest part of building a successful company is not coming up with a “great idea” or even the “right concept.”"}, {"type": "sentence", "content": "It’s getting your feet wet."}, {"type": "sentence", "content": "It’s taking the plunge."}, {"type": "sentence", "content": "It doesn’t matter how much research you do or how many business plans you write, starting a new business venture will always feel like jumping off the high dive."}, {"type": "image", "content": "https://miro.medium.com/max/6144/1*bpqSzANDiQAjtSzfIH4-Gw.jpeg"}, {"type": "sentence", "content": "And no amount of assurances or planning is going to make that scary, butterfly feeling go away. It all comes down to you and your naked curled up toes that have to make that dive. It takes guts, chutzpah, and courage. But after you have jumped off the high dive once, it gets much easier — and more fun — to do it again and again, as Harry did."}, {"type": "subtitle", "content": "The First In, Wins"}, {"type": "sentence", "content": "My friend Harry figured his career strategy out a long time ago. He knew he wasn’t as smart, creative, cultured, charming, or educated as his classmates. But what he did know is that most of us classically trained business graduates were far too cautious, methodical, and afraid of all the different things that could go wrong in a business that we’d never dip our toes into the water."}, {"type": "sentence", "content": "The thing about Harry is that he knows how to win by being more bold, daring, impatient, and impulsive than any of us. Instead of waiting to take swim lessons or get a degree in surfing, Harry just grabbed a board out of the sand — not even taking time to find the best or most perfect board — and got out into the waters to ride the waves of business. And it’s in those deep and rough waters where he learned how to sink or swim in business."}, {"type": "image", "content": "https://miro.medium.com/max/12032/1*z3zYZPSJrZd3V0SAgfV02A.jpeg"}, {"type": "sentence", "content": "Did he get his ass kicked?"}, {"type": "sentence", "content": "All the time."}, {"type": "sentence", "content": "And did the waves of business wipe him out at times?"}, {"type": "sentence", "content": "A lot."}, {"type": "sentence", "content": "Some of Harry’s initial business ventures didn’t work out so well, which we all enjoyed critiquing. But each time he failed, he’d head right back out in the water in search of the next big wave. And it was his 3rd, 5th and now 7th big waves that made him rich, famous and now a legend in his industry, henceforth my jealousy."}, {"type": "subtitle", "content": "The Gumption"}, {"type": "sentence", "content": "As I write this article, another one of my business acquaintances, Emanuel, announced his new book would be coming out in the fall. And I’m genuinely happy for him. Honest to goodness, I really am — no jealousy or envy about this one. (I’m evolving.)"}, {"type": "sentence", "content": "But is he the best person to write a book on this topic?"}, {"type": "sentence", "content": "No. Not even close. Even Emanuel admits that."}, {"type": "sentence", "content": "But he is the first person to write a book on this particular topic, and I think it’s going to be a big hit and probably the start of a new wave of strategic thinking in his field."}, {"type": "sentence", "content": "A publisher once asked me to put together a book outline. After she read it, she told me that I had at least five books in me. But I’ve yet to write the draft of even one book, much less publish any of them."}, {"type": "sentence", "content": "You can buy Emanuel’s book on Amazon, or you can listen to me sermonize over drinks at the bar about all the great ideas I have for the books I want to write… “someday.”"}, {"type": "sentence", "content": "What does Emanuel have that all the other experts and I don’t have?"}, {"type": "sentence", "content": "Nothing except gumption."}, {"type": "sentence", "content": "Emanuel took action and made shit happen."}, {"type": "sentence", "content": "He seized the moment, while all the other experts (like me), are still waiting for the right time to gather the facts and evidence. But once these experts read Emanuel’s book, they will waste even more time pointing out all the errors, while Emanuel will go to book signings and on the lecture circuit."}, {"type": "sentence", "content": "Let’s stop bullshitting ourselves. It’s time to stop futzing around with all the planning and get in the damn water."}, {"type": "subtitle", "content": "Make It Happen."}, {"type": "sentence", "content": "If your dream in life is to build a business. And if you’ve got a great idea — or even a half-baked idea — burning a hole inside you, grab a board — any board — and just get out in the water. Don’t overthink it or wait too long because you’ll miss the best waves. And you’ll find yourself sitting on the shoreline of business yet another season, which is all the time Harry and Emanuel need to Hang Ten."}, {"type": "sentence", "content": "Let’s make it happen, captain!"}], "topic": "startups"}