{"title": "Camels, Not Unicorns, are the New Darlings of Silicon Valley", "data": [{"type": "sentence", "content": "How being a “unicorn” is no longer enough as a startup — and could hurt you"}, {"type": "image", "content": "https://miro.medium.com/max/960/1*u0dW1wku7YtkmVCtYOXF7A.gif"}, {"type": "sentence", "content": "For most people, the search for unicorns ends around age nine or ten, when we realize that horses with horns on their heads aren’t going to come wandering out of the woods."}, {"type": "sentence", "content": "But for venture capitalists, and entrepreneurs seeking to launch or join early-stage startup companies, the quest for unicorns never goes away. Instead, the focus shifts — from a horse with a horn on its head, to a startup that’s almost as rare."}, {"type": "sentence", "content": "In business, “unicorn” describes any privately held company worth more than a billion dollars. The term first appeared in 2013, used by venture capitalist Aileen Lee, to indicate how rare these companies were to find."}, {"type": "sentence", "content": "Unicorns aren’t quite as rare as they once were. As of last month, there were an estimated 471 unicorns, and there are even new terms for even larger companies: a decacorn is a company worth ten billion, while a hectocorn is a company worth a hundred billion."}, {"type": "sentence", "content": "(In a biological sense, these new terms are ridiculous. Could you imagine a horse with a hundred horns? What’s the evolutionary reason? How would they all fit on its skull?)"}, {"type": "sentence", "content": "Finding a “unicorn” company, especially at an early stage (well before the company’s worth a billion dollars) is the goal of venture capitalists. Imagine if you invested in a breakout success like AirBnB, Lyft, Stripe, or Palantir before it was big! Depending on when the investment was made, this could lead to a 100x or 1,000x return on investment, or more."}, {"type": "sentence", "content": "At least, that’s been the strategy for the last five or six years."}, {"type": "sentence", "content": "But now, as the global economy shifts, the focus may turn from unicorns — to camels."}, {"type": "subtitle", "content": "Camel — Not Just a Company with Humps"}, {"type": "sentence", "content": "These days, a company is considered a “camel” if it is able to survive business downturns, changing economic conditions, and remain resilient."}, {"type": "sentence", "content": "As the COVID-19 disruption of our economy progresses, the attitudes, especially when it comes to investing in a rapidly growing, rapidly losing money startup, have started to shift from greed to fear. Many small startups are suddenly struggling to find customers, much less investors, while larger companies are working to reduce discretionary spending in order to preserve capital."}, {"type": "sentence", "content": "When things are rosy, the economy is climbing steadily towards new all-time highs, and there’s plenty of cash sloshing around? It’s easy to pitch investors on a money-losing startup."}, {"type": "sentence", "content": "But when the free money flow dries up, the stock market is teetering, and there’s a lot more financial uncertainty, it’s suddenly no longer a “smart play” to bet on a startup that will lose millions, for years, before converting to be cash flow positive."}, {"type": "sentence", "content": "Camel companies focus less on growth, especially when they have to subsidize that growth (and take a loss on every new subscriber or customer). They aim to take less total money from VC funds and manage their costs more tightly, looking to build a profitable, reliable core before chasing new ideas or endless growth."}, {"type": "sentence", "content": "If the company’s a camel, with the ability to conserve losses, preserve revenue, and out-last a [financial] drought, they’ll be more appealing in economic downturns."}, {"type": "subtitle", "content": "Camels vs. Whales"}, {"type": "sentence", "content": "Of course, being a camel company comes with trade-offs. In a bull market, when everything’s looking rosy, that strategy of not going all-in on the riskiest plays means that you may not grow as fast. You may lose market share or a competitive edge to the whales, who focus on growing as large as possible, as fast as possible."}, {"type": "sentence", "content": "Neither strategy is guaranteed to be better than the other. Consider two companies:"}, {"type": "subtitle", "content": "Uber — the whale"}, {"type": "sentence", "content": "Uber’s strategy has always focused on growth and dominating in its markets, rather than on profitability. Uber spends aggressively to expand into new markets, undercutting the competition and spending huge amounts on advertising, both to recruit drivers and passengers to its ride-share service."}, {"type": "sentence", "content": "Uber has also spent considerable funds on breaking into, or buying into, other areas of transportation beyond ride-share; they’ve gone into food delivery with UberEats, bike and scooter rental with Jump, and are a player in the autonomous vehicle development market."}, {"type": "sentence", "content": "Uber has grown immensely. The company took in 14.15 billion dollars in 2019 in total revenue. However, it’s spent — a lot — to get there. In 2019, Uber lost $8.5 billion. Despite all that revenue, they lost eight and a half billion dollars more. They lost more than the total value of WeWork, these days!"}, {"type": "sentence", "content": "At the end of December, Uber stated that they intended to aim for profitability by Q4 2020. This was before the impact of COVID-19 was realized, however, so that goal may be nothing but smog now."}, {"type": "sentence", "content": "Contrast this to…"}, {"type": "subtitle", "content": "Amazon — the camel"}, {"type": "sentence", "content": "Amazon is interesting. It’s often loudly pointed out how Amazon operated at a loss for many years — but much of that was because they spent so much money re-investing into their own growth, research, and development."}, {"type": "sentence", "content": "Amazon has certainly made forays into many other areas, most of which were partial successes at best, or horrible failures at worst. At various points, they’ve:"}, {"type": "sentence", "content": "Even though many of these forays into different sectors ended up not being successful, Amazon has built a solid core, with the majority of its income coming from their Amazon Web Services (AWS) offerings. Today, most of the web you know, including Netflix, Reddit, Pinterest, the CDC, Etsy, AirBnB, and more, all run on AWS."}, {"type": "sentence", "content": "Amazon is a camel, because even if its various forays into different tech and business sectors fail, it always has the core profit engine of AWS to keep the company going."}, {"type": "sentence", "content": "So far, Uber stock is up 11% in 2020 — but Amazon stock is up 31%."}, {"type": "sentence", "content": "Both of these companies have grown to behemoths, and would likely be considered success stories. But right now, as an investor, looking at the uncertainty in today’s economy, where would you put your money? Would you rather bet on the whale, with its goal of growing as big as possible, as fast as possible? Or would you pick the camel, which sacrifices some speed in growth to be more reliable in the face of economic downturns?"}, {"type": "sentence", "content": "I’d always heard a camel described as “a horse built by committee,” suggesting that it was a series of compromises. And they are strange, funny-looking creatures, lacking the grace of a horse. But while a horse is built for going fast, a camel has evolved for consistency and reliability, even in harsh conditions."}, {"type": "sentence", "content": "As markets struggle to understand the short and long term consequences of the COVID-19 impact on the global economy, camels may become the new darlings of Silicon Valley."}, {"type": "image", "content": "https://miro.medium.com/max/8744/0*J1nWzLlm0d743lRh"}], "topic": "business"}