{"title": "Building a Successful Startup Is Like Playing Smart Poker", "data": [{"type": "subtitle", "content": "You don’t want to be the gambler. You want to be the grinder."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*XLw-7fCmdA1AKHa9reIAIg.png"}, {"type": "sentence", "content": "I’m not what you’d conventionally call a high-risk investor. While everyone is trying to find the next Amazon at 10 cents per share, I’m looking for market inefficiencies that are artificially lowering the price of companies that make and sell the things that everyone needs."}, {"type": "sentence", "content": "I think this is because I learned about investing at roughly the same time I learned how to play poker. In both pursuits, I quickly realized that I’m not a gambler, I’m a grinder. I’m not looking to cover a bunch of risky losses with one big, risky win. Instead, I bide my time, read the table, build my stake, and wait for that one opportunity where I can strike. Then I take my gains and reload."}, {"type": "sentence", "content": "This strategy extends to how I operate as an entrepreneur. I like to think of myself as a startup assassin. I don’t build a company to raise a lot of money, establish a crazy valuation, then hope to cash in before it falls over. I build companies around market inefficiencies, and I spend my time seeking out opportunities, not accelerators."}, {"type": "sentence", "content": "My distaste for risk led to me quit investing in startups, because I just can’t subscribe to the venture capital model of covering 10 losses with one big win. That’s not to say that, as an entrepreneur, I won’t take on investors. But I’ve learned that I should only take on investment, and all the risk that comes with it, when it’s absolutely necessary. Because I still have a problem with being one of those 10 entrepreneurs that gets set up just to lose."}, {"type": "sentence", "content": "You should be thinking the same way as you build your startup. You shouldn’t be gambling, especially when the odds are 10 to 1. You should be grinding."}, {"type": "subtitle", "content": "Don’t follow the system"}, {"type": "sentence", "content": "One of the first things I have to teach new entrepreneurs is that there is no system for success. It doesn’t matter what type of company you start, the customers it sells to, or the price point of the product. If the entrepreneur follows a system or a template or a checklist, the startup is going to fail or, at best, stagnate."}, {"type": "sentence", "content": "Instead of worrying about some preordained plan, you should be solving a problem."}, {"type": "sentence", "content": "If your startup can solve a problem, you can exploit a market inefficiency, and then the game works almost like arbitrage. You fill that inefficiency gap until everyone catches up with you, and then you lap them because you’ve spent so much time focused on the problem that you’ve discovered additional problems to solve. This keeps you ahead of everyone else, and it sets up your startup for the long term."}, {"type": "sentence", "content": "It doesn’t matter how many cofounders you have, when you take investment, where that investment comes from, or how many connections you can call on. These things don’t create opportunity; they just drive acceleration."}, {"type": "subtitle", "content": "Opportunity always beats acceleration"}, {"type": "sentence", "content": "Opportunity is a slow and steady slog. Acceleration is a fast and sexy sprint. But if there is no defined opportunity, acceleration will just drive you into the ground. Or if the opportunity is misguided, acceleration will move you very quickly in the wrong direction. Both of these things will lead to failure."}, {"type": "sentence", "content": "You know the old saying about the sucker at every poker table? We’re all looking for the sprinter, the player who is going to put all their chips in without doing the math."}, {"type": "sentence", "content": "Another misconception among new entrepreneurs is that once a startup finds traction, it needs to raise money and throw all the sales resources that money can buy at that opportunity."}, {"type": "sentence", "content": "I said before that the game is like arbitrage, but it’s not exactly arbitrage. Traction in startups is more like an oil well. The opportunity can change direction on you while you’re digging, and it can also dry up."}, {"type": "sentence", "content": "The gambler move is to go all in on that first discovery of traction. The grinder move is to spend about a third of your time and resources building on that traction, another third of your time measuring as you go to make sure you don’t get surprised by a suddenly dry well, and another third of your time prospecting for a new source of oil."}, {"type": "subtitle", "content": "Don’t bet on the macro"}, {"type": "sentence", "content": "There are very few macro changes in the economy, the business world, or society that will impact every company equally — and we happen to be living one of them right now. The last economic shift of this magnitude was probably 9/11 or maybe the Great Recession. So think of it as a tectonic shift every 20 years, with the occasional near-miss every 10."}, {"type": "sentence", "content": "This also applies to business and consumer trends that happen fast and touch a lot of people. These kinds of trends might include the mainstreaming of smartphones, Bitcoin, a sudden shift to video conferencing, or an explosion of Fortnite dances."}, {"type": "sentence", "content": "Some of these you’ll have to comply with to survive; some of them you can ignore until they go away. But don’t ever bet your entire company on them."}, {"type": "sentence", "content": "Building a company on shifts in the macro tends to create a number of early false positives, like all those movie production studios who spent heavily on 3D technology. These positives then lead to the mass spending of resources on the acceleration of an opportunity that turns out to be a mirage."}, {"type": "sentence", "content": "Don’t get caught in that trap. Be pragmatic."}, {"type": "subtitle", "content": "There is no such thing as overnight success"}, {"type": "sentence", "content": "Windfalls are amazing, and they’re the lifeblood of all entrepreneurial strategy. They can be financial windfalls, marketing windfalls, positioning windfalls and even hiring windfalls. But no windfall sticks without putting in a shitload of work to build on the momentum until the next windfall comes along."}, {"type": "sentence", "content": "And sometimes windfalls don’t come again for a long, long time."}, {"type": "sentence", "content": "Startup is about runway and burn. You can have a tiny, little runway and low burn and succeed. At the same time, you can have a massive runway and huge burn and fail."}, {"type": "sentence", "content": "When it was still legal, I played poker online. I started with a free $6 promotion, playing penny games and building up to an amount that I feel sheepish talking about. It took time, it took a grind, it took a lot of windfalls, and it was crazy, hard work (but fun)."}, {"type": "sentence", "content": "I still play the game legally in casinos. And every time I’m walking the casino floor and I see someone hit a slot machine jackpot, all I can think about is how much they had to feed the machines over the years to get that one big payday. Are they up overall?"}, {"type": "sentence", "content": "Definitely not."}, {"type": "sentence", "content": "Being an entrepreneur and building a company from a startup is all about the long-term play. It’s about the grind. There’s no such thing as overnight success. Startup success isn’t about the once-in-a-lifetime idea, it’s about a lifetime of ideas."}, {"type": "sentence", "content": "Hey! If you found this post actionable or insightful, please consider signing up for my newsletter at joeprocopio.com so you don’t miss any new posts. It’s short and to the point."}, {"type": "sentence", "content": "This post was originally published in BuiltIn."}], "topic": "startups"}