{"title": "The Parent’s Guide to Getting Ripped”", "data": [{"type": "image", "content": "https://miro.medium.com/max/8490/1*m1SLUJmHoN4EGDtl54qjmw.jpeg"}, {"type": "sentence", "content": "This is a story about my husband, Greg, who created a workout program that hundreds of… possibly more… parents love."}, {"type": "sentence", "content": "It was a stupid idea to start with. I told him it was a stupid idea, but he just went along with it. I think Greg thought of it as a joke as well initially. Anyway, the idea was this. In Greg’s words, “functional exercises for adult men.” Let me give you a bit of a backstory. At the time we had just gotten Maxwell and Cedric. Every time we went to the groceries we had more and more things. When you have two growing boys you know how the shopping list piles up. Greg got sick of taking multiple trips to the car, so he started a workout program that first focused on becoming “strong enough for one trip from the car, no matter how many groceries you have.”"}, {"type": "sentence", "content": "It was about a sixty-foot walk from our car to the kitchen if you parked on the street. Less if you parked in the driveway. Far less if you parked in the garage, but we converted it to a little gym after this thing took off. Anyway, Greg drew out a one-hundred-foot track on our street. Just a couple of markers with chalk. We lived in a quaint suburban neighborhood, only a few blocks from the main road, but not many cars came by that didn’t live on the street. It was good for what he was doing and the neighbors didn’t mind. So he had a track. Now get this. He would just get grocery bags — as many as he could — stuff them with weights, and then walk the one-hundred yards down the road. Then he’d walk back."}, {"type": "sentence", "content": "He looked like an absolute idiot. At first, he started with just a few bags in each hand. He’d put a five-pound weight in each one. Then he had five bags in each hand. Then ten. He’d go up and down the block five times every day. Then he started throwing in a few lunging sets. I asked him why he didn’t just get a couple of fifty-pound dumbbells and work with that instead."}, {"type": "sentence", "content": "Honey, this is supposed to be functional. A dumbbell doesn’t replicate that feeling of the bags digging into your fingers. Or the weird wobble you get from the bags shifting around. Or the awkward steps you have to take from them hitting your thighs constantly."}, {"type": "sentence", "content": "I laughed. To be honest, it sounded dumb, but he had a point. Also, it gave him something to do. It also gave me something to do. Sometimes I’d join him. Sometimes I’d sit on the porch with the boys and read."}, {"type": "sentence", "content": "Then Greg got this idea in his head that just carrying the groceries wasn’t enough. There were other steps, like taking the groceries out of the car and putting them on the counter. He put a foldout table out front. He’d start with all of the bags on the table and pull them off, mimicking taking them out of the car. After each ‘grocery walk,’ he’d place the groceries on the table. That would alternate between a bicep curl and a high-pull."}, {"type": "sentence", "content": "Greg’s friends would come over every now and then. He’d show them the workouts. They laughed initially, but they ended up joining along. First, there were just three of them. Greg, his friend Jacob, and another friend Stephen. Stephen suggested that they also do carries with tote bags, since he and his wife, Jen, used totes. They added another routine that included walking with totes. Incredible."}, {"type": "sentence", "content": "Jacob was the one who suggested turning it into something functional for dads as well. The guy went out and got various weighted toddler dummies made. They were like little leather punching bags, but with arms, legs, and a noggin. They started doing exercises with them — shoulder carries, pulls, overhead presses. They figured these were pretty typical movements for fathers with small kids."}, {"type": "sentence", "content": "Oh, Stephen also thought that they should do mobility and agility exercises."}, {"type": "sentence", "content": "Kids will fucking wear you out man. First off, they’ll dash off and you have to chase them down. Then, you’ll realize you’ve pulled something that you didn’t know you even used."}, {"type": "sentence", "content": "So they started doing a sort of yoga/ pilates mix and put a small obstacle course out front."}, {"type": "sentence", "content": "A few fathers in the neighborhood joined. They’d all be doing this every night. Soon we had like a dozen grown men out there running around with these silly exercises. Greg knew that they had to make a real program, so he, Jacob, and Stephen sat down one day and did just that. They put them into segments and alternated the segments based on the day. It looked like this:"}, {"type": "sentence", "content": "A. Groceries (x5)"}, {"type": "sentence", "content": "B. Toddler Conditioning"}, {"type": "sentence", "content": "C. Agility & Mobility"}, {"type": "sentence", "content": "The thing just kind of exploded. During the week there would be between five to ten of them out there. Then more started coming. Then on the weekends, there would be thirty people turning up. Mostly older guys, but some ladies would join too. I would accompany the workout now and then. It was fun having a chat with everyone. Greg was way into it, and I loved that. A lot of the attendees wanted to pay Greg and the boys for their time, but they told everyone it was just for fun."}, {"type": "sentence", "content": "Eventually, there were so many people that the guys put up a site and a Facebook page. They called it The Parent’s Guide to Getting Ripped. We all laughed at the name. The three of them decided to not charge for any of it, but they did put up a donation link on the site. Quite a few people donated and the regulars donated consistently enough to where it was basically like paying for a gym membership. At first, it was just beer money, but now they’ve had to claim what they’ve been making."}, {"type": "sentence", "content": "Since there were so many people signing-up, they all decided to put the money back and get more equipment. They also rented a field on the weekend for training. More exercises were added. More weighted dummy babies were sitting in our garage. Stephen was putting content up each week. One of the attendees was a trainer at a local gym. They got some endorsements from them, and now twice a week they also teach a class at the gym itself."}, {"type": "sentence", "content": "How this thing blew up this much is beyond me, but I’m super proud of them, especially Greg."}, {"type": "sentence", "content": "They still do the exercises out in the front yard a couple of times a week. The other day I was out on the porch with the boys just watching, and everyone had finished up. Greg was busy talking with someone. One of the new guys, Chandler, came up to have a chat with me."}, {"type": "sentence", "content": "“So, how did this all come about?” he asked."}, {"type": "sentence", "content": "“Well, Greg and the guys wanted to put some exercises together for parents. They thought it would be cool and functional,” I chuckled as the thought of Greg walking around alone with grocery bags crossed my mind."}, {"type": "sentence", "content": "“Interesting!” Chandler grinned, “Do you two have any kids of your own.”"}, {"type": "sentence", "content": "“Well, we have the two boys here,” I pointed at Maxwell and Cedric who were sitting on either side of me."}, {"type": "sentence", "content": "Chandler got on a knee and patted their heads, “I’ve seen them around, they’re adorable dogs, what kind are they?”"}, {"type": "sentence", "content": "“Both Australian Shepherd mixes,” I replied."}, {"type": "sentence", "content": "A bit puzzled, he asked, “Have you both thought of kids in the future? I don’t mean to be impeding but I thought the workout was based on exercises for parents.”"}, {"type": "sentence", "content": "“No, no worries at all,” I said, “No plans at the moment. The boys are enough for us now. The whole parent thing was more Stephen and Jacob’s doing. To be honest, this entire thing started because Greg just wanted to be able to take all the groceries inside in one go.”"}, {"type": "sentence", "content": "Chandler looked up at me like he was going to say something but then had changed his mind. Then he laughed and said one last thing:"}, {"type": "sentence", "content": "Don’t we all."}], "topic": "fiction"}