{"title": "Take It From a Freelance Writer—You Don’t Want to Work From Home All the Time", "data": [{"type": "subtitle", "content": "But here’s how to make it work for you if Facebook and other companies get their way in setting the ‘new normal’"}, {"type": "image", "content": "https://miro.medium.com/max/12982/1*Kx7FGVnWUg2IWtsIWFhPSw.jpeg"}, {"type": "sentence", "content": "On May 21, Facebook became the first of the big tech companies to announce it would allow many of its employees to work from home permanently. Yes, permanently. Bye, bye Menlo Park enclave."}, {"type": "sentence", "content": "“It’s clear that Covid has changed a lot about our lives, and that certainly includes the way that most of us work,” Facebook CEO Mark Zuckerberg told employees at a live streamed meeting. “Coming out of this period, I expect that remote work is going to be a growing trend as well.”"}, {"type": "sentence", "content": "In what feels like a reverse call to arms, dozens of other white-collar companies are pushing their return-to-the-office dates far past states’ re-opening dates."}, {"type": "sentence", "content": "At the moment, many office workers are reacting to these announcements with joy. Working from home has its benefits—not the least of which is choosing not to put on pants if that’s your thing. With summer just around the corner in the northern hemisphere, not heading back to a windows-closed, overly air conditioned office may feel like the best news of all."}, {"type": "sentence", "content": "For the moment, it is. You’ve already dealt with the challenges of setting up a home office and child care. And now you get to keep up your new routine, as the weather turns nice? Amazing! And it is amazing. You should enjoy it. Because, trust me, the feeling will not last."}, {"type": "sentence", "content": "As someone who’s switched between office jobs and freelancing for most of her career, I can tell you that the work-from-home period you’re about to embark on will feel like freedom itself. And you’ll come up with plenty of fairly realistic schemes: You can rent a house in the country for a couple of months! You can drink your coffee on your front porch! You can take a 15-minute power nap between projects! You can keep on baking that sourdough bread in between calls! You can have a cheeky glass of wine at 5 pm (or 4 pm, who’s checking)! Your home is your oyster!"}, {"type": "sentence", "content": "But freedom from the office is kind of like the best dessert you can imagine: Incredible in the right quantities, sickening if you have too much. Below are six ways that you can have it and eat it, too, or something like that:"}, {"type": "subtitle", "content": "Remember, the WFH policy *isn’t* for your benefit"}, {"type": "sentence", "content": "Tough love: You know who benefits the most from a permanent work-from-home policy? One hint: It’s not you. It’s the company that sets it. Guess who suddenly gets to save a shit ton on their commercial real estate rent? Guess who doesn’t have to provide snacks and coffee? Guess who will decrease your salary if you live in an area of the country with a lower cost of living? (Answer: Facebook, which they kind of buried in their WFH announcement; and other orgs will likely to follow suit.)"}, {"type": "sentence", "content": "As for productivity, it turns out you’re actually likely to be more productive working from home. That’s certainly not harmful for you, it can be great! But remember that it’s your company that automatically benefits from that. So if your boss tries to position this policy as something you got to do rather than something you had to do—especially if the occasional WFH day had previously been treated as a benefit—well… don’t let them. Maintain perspective."}, {"type": "subtitle", "content": "Keep your personal growth expectations in check"}, {"type": "sentence", "content": "You’re a good worker; I can tell because you read articles about working. So I’m going to assume you’re good at multi-tasking, too. You may be able to fit more personal-fulfillment pursuits into your day when you work from home (like the aforementioned sourdough bread). But you may also find the lack of a typical routine to be challenging. It’s like the phenomenon where many people thought they would have more time to read in the pandemic, but are finding out that they’re reading less than ever before. In other words, saying goodbye to your commute doesn’t automatically mean you’ll use the found time to learn another language; you may, in fact, find out that that time you had to yourself evert day helped your mindset, almost like a meditation. So just remember, you may have more time for personal growth, but you will have to actively make sure you use it that way."}, {"type": "subtitle", "content": "Consider meditation or another centering activity"}, {"type": "sentence", "content": "Speaking of meditation, it’s a practice that, at its best, can help you maintain perspective about who you are. Not who you will be, not who you were—but who you are in this present moment. You’re going to have to learn to accept that person and understand that they are good enough. At home, you are a roommate, a partner, a mother, a father, an individual badass, etc. But in an office, people think of you differently—you exist in a completely different context and are appreciated for different skills and different daily interactions. Once you no longer have an office, it can be surprising to learn how much other people’s thoughts about you contribute to your sense of self-worth. (It was for me.) Working from home, you can absolutely still have that sense of self-worth, but you’re going to have work for it."}, {"type": "subtitle", "content": "Schedule social time with your cohorts"}, {"type": "sentence", "content": "And not just on Zoom. Assuming stay-in-place orders will be lifted at some point, if you still live near your co-workers, make an effort to see some of them on a semi-regular basis. In-person chatting is where all the good stuff happens — from ideas to real friendships. Those of us who are fully freelance quickly come to learn that talking to other people in our industry is one of the best ways to stay sane. If you have people in your actual organization to hang out with from time to time, all the better."}, {"type": "subtitle", "content": "Ask for regular reviews"}, {"type": "sentence", "content": "One detriment of the freelance life is that, unless you push for an awkward conversation, places you work for expect you will keep doing the same job for the same amount of money over years and years. You are entirely responsible for raising your value. Partly, that’s because in freelancing there’s typically no review schedule set in place. But keep in mind that it’s also easier to keep pushing off a scheduled review when someone’s face is not top of mind. It’s also easier for your boss to skip it entirely if your organization does not have a review policy. Sometimes, face-to-face contact spurs guilt for the employer. You can also spur a little guilt in the form of a requested review or call about a raise; in fact, I encourage you to do so. Don’t let them off easy."}, {"type": "subtitle", "content": "Put on some damn pants"}, {"type": "sentence", "content": "If I sound like a nag, well, it’s for your own good — so, sorry, not sorry. The first time I struck out on my own, I went so far as to set a rule that I had to put on pants with an actual zipper every morning. Some people still think that’s strange, especially in pandemic times. But if cleanliness is next to godliness, then stretchy pants are next to death."}], "topic": "freelancing"}