{"title": "A District of Factories, Cruise Ships, and Rabbits", "data": [{"type": "image", "content": "https://miro.medium.com/max/2900/1*rIMcTb3xGrn_WgGegnGB-w.png"}, {"type": "subtitle", "content": "A photo story about modernist masterpieces in Siemensstadt"}, {"type": "sentence", "content": "Siemensstadt is not how one might visualize a settlement designed for blue-collar workers. These quarters are more of a recreation area with a picturesque partly-wild park and a lake. I left my apartment at 5 a.m. on Sunday, and it took me 20 minutes by train to reach the station Siemensdamm. The first nice building I saw was one of the old Siemens facilities — its dark-brick texture reminded “Oreo.”"}, {"type": "sentence", "content": "However, I decided to visit the sleepy park Jungfernheide first — just before dog owners and joggers would invade it. And it was a damn good decision."}, {"type": "sentence", "content": "The name of the park Jungfernheide means something like “the heath of a young noblewoman.” In the 19th century, this territory used to be a royal hunting ground, later for a short period, it was a ground for military maneuvers. Still, it sometimes looks more like an untouched forest rather than a “civilized” park."}, {"type": "sentence", "content": "When I just entered, a fox stepped on the path in about ten meters. It looked at me for a while and started crossing the path very slowly, but once I tried to sneak the camera in my pocket — the fox disappeared. A few minutes later, I noticed a gang of fat-bottomed rabbits jumping across the lawn. And again, too fast for a shot. They suddenly dove behind a mossy stump, and I came closer to see how many holes they’d dug here and there — almost the first world war trenches. Eventually, only a majestic heron joined me to greet the first rays of the rising sun."}, {"type": "sentence", "content": "Staring at the sun, I noticed an old water tower on the horizon. Although it seemed pretty close, I had to cross a kilometer-long lawn in front of it. Meanwhile, the sun rose, and the birds’ singing got shouted down by the dogs’ barking — local dwellers went for a walk."}, {"type": "sentence", "content": "Before leaving the park, I looked back through the locked gates of the bathing pavilion and spotted another authentic German thing — a clock even in the place where you are supposed to lose track of time."}, {"type": "image", "content": "https://miro.medium.com/max/4338/1*b7bs00zo9hLrGjDgBfcFtw.jpeg"}, {"type": "sentence", "content": "The UNESCO World Heritage settlement is right beside the park. It’s neither an ornate gothic cathedral nor a prehistoric stone temple — not even a century old! Nonetheless, it belongs to so seriously protected sites. It appeared as a collaboration of the six greatest German architects, representatives of the Weimar-era modernism. The overall plan belongs to Hans Scharoun, whose more widely-known design, the Berlin Philharmonic, you might have seen before. Passing by the Philharmonic, I always imagine a golden-scaled dragon sitting on a rock, but in Siemenesstadt, his style is different."}, {"type": "sentence", "content": "My friend on Instagram wrote, “This is how you recognize Scharoun. I think he was raised by ships or something…” One of the most notable buildings in Siemenesstadt earned the nickname “Panzerkreuzer” (Armored Cruiser). Look at these rounded balconies — aren’t they gun shields?"}, {"type": "sentence", "content": "One more Scharoun’s masterpiece is the eastern ending of the curved house nicknamed “Langer Jammer” (Long Misery) by Otto Bartning. Scharoun’s part was added after the war, in 1956, whereas the rest of the blocks were completed in 1929–1930."}, {"type": "sentence", "content": "Unlike the “armored battleship” mentioned above, this piece resembles a different vessel — a cruise ship. It features portholes, colorful doors, and rosy balconies (or would it be more accurate to say “decks”?)"}, {"type": "sentence", "content": "The bright yet mild sun that day was a perfect setting for enjoying the architectural beauty, and now you’ll understand why."}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*_H1i6ilcWsi5vC9Mr2BbWw.jpeg"}, {"type": "sentence", "content": "Hugo Häring’s contribution to the settlement Siemenesstadt was nine ochre buildings of the same design. They didn’t gain “official” nicknames, so I labeled them “waffles” or “galettes” — such warm and delicious vibes they emanated. At some point, I even imagined dipping one of these cute buildings into a gigantic glass of milk."}, {"type": "sentence", "content": "In a couple of minutes, I approached Walter Gropius’s work, and the impression of it turned out to be quite different. Strict monochrome forms by the founder of the Bauhaus School starkly contrasted with the “galettes.” This geometry and minimalism might have influenced the inhabitants so that they don’t expose so much household stuff on their balconies. Or maybe it’s just because this building is facing the street."}, {"type": "image", "content": "https://miro.medium.com/max/11000/1*NPLgEylzvZLfd95f9_W8CA.jpeg"}, {"type": "sentence", "content": "Walking around the settlement, I ran into Häring’s brick warmness and Gropius’s cold minimalism combined. The building by Fred Forbat inherited the best parts of both approaches — the “cookies” and the “milk.” It might have been renovated recently, so squeaky clean the walls were. I suppose they seriously reconstructed everything around 2008 when the settlement got recognized by UNESCO."}, {"type": "sentence", "content": "Interestingly, overall modernist housing in Siemensstadt occupies much larger territory than the “UNESCO” section, and it’s all worth gazing at, too. For example, some houses are bent like snakes and hover over the streets. Above each arc, there are creative tiles or scenes, which don’t repeat twice. Some are large; others are tiny, practically invisible. My favorite one is a symbolic depiction of the four seasons."}, {"type": "sentence", "content": "Through the arches and across the Wilhelm von Siemens park, I moved to the gorgeous estate along Rapsstraße and Rieppelstraße. There is a memorial stone dedicated to Wilhelm von Siemens in the park — he is called the founder of Siemensstadt. Wilhelm von Siemens was a son of a world-renowned inventor, engineer, and businessman Werner von Siemens. The neighborhood Siemensstadt arose in 1899 when an electrical engineering company “Siemens & Halske” bought this territory and started building new factories out of brown and red brick. By the way, Siemens is the largest manufacturing company in Europe nowadays."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*dn0Y_QHxZCLOTz0gz19AMA.png"}, {"type": "sentence", "content": "But let’s get back to architecture. The atmosphere of the next settlement happened to be different from both Scharoun’s “fleet” or Häring’s “cookies.” This part consists of tile-roofed terraced townhouses and three-story blocks, which seem pretty rural."}, {"type": "sentence", "content": "To me, these cute houses are the most amazing in the dawn when the sun starts warming the pastel-colored walls. A distinctive feature of the settlement is the doors framed with white ladders, not to mention adorable green and blue shutters on the windows. All this beauty was designed in the 1930s by Hans Hertlein, who also is the author of Siemens’ brick facilities."}, {"type": "image", "content": "https://miro.medium.com/max/11000/1*artRI7RXSO2BhXBdlkygQw.jpeg"}, {"type": "sentence", "content": "It seems I came across the heart of this settlement, a miniature square and a fountain with a sculpture of a woman, Genoveva. She holds a bowl with water and is accompanied by a deer, squirrel, and birds. As for the house behind, it’s elegantly decorated with red rustic compositions."}, {"type": "sentence", "content": "Suddenly, I smelled the fresh pastries from a bakery on the corner. If you walk here early in the morning, don’t forget to enjoy a crusty bun, French-style croissant, or cinnamon snail."}, {"type": "sentence", "content": "I could wander around this settlement forever. It felt like being inside of a hyperrealistic diorama of an ancient fortified town with stone walls and gates. But an especially charming detail was a mini-tower topped by a weathercock swirling in the spring breeze. I wouldn’t have been astonished if, at some point, Rapunzel let her hair down from the upper floor."}, {"type": "sentence", "content": "This comparison isn’t accidental. Above almost all house entrances along Rieppelstraße, there are sculptures based on famous German fairy tales. I only managed to recognize the “Town Musicians of Bremen.”"}, {"type": "sentence", "content": "But I had little time left before the city woke up and contaminated the space with bustle and noise, this squealing, hissing, and rattling. So, here is the closing part of my journey — a set of three noteworthy vertical constructions: a church, a factory, and a monument."}, {"type": "sentence", "content": "The appearance of this church shouldn’t be a surprise if I tell you it belongs to Hans Hertlein, the same architect who designed Siemens facilities, including the one at the very beginning of this story. Formerly known as Protestant Church Siemensstadt, it is called Christopher’s Church, and that’s remarkable because the full name of the architect is Hans Christoph Hertlein."}, {"type": "image", "content": "https://miro.medium.com/max/6600/1*gkEWdRBfEO9jn6P0lKKF4g.jpeg"}, {"type": "sentence", "content": "My favorite thing about this church is the tiny golden pictures of a fish and a dove on the sides of the western portal. I’m pretty sure they refer to the Bible but also seem not less than cute out of context."}, {"type": "sentence", "content": "In ten minutes or so, I approached the Siemens tower. Well, yes, another tower and, of course, with a clock. But unlike other Siemens buildings equipped with a large tick-tock, this one is probably the most recognizable. And this eagle on a column is the Monument to the Fallen Siemens Workers, commemorating those who died in both world wars. The stone cubes hold the war years, and around three thousand Siemens employees’ names are engraved on the panels surrounding the square."}, {"type": "sentence", "content": "I should have finished the story because we’ve discovered a lot: a beautiful sunrise, graceful geometry, and even a fairy tale mood. But when Her Majesty Curiosity calls, I can never resist. Heading back to the metro station, I had the misfortune of looking at one of the visitor info stands and couldn’t go home without seeing one more place."}, {"type": "sentence", "content": "Behind the UNESCO World Heritage settlement, there is one more group of buildings, twice larger. These houses, designed by Hans Scharoun, were built in post-war years, between 1955 and 1961, and they all follow the same architectural leitmotif — a circle."}, {"type": "sentence", "content": "Quite a while ago, I read an article “Fine Art for Dummies” or something like that. It was a funny guide on how to distinguish between famous painters, for example, “If you see ballerinas, you are staring at Edgar Degas; if you are looking at Degas, you see ballerinas.” Now I can put together my piece of advice. Here you go, my friends, “If you see houses like ships, it’s Scharoun; if you want to find Hans Scharoun, search for the ships.”"}, {"type": "sentence", "content": "It turned out that in deck-balconies and porthole-windows were not enough, and Scharoun started playing with the layout. Sets of windows are arranged like checkers on the board or like grapes on the vineyard logotypes."}, {"type": "sentence", "content": "At first, I thought the porthole windows were non-openable but noticed some of them were turned horizontal. They had handles and latches on the inside."}, {"type": "sentence", "content": "The last shot with a nearly depleted battery was this juicy interior of the metro staircase. Owing to its vibrant color, I recalled that I wanted to buy a carton of orange juice on the way home."}, {"type": "sentence", "content": "P. S. During this adventure, I somehow managed to shoot a furry hunter. Unfortunately, it’s pretty blurred, but how close to me it walked! Siemensstadt is literally crowded with rabbits and foxes."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*9suZY2fYR-9blTVnZdsyqQ.png"}, {"type": "sentence", "content": "This article is part of the “5 a.m.” publication. Feel free to follow it if you are interested in more visual inspiration."}, {"type": "sentence", "content": "Feel free to get in touch elsewhere: Instagram, Twitter, Linkedin."}], "topic": "travel"}