{"title": "I Will Show My Love By Poking Your Lips In an MRI Machine.", "data": [{"type": "subtitle", "content": "Scientists have built a two-person MRI to scan couples’ brains during physical contact."}, {"type": "image", "content": "https://miro.medium.com/max/1440/1*CNQSz4zqkF5K52Da-55GsA.jpeg"}, {"type": "sentence", "content": "In a new study that reminds me of why l love science, researchers have invented a new way to show your partner love: an MRI built for two. That’s because brain scientists have become increasingly interested in how our minds respond to each other. We may think of ourselves as independent, but our brains actually have an interesting habit of syncing with each other."}, {"type": "sentence", "content": "To test how interaction shows up in the brain, researchers at Aalto University and Turku PET Centre redesigned an MRI machine. They divided the head coil used for regular brain scans into two separate coils. They ended up with a custom-built 16-channel (8 + 8 channels) two-helmet coil with two separate receiving elements. This allowed them to place two people close together in the MRI machine in a position to allow normal interaction and scan their brains at the same time."}, {"type": "sentence", "content": "Now the scientists could observe in real time what social interaction does in the brain. They asked 10 couples to participate. Couples were asked to lie facing each other so that they were touching, in a position the researchers described as almost hugging. They spent 45 minutes in the machine, while the MRI scanned their brains."}, {"type": "sentence", "content": "The fun part came when the couples were told to take turns tapping each others’ lips. Because nothing says, “I love you,” like poking your partner’s lips. Why didn’t they have them kiss or give some other more typical show of affection? Because in an MRI scan, even small amounts of motion blur the image."}, {"type": "sentence", "content": "So what happened when the couples touched each other’s lips? The brain scans shows activation in the motor and sensory areas."}, {"type": "subtitle", "content": "Why is scanning two people at once so exciting?"}, {"type": "sentence", "content": "When we interact with each other, we work hard to observe and understand each other. But we are not passive participants; we attempt to predict the other person’s reactions and behaviors so we can influence them. When it works well, we begin to mimic each other in our facial expressions and postures. Scientists believe that our brains start to mirror each other as our thoughts, emotions and sensory experience map and remap in our brains."}, {"type": "sentence", "content": "There is reason to believe that we attune to each other so well that our minds become “intertwined into a shared system facilitating reciprocation as well as anticipation of the other person’s acts, allowing distribution of neural processing across brains to aid, for example, problem solving,” according to the study. To me, that sounds a little like the cloud."}, {"type": "sentence", "content": "So far, studies using functional MRIs which use blood oxygenation dependent images (BOLD-fMRI) have helped us learn a lot about the brain. Such studies have even gone as far as mapping our decision making processes. But research has been limited by the fact that only one person fits in an fMRI at a time, making it hard to truly understand what happens when people interact in real time."}, {"type": "sentence", "content": "This study’s goal was not to discover anything new about human interaction, but to see if an MRI built for two would work. The proof-of-concept study, published in the theme issue “Social Interaction in Neuropsychiatry” of the journal Frontiers in Psychiatry, succeeded in showing that simultaneous fMRI scanning could produce quality images. And that means we can look forward to some very interesting research findings in the near future."}, {"type": "sentence", "content": "Meanwhile, I am definitely suggesting a two-person MRI machine for my next date night."}, {"type": "sentence", "content": "The results were published in the theme issue Social Interaction in Neuropsychiatry of the journal Frontiers in Psychiatry."}], "topic": "neuroscience"}