{"title": "Forward to Normal.", "data": [{"type": "subtitle", "content": "What is normal, anyway?"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*ttYTRQGnGkDiIWBT"}, {"type": "sentence", "content": "I woke up, fried an egg in a pan, tossed in some hot peppers, tomato, and onion. I let them all cook for a bit before throwing in spinach. Then I added some Tamari sauce, toasted a piece of Rye bread, and put it all on a plate."}, {"type": "sentence", "content": "I received a text."}, {"type": "sentence", "content": "“When do you think things will go back to normal.”"}, {"type": "sentence", "content": "Never, I thought. But I wanted to answer later, after I had enjoyed my breakfast. I knew my honest response would trigger rage."}, {"type": "sentence", "content": "But normal…Normal wasn’t a thing that existed outside. Normal was not stores being open. Even before this, I worked from home and hardly bought anything that wasn’t essential."}, {"type": "sentence", "content": "That was already my normal. It just wasn’t normal for others. But I still woke up and ate by 7:30 a.m., took a walk, showered, wrote, cleaned, worked from 12–4 pm, then exercised, ate dinner, and relaxed. That was still my schedule…practically unchanged."}, {"type": "sentence", "content": "Normal was just a combination of what you were used to doing, and what you wanted to do. Sometimes the two worked together, and sometimes they didn’t. Sometimes what you’re used to is more comfortable than what you want. And sometimes what you want is a destructive monster."}, {"type": "sentence", "content": "How was I going to explain that their normal had already been replaced…by whatever they’d been doing the past two months? Whether it was getting up early, cooking more, drinking more, creating more, talking about “when will all this end?” more, cleaning more, working more, working less…When was it going to dawn on them that there really was no pause?"}, {"type": "sentence", "content": "Time kept on. We did not pause. We did not freeze in time because stores and schools were closed. We got up every day and looked for new routines, new causes, new hopes, new hobbies, new worries."}, {"type": "sentence", "content": "We sought a new normal already."}, {"type": "sentence", "content": "I know what this person will say."}, {"type": "sentence", "content": "“I’m telling the kids it’ll be over soon. For them.”"}, {"type": "sentence", "content": "Yes, yes, for the children…the children who are just now learning how the world works, so if they grow up in the post-Covid world, they won’t even miss the pre-Covid world. They won’t miss festivals they had never been to. It’ll just be some cool, bygone era, the way my friends would dress as flappers in college."}, {"type": "sentence", "content": "Children adjust better because they don’t need to adjust at all. They don’t know to complain about taking their shoes off at the airport. They don’t cling to some before time the way adults do."}, {"type": "sentence", "content": "That’s our special flaw."}, {"type": "sentence", "content": "Clinging to before times."}, {"type": "sentence", "content": "The Tamari sauce worked so well with the onions. I enjoyed them. I popped the yolk and ate it with the rye bread. Next time, I thought, I would add just a bit of mayo to the bread. Just a sliver, and let it melt into the toast. Then, I could put the fried egg on top, a bit like a Benedict."}, {"type": "sentence", "content": "I had cleaned out my storage unit after my grandfather died of Covid. I wanted to see photos of him, and I found them."}, {"type": "sentence", "content": "I found other things. Silver. I used to buy and sell silver coins for extra money when I was in college. Buy low, sell high. I was happy I had some precious metals."}, {"type": "sentence", "content": "There was a photo of my grandfather in the cemetery, right after he had bought his plot. He was lying on top of it…on his side, a bit like a pinup model. He was smiling."}, {"type": "sentence", "content": "That was the photo I was looking for…the one that would remind me that he had a sense of humor about death."}, {"type": "sentence", "content": "After he had purchased his own plot, he called me."}, {"type": "sentence", "content": "“What are your plans for after you’re dead?” He had asked."}, {"type": "sentence", "content": "“I had hoped I wouldn’t have to make any plans after that, and I could just rest.” I had replied."}, {"type": "sentence", "content": "He had extra room."}, {"type": "sentence", "content": "“You bring the cards, I’ll bring the Monopoly,” he had said."}, {"type": "sentence", "content": "Only, because of Covid, he could not be buried with any of the things he wanted to be buried with."}, {"type": "sentence", "content": "I suppose I’ll have to bring both the cards and the Monopoly."}, {"type": "sentence", "content": "I had the photo. I cleaned out the rest of my storage unit, and emptied two bins."}, {"type": "sentence", "content": "Now the Makespace crew was coming back to pick up what was left and the empty bins. I cleaned my plate and pan and started to move the bins outside for the contactless delivery."}, {"type": "sentence", "content": "I remembered my phone. Normal. Normal. When are we going back to normal?"}, {"type": "sentence", "content": "Was this not normal? I felt normal. I had a dance class later today. I had a phone date with a boy at night. I had been taking Saturday dance classes every week since lockdown started, with the exception being the day of my grandfather’s funeral. Cleaning, emptying, moving, contactless delivery and pickup."}, {"type": "sentence", "content": "I didn’t know how to answer. I didn’t think anyone was going to go “back” to anything."}, {"type": "sentence", "content": "Just forward, forward, forward."}, {"type": "sentence", "content": "my books here < 3"}], "topic": "fiction"}