{"title": "Two Slack hacks that keep our design team connected", "data": [{"type": "subtitle", "content": "How I applied semi-technical solutions to human problems."}, {"type": "sentence", "content": "Like many product design teams, we embed our designers across various squads, an approach with at least two distinct upsides:"}, {"type": "sentence", "content": "There is, however, one distinct drawback: embedded designers can feel disconnected from the larger design culture. Put another way, it can be challenging to build a sense of camaraderie, culture and shared knowledge when designers are dispersed across squads. It can even have a negative affect on things like design consistency and awareness."}, {"type": "sentence", "content": "As a design director, I try to make up for those gaps. For example, I have weekly one-on-ones with each designer. In addition, I hold weekly team meetings with recurring topics as well as open time for anything anyone wants to discuss. In the studio, we do regular whiteboard sessions and face-to-face check-ins. (Remote designers don’t benefit here, but we do, of course, take advantage of all the latest design and collaboration tools including Figma, Slack, Miro, Milanote, Dropbox Paper, etc.)"}, {"type": "sentence", "content": "Nonetheless, some gaps persisted, so I started looking for more ways to help foster a supportive design culture. I came up with two other hacks—both in Slack—that have been helpful:"}, {"type": "subtitle", "content": "1. The Design Charrette channel"}, {"type": "sentence", "content": "We have a very open design culture; no black box design, we share our work early and often with our stakeholders, product partners and engineers. Sometimes, though, designers want feedback only from their peers. To scratch this itch, I created a Slack channel dedicated exclusively to getting help and feedback from one another. Called Design Charette, it’s a safe space away from the prying eyes of, well, everyone else!"}, {"type": "sentence", "content": "When a designer is stuck and wants advice and guidance from kindred spirits, or they just need fresh eyes, they post their work in the Design Charette channel, along with a request for help. These can be broad (e.g., “What do you think of this concept?”) or narrow (e.g., “Which of these two icons works better?”), or anything in between. Requests are accompanied by a screenshot or a link to an external design file. Screenshots have the benefit of immediacy, as no one has to travel out of Slack to see the work."}, {"type": "sentence", "content": "Designers usually start weighing in within a matter of minutes, particularly if the posting designer uses Slack’s “@here” tag to alert everyone online. The discussion typically starts with clarifying questions before narrowing in on suggestions and answers to the query. Within 15 minutes or less, the stuck designer has fresh insights, ideas and answers to their dilemma."}, {"type": "sentence", "content": "Asking for help doesn’t come naturally to all designers; some fear that it might be perceived as a sign of weakness, whereas others feel compelled to bang away at a problem until their nerves are shot. However, if our Design Charrette channel has proven anything, it’s that most designers are not only eager to help and support one another, but that they can do so in a spirit of generosity and goodwill."}, {"type": "sentence", "content": "The Design Charrette channel is not a secret; many on our larger tech team are aware of its existence. This has led to a pleasant side effect: when non-designers know a designer has sought and gotten feedback from the rest of the design team, even across squads, they often have more confidence in the design solution. For example, a product manager recently asked me if a specific design had been put posted in the Design Charrette channel. It was clear she felt more confident knowing the whole design team, regardless of squad affiliation, was supporting her project."}, {"type": "subtitle", "content": "2. Friday Morning Shots"}, {"type": "sentence", "content": "When designers are embedded in squads, they can develop tunnel vision. They’re only seeing their own projects, missing exposure to the work being done by designers in other squads. Moreover, they’re not getting the opportunity to learn and grow from one another, or to see where there might be inconsistencies in their own work vis a vis work being done elsewhere."}, {"type": "sentence", "content": "I considered scheduling regular design critiques, but the baggage of critiques filled me with a bit of dread. They can be lopsided and negative; participants often feel compelled to offer criticism without offering positive support; they’re often dominated by the loudest, most opinionated voices; and they add another meeting into already packed calendars. Finally, they may shut down more junior designers who need guidance and mentorship rather than criticism. And, while there are solutions to having more productive critiques, in general they’re better for single projects or teams, not across squads."}, {"type": "sentence", "content": "The solution I came up with was #FridayMorningShots. I use the Slack reminder function to notify the design team at 10:30 every Friday that it’s time to post their shots to the Charrette Channel."}, {"type": "sentence", "content": "The shot can be anything, but at a minimum, it’s a screenshot of what the designer has been working on for the past week. Or it can be a link to an external design file, a creative brief, user testing results—really, anything a designer did since the previous Friday they feel worthy of sharing with peers."}, {"type": "sentence", "content": "Designers post their shots with a brief explanation or description. Their peers typically respond with votes of confidence, often in emoji form, ❤️, 😍, 🎉, 👏 and 👍 being the most frequently used. Sometimes, their peers ask questions or provide feedback, even criticism, but it’s always offered in a spirit of goodwill and positivity."}, {"type": "sentence", "content": "As a design director, I’ve gotten better exposure to projects across squads thanks to #FridayMorningShots. I’ve also been able to connect dots between squad initiatives thanks to the exposure this ritual affords. For example, it recently became clear that two designers on different squads were working somewhat at cross-purposes; this wasn’t intentional, but it exposed a gap in our overall product strategy. We were able to close the gap thanks to the awareness #FridayMorningShots provided."}, {"type": "sentence", "content": "Perhaps the biggest surprise to me, however, is how much everyone seems to enjoy #FridayMorningShots. I was worried people might find it tiresome, another chore to tackle, but that’s not been the case. I get a little jolt of excitement when I see the 10:30 reminder and hear Slack’s little *ding* telling me shots are being posted. (I always try to post my own, too.) It’s so nice to read all the votes of confidence, the questions, the feedback, and bask in the glow of camaraderie with my fellow designers."}, {"type": "sentence", "content": "I believe these softer, squishier benefits are as important as the pragmatic benefits the practice provides. In other words, #FridayMorningShots does something a normal design critique rarely does: it makes people happy."}, {"type": "subtitle", "content": "It’s not about Slack"}, {"type": "sentence", "content": "The Design Charrette channel and #FridayMorningShots have had a positive impact on our design team’s culture and effectiveness, but they’re not reliant on Slack; most messaging tools could be used in a similar way. It’s not about a technical solutions, in other words. It’s about finding unique, creative ways to fill gaps, build connectedness, improve insights, and foster camaraderie."}, {"type": "sentence", "content": "As of this writing, we’re still sheltering in place, working from our respective homes, even more atomized than usual. Any way we can find to stay connected and supportive of one another is a huge bonus."}, {"type": "sentence", "content": "So, what hacks have you come up with to improve your design team culture?"}], "topic": "design"}