{"title": "The 6 Habits of Kind, Generous People", "data": [{"type": "subtitle", "content": "Instilling confidence in others is a choice"}, {"type": "sentence", "content": "As a shy kid, I was in awe of confident people. The way they moved. The way they spoke. This admiration continued with me well into my thirties. I wanted to be like them."}, {"type": "sentence", "content": "Today, however, at the age of 41, I don’t really care if someone exudes great confidence or not. Nor do I look up to people because society deems them successful."}, {"type": "sentence", "content": "The people I admire most are kind. They are generous. Those who do what they can to instill confidence in others. The people who make others feel truly seen."}, {"type": "sentence", "content": "I wish I had come to this conclusion earlier in life. Emulating the actions of the kind and generous people around you is one of the best decisions you can make."}, {"type": "subtitle", "content": "1. They are masters of the follow-up"}, {"type": "sentence", "content": "I’ve lived in Spain for ten years. During this time, it’s been hard to keep in contact with old friends. Every few weeks, however, like clockwork, a friend of mine reaches out."}, {"type": "sentence", "content": "This same person has four kids and owns a decent-sized business. I’d be naive to think I’m the only person who he treats this way. The reason for his success is obvious: he cares."}, {"type": "sentence", "content": "Check-in on people. Kill people with kindness in the follow-up. It doesn’t have to be something big. It could be a book recommendation based on a recent conversation. Or just to simply say hello."}, {"type": "sentence", "content": "“I miss you.” “I saw something and thought of you.” These phrases light people up. This is especially true in trying times like we are all going through now. They let people know you are there for them. Little, yet consistent acts of kindness, lead to strong, long-lasting relationships."}, {"type": "sentence", "content": "Being a person who follows-up is a choice."}, {"type": "subtitle", "content": "2. They give their best ideas away for free"}, {"type": "sentence", "content": "I was hesitant to ask my friend if I could write about a great idea he once shared with me. I thought maybe he wanted to keep it for himself. “I’d be honored,” he replied."}, {"type": "sentence", "content": "Kind people proactively connect people. If generous people come across something that could help you grow their business, they share it with you."}, {"type": "sentence", "content": "The best relationships are always forged when two people give without expecting anything in return. It’s hard to lose if you choose to not keep score. Generosity is the true currency of friendship."}, {"type": "sentence", "content": "Being a giver is a choice."}, {"type": "subtitle", "content": "3. They are quick to forgive people"}, {"type": "sentence", "content": "I made a mistake. A man I greatly admire reserved an hour of his day to help me with a project. I put down the wrong day on my calendar. An hour before the meeting his assistant called to make sure I had directions. I was in Italy."}, {"type": "sentence", "content": "After sending an apology I called my mom to vent. “See how he responds,” she replied. “Everyone makes mistakes. He knows you. If he’s the person you think he is, he won’t sweat it.”"}, {"type": "sentence", "content": "Later that night the man sent me a picture of him and his daughter at the beach. He thanked me for freeing up that time and he sent an option for the following week."}, {"type": "sentence", "content": "There are worse things in the world than missing a meeting. People will do things you don’t like. Regardless, look at people as a whole instead of a single sum of their many parts. The faster you choose to move on when things go wrong the more of an impact you’ll make in the world."}, {"type": "sentence", "content": "Forgiving people is a choice."}, {"type": "subtitle", "content": "4. They ask themselves who needs them"}, {"type": "sentence", "content": "Each morning, during the four years Viktor Frankl spent in concentration camps, he reminded himself of who was going to need him when he got out. He would later say this was one of the main reasons for his survival."}, {"type": "sentence", "content": "Kind, generous people reserve time to think about the wants and needs of others. They ask themselves who needs them."}, {"type": "sentence", "content": "By all means, keep your own to-do list of the things you need to do each day, but don’t forget to also keep a tally of the ways you can support other people. Helping other people enriches our lives. It is the fastest way for each of us to feel truly successful."}, {"type": "sentence", "content": "Prioritizing others is a choice."}, {"type": "subtitle", "content": "5. They treat their word as gold"}, {"type": "sentence", "content": "Kind, generous people pride themselves on keeping their word. They know that trust is everything."}, {"type": "sentence", "content": "This doesn’t mean, however, they are pushovers and their kindness leads to their own detriment."}, {"type": "sentence", "content": "Quite the contrary. Kind, generous people are quicker to say no than most. They take the time to identify when, where, and with whom they are best served. Saying yes to everything spreads them too thin. They know they won’t be of use to anyone if they are busy all day."}, {"type": "sentence", "content": "When they do say yes, however, unless a true emergency comes up, consider their word as good as gold."}, {"type": "sentence", "content": "Being trustworthy is a choice."}, {"type": "subtitle", "content": "6. They take the time to truly see others"}, {"type": "sentence", "content": "I was on a phone call with a leader in the tech space. I asked her what most attributed to her success. She replied that she writes down the times she feels like she is truly seen. It serves as a reminder to do the same for others."}, {"type": "sentence", "content": "Kind, generous people approach their interactions with an open mind to learn as much as they can about the people they meet. They pocket their agenda for later. Experience has taught them empathy is the key to truly being able to see."}, {"type": "sentence", "content": "Listen and observe before you speak. If your immediate impression isn’t a strong one, take a step back to get a better view."}, {"type": "sentence", "content": "As human beings, we all like different things. The people we deem the most valuable, however, focus on learning what the people around them truly value."}, {"type": "sentence", "content": "Being present is a choice."}, {"type": "sentence", "content": "When it comes to better navigating life, keeping track of what brings people down is an effective exercise. Don’t underestimate the power of simply taking note of the actions that light people up."}, {"type": "sentence", "content": "Who knows, by emulating the actions of kind and generous people, you may find that you don’t have to worry so much about raising your confidence."}, {"type": "sentence", "content": "Building up others has a funny way of making us stronger."}, {"type": "sentence", "content": "Join my fluff-free newsletter to receive my latest posts each week."}], "topic": "leadership"}