{"title": "Are We All Responsible for the Death of Hana Kimura?", "data": [{"type": "image", "content": "https://miro.medium.com/max/1600/1*EwQbd_bZCnBDVbytueA-Xg.jpeg"}, {"type": "sentence", "content": "TW: Suicide, self-harm, mental illness"}, {"type": "sentence", "content": "I was up late on Friday night, struggling to fall asleep in the sticky heat of my childhood bedroom. My mindless scrolling was stopped short when I saw a photograph of a familiar, smiling face and the caption “please don’t let this be true.” Suddenly even more awake, I clicked through and read a headline I could not have predicted in a million years: Hana Kimura had taken her own life."}, {"type": "sentence", "content": "Kimura had been a regular presence in my life for the better part of the last year. As a devoted Terrace House fan, I became acquainted with her when she joined the cast of the popular Japanese reality show in September 2019. With her bright pink hair, tan skin, and infectious laugh, she was a welcome change from the lineup of porcelain models that the show has a habit of casting. Kimura was a well-known professional wrestler, and embodied the strength of her profession while remaining butter soft at heart. Some fans saw Kimura as irritating and immature, particularly when she began her romantic pursuit of housemate Ryo Tawatari, a professional basketball player. Yet, each time Kimura laughed a little too forcefully or struggled to hide her jealousy, I could only see myself in her. It’s a near-universal experience shared by unique women to face the pain of rejection on the basis of that uniqueness. Or, more simply put, to watch the object of your desire opt for someone blonde."}, {"type": "sentence", "content": "The critique Kimura received for her pursuit of Tawatari provided plenty of fodder for the denizens of Twitter. The vitriol aimed at Kimura escalated even further, though, following an incident between Kimura and fellow housemate Kai Kobayashi. After Kimura left her expensive, custom-made wrestling costumes in the laundry, Kobayashi failed to check the machine before doing his own washing and ultimately destroyed her costumes. There was a heated confrontation on the show, after which Kobayashi ultimately apologized and he and Kimura reconciled prior to Kobayashi’s departure from the show not long after."}, {"type": "sentence", "content": "While the incident seemingly blew over in the minds of the housemates, the internet refused to let it rest. It seems so trivial in retrospect, but as we all know the faceless population of Twitter and the like are capable of ruining someone’s lives with a breadcrumb. In the hours before her death, Kimura took to her own Twitter to share a sampling of the messages she was receiving on a daily basis, all suggesting her worthlessness. In the posts she made in the hours before her death, the implication was that her decision to take her own life was directly connected to the relentless cyber-bullying she faced. She was just 22 years old."}, {"type": "sentence", "content": "Though Terrace House first began airing in Japan in 2012, it wasn’t until Netflix began distributing the Opening New Doors season in 2017 that popularity truly exploded stateside. With the rise of series came a slew of thinkpieces touting the show as a balm to everything wrong with Western TV. The Verge referred to the program as “the nicest reality show on TV,” Refinery29 praised it as a form of “gentle hypnosis,” and CNET dubbed it an “antidote to a world gone mad.”"}, {"type": "sentence", "content": "It’s true: a major part of Terrace House’s appeal is in its mundanity. The show regularly features housemates lovingly preparing home-cooked meals, going on adventures in the Japanese countryside, or spending time reflecting and sharing dreams and goals. Yet, for as long as the show has inspired viewers to be their best selves, it has also harbored a much less-discussed dark side. In 2018, my friend and fellow writer Annelise Giseburt explored the show’s complicated and troubling discussions of consent. Earlier this year, The Japan Times published a piece questioning the one-sided dynamic between current housemates Toshiyuki Niino and Yume Yoshida. Yet, to the average viewer, these troubling relationships are often written off as mere “cultural differences.”"}, {"type": "sentence", "content": "Yes, there are differing social norms in Japan when it comes to romantic relationships. Yet, the tensions inherent in the relationships above and the treatment of Hana Kimura stem not from “cultural differences” (surprise, being an asshole is a universal concept) but from the idea that these individuals are fictional, impenetrable characters rather than flesh and blood."}, {"type": "sentence", "content": "While trying to parse Kimura’s tragic passing, I couldn’t help but be reminded of the late Goo Hara, a K-pop idol and outspoken individual who was similarly driven to take her own life after receiving incessant criticism on social media. Hara was a victim of an industry that pushes young women to their physical and mental limits for the sake of creating an escapist fantasy in which listeners can immerse themselves. So too does Terrace House allow viewers to exist in a picturesque world — at the expense of six young men and women allowing the most intimate possible look at their day-to-day lives."}, {"type": "sentence", "content": "Since Kimura’s passing, calls to cancel Terrace House have begun to sprout. Some see it as inevitable, feeling that Netflix will seek to immediately divorce itself from the program in order to maintain its image. Other armchair theorists can’t imagine how the show would be able to proceed in light of the editing and filtering that would be required to avoid showing housemates in a “bad light.” At the very least, all seem to agree that mental health services for all appearing on the show are critical. Then again, should a show that requires an on-set therapist even exist to begin with? It’s probably impossible to say what the best solution is here. It is never easy to search for justice by feel."}, {"type": "sentence", "content": "While statistics are still trickling in, various cities around the world are reporting an increase in suicides and suicide attempts as a result of the isolation and economic devastation brought on by Covid-19. Even the average individual is feeling the lethargy, sadness, and anxiety that come with being trapped at home all day while the news blares death tallies in the hundreds of thousands at all hours of the day. For those with pre-existing mental health issues, this time can feel excruciating."}, {"type": "image", "content": "https://miro.medium.com/max/1298/1*mLOHSUDLl4ut3bhRx2aTRQ.jpeg"}, {"type": "sentence", "content": "In the final episode of Terrace House aired on Japanese television (distribution of new episodes has been suspended), Hana can be heard saying that a portion of her wrestling matches were cancelled due to the virus, resulting in a major loss of income. I note this only to give a fuller picture of her life in the weeks before its end, but it feels like a sound judgment to say her ultimate decision was much more directly tied to her appearance on Terrace House."}, {"type": "sentence", "content": "To imagine what she must have been feeling at the end fills me with inexplicable sorrow. As a Terrace House fan, I can’t help but feel responsibility, even if we are measuring in parts per million. Even if my role was merely turning a blind eye to the malicious comments I would see when I scrolled through episode recaps or Reddit discussions. To know that while I lay on my couch, relaxed and laughing, she had a storm brewing inside…"}, {"type": "sentence", "content": "There are many reasons why grieving someone who has committed suicide can feel impossible. By the time one has surmounted the waves of shell-shock and self-doubt, there is only hollowness left. I’ve found that my grief is incapable of expressing itself directly, and remains readily compartmentalized until strange and inopportune moments. I hoped writing this would help me understand, but it has only reminded me that healing is a process. In struggling to understand and process Hana Kimura’s death myself, I want to reach out a hand to all reading this and let you know you are important. You deserve to be here. Tomorrow cannot wait to meet you."}, {"type": "sentence", "content": "National Suicide Prevention Lifeline"}, {"type": "sentence", "content": "800–273–8255 (24/7)"}, {"type": "sentence", "content": "Online chat: https://suicidepreventionlifeline.org/chat/ (24/7)"}, {"type": "sentence", "content": "Crisis Text Line"}, {"type": "sentence", "content": "Text HOME to 741741 (24/7)"}, {"type": "sentence", "content": "The Trevor Project"}, {"type": "sentence", "content": "866–488–7386 (24/7)"}, {"type": "sentence", "content": "Text START to 678678. (Mon-Fri 3 p.m. to 10 p.m. EST/12 p.m. to 7 p.m. PST)"}, {"type": "sentence", "content": "TrevorCHAT (instant messaging, available seven days a week 3 p.m. to 10 p.m. EST/12 p.m. to 7 p.m. PST)"}], "topic": "mental-health"}