{"title": "50 Lessons I Learned After Quitting My $100,000+ Career", "data": [{"type": "subtitle", "content": "How to leave the corporate world and succeed as a digital entrepreneur"}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*UnUppl_TOpJXLCkEwAGz2w.jpeg"}, {"type": "sentence", "content": "Three years ago I left my safe, secure, 9–5 corporate job at Yelp.com."}, {"type": "sentence", "content": "At the time, I was earning over $100,000 as a national client partner in my late 20s. It took me six years to climb the corporate ladder and reach my dream position."}, {"type": "sentence", "content": "But by the time I reached the top sales position in the organization, I was checked out. It wasn’t the company either, it was working on someone else’s dream instead of my own."}, {"type": "sentence", "content": "I found that more money didn’t mean more fulfillment. I knew I had to do my own thing, so I could control my destiny."}, {"type": "sentence", "content": "So I saved up money and quit my six-figure job after making $200 from my blog in 2017. I’d love to tell you it’s been an easy ride but it would be a huge lie."}, {"type": "sentence", "content": "Needless to say, I just kept moving forward… inch by inch. After a lot of failing online ventures, I eventually found success as a freelance writer. That’s led to building an online brand, developing my skills, and never having to go back to a cubicle."}, {"type": "sentence", "content": "Being a digital entrepreneur means working on stuff you love, creating your schedule, and going all in your dreams. If you’ve ever thought of going out and building an online business, now is the time to get started."}, {"type": "subtitle", "content": "50 Digital Entrepreneur Lessons"}, {"type": "sentence", "content": "Here’s 50 lessons I’ve learned from my millennial life crisis to help you speed up success."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "Truthfully, I can’t believe it’s been three years since I left the corporate world. Some parts of me feel like it was yesterday, while other parts feel like it’s been a decade."}, {"type": "sentence", "content": "I will say working for yourself is a beautiful self-discovery adventure, but just know it’s not going to be easy. It’ll test you more than any job ever will, but if you keep going, amazing things will happen."}, {"type": "sentence", "content": "Use these 50 tips to start your passion business and make your dream of entrepreneurship come to life."}, {"type": "sentence", "content": "Life’s too short to work at a job you hate."}, {"type": "subtitle", "content": "Keep Reading"}], "topic": "freelancing"}