{"title": "A Place Where We Can Be Together", "data": [{"type": "subtitle", "content": "Animal Crossing reclaims a sense of control in our daily lives"}, {"type": "image", "content": "https://miro.medium.com/max/10000/1*eXCmEPXomZkJhY8OqQr-9A.png"}, {"type": "sentence", "content": "Despite all the memes that characterize our generation as perpetually tired, introverted homebodies — COVID-19 has shown that we are at heart social animals, after all, longing to be together, and gathering on balconies and in Zoom hangouts. There is a powerful thread that draws us together during times of crisis and conflict when we seek safety and comfort from each other. Our inability to be together in this painful moment, overwhelmed with fear and grief, is a cruelty of this pandemic that’s characterized by proximity and distancing."}, {"type": "sentence", "content": "In these uncertain times many of us, 11 million to be exact, have sought out a different kind of space where we can be together, on a pleasant virtual island shared with friendly anthropomorphic neighbors. Since it was released on March 20th, the Animal Crossing: New Horizons game has become wildly popular, permeating into the real world in unexpected ways. In a single month, more digital units of Animal Crossing were sold than any other console game in history, offering us an escape and a common virtual space."}, {"type": "sentence", "content": "On this virtual island users, plant trees, build zen gardens, water their vegetables and flowers, catch bugs, and collect items to decorate their home. It is the exact opposite of being locked in a cramped apartment during a pandemic. There are people who spend all day on their island. You can go visit friends’ islands and hang out in a common space,” one player told NBC, “because it’s not really something I can do in real life.”"}, {"type": "sentence", "content": "Animal Crossing offers a distraction from the dark reality around us, but as a slow-paced, live simulation game, it doesn’t provide the same kind of engagement and escapism as other video games."}, {"type": "sentence", "content": "There is no quest to embark on, no princess to save, or treasure to discover on your island. There is no progress in the game, just a Sisyphean tempo of real-life albeit in a more equitable world — doing gardening chores with our anthropomorphic neighbors, contributing to public institutions, and paying off an interest-free mortgage:"}, {"type": "sentence", "content": "This game is an intricate, shared fantasy that we can indulge in together, where we are caretakers of an island that’s really taking care of us during this crisis. The game offers us a sense of stability and consistency where each day we can collect seashells at the beach and sell turnips at a time that our economy is in a freefall in the real world."}, {"type": "sentence", "content": "Perhaps the most meaningful thing that Animal Crossing offers us is reclaiming a sense of control in our daily lives. In the real world, it’s become increasingly difficult to make plans for the future during this pandemic, while the virtual world offers us a sense of order, organization, and control over different elements. The same kind of satisfaction one gets entering MUJI or The Container Store when their personal life is in disarray, and then leaving with bags full of files, closet organizers, folders, and drawer dividers as if organizing your file cabinet and the top drawer will also solve personal problems."}, {"type": "sentence", "content": "At some point in the last two months, however, with prolonged closures of schools and workplaces, the game became more than just a silly way to pass the time while we’re in lockdown. Unable to hold gatherings in the real world, many people have organized birthday parties, weddings, graduations, and wakes on their Animal Crossing island. No longer just an escape, this virtual platform has become an important common place where major life events happen, and where memories are made."}, {"type": "sentence", "content": "This hybridity of the real and virtual worlds is part of “the new normal,” a phrase we’ve come to use a lot recently to cope with the constant of change during the pandemic. To define this phrase, however, is to have a common understanding of when our sense of normalcy changed, when exactly living online became the new normal. At which point exactly did things go astray, and when is the last time things felt normal before coronavirus? “Was I always the sort of person who hoards hand sanitizer and Lysol, or is this just what the pandemic brought out in me?” one wants to ask. “Have I always been the sort of person who has a panic attack at 9:00 AM in front of a Walgreens cashier?” At what point was the sense of normalcy and control lost, and is the COVID lockdown really to blame?"}, {"type": "sentence", "content": "Playing the game with the intention of briefly feeling a false sense of control over our lives while COVID-19 is knocking everything off balance, inevitably leads to asking how much control we had over our lives in the first place. This illusion of order and control sought in Animal Crossing is being broken down as many corporate and government policies are changed due to the COVID-19 emergency. Policies allowing more than 3.4 ounces of liquids and gels through airport security, stopping incarceration for minor offenses, broadband data caps, throttled internet, stopping landlord evictions, and keeping the water and electricity on during times of financial hardship were all revealed to be unnecessary cruelties:"}, {"type": "sentence", "content": "Perhaps there is no going “back to normal” after COVID-19, not only because of the profound loss and grief experienced collectively but because this crisis has made us aware of these many unnecessary cruelties that project an illusion of order and normalcy. In the end, perhaps it doesn’t matter whether our actions are more authentic on the island or in the real world. What is truly beautiful about this common virtual space we’ve created in a dark moment in time, is humankind’s ability to create communities in unexpected places. Our need to care for others in a crisis. Perhaps all that matters right now is that we have a place to be together, either mindfully spending time with our loved ones in a virtual space, or just passing the time playing a silly video game."}], "topic": "gaming"}