{"title": "How to stay in touch with friends you met overseas and why it’s important", "data": [{"type": "subtitle", "content": "It can be challenging to stay in touch with people you met on your travels. You can take the initiative, maintain space for conversations and connections, and ultimately have longstanding travel friendships with people who live in other cities. But you can also learn to let go of people that are disengaged."}, {"type": "image", "content": "https://miro.medium.com/max/2488/1*DIOoUERX5tJS8H0W8W7IRQ.jpeg"}, {"type": "sentence", "content": "During your travels, you will meet a multitude of people in bars, hostels, through existing friends, etc. If you’re like me, meeting people isn’t so hard. It’s staying in touch with them that I find a bit challenging. I feel like I’m the type of person who wants to build secure connections and continuously remind myself that that will usually not be the case. Building strong connections takes a lot of energy and time, and being so far from these people doesn’t make it any easier. But it’s worth keeping them in any way you can! And if they’re down, you’re down. Here are a few ideas based on how I maintain connections with people I met overseas."}, {"type": "subtitle", "content": "Understanding travel friends from a distance"}, {"type": "sentence", "content": "Every connection and friendship will be different. People have their own lives at home, as you have your life here. You have to understand each other. You’re getting to know these people at a much slower pace than your new friends at home. So if someone doesn’t answer for days or weeks, there’s no reason to fret. There’s a trust that they will get back to you. And you want the same courtesy and understanding extended to you as well."}, {"type": "image", "content": "https://miro.medium.com/max/10944/1*ikilL3JE1XxExbCkkoV7vQ.jpeg"}, {"type": "subtitle", "content": "Use your creativity"}, {"type": "sentence", "content": "When I spent a month in Russia, I met and stayed in touch with a fair amount of people. I was there in August 2018, which was quite some time ago. In a year and a half, I maintained good-standing friendships with a few people. Shortly after I came back from Russia, I started my last semester at Parsons and was working on my thesis. I graduated from a Communication Design program, so thesis was in the form of a big design project. I designed social awareness posters based on USSR-style design. The subjects I used in the posters were based on portraits I took in Russia of Russian youth, therefore focusing the topic onto Russian youth culture. The thesis is the way I was able to use my connections, conversations, and the portrait shots I took in a meaningful way. It created something I was happy to report back to the people that collaborated with me for the project."}, {"type": "sentence", "content": "Another way I include travel friends in my creative processes is by sharing the stories they tell about a particular topic I am writing about for Medium. So, I seek out conversations to have. A good example of this is the article I wrote recently about staying at hostels. I contacted a few people that I met in hostels on my travels and asked them questions about their worst and best experiences. Not everyone I contacted answered me, but the ones who did told amazing stories and gave us space to deeply talk about awesome experiences we had. This was a practice in active listening. Since I will already tell my own story in my writing, this was the time to listen to their story."}, {"type": "sentence", "content": "Involving people in creative projects strengthens communities, increases communication, and keeps that globalization ball rolling."}, {"type": "subtitle", "content": "Using the internet"}, {"type": "sentence", "content": "It’s always fun to say something like “I met Tay in a Saint Petersburg hostel, she’s from Brazil, and now she’s hanging out with me here in Brooklyn!” It’s no doubt that having travel friends meet you in your hometown or visiting a friend in their home city is a great feeling. I stayed in touch with Tay because she was (and still is) genuinely open to engaging in a meaningful conversation. Through Whatsapp, Instagram, Facebook, we are able to share content, information, and life events. They keep us connected, both passively and actively."}, {"type": "image", "content": "https://miro.medium.com/max/8512/1*d0GwB2WDaVx_5vZO2ssDOQ.jpeg"}, {"type": "sentence", "content": "Tay is easy to talk to. But there are some people whose interaction with you only goes so far. It’s okay. If someone is really disengaged, someone who continuously doesn't reply, then there’s no reason to keep trying. There are also times I don’t care if someone doesn’t reply, and I’ll probably try again in a few weeks if I think of them. When I do catch them on a day where they’re talking and sharing with me, I welcome it. There is nothing wrong with taking the initiative."}, {"type": "sentence", "content": "It’s up to you when and how often you want to make the first move. It’s also up to you how you treat travel friends that reach out to you."}, {"type": "subtitle", "content": "No regrets"}, {"type": "sentence", "content": "I recently messaged someone who lives in Ireland. I haven’t talked to her in about 4 years. This was someone I’ve had emotional conversations with. She was on my mind, I was wondering how she was doing, and it felt right. Why not go for it? The discussion was minimal. However, she did reply and greeted me with warmth and enthusiasm. I probably won’t message her first again because she didn’t keep up with the conversation, which is okay. No regrets."}, {"type": "sentence", "content": "Honestly, I used to have this fear that I’m being too annoying, or that I talk too much #whyiwrite"}, {"type": "sentence", "content": "Then I met people who absorb what I say and are interested in my thoughts and me listening to them. Over time you’ll learn who likes to connect deeply but rarely, or who likes to have a light conversation but more frequently. Who can have the same discussion for a long time because they rarely reply, or who just doesn’t want to keep up with any conversation for whatever reason."}, {"type": "sentence", "content": "Instagram creates very passive relationships with people. But it also offers an environment that gives travel friends a space to connect deeper. I’ve made friends that I’ve stayed in touch with from all the recent cities I’ve visited."}], "topic": "travel"}