{"title": "Beyond the Bridge", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "image", "content": "https://miro.medium.com/max/10846/1*-jqGFg461QEYeFmblSfDJA.jpeg"}, {"type": "sentence", "content": "When Manny was eight, he met Dana. There was something that drove him to the bridge. It was misty. Something in between rain and fog, only more gentle. Manny never could see past the mist from the wooden back porch of his aunt and uncle’s house. He always wondered what was beyond it, but they discouraged it. They said it was for his own good, so he stayed put. Manny didn’t have any friends minus his aunt and uncle. For most of his childhood, he didn’t complain. He enjoyed them and, unlike most children, didn’t feel the need to dive deep into what happened to the parents he never met."}, {"type": "sentence", "content": "The bridge was small and wooden and crossed over the freshwater river. It arched so you couldn’t see over the other side without actually stepping onto it, which he wasn’t allowed to do. But when he saw the other child, near his same age, skipping toward his direction, he went to meet her."}, {"type": "sentence", "content": "“Hi, I’m Dana,” she said before he could say anything."}, {"type": "sentence", "content": "“I’m Manny.”"}, {"type": "sentence", "content": "She didn’t say anything else. She skipped back over to the other side and he went back to the porch."}, {"type": "sentence", "content": "When he was eleven, she told him about a tv show she watched. He wasn’t into television. He wouldn’t be allowed to watch the kind of stuff she did even if he was. He would see his aunt and uncle watch the news and other free educational shows, but there was nothing they had access to beyond that."}, {"type": "sentence", "content": "“Do your aunt and uncle kiss each other?”"}, {"type": "sentence", "content": "“Ummm…yeah sure, sometimes.”"}, {"type": "sentence", "content": "“Well, they do it on tv all the time. My mom doesn’t kiss anyone.”"}, {"type": "sentence", "content": "“Oh.”"}, {"type": "sentence", "content": "“Have you ever kissed a girl?”"}, {"type": "sentence", "content": "“No. You’re the only girl I know.”"}, {"type": "sentence", "content": "“Do you want to?”"}, {"type": "sentence", "content": "“Umm…”"}, {"type": "sentence", "content": "“You can think about it. I only want to if you want to.”"}, {"type": "sentence", "content": "The next week he ran to the bridge to meet her."}, {"type": "sentence", "content": "“I want to.”"}, {"type": "sentence", "content": "They stared at each other and then Manny broke eye contact to scan trees in the distance."}, {"type": "sentence", "content": "“Well, what are you waiting for?” she asked."}, {"type": "sentence", "content": "“Umm…I…I don’t know.”"}, {"type": "sentence", "content": "She sighed, “Ok, on the count of three…one…two…”"}, {"type": "sentence", "content": "Manny shut his eyes as hard as he could and puckered his lips. He looked like he’d just tasted a lemon for the first time."}, {"type": "sentence", "content": "“…three.”"}, {"type": "sentence", "content": "She pressed her lips against his. It ended as soon as it began. It was awkward and a little dry, but he opened his eyes and smiled at her anyway. And she was smiling back."}, {"type": "sentence", "content": "When Manny was 17, he had begun sneaking out more with Dana and didn’t care if his aunt or uncle caught him or not. She had taught him about pizza and social media and the internet and movies. And she would show him whatever she could from her cell phone, virtually introducing him to a foreign world."}, {"type": "sentence", "content": "He dressed up one day in his best shirt, which wasn’t much compared to how she would look when he saw her, but he tried his best to look nice. He waited until his aunt and uncle went to sleep to go out. He’d gotten some flowers from his aunt’s garden and tied them up as best he could and tiptoed out and waited by the bridge."}, {"type": "sentence", "content": "Twenty minutes later, she showed up wearing a peach colored dress that shone brightly even in the midnight darkness. She smiled when she saw him, giving him a long hug."}, {"type": "sentence", "content": "“You look really nice!” he said as he handed her the flowers."}, {"type": "sentence", "content": "“Thank you!” she took them."}, {"type": "sentence", "content": "“How was the prom?”"}, {"type": "sentence", "content": "“Honestly? Not that fun. All my friends had dates.”"}, {"type": "sentence", "content": "“You didn’t get a date?!”"}, {"type": "sentence", "content": "“I told you already. You’re my date whether you were there or not. I didn’t want to go with anyone else.”"}, {"type": "sentence", "content": "“Oh. Sorry.”"}, {"type": "sentence", "content": "“I’m not. I was just looking forward to coming to see you.”"}, {"type": "sentence", "content": "He sucked on his bottom lip and looked at the ground, then smiled back up at her."}, {"type": "sentence", "content": "“Will you dance with me?” she asked."}, {"type": "sentence", "content": "“I want to…but I can’t dance.”"}, {"type": "sentence", "content": "“It’s ok. I’ll show you.”"}, {"type": "sentence", "content": "She pulled out her phone and tapped on it until a song started playing. Manny had never heard of it, but it was slow and rhythmic. The melodies were drastically different from what his aunt and uncle played in the house. Occasionally, Dana would play music for him when they talked on the bridge, but he knew he’d never heard this one. She turned the music to full volume and placed it on the ground. She then reached out her hand and Manny grabbed it."}, {"type": "sentence", "content": "Her arms were around his neck and her chin was rested on his shoulder. He hesitated, but placed his palms on her waist, hoping she couldn’t hear or feel his heartbeat increase that he felt in his own ears. The night was mild. The slight breeze brushed her short hair against his cheek. He got a view of the other side of the bridge and although he could never fully see what was on the other side, he thought about what it would be like to finally cross it, to take Dana right now and go into her world. She had spent the last ten years coming into his, a beautiful accident, and he wanted to return the favor. He wanted to know what was beyond what he knew. He wanted to see the places he’d read about in all those books and the things she’d shown him."}, {"type": "sentence", "content": "He glanced at the sky with all its vastness and stars that could easily be seen from his countryside home. He knew going deeper into the city would make them less visible, but he didn’t care. He wanted to see more than that. He knew Aunt True and Uncle Gannon would never approve, but if he left, he knew he wouldn’t be alone."}, {"type": "sentence", "content": "He relaxed a little more in Dana’s arms and let his hands glide to the curve in her lower back. She adjusted and pulled in closer to him. A new feeling arose in him about her that night…a feeling he wasn’t sure he should be feeling or not, but he pressed into it. He pulled back and looked in her eyes. She looked back at him, eyes wide and welcoming. He pressed his lips against hers, but not like when they were eleven. This time he took the lead and instead of being awkward, quick, and flat, it was the complete opposite. She didn’t stop him. Instead, she took her hands to the back of his neck, inviting him more, neither of them noticing when the music stopped, because they had already stopped dancing."}, {"type": "sentence", "content": "“Manny!! Manny are you out here?!”"}, {"type": "sentence", "content": "He broke the kiss in a hurry at the sound of his uncle’s voice."}, {"type": "sentence", "content": "“Shhh…” he put his finger to her lips."}, {"type": "sentence", "content": "“He’s not going to stop looking for you,” she whispered, “You should go. I’ll come by tomorrow.”"}, {"type": "sentence", "content": "He didn’t realize he was still holding her until she wiggled herself free."}, {"type": "sentence", "content": "“Let me come with you,” he whispered."}, {"type": "sentence", "content": "“Manny…”"}, {"type": "sentence", "content": "“I’m serious.”"}, {"type": "sentence", "content": "“Are you sure?”"}, {"type": "sentence", "content": "“I want to see what’s over the bridge.”"}, {"type": "sentence", "content": "She nodded her head yes and mouthed “ok”. They walked across the bridge and as he walked, he realized how much he hadn’t seen. He never realized how clear the water was beneath the bridge. Or how many trees were on the other side. Or if you just took a few steps, you saw the beginning signs of the city, lights in the distance and buildings that were closer together than he had ever seen. He didn’t know when he would be back or if he would be back at all. He didn’t even know what he would do when he got to the other side because he didn’t know what to expect, but if the experience lasted only a night or the rest of his life, it would be worth it."}], "topic": "fiction"}