{"title": "Maybe You’re Not Getting There Because Your Goals Are Unhealthy", "data": [{"type": "subtitle", "content": "Humans 101"}, {"type": "subtitle", "content": "It’s not aspirational to chase a life that’s unsustainable"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*qUYzsl7JYgiQm5x59bhp6w.jpeg"}, {"type": "sentence", "content": "Maybe the problem isn’t your motivation."}, {"type": "sentence", "content": "Maybe the problem isn’t your business plan."}, {"type": "sentence", "content": "Maybe the problem isn’t that you don’t have enough willpower."}, {"type": "sentence", "content": "Maybe the problem isn’t that you need a new diet."}, {"type": "sentence", "content": "Maybe the problem is that your goals are fundamentally unhealthy, and maybe sabotaging your attempts to get there is, in fact, a survival mechanism you should be grateful for."}, {"type": "sentence", "content": "When we’re told to think big, we sometimes forget to think laterally."}, {"type": "sentence", "content": "It’s not about what we are or aren’t capable of, what we do or don’t deserve. It’s about how much of our time, life, resources, and energy we are willing to sacrifice for a given goal."}, {"type": "sentence", "content": "Though living out the absolute limits of our potential would be exhilarating, it’s probably not realistic."}, {"type": "sentence", "content": "Not because it’s impossible, but because it’s unhealthy."}, {"type": "sentence", "content": "The world has encouraged us all to rise up, do better, and believe in ourselves more, and this on its own is a wonderful thing. It becomes a hindrance when we confuse the extent of our imagination with the limits of our ability to match it."}, {"type": "sentence", "content": "I’m not trying to discourage anyone."}, {"type": "sentence", "content": "I’m not trying to say you cannot become the person you want to be."}, {"type": "sentence", "content": "I am only trying to say that, sometimes, your perceived failures are a matter of having unrealistic expectations. You would have to break yourself so significantly to meet them that, when you finally arrived at your goal, you’d barely call it success at all."}, {"type": "sentence", "content": "We are infinitely capable of feats beyond what we might imagine for ourselves — but we must also acknowledge that those who reach the most extreme peaks are often assisted by invisible forces."}, {"type": "sentence", "content": "These forces can be genetics."}, {"type": "sentence", "content": "They can be their upbringing or environment."}, {"type": "sentence", "content": "They can be funding or investments."}, {"type": "sentence", "content": "They can be a natural hunch or inclination toward a type of work."}, {"type": "sentence", "content": "They can also be intense and brutal self-dissatisfaction. This is what motivates many people to stretch their limits and achieve increasingly more for themselves."}, {"type": "sentence", "content": "Should we ignore the hard work of those who’ve accomplished so much?"}, {"type": "sentence", "content": "Of course not. They should be celebrated for their efforts."}, {"type": "sentence", "content": "But if you’re looking at how hard you’re working, and how far you’ve come, and wondering why your progress doesn’t quite match up with someone else’s — their level of fitness, their pristine home, their incredible body of work, their upper-level position — it’s not always because you’re incapable. It’s because there’s more to the picture than you can see from where you stand."}, {"type": "sentence", "content": "At the end of the day, we all have to decide what to do with our energy."}, {"type": "sentence", "content": "Getting into incredible shape might look very different depending on where someone started, and their physiology. It may sap much more energy from one person than another."}, {"type": "sentence", "content": "This isn’t about making excuses."}, {"type": "sentence", "content": "It’s not about admitting defeat."}, {"type": "sentence", "content": "It’s not about overlooking the hard work some people absolutely do."}, {"type": "sentence", "content": "It’s about understanding that your best and their best might not look quite alike for reasons that are out of your control. What matters is not that you try to compete with a life that’s not supposed to be yours, but that you do your best to make the most of what’s in front of you."}, {"type": "sentence", "content": "The internet has turned the unrealistic into the aspirational. Buy into this too much, and you’ll find yourself deeply dissatisfied despite having everything you need and then some."}, {"type": "sentence", "content": "Eventually, you must decide what matters to you, and what’s enough for you — and let go of the rest. Comparison is a game you will always lose."}, {"type": "sentence", "content": "Walk your own journey, find your own joy. Don’t worry if the peak of your mountain isn’t quite as high as someone else’s. All that matters is whether you savor the view when you get there."}], "topic": "productivity"}