{"title": "6 Online Business Myths You Should Stop Believing", "data": [{"type": "subtitle", "content": "“Living the dream” isn’t always what it seems"}, {"type": "image", "content": "https://miro.medium.com/max/9438/1*IjuV_Pt32fH-F5iueZSGHQ.jpeg"}, {"type": "sentence", "content": "In this day and age, the internet is full of courses, videos, and blogs on how to escape the corporate shackles by building an online empire."}, {"type": "sentence", "content": "Most of these gurus and influencers claim to be filthy rich — see my Lamborghini — and promise you that you can replicate their journey."}, {"type": "sentence", "content": "There are a few caveats. First, you have to buy their products. Secondly, you have to become part of their social media tribe. And finally, you have to stay loyal."}, {"type": "sentence", "content": "Most people will buy one course, read a few articles, and go back to their lives."}, {"type": "sentence", "content": "In the meantime, guru X earned a few hundred dollars to add to the rental cost of an Insta-worthy supercar."}, {"type": "sentence", "content": "All very glamorous. But how can an average person with little to no experience see through all this?"}, {"type": "sentence", "content": "How can you debunk online business myths and still receive value from coaching content?"}, {"type": "sentence", "content": "I’ve been working in the content marketing ecosystem for over five years now."}, {"type": "sentence", "content": "It took me three years to make a decent living and five to “live the dream.” That means that I can work from anywhere and don’t have to worry about money anymore."}, {"type": "sentence", "content": "I started with a travel blog and transitioned into freelance writing, photography, and startup management. Without any coaching or mentorship, I had to navigate countless entrepreneurial hurdles by myself."}, {"type": "sentence", "content": "In short, most of my successes came through trial and error journeys."}, {"type": "sentence", "content": "Over the years, I learned to dissect genuine advice from plain marketing. With some experience and insight, it’s rather easy to distinguish between myth and reality."}, {"type": "sentence", "content": "On this basis, here are 6 common online business myths you should stop believing."}, {"type": "subtitle", "content": "1. Everybody can make it"}, {"type": "sentence", "content": "I made 50,000 dollars blogging this year. So can you!"}, {"type": "sentence", "content": "These are typical coaching headlines."}, {"type": "sentence", "content": "For those of you who want to enter the coveted world of business gurus attracting people with headlines, the formula is simple."}, {"type": "sentence", "content": "Start with a motivational statement. Blogging is easy. You just need a niche and a few articles."}, {"type": "sentence", "content": "Insert link to your overpriced blogging course."}, {"type": "sentence", "content": "Continue with another generic phrase. Hosting is easy."}, {"type": "sentence", "content": "Add an affiliate link to the hosting platform of your choice."}, {"type": "sentence", "content": "Building a tribe is easy. Don’t forget the link to your social media course. And so on."}, {"type": "sentence", "content": "Telling people that they can make it online is a powerful marketing tool. So powerful that an entire niche now revolves around selling the idea of online entrepreneurship to the average Joe."}, {"type": "sentence", "content": "And there is nothing wrong with that. It’s a clever marketing strategy and one that works. The results and ethics might be questionable. But that could be said of most marketing techniques."}, {"type": "sentence", "content": "Nevertheless, the simple truth is that not everybody can make it. No matter how many online “mentors” tell you that you can, you might not succeed."}, {"type": "sentence", "content": "In this respect, a blog, Youtube channel, or e-commerce site is no different from a small shop."}, {"type": "sentence", "content": "You might have enough customers or not. You might make decent money or not. And finally, you might survive in the long haul or not."}, {"type": "sentence", "content": "The ubiquitous idea that everybody can become a successful entrepreneur is one of the greatest online business myths in our current era."}, {"type": "sentence", "content": "A combination of skill, perseverance, and luck will ultimately determine your online business’ fate."}, {"type": "sentence", "content": "As in any other sector, some people will succeed, some won’t."}, {"type": "subtitle", "content": "2. Successful online entrepreneurs have Lamborghinis and villas in Bali"}, {"type": "sentence", "content": "Flaunting success has never been more popular."}, {"type": "sentence", "content": "Just open Youtube. You can find hundreds of videos of 20-something-year-olds advising you on Rolexes. To the 30-year-olds, Rolexes are too cheap. They need a 100,000 $ Richard Mille."}, {"type": "sentence", "content": "Don’t get me wrong. These timepieces are beautiful. And I’m sure that all of these self-declared millionaires can afford them."}, {"type": "sentence", "content": "Nevertheless, the question arises: what world do these people live in?"}, {"type": "sentence", "content": "Are we supposed to be inspired by young entrepreneurs showing off their wealth through material possessions?"}, {"type": "sentence", "content": "In light of the ostentatious flaunting, many aspiring online entrepreneurs now feel that they’re only successful if they can afford a supercar and an iced-out watch."}, {"type": "sentence", "content": "The myth of making millions online now creates a much higher threshold for success."}, {"type": "sentence", "content": "This millionaire myth is not only dangerous, but it’s also an outright mirage."}, {"type": "sentence", "content": "Here are some numbers for you. 90% of startups fail in their first year. According to Fortune, only 3.5% of Youtubers make enough to live above the US poverty line. And less than 1% make a living wage."}, {"type": "sentence", "content": "Yes, some are millionaires with big sponsorship deals, but the number of Lamborghinis and Rolexes on Youtube seems disproportionate when you consider the number of Youtubers who could afford them."}, {"type": "sentence", "content": "The same goes for travel bloggers and Instagrammers showing off the ominous “Bali lifestyle.”"}, {"type": "subtitle", "content": "3. Content creation is better than a corporate career"}, {"type": "sentence", "content": "Modern-day influencers endlessly slam the traditional 9 to 5 corporate career."}, {"type": "sentence", "content": "By showcasing their glittering lifestyle, they build a weird precept. If you live the conventional 9 to 5 life, you’re a failure."}, {"type": "sentence", "content": "Some people thrive in corporate careers. Many love stability, paid leave, and bossy superiors."}, {"type": "sentence", "content": "None of these things are intrinsically good or bad."}, {"type": "sentence", "content": "Other people, on the other hand, flourish as entrepreneurs. Their talents reside in their creativity, financial skills, or illustrious personalities."}, {"type": "sentence", "content": "They despise the mere thought of sitting in a cubicle and following orders."}, {"type": "sentence", "content": "They have no issues with risk and would rather work 24 hours a day for themselves than one hour a day for someone else."}, {"type": "sentence", "content": "In a nutshell, some people are just better suited for entrepreneurship than others."}, {"type": "sentence", "content": "Neither choice is better or worse. It all depends on your character."}, {"type": "sentence", "content": "The best way to find out is through experience."}, {"type": "sentence", "content": "There is no point in listening to online business gurus chastizing the corporate route if you’ve never been on it. You wouldn’t judge a car’s engine without driving it, would you?"}, {"type": "sentence", "content": "In that same vein, why scorn someone’s entrepreneurial ambitions if you’ve never tried it yourself?"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*i0AIvWAJ1Xfq0qkjBLIyLQ.jpeg"}, {"type": "subtitle", "content": "4. It’s easier than a brick and mortar business"}, {"type": "sentence", "content": "One of the greatest online business myths is the supposed absence of risk."}, {"type": "sentence", "content": "Everybody knows that a brick and mortar business requires startup capital. Aspiring entrepreneurs often finance their new shops, bars, or other companies through loans."}, {"type": "sentence", "content": "The bank assesses the risk and the founder attempts to build a profitable business venture. If it works out, the founder will make a decent profit. If the business goes bust, both the owner and the bank will bear losses."}, {"type": "sentence", "content": "When it comes to online businesses, people somehow imagine a different scenario."}, {"type": "sentence", "content": "You don’t have to risk anything. Just build a little side hustle with 100 dollars and grow it into a six-figure business."}, {"type": "sentence", "content": "Yes, it’s possible to build a six-figure online business with an upfront investment of a few hundred dollars."}, {"type": "sentence", "content": "The entry barriers are low."}, {"type": "sentence", "content": "A decrease in startup investment, however, doesn’t create a risk-free environment."}, {"type": "sentence", "content": "You can start your online business with little money, but if you want to grow it into a large enterprise — in essence, live the dream that business gurus promise you — you’ll have to invest along the way."}, {"type": "sentence", "content": "Of course, you can start a blog with 300 dollars. However, if you become successful after two or three years, additional investment will be required."}, {"type": "sentence", "content": "You’ll soon discover the importance of virtual assistance, premium services, technical improvements, and managerial help."}, {"type": "sentence", "content": "Furthermore, you’re risking your time."}, {"type": "sentence", "content": "Especially as a content creator, you’ll do the bulk of the work yourself."}, {"type": "sentence", "content": "You may not invest a lot of money, but you’re still investing your time. That could become a greater loss if your business doesn’t succeed."}, {"type": "sentence", "content": "Consequently, in terms of risk and difficulty, an online business doesn’t differ much from a conventional brick and mortar enterprise."}, {"type": "sentence", "content": "The startup capital may be lower, but the more your enterprise grows, the more you’ll have to overcome similar entrepreneurial hindrances."}, {"type": "subtitle", "content": "5. If you don’t make it quickly, you’re a failure"}, {"type": "sentence", "content": "The single greatest myth about starting an online business is the get-rich-quick dogma."}, {"type": "sentence", "content": "In short, it is a farce."}, {"type": "sentence", "content": "No matter how talented you are, it will take many months and years before you’ll achieve significant financial success."}, {"type": "sentence", "content": "There are a few simple reasons for this delay."}, {"type": "sentence", "content": "First, unless you are already famous, you’ll have to build an audience or customer base online. In the current climate, this takes a long time."}, {"type": "sentence", "content": "The days of instant hits are over and the people who succeed today build their following thanks to years of consistent, high-quality output."}, {"type": "sentence", "content": "Some people strike gold in their first few months, but these usually remain one-hit wonders."}, {"type": "sentence", "content": "Secondly, the competition is massive."}, {"type": "sentence", "content": "Every niche, every product, and every topic has a ton of content already, making it harder to stand out."}, {"type": "sentence", "content": "Don’t get me wrong. Competition should by no means discourage you."}, {"type": "sentence", "content": "If you have a fresh angle to an existing issue or a great idea for a new niche, go for it."}, {"type": "sentence", "content": "You don’t have to become an overnight success. You’re not a failure if it takes two, three, or four years."}, {"type": "sentence", "content": "The idea that people become rich in a few months online is nothing more than a myth — cultivated by the same people who show off their rented supercars."}, {"type": "subtitle", "content": "6. You can work whenever and wherever you want"}, {"type": "sentence", "content": "Finally, online business is not a theme park ride."}, {"type": "sentence", "content": "Many Insta-entrepreneurs make it seem like they’re always on holiday, but this is another myth."}, {"type": "sentence", "content": "For years, I worked 12-hour days in the corporate world. After taking the leap, I did the same as an entrepreneur."}, {"type": "sentence", "content": "Only the decision-making process changes."}, {"type": "sentence", "content": "If you work online, you can naturally work anywhere at any time. But if you want to maintain your standard of life or even grow your wealth, your hours will not change. They will likely increase."}, {"type": "sentence", "content": "Flexibility does not mean a reduction in hours."}, {"type": "sentence", "content": "You can design your schedule and move to a tropical island, but you certainly won’t work less."}, {"type": "sentence", "content": "You are your own boss. That freedom entails responsibility. The difference with the corporate world resides in the sanctions."}, {"type": "sentence", "content": "Your corporate boss might reprimand or even fire you if you don’t work enough. Salary decreases are, however, rare."}, {"type": "sentence", "content": "As an entrepreneur, your salary and livelihood will be impacted. You won’t last long if you only work when you feel like it."}, {"type": "sentence", "content": "To sum it up, you can work anywhere at any time, but only if you manage to get the hours in. And these hours will make it impossible to sip cocktails on a beach all day long."}, {"type": "sentence", "content": "If you enjoyed this article, join my email list to stay in touch."}, {"type": "subtitle", "content": "You might also like"}], "topic": "freelancing"}