{"title": "Gaming platforms — Reuse player investment", "data": [{"type": "image", "content": "https://miro.medium.com/max/2560/1*Aern-oEMNomD5M1tajm8KQ.jpeg"}, {"type": "sentence", "content": "Last week, I outlined a set of ten directives on how to survive in a gaming platform wars. Over the course of the next few weeks, I plan to dive deep into each of them. Today, let’s chat about the first topic — Reuse player investment."}, {"type": "sentence", "content": "Gaming is not new. It has spanned many decades, from the days of Magnavox (1968) to the VR and cloud streaming. However, the gaming platforms are relatively new. If you are a regular at gaming communities, you will see three main factions: Xbox, Playstation, and PC. Xbox Live launched in Nov 2002, Steam launched in Sept 2003, and Playstation Network launched in November 2006. Each introduced a digital identity for the gamer. Over the next decade, they invested in enabling social, commerce, and engagement use cases, in addition to platform exclusives, to make their platform ‘sticky’."}, {"type": "sentence", "content": "Why is this important? Because generally, gamer’s purchase decisions can be outlined by the following basic flow chart."}, {"type": "image", "content": "https://miro.medium.com/max/556/0*g39W7W6sghNN-aeK"}, {"type": "sentence", "content": "For a gamer, gaming experience trumps everything, followed by social experiences, and finally by their investment and affinity for the platform. Over the course of the past 18 years, gamers have significantly invested in one or more platforms, in terms of money, resources, and time."}, {"type": "sentence", "content": "Everything starts with a digital identity for the gamer. For example; Gamertags for Xbox LIVE. Fun fact: At one point, the Gamertag change feature, which is roughly 10$ for the customer, generated more revenue than the Zune music org! Gamers are so passionate about their identity that they are willing to spend a lot of money to get the right name. For my Xbox Gamertag, I have got offers north of 2000$ to sell it!"}, {"type": "sentence", "content": "As gamer spends more time on the platform, they start growing their library of games. Over time, a typical gamer acquires [licenses to play] hundreds of games, digital or physical. With each game, they meet new people and experience new games with them, and build their social graph along the way."}, {"type": "sentence", "content": "Gamers also build artifacts of their proud moments. Achievements and trophies, screenshots, twits and posts, gameplay videos, community memberships, etc. All of these artifacts are of great emotional value to the gamer."}, {"type": "sentence", "content": "Emerging gaming networks like Stadia, Epic and other publisher-specific-networks are 15–20 years late to the party. Gamers would be hesitant to give up on all their investments so far by moving to the new platform. If you want them to adopt a new platform, the path of least resistance is to port all their investments to the new platform."}, {"type": "sentence", "content": "Stadia and Epic, the two newcomers, both start afresh on the player journey. This works for new gamers, but for those who have years of gaming under their belt, it forces them to throw away all their investments. Not the best way to start. Wouldn’t it be awesome if you can sign in with your Xbox, Steam, Playstation, or any other identity and continue using the name you have been using for years? Epic already allows you to sign in using other OAuth providers today. Why not extend it to use the underlying identity as well, similar to keeping your phone number when you change the provider."}, {"type": "sentence", "content": "But why stop at only importing identity? There was a time, where when you change your number, you had to rebuild your address book, but not anymore! All your contacts are centralized and if not, you can easily export and import them. Even Facebook allows you to export your contacts as you need. It will really give a headstart in my gaming if I can bring all my Fortnite/COD/insert_any_multiplayer_game_here friends to this new platform instead of starting blank. If it is not possible to import the graph due to technical or business limitations, you can build one over time with triangulation as more gamers adopt your platform."}, {"type": "sentence", "content": "Other gaming investments are also possible to import for bootstrapping the user, but they present different challenges. How do you create a tamperproof way to allow the gamer to bring their Achievements/Trophies? How do you import videos and images with the proper attribution? Working directly with consumers presents some security challenges while working B2B has its own business challenges. None of the above challenges are impossible to solve though, and as a gamer, it will make the best experience if I can take my identity, friends, and gaming collection with me, to try a new exclusive or a new gaming platform!"}, {"type": "sentence", "content": "Is that really too much to ask? ;-)"}], "topic": "gaming"}