{"title": "Becoming Visible", "data": [{"type": "subtitle", "content": "Perception is everything — hold out for someone who sees you."}, {"type": "image", "content": "https://miro.medium.com/max/7668/0*4QSHjIFmgQ7TLcU0"}, {"type": "sentence", "content": "Braving smoke from the huge Okanagan-complex fires, we drive into the province of Alberta and camp along the Elk River. In the middle of the night, I hear the sound of zippers unzipping."}, {"type": "sentence", "content": "Then Guy calls out, “Honey, you should come out here. I’m staring at the Northern Lights.”"}, {"type": "sentence", "content": "I climb clumsily out of our frost-rimed tent. Low on the horizon hangs a pale, shimmering curtain, and over our heads flows the “big river” of the Milky Way. It’s a spectacular sight, but finally, the frigid air draws me back into our downy cocoon."}, {"type": "sentence", "content": "Just then he calls out again, “Did you see that shooting star? Make a wish.”"}, {"type": "sentence", "content": "But I don’t need to. Tonight is perfect. I am fifty-five years old. No one has ever called me “Honey,” and I have never seen the Northern Lights, before this moment."}, {"type": "sentence", "content": "The next evening, the Bitterroot Valley is eerily dark with an orange cast to the light, and little flakes of ash fall like snow. We go to bed early to read, side by side, our long legs entangled. This is one of our favorite things, sweet and intimate — exactly the kind of thing you can keep doing as you grow old together."}, {"type": "sentence", "content": "As I get up to brush my teeth, I can hear Guy politely asking Wylie about his day."}, {"type": "sentence", "content": "“Did you swim in the river? Find any doggie friends to play with? Want your belly scratched?” Wylie is stretched out the length of the bed, his shaggy head resting on Guy’s chest, his dark eyes staring adoringly into the face he’s so quickly grown to love. Yeah, me too. Someone once said, “Life doesn’t have to be perfect to be wonderful.” But perfect is always worth hoping for."}, {"type": "sentence", "content": "This has been a year of growth and change. But, looking back, I know it has taken me thirty, painful years to understand these simple facts: just because someone doesn’t perceive you to be attractive, or sexy, or smart doesn’t mean you aren’t; just because someone doesn’t perceive you to be worthy of their respect, affection, loyalty, or love doesn’t mean you aren’t worthy of these things. Perception is everything. Hold out for someone who sees you."}, {"type": "image", "content": "https://miro.medium.com/max/8544/0*uFAhFwUJ982aNBoa"}], "topic": "fiction"}