{"title": "‘How Could the CDC Make That Mistake?’", "data": [{"type": "subtitle", "content": "The government’s disease-fighting agency is conflating viral and antibody tests, compromising a few crucial metrics that governors depend on to reopen their economies. Pennsylvania, Georgia, Texas, and other states are doing the same."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*poQTHKDaBW92r6fW.jpg"}, {"type": "sentence", "content": "By Alexis C. Madrigal and Robinson Meyer"}, {"type": "sentence", "content": "The Centers for Disease Control and Prevention is conflating the results of two different types of coronavirus tests, distorting several important metrics and providing the country with an inaccurate picture of the state of the pandemic. We’ve learned that the CDC is making, at best, a debilitating mistake: combining test results that diagnose current coronavirus infections with test results that measure whether someone has ever had the virus. The upshot is that the government’s disease-fighting agency is overstating the country’s ability to test people who are sick with COVID-19. The agency confirmed to The Atlantic on Wednesday that it is mixing the results of viral and antibody tests, even though the two tests reveal different information and are used for different reasons."}, {"type": "sentence", "content": "This is not merely a technical error. States have set quantitative guidelines for reopening their economies based on these flawed data points."}, {"type": "sentence", "content": "Several states — including Pennsylvania, the site of one of the country’s largest outbreaks, as well as Texas, Georgia, and Vermont — are blending the data in the same way. Virginia likewise mixed viral and antibody test results until last week, but it reversed course and the governor apologized for the practice after it was covered by the Richmond Times-Dispatch and The Atlantic. Maine similarly separated its data on Wednesday; Vermont authorities claimed they didn’t even know they were doing this."}, {"type": "sentence", "content": "The widespread use of the practice means that it remains difficult to know exactly how much the country’s ability to test people who are actively sick with COVID-19 has improved."}, {"type": "sentence", "content": "“You’ve got to be kidding me,” Ashish Jha, the K. T. Li Professor of Global Health at Harvard and the director of the Harvard Global Health Institute, told us when we described what the CDC was doing. “How could the CDC make that mistake? This is a mess.”"}, {"type": "sentence", "content": "Viral tests, taken by nose swab or saliva sample, look for direct evidence of a coronavirus infection. They are considered the gold standard for diagnosing someone with COVID-19, the disease caused by the virus: State governments consider a positive viral test to be the only way to confirm a case of COVID-19. Antibody tests, by contrast, use blood samples to look for biological signals that a person has been exposed to the virus in the past."}, {"type": "sentence", "content": "A negative test result means something different for each test. If somebody tests negative on a viral test, a doctor can be relatively confident that they are not sick right now; if somebody tests negative on an antibody test, they have probably never been infected with or exposed to the coronavirus. (Or they may have been given a false result — antibody tests are notoriously less accurate on an individual level than viral tests.) The problem is that the CDC is clumping negative results from both tests together in its public reporting."}, {"type": "sentence", "content": "Mixing the two tests makes it much harder to understand the meaning of positive tests, and it clouds important information about the U.S. response to the pandemic, Jha said. “The viral testing is to understand how many people are getting infected, while antibody testing is like looking in the rearview mirror. The two tests are totally different signals,” he told us. By combining the two types of results, the CDC has made them both “uninterpretable,” he said."}, {"type": "sentence", "content": "The public-radio station WLRN, in Miami, first reported that the CDC was mixing viral and antibody test results. Pennsylvania’s and Maine’s decisions to mix the two tests have not been previously reported."}, {"type": "sentence", "content": "Kristen Nordlund, a spokesperson for the CDC, told us that the inclusion of antibody data in Florida is one reason the CDC has reported hundreds of thousands more tests in Florida than the state government has. The agency hopes to separate the viral and antibody test results in the next few weeks, she said in an email."}, {"type": "sentence", "content": "But until the agency does so, its results will be suspect and difficult to interpret, says William Hanage, an epidemiology professor at Harvard. In addition to misleading the public about the state of affairs, the intermingling “makes the lives of actual epidemiologists tremendously more difficult.”"}, {"type": "sentence", "content": "“Combining a test that is designed to detect current infection with a test that detects infection at some point in the past is just really confusing and muddies the water,” Hanage told us."}, {"type": "sentence", "content": "The CDC stopped publishing anything resembling a complete database of daily test results on February 29. When it resumed publishing test data last week, a page of its website explaining its new COVID Data Tracker said that only viral tests were included in its figures. “These data represent only viral tests. Antibody tests are not currently captured in these data,” the page said as recently as May 18."}, {"type": "sentence", "content": "Yesterday, that language was changed. All reference to disaggregating the two different types of tests disappeared. “These data are compiled from a number of sources,” the new version read. The text strongly implied that both types of tests were included in the count, but did not explicitly say so."}, {"type": "sentence", "content": "The CDC’s data have also become more favorable over the past several days. On Monday, a page on the agency’s website reported that 10.2 million viral tests had been conducted nationwide since the pandemic began, with 15 percent of them — or about 1.5 million — coming back positive. But yesterday, after the CDC changed its terms, it said on the same page that 10.8 million tests of any type had been conducted nationwide. Yet its positive rate had dropped by a percent. On the same day it expanded its terms, the CDC added 630,205 new tests, but it added only 52,429 positive results."}, {"type": "sentence", "content": "This is what concerns Jha. Because antibody tests are meant to be used on the general population, not just symptomatic people, they will, in most cases, have a lower percent-positive rate than viral tests. So blending viral and antibody tests “will drive down your positive rate in a very dramatic way,” he said."}, {"type": "sentence", "content": "The absence of clear national guidelines has led to widespread confusion about how testing data should be reported. Pennsylvania reports negative viral and antibody tests in the same metric, a state spokesperson confirmed to us on Wednesday. The state has one of the country’s worst outbreaks, with more than 67,000 positive cases. But it has also slowly improved its testing performance, testing about 8,000 people in a day. Yet right now it is impossible to know how to interpret any of its accumulated results."}, {"type": "sentence", "content": "Texas, where the rate of new COVID-19 infections has stubbornly refused to fall, is one of the most worrying states (along with Georgia). The Texas Observer first reported last week that the state was lumping its viral and antibody results together. On Tuesday, Governor Greg Abbott denied that the state was blending the results, but the Dallas Observer reports that it is still doing so."}, {"type": "image", "content": "https://miro.medium.com/max/3144/0*F3bElL6_zIwqM_wX"}, {"type": "sentence", "content": "While the number of tests per day has increased in Texas, climbing to more than 20,000, the combined results mean that the testing data are essentially uninterpretable. It is impossible to know the true percentage of positive viral tests in Texas. It is impossible to know how many of the 718,000 negative results were not meant to diagnose a sick person. The state did not return a request for comment, nor has it produced data describing its antibody or viral results separately. (Some states, following guidelines from the Council of State and Territorial Epidemiologists, report antibody-test positives as “probable” COVID-19 cases without including them in their confirmed totals.)"}, {"type": "image", "content": "https://miro.medium.com/max/3140/0*tipVEJCAq5f4uIB_"}, {"type": "sentence", "content": "Georgia is in a similar situation. It has also seen its COVID-19 infections plateau amid a surge in testing. Like Texas, it reported more than 20,000 new results on Wednesday, the majority of them negative. But because, according to The Macon Telegraph, it is also blending its viral and antibody results together, its true percent-positive rate is impossible to know. (The governor’s office did not return a request for comment.)"}, {"type": "sentence", "content": "These results damage the public’s ability to understand what is happening in any one state. On a national scale, they call the strength of America’s response to the coronavirus into question. The number of tests conducted nationwide each day has more than doubled in the past month, rising from about 147,000 a month ago to more than 413,000 on Wednesday, according to the COVID Tracking Project at The Atlantic, which compiles data reported by state and territorial governments. In the past week, the daily number of tests has grown by about 900,000."}, {"type": "sentence", "content": "At the same time, the portion of tests coming back positive has plummeted, from a seven-day average of 10 percent at the month’s start to 6 percent on Wednesday."}, {"type": "sentence", "content": "“The numbers have outstripped what I was expecting,” Jha said. “My sense is people are really surprised that we’ve moved as much as we have in such a short time period. I think we all expected a move and we all expected improvement, but the pace and size of that improvement has been a big surprise.”"}, {"type": "sentence", "content": "The intermingling of viral and antibody tests suggests that some of those gains might be illusory. If even a third of the country’s gain in testing has come by expanding antibody tests, not viral tests, then its ability to detect an outbreak is much smaller than it seems. There is no way to ascertain how much of the recent increase in testing is from antibody tests until the most populous states in the country — among them Texas, Georgia, and Pennsylvania — show their residents everything in the data."}], "topic": "science"}