{"title": "Media Loses to Fandom: The Snyder Cut Is Coming", "data": [{"type": "subtitle", "content": "How constantly talking about a non-event, made it eventually a reality."}, {"type": "sentence", "content": "Once thought to be the domain of pure conspiracy living within the confines of Zack Snyder’s Vero account is now confirmed to be a reality — with reworked VFX and much of the original composition prior to Joss Whedon’s involvement, the Snyder cut of the Justice League movie is slated for release on HBO Max in 2021."}, {"type": "sentence", "content": "Preceding this announcement was a saga of what could only be described as the first successful entertainment-related grassroots campaign of its kind — usually when shows are canceled or movies don’t fit their purported profile, there’s rarely an appetite to see them retooled. If a piece of art doesn’t live up to expectation, its creators move onto the next thing, and the rest is history — for fans of Zack Snyder however, finality is rather fleeting."}, {"type": "sentence", "content": "That cycle of gradual betterment or falling down then rebounding shaped consensus opinion on entertainment for the longest — in a typical scenario, Zack Snyder would’ve abandoned the hopes of seeing through his vision for Justice League after Joss Whedon took over; but emboldened by a reverent fanbase, Snyder kept pushing for his baby to finally see the light of day. It eventually happened, but it was at the expense of empowering the very worst in toxic fandom."}, {"type": "sentence", "content": "Very rarely are spoils won by begging and pleading before those who hold power, and the #ReleaseTheSnyderCut movement understood that plentifully — billboards were hung at conventions, petitions were signed, fundraisers were hosted, and it even made it to New York City’s coveted advertising haven of Times Square. What was left is for the cut to actually be made, and in the wake of its tangibilization, many are left to wonder if doubt cast on the cut’s existence was the very instrument through which the movement managed to ultimately attain its ends."}, {"type": "sentence", "content": "In media’s traditional proceedings, sunlight is a natural disinfectant — if the movement is talked about scornfully, it then necessitates for the audience to take this as a cue of disapproval and then elect to disengage. What has happened instead is a further entrenchment of Zack Snyder’s fandom around their shared identity, driven through negative polarization against what they perceived as the enemy — that being the media. Combine that with the antagonism that’s been mounting against the institution since the transition to digital, it’s easy to see how the pushback against the Snyder cut was perceived as yet another attempt by journalists to spoil the pot."}, {"type": "sentence", "content": "Expectedly, actors in media took the bait. “This is the story of #ReleaseTheSnyderCut,” wrote Ringer’s Rob Harvilla back in June of last year. “The most bizarre sustained fan campaign in modern superhero-movie history, arbitrary and fearsomely dedicated, fascinating and bewildering, possibly hopeless and legitimately inspiring.” But not all were receptive to the idea, as the Verge’s Julia Alexander wrote on her personal blog: “Warner Bros. has no obligation to release an alternate version. The movie is owned by them, created by Snyder and finished by Whedon. This is how entertainment works — it’s why fanfiction exists for those who envision something different.”"}, {"type": "sentence", "content": "Morbid curiosity is a condition all journalists and bloggers — myself included — are afflicted by; but the error that media often commits, is that it downplays the importance of a story right as it provides fodder for dissenters to make a bigger deal out of it. The reason that a Snyder cut exists at all, and it’s not the one that was released in theaters, is partly due to the negative critical reception of Man of Steel and Batman V Superman — in a roundabout way, it created the perfect conditions for fandom to thrive with anti-media rhetoric as its main driving fuel."}, {"type": "sentence", "content": "The role of amplification in bolstering certain political narratives has already been explored through exhaustion, but a way in which it can manifest in online fandom, is through journalists not understanding that reporting on fandom-led movements still gives them legitimacy, even if it’s done for the purpose of criticism. Whether it’s Rise of the Skywalker being the child of anti-Last Jedi backlash, the live-action Sonic movie being remade to counter the first trailer’s lackluster reception, or the emergence of the phantom Snyder cut — the media has consistently lost every bet it placed against fandom."}, {"type": "sentence", "content": "If anything, the anti-fandom playbook is clearly exacerbating the problem, not solving it — a new model is in dire need of creation if the media ever stands a chance of gaining back control of the narrative. To start, a less individualized approach to blame-assignment might be a way to do it — quite often, individual actors are at the center of fandom-related stories, but group dynamics matter just as much. To properly dismantle the issue of toxic fandom, systems — not just people — have to be thoroughly re-examined."}, {"type": "sentence", "content": "Snyder’s version of Justice League when it comes out, might indeed be what its proponents hoped it was — but that doesn’t nullify the great pain many were subject to when voicing even the mildest critique of Snyder’s creative output. The DCEU fandom is notorious for its toxicity, and while Warner Brothers may think it is finally free of having to navigate a PR nightmare at each announcement of a DC Comics live-action adaptation, it has only armed the most fervent to keep screaming as loud as they can until their demands are heeded."}, {"type": "sentence", "content": "Now more than ever, entertainment has fully divorced itself from creativity, becoming instead a vessel for fandom to channel their desires through. If one of the world’s most popular entertainment IPs — Star Wars — couldn’t curb it, there’s no reason to believe others would be able to — fandom rules everything, and it is by its hands that the future of entertainment will be shaped."}], "topic": "social-media"}