{"title": "TikTok Is at War With India — And Losing Badly", "data": [{"type": "subtitle", "content": "Is the dream run coming to a close?"}, {"type": "image", "content": "https://miro.medium.com/max/7880/0*hPwCqhenNNUZ849M"}, {"type": "sentence", "content": "You’d think it would be a good week if your company was just valued at $100 billion. Yet it’s been a catastrophe. TikTok has risen exponentially, but it’s showing signs it can’t handle this growth. A week ago, it was rated 4.8 out of 5 on the Google Play Store, and now it has 1.2 stars! #BanTikTok, #IndiansAgainstTikTok, and #TikTokDone have all gone viral on Twitter."}, {"type": "image", "content": "https://miro.medium.com/max/1808/1*ljgMudfAfaVDYvAggZIH_Q.png"}, {"type": "sentence", "content": "So what the hell happened?"}, {"type": "sentence", "content": "Their largest audience has turned on them with a vengeance. India accounts for 30.3% of all TikTok downloads. Some of my British friends even tag their videos with #TikTokIndia because they know they will get way more engagement. They have bombed them with one-star reviews leading to the pathetic Google Play rating. Why did this happen now?"}, {"type": "sentence", "content": "Like any good internet story, it began with a roast, one that shows TikTok they can’t gaslight their audience. Their marketing department must be in a frenzy!"}, {"type": "sentence", "content": "Heard the name Elvish Yadav? I certainly hadn’t. But he has 6.45 million followers on YouTube and released a video called “Life of A TikToker” that has 1.6 million upvotes. That’s more followers than the entire population of Los Angeles. The video is 14 minutes long and taunts TikTok creators for poor quality at every stage."}, {"type": "sentence", "content": "The TikTok influencers released counter videos, with Amir Siddiqui’s triggering the meltdown. He called out a famous roaster with 18.5 million followers, called Carry Minati. He took on the challenge and raked in 75 million views. He focused on TikTok’s poor record for moderating its content and strongly implied YouTubers were superior in every way. I imagine the mention of his name is giving TikTok’s PR nightmares."}, {"type": "image", "content": "https://miro.medium.com/max/1438/1*jlwWeKdkMkP8jBRKsA-yTQ.png"}, {"type": "sentence", "content": "It was already going downhill for TikTok, but it was YouTube who gave an extra shove to speed things up. They deleted his video for breaching their terms and conditions. What better way to draw attention to controversy than deleting it after it had already been seen by more people than New York and California combined? This triggered the start of the astonishing collapse in the app’s rating."}, {"type": "sentence", "content": "TikTok was staggered and desperately needed a good defense. But two haymakers broke through. These despicable videos went viral and got millions of views before being taken down. One video promoted acid attacks against women and the other implied a rape had just finished. To make the problem worse, these videos were highlighted and condemned by Bollywood stars. Both accounts were deleted, but the damage was done."}, {"type": "sentence", "content": "Politicians across the spectrum started backing the calls to ban TikTok in India. The National Commission for Women released a statement demanding action immediately. TikTok India’s responses have been textbook in how you shouldn’t deal with a crisis."}, {"type": "image", "content": "https://miro.medium.com/max/1092/1*F1vnyElHML2_EmzutQF-5A.png"}, {"type": "sentence", "content": "The language blames users for not following the rules. When videos are promoting disgusting crimes against women, expectations are not enough. There was no admission of fault or promise to improve. It seems as if they think they acted appropriately. This has not stemmed the negativity! This statement does not tell me they’re taking their precarious position seriously enough. It’s not a one-off, and this statement from reinforces the idea that TikTok are the victims here:"}, {"type": "sentence", "content": "People have defended TikTok, and it’s not one-sided. All social media companies have struggled to manage content violations in a timely way. Why isn’t this counterargument gaining traction? Because TikTok, as a Chinese company, is incredibly fast at removing any content with anything pro-Tibet or anti-China. It makes it harder to justify the length of time violent, pornographic, and paedophilic content is left online. They can remove content faster than they are — a fact not missed by Indian journalists:"}, {"type": "image", "content": "https://miro.medium.com/max/1128/1*siJ3vuNgI030VPx8aH0P6Q.png"}, {"type": "sentence", "content": "The drama unfolding in India hasn’t been covered worldwide. Yet when your new would-be TikTok user in the USA goes to download the app and sees 1.2 stars, will they not do a double take? If I didn’t know about this story, I’d be confused. You might think you had a typo. After you searched again and saw you were correct, you might look at the reviews. Even worse, imagine being a concerned parent checking the reviews of the app your child spends so much time on."}, {"type": "image", "content": "https://miro.medium.com/max/1782/1*g1pXlBeCrYFrNeYhzAqDPg.png"}, {"type": "sentence", "content": "This is a massive brand problem, and it will be fascinating to see how TikTok responds in the next few days and weeks. They ran huge marketing campaigns recently using the Indian cricket team’s captain Virat Kohli. A social media titan himself, he was the first Indian to reach 50 million Instagram followers. This campaign centered on encouraging users to think before they posted. The evidence shows this has failed. How do you solve this problem?"}, {"type": "sentence", "content": "It’s unprecedented for an app of this level of popularity to be rating-bombed to this extent. TikTok’s growth seemed unstoppable, but weak points have been exposed. If they can avoid a ban in India, then they have a chance of repairing their image. They must learn from the mistakes with the Indian market to emerge stronger as a company."}, {"type": "sentence", "content": "With over 2 billion downloads, their growth cannot continue at this speed. As they mature, their size will draw more criticism, just like Facebook before them. It’s up to their tech team to moderate content more effectively. Yet they must show a stronger stance when the inevitable distasteful videos go viral. When their revenues are at record highs, it’s hard to believe they are incapable of greater action."}, {"type": "sentence", "content": "TikTok's brand has taken a hammering. I worry about their ability to weather storms like this in their key markets of Europe and the U.S. Will their valuation of $100 billion come to be used as an example of markets gone mad?"}], "topic": "social-media"}