{"title": "Progressing Education in the COVID Era", "data": [{"type": "sentence", "content": "Students and educators alike are undergoing a frustrating experiment because of COVID-19. They’re exploring what happens when our learning experience evolves without advancing the type of education it provides. It’s a process that will work itself out over time, but what better time to start than now? Progressing education in the COVID era is something every teacher can do. We’ll explore how."}, {"type": "sentence", "content": "Why should the type of education we offer change? Depending on location and personal beliefs it can be a very weighted question. This exploration takes the stance that education is the cornerstone of successful societies. It is in every society’s best interest to maximize the educational opportunities for all members at all stages of life. Now more than ever, our current approach falls far short of that objective for several reasons."}, {"type": "sentence", "content": "Today the majority of our youth follow educational agendas developed during the industrial era United States. As war economies expanded productive efforts, the country needed people smart enough to operate the machines, but lacking the skills necessary to climb the ladder. Limited by our technology, the majority of our population had few alternatives when it came to working. As Joseph Campbell lectured, humanity has always been forced to fit the needs of an era."}, {"type": "sentence", "content": "That time has passed, so why are we still applying the same methodology? We see this most directly in the hierarchical structure of our primary education. The teacher teaches, students memorize and regurgitate, tests determine rank which then open or limit options. Beyond the facts, the most significant focus of our learning is obedience. Do it this way, or else. It forces a worldview that seeps deep into the fibers of our being."}, {"type": "sentence", "content": "Reinforcing these behaviors and beliefs may have made sense in the past, now they only promise struggle. Technology is rapidly expanding in all directions, bringing new possibilities and opportunities at the cost of old. The pandemic highlights the clear division of labor in the United States. Some of us are doing well under these circumstances; some of us are struggling. Those fortunate enough to be working more than likely fall into three categories, rudimentary, technical, and professional. We’ll focus on the technical and professional."}, {"type": "sentence", "content": "Behaviors such as life-long learning, creativity, and innovation define the highest degrees of success in these verticals. They both draw power from our most plentiful resource, infinite imagination. These practices represent the future of work and progress. Therefore we should structure learning around them. Progressing education is about instilling different values at different times. How do we reinforce these skills in an era when the classes happen through online meeting platforms?"}, {"type": "subtitle", "content": "Cooperation and Collaboration"}, {"type": "sentence", "content": "When exploring techniques for helping people learn, we begin by understanding that no method exists independent of existing relationships. Every student comes with a whirlwind of experiences that brought them to their moment with you. Therefore, we’ll focus on the general philosophy of progressing education using customizable examples to illustrate the practice better."}, {"type": "sentence", "content": "Next-generation learning is all about the ability to cooperate effectively. Collaboration is most effective when all participating individuals have the skills necessary to think critically about ideas and contribute. These two skills pair well together, both in learning and in life. More importantly, this type of learning better reflects the everyday experiences that many youths enjoy. Gaming, communication, and self-learning via the internet, encourage connection and dialogue."}, {"type": "sentence", "content": "So we want to teach cooperation, critical thinking, and dialogue — but how? Distance learning is especially difficult for many students, being home, and being at school recall distinctly different behavioral dynamics. For remote working professionals, the ability to focus on work at home is a discipline that we can’t expect immediately from our young prophets. The question offers no single answer because the pathways vary as much as the students. Therefore, our best route is to empower their ability to self-direct."}, {"type": "sentence", "content": "Any person who masters a hobby will share that learning is easier and more enjoyable when you’re passionate about the subject. Interviewing any innovator provides the same results, the underlying desire to give a fiery imagination form. We need to infuse self-direction into education because automation trends make it clear that humans will automate everything we can. As the need for repetitive work fades, the demand for creative thinking will grow. Self-direction is essential and personally empowering, but how can it work in the limited scope of specific subjects and digital classrooms?"}, {"type": "sentence", "content": "The first step is to transform existing lesson plans. Teaching in a classroom before COVID-19 may have been following a one-directional style of learning. Information flowing from the instructor to the students, who were responsible for absorbing and processing it for recollection at a later date. This learning style has its benefits but struggles to maintain attention and efforts in a virtual class setting. Single directional learning also squanders plentiful opportunities to incorporate self-directed learning into the process. The alternative is to transition lesson plans to a matrix style of learning."}, {"type": "image", "content": "https://miro.medium.com/max/1234/0*hfcuE0_vdLBq6QtF"}, {"type": "sentence", "content": "Matrix learning breaks traditional lesson plans into multi-directional approaches. Teachers become less of a source of information and more facilitators of frameworks for learning and discussion. Directional learning supports a broad, surface-level approach to understanding the world. Matrix learning allows for selective topic depth within a more extensive structure, empowering students to explore what interests them and develop ideas through critical analysis. We make teaching akin to a choose-your-own-adventure book. Prioritizing a form of education that instills more knowledge about fewer topics, but equips them to better evaluate their understanding."}, {"type": "sentence", "content": "Teachers break down their subjects into various verticals. At the beginning of a lesson cycle, students choose the topic(s) they want to explore. Within each of the possible verticals are additional subsets of focus that continue to branch out as far as necessary. Students receive research and topic frameworks after making topic choices. Broad enough to allow for critical thinking but within limits to ensure knowledge stays relevant to subject matter."}, {"type": "sentence", "content": "Students can research on their own or virtually connect with others in class via separate virtual conferences to share their specific interest verticals. Whenever possible, frame informational requests as open-ended to encourage critical thinking and reduce the reward for identical answers. Segments can end in several directions. Group presentations (combining students in similar verticals) are one option, as are individual speakers. Alternatively, teachers can conduct a single lesson cap class where students drive the lesson through their research."}, {"type": "sentence", "content": "As students share their research and perspective, teachers ask probing questions. They are connecting the dots between the various aspects of information students present. Questions should probe relational elements of the content, avoiding prioritizing specific details that we can obtain through sixty seconds of online search. Each cap day ends with more questions asked than answered, setting the stage for the next level of deep learning."}, {"type": "sentence", "content": "We can illustrate this concept using a history lesson on the American Revolution. Traditional education crams this multifaceted event chain into surface-level understanding, often white-washing the actual historical context. Our matrix approach reorganizes the subject, starting from relevant parties."}, {"type": "sentence", "content": "An initial lesson plan might be to explore population groups of the time: American revolutionaries, British imperialists, native Americans, and African Slaves. Who were these groups? What were their driving beliefs? What were their options in the war? What were the possible outcomes for the group becoming involved? How might our world today be different if (insert scenario) happened? As the lessons progress, research and discussion can continue about the relationships between these groups, how those relationships still impact the way we live today, and moral and ethical evaluations of the decisions made during the time. The possibilities are endless, limited only by the time and imagination of the teacher and students."}, {"type": "sentence", "content": "We can customize this example to any degree for any age group. Second graders can begin with the question of researching their favorite dinosaur, discussing how those dinosaurs may have interacted with each other based on their food preferences. Biology could open up with understanding parts of the cells, their individual and collective roles, and how these separate parts fit into a more contextual basis of our understanding of life. Each educator must decide what topics are required knowledge and which can benefit from a more thoughtful approach."}, {"type": "sentence", "content": "All of the examples provided follow the same flow of information and structure. Individual student research and thought, virtual group discussion and debate to further develop the ideas, and participatory instruction during cap courses. Each step reinforces critical thinking, dialogue, and cooperation. This method poses a challenge to traditional performance measurements, but these must progress alongside educational character and content. Today a teacher’s role in society is to empower future generations to navigate a rapidly changing world, what better way to do that than demonstrating the value of experimentation in education?"}, {"type": "sentence", "content": "One significant difference in this approach to education in comparison with traditional directional teaching is the ability to view subjects from multiple perspectives. This is more relevant in subjects like history and social sciences than math and chemistry, but the skills learned transcend individual disciplines. Learning through a process that considers multiple perspectives changes the entire dynamic of how the realized individual approaches personal and social life. Most importantly, it better prepares them to coexist in a world of radical technological expansion and automation."}, {"type": "subtitle", "content": "Implementation and Impact"}, {"type": "sentence", "content": "One of the most promising benefits of progressing education is to change the relationship dynamics of people within our societies. American students spend the majority of their time in classrooms, making school a primary influencer of their universe. Traditional education models center around hierarchy, both in the form of learning and grade-centric ranking. This process instills expectations for work and society beyond primary education, beliefs that calcify over time. Traditional education is one of the most significant factors contributing to the erosion of our collective potential."}, {"type": "sentence", "content": "Observing the broader circumstances of the moment, we see that society as we know it is on shaky ground. Large swaths of our population are seemingly ungovernable, caught in a whirlwind of propaganda and fear that dulls the senses. While it’s easy to point the finger in blame and anger, the inconvenient truth is that many in the United States are simply ill-equipped to navigate the world in which we exist. From early education to a lifetime of work, obedience has taken priority over actualization. Now, in a political and economic climate that is increasingly hostile towards the well being of the working class, they rage. Unwilling or, more often than not, unable to see that they actively fight against their wellbeing."}, {"type": "sentence", "content": "Teachers today must grapple with several factors limiting their ability to progress education. Inadequate performance measures such as tying teacher evaluations to student test results, the consistent political threat from those who seek to privatize education, and educational resources reliant on the wealth of the communities they serve all act as obstacles to progress. We understand that if we don’t develop new versions of humanity, these problems will persist with generations of educators to come. Despite all of these barriers, the importance of educators within society has never been greater."}, {"type": "sentence", "content": "It is the teacher who will shape the worldviews of the generations to come. Unfair as this burden may be, there seems to be no better alternative in our immediate present. Further complicating the task, many educators will reject the idea of progressing education because of personal beliefs and circumstances. But do they grasp the consequences of choosing stagnation?"}, {"type": "sentence", "content": "Any educator will understand how effort and time expand theory and understanding in all subjects. After all, the topics currently explored with youth are not presented in the same manner as they were thirty, fifty, or a hundred years ago. If we do not alter the skills we pass to our youth, we are likely to continue on our current path of hyper wealth concentration and environmental destruction. It is a grim future for the vast majority of humanity."}, {"type": "sentence", "content": "Courageous action and loving empathy happen not by a random occurrence, but through an enlightened understanding of the moment. Equipping more people with the ability to remove themselves from the emotional swings of the present and think critically about the future is our best hope for changing our trajectory. Our current national and global foundation is unsustainable in several directions. Humanity is its own greatest enemy, familiarity breeding unearned security in times of crisis."}, {"type": "sentence", "content": "The techniques explored here break our youth free from the mental prison that is duopolistic thinking. Right and wrong. Black and white. My way or the highway. When infusing these practices and procedures into the psyche of youth, we cripple their ability to transcend the circumstances we have created for them. Only by pushing the boundaries of our efforts can we stumble upon breakthrough practices."}, {"type": "sentence", "content": "Depending on the educator’s professional arrangements, implementing these practices will vary in difficulty. As with any experimental program, it’s best to begin incrementally, tweaking our approaches to suit the students’ specific needs better over time. Deviating from traditional paths always comes with risk. Performance reviews and organizational politics may threaten those interested in expanding education to its new necessary form, but what real alternative is there?"}, {"type": "sentence", "content": "Consider that dialectic education is already widely practiced by those in elite educational institutions and has been for some time. Those born into the means of money and power learn how to leverage these resources to continue and expand them. Small changes that accumulate over time to provide tremendous advantages. How much longer will we allow economic class to dictate the content and character of the education we provide?"}, {"type": "sentence", "content": "Progressing education in the COVID era is the recognition of our changing reality. Today the nature of work is expanding beyond the skillset and preparation provided by traditional educational models, evident in our national labor divisions. We must move towards reshaping the inherent values our education instills. By doing so, we empower an entire generation to solve problems well beyond our present grasp. While educators today face many challenges, their opportunity to radically transform a people has never been greater."}], "topic": "education"}