{"title": "To the Freelancers Charging $30/Hour (or Less)", "data": [{"type": "subtitle", "content": "An open letter to encourage you to reach for more"}, {"type": "sentence", "content": "Four years ago, I sat at my cousin’s apartment in California. She and her ex-husband, a businessman, had just rescued me from an abusive relationship."}, {"type": "sentence", "content": "“Let’s look forward, Krista,” her ex-husband said to me, possibly trying to get me to think positively instead of bawling nonstop. “What goals do you have for your life?”"}, {"type": "sentence", "content": "I had just spent the last 3 months as an Assistant Case Manager at a law firm where I started at $12 per hour. I loved what I did. And I felt so seen by the firm when I received my first raise, to $14 per hour, within just two months."}, {"type": "sentence", "content": "At that point in my life, $14/hour was the most an employer had ever paid me."}, {"type": "sentence", "content": "So, I answered his question."}, {"type": "sentence", "content": "“I want to find another job that will pay me $14 per hour.”"}, {"type": "sentence", "content": "I look back on this moment frequently. I had no idea how to find companies that would pay more. Thinking about negotiating froze my nervous system. I didn’t know how to translate my efficiency, skills, nor wit into a larger paycheck."}, {"type": "sentence", "content": "I had no idea I was worthy of more — more than pushing papers, more than $14 per hour, more than being abused by capitalism just because they don’t teach something like self-worth in schools."}, {"type": "subtitle", "content": "Dear freelancer, if you are reading this, I hope you know that your grit, perseverance, and resourcefulness will make you worthy of more."}, {"type": "sentence", "content": "That afternoon, my cousin’s ex-husband tried telling me how I could dream bigger, but I didn’t believe him. I worked my tail off to get that +$2/hour raise — all while sharing rooms sleeping on air mattresses and futons just trying to get by."}, {"type": "sentence", "content": "At the time, it meant nothing to hear him tell me I could dream bigger. I had to dream it for myself."}, {"type": "sentence", "content": "Fast forward to now. I’ve been in business for myself for two and a half years, which more or less happened accidentally."}, {"type": "sentence", "content": "This is a letter to the freelancer charging $30 per hour or less."}, {"type": "sentence", "content": "I want you to know that you deserve more."}, {"type": "sentence", "content": "I’m writing this because I didn’t realize that by setting my goal as a $14/hour job, I created a ceiling for my growth."}, {"type": "sentence", "content": "I’m writing this because when I finally did the math of my hourly rate after business overhead (like taxes and digital expenses), I faced the reality of my takeaway."}, {"type": "sentence", "content": "I’m writing this because as a Filipinx-American, I want my sisters to see someone like me reaching for the stars — so they feel comfortable dreaming bigger too."}, {"type": "subtitle", "content": "You define your limits"}, {"type": "sentence", "content": "As a WOC, I understand. There are some things we grow up programmed to believe — and these beliefs are a result of systemic racism, intergenerational trauma, and our surrounding environment."}, {"type": "sentence", "content": "There are some factors we cannot change. Some disadvantages we DO face."}, {"type": "sentence", "content": "At a certain point, we have to take matters into our own hands."}, {"type": "sentence", "content": "As a freelancer, you understand that. You have gotten yourself this far, supporting yourself and not having to answer to someone else’s set schedule, rates, or rules."}, {"type": "sentence", "content": "And now you can take yourself further."}, {"type": "sentence", "content": "Instead of limiting yourself by focusing on other people’s advantages to success, focus on how you can use your current resources to take the next step towards success."}, {"type": "subtitle", "content": "Evolution happens in small steps"}, {"type": "sentence", "content": "No one reaches Rachel Rodgers or Maya Elious status overnight. The truth is, evolution happens in small steps."}, {"type": "sentence", "content": "Sometimes it feels like we work towards the same goal forever. But change doesn’t happen overnight. You grow into your evolution over time."}, {"type": "sentence", "content": "I worked for agencies at the $20–30 per hour range because I was a designer-in-training, learning skills from the high-achieving women I called my mentors. This behind-the-scenes experience taught me skills I’ll take with me for a lifetime."}, {"type": "sentence", "content": "Focus on what you can do today so you can be closer to your goal tomorrow. Try to leverage small opportunities for bigger ones. If you’re charging under $30 an hour for work, decide what you want to get from that opportunity to move your career forward."}, {"type": "sentence", "content": "Protip: while you are taking those small steps towards your big evolution, strengthen your relationships to build a sustainable client network."}, {"type": "subtitle", "content": "Don’t settle for less just because it’s available"}, {"type": "sentence", "content": "At the beginning of your career, it’s hard to turn away work that doesn’t align with your goals."}, {"type": "sentence", "content": "Think about your beliefs about why you accept a lower rate. Is it because of a system we live in that programmed you to believe you are worth that amount?"}, {"type": "sentence", "content": "Women freelancers make 4.5x less than men do (Source: Slash Workers)."}, {"type": "sentence", "content": "Just because an opportunity to work and receive money is available doesn’t mean you have to do it. When you are presented with an opportunity, give yourself the space to think about why you should do something. And don’t settle for less just because it’s available."}, {"type": "subtitle", "content": "Evolving requires elimination."}, {"type": "sentence", "content": "Sometimes, to step into the next stage of our lives, we need to eliminate overgrowth around that."}, {"type": "sentence", "content": "Overgrowth doesn’t even have to be dramatic or negative. Sometimes, things we once loved just no longer serve a purpose for our next life chapter."}, {"type": "sentence", "content": "Is there anything in your life that isn’t fulfilling you? When you think about the next step you’re about to take in life, what comes up?⁣"}, {"type": "sentence", "content": "If you have any overgrowth, I invite you to figure out how you can start cutting off those things that weigh you down.⁣"}, {"type": "sentence", "content": "Because when you eliminate overgrowth, you make space for something big. You make space for your evolution."}, {"type": "subtitle", "content": "The people you surround yourself with matters"}, {"type": "sentence", "content": "It’s helpful to have a network of people who support you. It’s also useful to be surrounded by people evolving at the rate you want to grow."}, {"type": "sentence", "content": "One of the most challenging parts about freelancing is the lack of team, office environment, or water-cooler culture."}, {"type": "sentence", "content": "Who do you go to when you are second-guessing a decision? Where do you go to celebrate a new client? How can you receive advice tailored to what your actual business goals are?"}, {"type": "sentence", "content": "Surround yourself with fellow creatives who will help you overcome your own limiting beliefs and be there as a part of your growth."}, {"type": "subtitle", "content": "Your biggest asset is yourself."}, {"type": "sentence", "content": "Dear freelancer, one of the best skills you can invest in is sales and marketing. When you learn how to communicate the value of your work to a human being outside of your network, it leads to new clients."}, {"type": "sentence", "content": "Working at a day job, we are not trained to think about ROI. We put hours in, and the return is a reliable paycheck."}, {"type": "sentence", "content": "As a freelancer, you train yourself to look at spending differently."}, {"type": "sentence", "content": "Learn to make smart investments in your own growth."}, {"type": "sentence", "content": "When you put on your business hat, you step into the shoes of your clients and their worries. One essential step to increasing your value as a freelancer is being able to solve your clients’ problems through their work."}, {"type": "sentence", "content": "Take, for example, being a freelance writer. Think about why your clients are hiring out work. Ask them about the tangible results they want from hiring you."}, {"type": "sentence", "content": "When you understand the tangible results you can deliver, suddenly, clients start hiring you for your brain instead of hiring just any writer. When you can take on the role of strategist and communicate how your work brings tangible ROI, the value of your work increases."}, {"type": "subtitle", "content": "Be forgiving — of yourself."}, {"type": "sentence", "content": "Often, we are our own worst critics. I see SO many people get so wrapped up in random mental roadblocks. Maybe that call with the client didn’t go as expected. Or, you are such a big-picture thinker that you struggle with integrating the small, finer details."}, {"type": "sentence", "content": "Don’t expect yourself to do-it-all, be-it-all, and do everything perfectly."}, {"type": "sentence", "content": "Instead, take a step back."}, {"type": "sentence", "content": "Focus your energy on how you can improve your process to show up a little better next time. Remind yourself that you are worthy as you are."}, {"type": "sentence", "content": "If you’ve made it this far, you’ve seen me repeatedly telling you that the results are limitless when you invest in yourself."}, {"type": "sentence", "content": "It doesn’t matter that I believe that about you. Do you believe that about you?"}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}