{"title": "Predicting 30-day Readmission risk for ICU patients using a multi-task deep learning framework", "data": [{"type": "image", "content": "https://miro.medium.com/max/2878/1*sSMw8MGzIEG75jjniimq2Q.png"}, {"type": "subtitle", "content": "Unsupervised clustering of patient sub-populations for multitask learning using electronic health records"}, {"type": "subtitle", "content": "Problem"}, {"type": "sentence", "content": "Readmission whether planned or unplanned costs the U.S healthcare system billions of dollars annually. This, among other things, is of great importance to healthcare systems, since about one-third of readmissions are preventable, providing a huge opportunity for hospital systems to improve their quality of care (1). This compounded with the fact that hospitals are also penalized with up to 3% lower reimbursements from the Centers for Medicare & Medicaid Services(CMS) for increased readmission rates, as a part of the 2012 affordable care act passed by the Obama administration (2), creates a huge opportunity for the use of data to build algorithms that are capable of predicting which patients are likely to be readmitted if discharged early."}, {"type": "sentence", "content": "In recent years, many studies using Electronic Health Records (EHR) data and machine learning techniques were executed to help determine whether or not big data can detect patients that are at high risk of being readmitted within 30 days. These studies utilized a plethora of statistical and machine learning techniques, ranging from basic epidemiological models to deep learning LSTM and CNN architectures with expertly crafted features (3–12). Despite the progress, one shortcoming of many of the studies is the general one size fits all approach used to predict a patients risk of readmission mostly targeting specific phenotypes. As we move toward developing personalized medicines that takes into account each patient’s individual risks factors, we should also apply this same mindset to creating algorithms that are tailored to the vast subpopulations that exists in complexed EHR data. Therefore, in this study I explored the feasibility of using an unsupervised approach to cohort selection to first identify subpopulations within the dataset before predicting each group’s risk of being readmitted in 30 days."}, {"type": "subtitle", "content": "Proposed Study"}, {"type": "sentence", "content": "In this study, I will use single task and multi task models to predict 30 day readmission risk using the MIMIC III dataset. This will be done by first clustering patients using a data driven unsupervised approach to cluster patients using sociodemographic, operational, and clinical factors captured in the last 48 hours of their stay.This will then be used to predict the patient’s risk of readmission within 30 days of discharge from the ICU using a multi-task framework. This approach was first introduced by Suresh et.al., (2018) (13) to predict in hospital mortality in the ICU. To the best of my knowledge this is the first study that uses this two step approach to predict 30 day readmission risks of heterogenous patients in the ICU. Additionally, it is key to note that this study focuses on the implementation and tests the feasibility of this modeling approach, which if successful will then lead to possible follow-ups and improvements of this study in a subsequent post."}, {"type": "subtitle", "content": "Data Source"}, {"type": "sentence", "content": "This project utilized the MIMIC III electronic health record (EHR) dataset, which is comprised of over 58,000 hospital admissions for 38,645 adults and 7,875 neonates. This dataset is a collection of de-identified intensive care unit stays at the Beth Israel Deaconess Medical Center from June 2001- October 2012."}, {"type": "subtitle", "content": "Data Preprocessing"}, {"type": "sentence", "content": "Sociodemographic, operational, and clinical factors have been shown to be associated with readmission. The vast majority of models built to assess 30 day readmission risk, rely mostly on the sociodemographic, operational and expertly crafted disease specific clinical variables(comorbidities)(14–16), with a small portion including the time varying measurements such as labs and vitals to comprehensively capture a patients progress during their stay. Hence, to holistically assess this approach the following static and time varying variables were used in addition to the administrative and comorbidity features. The time varying features were windowed to capture the last 48 hours of a patients stay. To address the missing data challenges with the data, the data was backfilled from the last measure data point."}, {"type": "image", "content": "https://miro.medium.com/max/2268/1*U6pCDpGpbfXdorgF0Z51yw.png"}, {"type": "sentence", "content": "Inclusion Criteria:"}, {"type": "sentence", "content": "Exclusion Criteria:"}, {"type": "sentence", "content": "The cohort was then created using the above inclusion and exclusion criteria in the following steps:"}, {"type": "sentence", "content": "Step 1: Calculate age, remove patients under 18 years and create readmission flag"}, {"type": "sentence", "content": "The SQL script below extracts patients first discharge date from the ICU and used that discharge date to estimate the time elapsed between the first discharge date and readmission back to the ICU. The age of each patient was calculated as the difference between the shifted date of admission to the ICU and the year of birth. Please do not be surprised when an age of 300 shows up in the dataset, this is caused by a replacement of all ages > 89 with 300 in the MIMIC III dataset."}, {"type": "sentence", "content": "Step 2: Using the four most common comorbidity risk factors, extract this information from each patient in the above SQL view."}, {"type": "sentence", "content": "Step 3: Extract all of the time varying labs and vitals listed in Table 1. for each patient in the cohort"}, {"type": "sentence", "content": "Step 4: Average labs that were measured in the same hour by lab and patient"}, {"type": "subtitle", "content": "Methods"}, {"type": "sentence", "content": "After preprocessing the data an auto-encoder was used to first create a dense representation of the features, given their initial sparsity. The output of the auto-encoder was then used to fit a Gaussian Mixture Model (GMM), which is a probabilistic model that can be thought of as a generalized version of the k-means by including information about the covariance structure of the data as well as the centers of the latent Gaussians."}, {"type": "image", "content": "https://miro.medium.com/max/2604/1*Qf91PSyZqoZ_pverRXqXtA.png"}, {"type": "subtitle", "content": "Global Model Architecture:"}, {"type": "sentence", "content": "To help leverage the time varying variables for predicting 30-day readmission risk, a LSTM was used in each architecture. In the global model (Figure 2.), a single LSTM layer was used to train on all of the data, creating a global baseline with the intent of demonstrating the performance of a one size fits all model versus one that has a separate dense layer for each patient group."}, {"type": "image", "content": "https://miro.medium.com/max/916/1*1GsP0lXMGqmfBUXd2x17gw.png"}, {"type": "subtitle", "content": "Multitask Model Architecture:"}, {"type": "sentence", "content": "Similar to the global approach, this model used a single LSTM layer, however the final dense layer was specific to each cohort. This presents an opportunity for the models to learn salient patterns that are only present in specific patient cohorts versus using a shared dense layer which does not account for the differences. The architecture of this model can be see in Figure 3 below:"}, {"type": "image", "content": "https://miro.medium.com/max/848/1*_MTxsJdJHxAVX-1F9IdJ5g.png"}, {"type": "subtitle", "content": "Results"}, {"type": "subtitle", "content": "How many clusters (components)?"}, {"type": "sentence", "content": "Using the embeddings created by the auto-encoder, the Akaike information criterion (AIC) or Bayesian information criterion (BIC) plot was created to determine the optimal number of components (clusters) that minimizes the AIC and BIC. The results of these plots illustrate that 5 clusters would be best. However, the larger the cluster size the smaller the cohort, and my experiments using 4 or 5 clusters with a highly imbalanced data set resulted in homogenous clusters with only negative cases. Therefore a cluster size of 3 was chosen as a compromise in order to create a meaningful cohort that had a consistent prevalence. It is also key to note that while the AIC and BIC do generate negative values it is not the absolute size of the AIC or BIC value that determines if the selected model is best, it is the relative values over the set of models considered(18). ​"}, {"type": "image", "content": "https://miro.medium.com/max/780/1*YX2Kit2i4uFC53wnPgp1CA.png"}, {"type": "subtitle", "content": "Visualizing the unsupervised patient clusters:"}, {"type": "sentence", "content": "t- distributed Stohcastic Neighborhood Embedding representation of Clusters in 2D"}, {"type": "sentence", "content": "The plot below(Figure. 5) is a t-SNE representation of the output clusters predicted by GMM model. Here you can see that the clusters overlap quiet a bit which makes it difficult to get a better picture of the clusters in 2-dimensions. Thus a 3D t-SNE representation was created in Figure 6 ."}, {"type": "image", "content": "https://miro.medium.com/max/2884/1*T8LK1lK9n93NY5OywjDO0Q.png"}, {"type": "subtitle", "content": "t-SNE representation of clusters in 3D"}, {"type": "sentence", "content": "To help improve the visualization of the 4 clusters created, a t-SNE representation of the embeddings was created. The figure below shows the scatter plot and cluster plot of the clusters generated by the GMM model. Here we can see that a vast majority of the patients are in cluster 1, the cluster that contained majority of the readmissions, followed by cluster 2. We can see that both clusters 1 and 2 seemed to be more densely distributed than cluster 0, which seems to be must more dispersed (Interactive plot, click on cluster number on top right to see individual clusters)."}, {"type": "image", "content": "https://miro.medium.com/max/4416/1*k31Bvcxs9W6NvQ4WhkTjYA.png"}, {"type": "image", "content": "https://miro.medium.com/max/4356/1*R1HyHMxyq5S73uFaTMZ6tQ.png"}, {"type": "image", "content": "https://miro.medium.com/max/4788/1*iQHO511IxIVylMGpnpLVvw.png"}, {"type": "subtitle", "content": "Readmission Prevalence by cluster"}, {"type": "sentence", "content": "The prevalence rates varied significantly across each cluster, ranging from 5.6% in cluster 0, 13.04% in cluster 1, to 10.27% in cluster 2. The global multi-task model was trained on the entire cohort of patients with the final dense layer sharing the predictions of each patient cohort."}, {"type": "image", "content": "https://miro.medium.com/max/2288/1*yg41uFYzZB8Au0RxJvQkAg.png"}, {"type": "subtitle", "content": "Patient Characteristics by Cluster and Readmission status"}, {"type": "sentence", "content": "Using the clusters generated by the GMM model, Table 3 showed the baseline characteristics stratified by each patient cohort and readmission status of 33, 972 discharges and 3602(10.6%) readmissions. Overall, the vast majority of patients who were readmitted within 30 days were in cluster 1 , 59% population in cluster were male, 67.7% white, with a median length of stay of 2.70 days and 48.7% covered by Medicare. Since the age was discretized, the majority of readmission across all clusters occurred in the 51–70 year old age group and were originally discharged to a skilled nursing facility(SNF). Patients who had existing conditions such as congestive heart failure also showed higher readmission rates over the other four comorbidities included in the dataset."}, {"type": "image", "content": "https://miro.medium.com/max/2740/1*lhx_jL7oEWHpP1c82-DJ_g.png"}, {"type": "subtitle", "content": "Time varying features by unsupervised cluster"}, {"type": "subtitle", "content": "Vitals"}, {"type": "sentence", "content": "The heatmaps below shows the change in z-score values of both the laboratory and vital sign features over the last 48 hours of a patient’s stay. Positive, negative or zero values of the vitals indicate elevated levels, decreased, or average levels of each feature over time, respectively. In the case of cluster 0, it showed consistently increasing blood pressure and respiratory rates over the last 48 hours while, cluster 1showed increased Glascow coma scores in the early hours of the day prior to discharge. Interestingly, cluster 2 showed quite a few missing measurements, which is expected since many of these labs will not be captured later in a patients stay."}, {"type": "image", "content": "https://miro.medium.com/max/3300/1*90iZ233HJQo-Z-epJzb6Mg.png"}, {"type": "image", "content": "https://miro.medium.com/max/3324/1*xlYpowYTUgUaiYZr7ZOJFQ.png"}, {"type": "image", "content": "https://miro.medium.com/max/3296/1*uaHhSVmDOWVPi060hgjqEA.png"}, {"type": "subtitle", "content": "Labs"}, {"type": "sentence", "content": "In the case of the laboratory measurements within the last 48 hours prior to discharge; in cluster 1 where most of the patients were readmitted in we see many of the labs remained largely elevated over the course of the last 48 hours of stay, with the exception of Albumin, blood pH and pO2 which stayed relatively lower than average. Like the vitals heatmaps for the labs, demonstrated the same trend of missing lab values over the course of the last 48 hours increased as the frequency in which these labs were measured decreased later into the ICU stay."}, {"type": "image", "content": "https://miro.medium.com/max/3300/1*eFZavCCJDIPA7QdP7ZUdOw.png"}, {"type": "image", "content": "https://miro.medium.com/max/3224/1*4PrKkA0BNCf4QjLzaSuIJw.png"}, {"type": "image", "content": "https://miro.medium.com/max/3240/1*_InJyNHQoTtgwzsByULv0A.png"}, {"type": "subtitle", "content": "Model Results"}, {"type": "sentence", "content": "To assess whether the clusters play a role in better predicting a patient’s risk the patient cohorts were presented to a global multi-task model and the individual dense layer multi-task model for predicting a patients 30-day readmission risk. The results shown in Table 3. while promising come at a huge cost. While the algorithms were great at predicting negative cases, they did a poor job predicting positive cases. Hence the results below might be misleading, as they are heavily based on the majority class. This is can be attributed to several factors. Having several optimizers, network sizes and learning rates with no improvements in the PPV, I suggest that a possible cause for this is mostly likely the sparsity and reduced frequency in which many of the routine physiological data is collected at closer to discharge as illustrated in Figures 9–10. This led to the development of a feature set that is heavily influenced by missing values. However this approach can work using a different feature engineering approach. Note the single task model presented in the paper also performed significantly worse than the other which the author also experienced in her study, hence it was also not included."}, {"type": "image", "content": "https://miro.medium.com/max/1556/1*xwcBIyn1FHhQt22pBA0cZg.png"}, {"type": "subtitle", "content": "Conclusion/Limitations"}, {"type": "sentence", "content": "This project demonstrates how the idea of personalized should be done in the real world setting. However, the method will need to be adapted to ensure that the selected features provide meaningful results for predicting the outcome at hand. Some of the findings when revisiting the work presented in this paper that should be addressed if this method is to be used on other research projects include:"}, {"type": "subtitle", "content": "Future directions"}, {"type": "sentence", "content": "This publication is a step in the right direction of personalizing healthcare, and with some changes this modeling approach can provide some interesting insights into specific sub-populations which are often overlooked when building health related models because of the limited cohort sizes available after applying the inclusion and exclusion criteria. However, while this is only a preliminary study that explored the modeling approach as is. With further research, with well crafted features and potentially using a more robust feature engineering strategy can further propel and evolve this approach. If we:"}, {"type": "sentence", "content": "My Blog"}, {"type": "sentence", "content": "Code is available on GitHub"}, {"type": "subtitle", "content": "Acknowledgements:"}, {"type": "sentence", "content": "Special thanks to Eraldi Skendaj for critically reading and providing feedback."}, {"type": "subtitle", "content": "References"}], "topic": "artificial-intelligence"}