{"title": "How ISIS Uses Twitter", "data": [{"type": "subtitle", "content": "Understanding the Islamic State’s Twitter Network Using Social Network Analytics"}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*qFQQ9yu6dXauZnVugeDbiQ.png"}, {"type": "subtitle", "content": "Introduction"}, {"type": "sentence", "content": "The Islamic State of Iraq and the Levant (ISIL), also known as the Islamic State of Iraq and Syria (ISIS) is a group that follows a jihadist doctrine of Sunni Islam. ISIS grew to fame in 2014 when it took over key cities in Iraq. Since then, the monitoring and prevention of ISIS influence have been a key goal of the United States and others."}, {"type": "sentence", "content": "Over the years ISIS has been using social networks to spread its message and recruit advocates for its cause. From pro-ISIS content to graphic materials such as executions, the use of the internet has been a prime tool of the terrorist group. These social networks have even been used to recruit members from Western countries such as the United States, the United Kingdom, and Canada."}, {"type": "sentence", "content": "Understanding the network of pro-ISIS Twitter accounts can help uncover who the primary actors are, how content propagates through the network, and improve the monitoring of ISIS activities."}, {"type": "subtitle", "content": "Data"}, {"type": "sentence", "content": "The data used for this analysis was provided by Data Society on the website data.world. The dataset was collected from 2015 to 2017 and contains 17,000 tweets from over 100 pro-ISIS accounts. Features collected include:"}, {"type": "sentence", "content": "name, username, description, location, number of followers at the time the tweet was downloaded, number of statuses by the user when the tweet was downloaded, date and timestamp of the tweet, and the tweet itself"}, {"type": "sentence", "content": "The dataset can be found here."}, {"type": "sentence", "content": "In order to build a network graph of the Twitter accounts, a node list and edge list must be created. The graph will visualize connections between accounts through mentions. Twitter mentions are embedded in the text of a tweet using the @ symbol followed by a user’s username. In order to generate the node and edge lists a Python script was used to extract mentions from a tweet and create edges between the user who tweeted and the mentioned user. Both the node and edge list were then fed into the network graphing program Gephi for analysis."}, {"type": "subtitle", "content": "Analysis"}, {"type": "sentence", "content": "The node and edges lists were fed into Gephi to generate a graph. The graph nodes are color-coded by degree (the number of connections to other nodes) with red->yellow->blue color scale. The edges are color-coded by weight with a red->yellow->blue color scale. The Fruchterman Reingold Layout Function was used to organize the nodes of the graph. The resulting graph is shown below."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*qFQQ9yu6dXauZnVugeDbiQ.png"}, {"type": "sentence", "content": "As can be seen in the above graph, the number of nodes and edges is large, making it difficult to extract useful insights. However, even at this scale, certain structures and relationships are visible. Several high-weight relationships can be seen with the yellow and blue arrows, denoting twitter users that mention another specific user frequently. Several hubs (nodes to point to many other nodes) and authorities (nodes that are pointed to from many other nodes) can also be seen. Let’s take a closer look at the graph to get some better insights."}, {"type": "subtitle", "content": "High-Weight Relationships"}, {"type": "sentence", "content": "Several high-weight relationships are present in the network. Of them, two of them are very high (denoted by the blue arrows). These relationships are denoted below as relationship 1 and relationship 2."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*pA1RXkanBLWLOHPzniN1lw.png"}, {"type": "sentence", "content": "Relationship 1 is a directed relationship from user ‘mo********’ to user ‘Ra*********’. This relationship has a weight of 195, the largest in the network."}, {"type": "sentence", "content": "Relationship 2 is a directed relationship from user ‘wa******’ to user ‘Ni*********’. This relationship has a weight of 184, the second largest in the network."}, {"type": "sentence", "content": "While these relationships show frequent mentions from one specific user to another specific user, this does not necessarily mean that the mentioned user is highly influential to the graph. Let's take a closer look at these users and their networks within the graph."}, {"type": "sentence", "content": "The below image shows the relationships for the user ‘Ra*********’."}, {"type": "image", "content": "https://miro.medium.com/max/2908/1*GoazyweJMHYKIX4B29f3gg.png"}, {"type": "sentence", "content": "As seen in the above image, the user ‘Ra*********’ appears well connected to the network. With many relationships pointing both in and out of the node, it appears that ‘Ra*********’ acts as both a hub and authority in the network."}, {"type": "sentence", "content": "The below image shows the relationships for the user ‘mo********’."}, {"type": "image", "content": "https://miro.medium.com/max/2652/1*AANG7V0G9AAyZporxIPMtg.png"}, {"type": "sentence", "content": "As seen in the above image, the user ‘mo********’ also appears well connected to the network and acts as both a hub and authority in the network."}, {"type": "sentence", "content": "The below image shows the relationships for the user ‘wa******’."}, {"type": "image", "content": "https://miro.medium.com/max/3092/1*JaAy3GingGl2gxNY2slmUw.png"}, {"type": "sentence", "content": "Like the previous two users, the user ‘wa******’ appears well connected to the network and acts as both a hub and authority in the network."}, {"type": "sentence", "content": "The below image shows the relationships for the user ‘Ni*********’."}, {"type": "image", "content": "https://miro.medium.com/max/2384/1*sFjHkPF7ZIfWLStaugyweA.png"}, {"type": "sentence", "content": "Unlike the previous three users, this graph shows a slightly different picture. While the user ‘Ni*********’ appears relatively well connected in the network, the other three users appear to have a much higher degree."}, {"type": "sentence", "content": "However, without a baseline to compare the importance of these users cannot be established. In order to get a baseline for the degree of nodes in the network, the degree statistics report was run. It was found that a small number of nodes have high degrees with many nodes having low degrees (as expected in a scale-free network). The results are shown below."}, {"type": "image", "content": "https://miro.medium.com/max/2660/1*YdFRzyP0FY-mVwavZl2xyA.png"}, {"type": "sentence", "content": "The few hubs and authorities in the network are likely to be key members and important to identify for monitoring efforts. In order to better visualize these nodes, their size has been scaled to their degree. This graph is shown below."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*FIVydnVa6EsrPCT_UA77KQ.png"}, {"type": "sentence", "content": "As can be seen in the above graph, there are several hubs and authorities present in the graph (denoted by the large node size). Three of the four nodes we looked at above are also found."}, {"type": "sentence", "content": "While these nodes are both hubs and authorities, it does not denote which nodes are which. In order to identify which nodes are hubs and authorities, two graphs were made — one with the size of the node scaled to the outbound relationships and one with the size of the node scaled to the inbound relationships. These graphs are shown below."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*OPYp4Q0tJhx4Wlkn8v-Lnw.png"}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*cd-UwfaY5kk84zF4NlRh0g.png"}, {"type": "sentence", "content": "As can be seen in the above images, separating the node scaling by inbound and outbound connections can provide useful information. While both hubs and authorities have a high degree, their roles in the network differ. The high in-degree nodes (authorities) are likely to be key members of the pro-ISIS network who command some authority from within the network. These members are prime security-monitoring candidates."}, {"type": "sentence", "content": "The high out-degree nodes (hubs), on the other hand, are key to spreading information across the network. These members are highly connected within the network, mentioning many people in their tweets."}, {"type": "sentence", "content": "In addition, some of these hubs appear to be one of the few connections groups of accounts have to the greater network. These nodes are called bridges. Removing these nodes from the network can significantly reduce its size, making these key accounts to shutdown."}, {"type": "subtitle", "content": "Discussion"}, {"type": "sentence", "content": "Social network analysis of pro-ISIS Twitter accounts can provide valuable insights to improve security-monitoring and prevention efforts. Identifying key authorities in the network allow monitoring efforts to be better target those who are most influential in the network. In addition, identifying hubs can provide key accounts for removal in order to limit the effectiveness of information to propagate through the network."}, {"type": "sentence", "content": "While this analysis looked at relationship weight and node degree, there is still room for further analysis of this social network. Additional centrality measures could be analyzed such as betweenness, closeness, and PageRank."}, {"type": "sentence", "content": "The dataset used in this analysis was compiled in 2017. Because of the fast-moving nature of groups such as ISIS a new dataset could also be collected to provide insights more applicable to the current landscape."}], "topic": "data-science"}