{"title": "The School District That’s Serving Kids 3 Meals a Day Through Quarantine", "data": [{"type": "subtitle", "content": "The foodservice crew in Santa Clarita Valley is working around the clock"}, {"type": "sentence", "content": "At a time when so many of us feel utterly useless, it can help to instead feel inspired by others and what they do — on a regular basis, but especially now — to take care of America’s children. This is why I wanted to talk to some of the foodservice professionals who ensure that the 30 million kids who rely on school meals get fed every single day during the pandemic."}, {"type": "sentence", "content": "Despite being busier than ever, three of these incredible people spoke with me in late April about the work they’re doing. (I was connected to them via FoodCorps, an organization whose mission is to connect kids to healthy food at school.) Here’s the third, with Robert Lewis, chief executive officer of the Santa Clarita Valley Food Service Agency in Santa Clarita Valley, California. (The first and second Q&A are here and here.)"}, {"type": "image", "content": "https://miro.medium.com/max/2570/1*_j4gU9eUEHqdoertMQGVbA.jpeg"}, {"type": "sentence", "content": "KB: When you found out the schools were going to close, what was your first thought?"}, {"type": "sentence", "content": "RL: I was actually in Washington, D.C., at the time, at a legislative action conference, and the USDA undersecretary was there, and we found out that closing was a possibility. So at the conference, we were talking about some strategy plans, but by the time I flew home, all four school districts here had decided that they were going to close and that they wanted us to serve students. So we had to figure out a plan as fast as we could to feed students outside of the central kitchen here in Valencia, and those first few days were crazy. We served from both sides of the street, we did the drive-through and served everybody that came through, and in those first three days, March 18, 19, and 20, we served about 3,200 families. And then we came up with a plan to open 11 schools — we normally have 38 — to do breakfast and lunch service."}, {"type": "sentence", "content": "Oh, you’re doing breakfast, too?"}, {"type": "sentence", "content": "Yes, one week later we started doing breakfast. We added a breakfast in the same box as the lunch so they get breakfast and lunch in the same box for each child, and then starting April 20, we added a supper. A lot of our kids are used to having a supper anyway, so this is really going to help the families."}, {"type": "sentence", "content": "Tell me a little about your community."}, {"type": "sentence", "content": "It really is a community that cares about one another. Just to give you some background, this is like the third or fourth major emergency this community has had recently. So going back to October, we had those really high winds that blew things down: We had to close the schools because of the winds. And then the next week, there were fires: We had to close the schools because of the fires and the ash. And then going forward, toward November, we had that shooting at Saugus High School. I don’t have the high schools; I just have the elementary district. But it affected our elementary schools because we had to shut those schools down that were around the high school, and then they were closed down around that area for about a week. And then, you know, this."}, {"type": "sentence", "content": "I noticed, though — the people that live in Santa Clarita Valley, they pull together in a time of crisis. I have a good friendship with the sheriff captain. Early on, he asked me if we had enough N95 masks, and I said, no, we don’t. We’re trying to get someone to get us an order for homemade masks; we do have somebody working on it, but we’re going to run out. Well, he had some resources and he ordered 500 masks, and he delivered them in person to us."}, {"type": "sentence", "content": "A lot of us feel pretty helpless and we don’t know how we can contribute. What can people do for a community like yours?"}, {"type": "sentence", "content": "Cloth masks … those would help a lot. We have people’s grandmothers sewing them for us right now. If my mom was with us, I’m sure she’d be making them."}, {"type": "sentence", "content": "So people are probably working around the clock, right?"}, {"type": "sentence", "content": "Yeah. Well, they come in at 4 or 5 o’clock in the morning, every day, and being that we don’t want them to be exposed to the virus, or be exposed to one another too long, they’re working early in the morning and then we’re trying to get them out early — we don’t want to expose them for a full day."}, {"type": "sentence", "content": "What kinds of responses are you getting from the parents and the kids?"}, {"type": "sentence", "content": "They’re very appreciative: They’ve made little signs, things like that. One evening, some kids went out with some colored chalk, and they wrote all over the sidewalk, big thank yous to all of the cafeteria ladies, and so when they walked to work that morning, they saw that. It said “thank you, we love you, thank you for feeding us” — that kind of stuff. And they clap their hands as they’re coming through. They’re very appreciative and very happy to see us."}, {"type": "sentence", "content": "I just can’t get over you doing breakfast, lunch, and dinner. That’s such an undertaking. What kind of food are you serving?"}, {"type": "sentence", "content": "So the lunches we try to do hot. Breakfast, of course, that’s cold. Sometimes it’s something they can heat up at home, like some type of a pastry or something. Or we give them cereal, things like that, and that always includes a fruit, and a milk, and a fruit juice. And lunch, of course, includes all the components: Bread, protein, fruit, vegetable, and milk. So supper will be the same thing as lunch, those five components. And then what we’ll do for the suppers is we will put instructions in there about how to heat it up at home."}, {"type": "sentence", "content": "The schools have been wonderful. They give us a custodian every day, who cleans the entire time, and then usually a principal or a vice-principal will be there with us, as well. And then we have volunteers, too. For example, yesterday, when I was at one of the schools, the president of the school board was out there, handing out meals. We’ve had PTA presidents out there helping us, some of the teachers come out, and the kids love that, because they miss their teachers. You know, it’s been a totally different protocol; we’ve had to retrain everybody, how to use the gloves, how to use the masks, keeping 6 feet apart, being very careful, washing your hands constantly, all of that different stuff. We’ve done a number of different trainings with them, just to cover all of our bases. There’s nothing in the playbook for us — well, for the whole world. For us, this is all by the seat of your pants. We have been getting information from USDA, on what to do, and how to handle things. And of course our state agency — California Department of Education — they’ve been giving us instructions as well, but it’s just been around the clock. Twenty-four hours a day, my staff and I — even on Saturday and Sunday — we’re trying to think of ways to serve our families, the best way we can, because we know they need it. We have a lot of people here who have been laid off, who are in the service industry or whatnot, and it’s just one of those things where you have to do your best at all times. But it’s a challenge to think of new, creative ways to do it."}, {"type": "sentence", "content": "And it’s for everyone, right? Any child who wants a meal can get one?"}, {"type": "sentence", "content": "Eighteen and younger, yes. And if they have an allergy, we have a different meal for people with allergies. If it’s peanut butter day, then we have a backup plan, maybe a toasted cheese sandwich or something like that. We have to plan for everything because we don’t want any child to be denied."}, {"type": "sentence", "content": "What are you doing to take care of yourself?"}, {"type": "sentence", "content": "What I’ve been doing, when I have time, is cooking at home. That seems to calm me down. And doing some baking. And of course, I have a lovely garden out here in Southern California, like everybody does out here, so going out and doing that. And then in my office here, we’re just a block away from the Santa Clara River, and there’s a big hiking trail there, so I go and walk along the river there. It’s really nice. And then, you know, trying to just take it one day at a time, one hour at a time, because things change so quickly. It’s just unprecedented, the whole thing. I need to be calm for my staff, as well, so they see how we’re doing, and making sure we lead by example, by staying calm and thinking outside the box and thinking creatively. And encouraging them to do that as well."}], "topic": "education"}