{"title": "How To Promote Your Content, Write Cold Emails, and Grow Your Audience", "data": [{"type": "subtitle", "content": "Plus, how to build an effective newsletter and identify your target audience."}, {"type": "sentence", "content": "Here’s the latest edition of my For The Interested newsletter, a collection of tips to help you produce, promote, and profit from your creations."}, {"type": "sentence", "content": "A question creates value."}, {"type": "sentence", "content": "For the person who asks it, the one who answers it, and anyone who gets to consume that answer."}, {"type": "sentence", "content": "I’m answering questions on Twitter and it’s prompting me to consider and communicate things I haven’t necessarily addressed before."}, {"type": "sentence", "content": "You can ask me a question here and I’ll be happy to answer."}, {"type": "sentence", "content": "Collectively, we can create a whole lot of value."}, {"type": "sentence", "content": "Now, on to this week’s ideas…"}, {"type": "subtitle", "content": "1. The Two Ways To Grow Your Audience: Do More or Do Less"}, {"type": "sentence", "content": "“You can’t control the growth of your audience, but you can control the volume of your output.”"}, {"type": "sentence", "content": "I recently had an epiphany."}, {"type": "sentence", "content": "There are only two reasons why you may struggle to grow your audience: You’re either not doing enough or doing too much."}, {"type": "sentence", "content": "In this post I break down the two ways to grow your audience including how to figure out which issue you have and what to do about it."}, {"type": "sentence", "content": "Related: 100 things to publish in the next 100 days to grow your audience."}, {"type": "subtitle", "content": "2. How To Use Your Newsletter To Create Art, Attract An Audience, And Grow Your Business"}, {"type": "sentence", "content": "“You should do things and create things that you’d want to consume.”"}, {"type": "sentence", "content": "I’m obsessed with newsletters and the power of email so it was fun to have this opportunity to chat about how I use them."}, {"type": "sentence", "content": "Bryan Kelly recently interviewed me in this episode of the Pushing Send podcast and we had a 20-minute conversation about how I create and use my newsletter, what it takes to attract subscribers, and the key components of an effective newsletter."}, {"type": "sentence", "content": "Related: A five-day plan to grow your newsletter."}, {"type": "subtitle", "content": "3. How To Promote Your Content On Social Platforms"}, {"type": "sentence", "content": "“May 2019. I wrote my first marketing article. A year later my email list hit 19,000. No ads. No connections. No existing audience.”"}, {"type": "sentence", "content": "The best way to build an audience for your content is not to just share a headline and link to it on your social media platforms."}, {"type": "sentence", "content": "Harry Dry breaks down how to promote your content on social platforms and shares examples of how he presents his work on various platforms in ways that provide as much value as possible within those platforms."}, {"type": "sentence", "content": "For a deeper dive, check out his recent appearance on the Everyone Hates Marketers podcast where he goes into more detail about his approach and the success he’s seen from it."}, {"type": "sentence", "content": "Related: Eight ways to maximize the value you get from your content."}, {"type": "subtitle", "content": "4. How To Write A Great Cold Email"}, {"type": "sentence", "content": "“In a great cold email, the person receiving the email should benefit far more than you from a potential exchange.”"}, {"type": "sentence", "content": "There’s nothing wrong with sending emails to people you don’t know…as long as you send them something worth their time."}, {"type": "sentence", "content": "Auren Hoffman explains how to write a great cold email including to personalize it, emphasize how responding will benefit the reader, and keep it short and clear."}, {"type": "sentence", "content": "Also: never ask to grab coffee or use the phrase “I hope you are well.”"}, {"type": "sentence", "content": "Btw, I found this link in Khe Hy’s newsletter."}, {"type": "sentence", "content": "Related: How to write an effective follow-up email after meeting someone."}, {"type": "subtitle", "content": "5. What If Your Target Audience Was A Single Celebrity?"}, {"type": "sentence", "content": "“The best way to identify your celebrity persona is to ask you and people close to your project, ‘What celebrity should follow me but they don’t?’”"}, {"type": "sentence", "content": "I’ve spent a lot of time studying and teaching target audience techniques, but this is a new concept to me and I love it."}, {"type": "sentence", "content": "Amber Horsburgh suggests you pick a specific celebrity as your target audience and explains how doing so can help you see your niche in a clearer way."}, {"type": "sentence", "content": "She also shares a series of questions to ask yourself about your new target celebrity to help you identify how to position yourself with potential fans."}, {"type": "sentence", "content": "Related: How to get more true fans."}, {"type": "subtitle", "content": "My Final Words Of The Week"}, {"type": "sentence", "content": "My uncle turned 60-years-old today."}, {"type": "sentence", "content": "To celebrate the occasion, his siblings — spread out around the country — wished him a happy birthday on a Zoom call."}, {"type": "sentence", "content": "Ten minutes into it, he was surprised when myself and his other nephew and niece popped in to wish him a happy birthday."}, {"type": "sentence", "content": "Ten minutes after that, he was further surprised to see extended family, cousins, and a dozen other relatives magically appear on screen with birthday wishes."}, {"type": "sentence", "content": "Ten minutes after that, he was shocked as one-by-one his close friends and childhood friends he hadn’t seen in decades trickled in to join the festivities on screen."}, {"type": "sentence", "content": "When all was said and done, more than 30 people had surprised him and helped make his birthday a happy one."}, {"type": "sentence", "content": "It was a cool thing to be a part of."}, {"type": "sentence", "content": "It’s also a reminder that even when the world gets grim, we always have an opportunity to make of it what we want…even if just for a moment."}, {"type": "sentence", "content": "Take advantage of it."}, {"type": "sentence", "content": "Have a great week."}, {"type": "sentence", "content": "Josh"}, {"type": "sentence", "content": "PS — If you dig this newsletter, I’d love for you to share it with others who might enjoy it."}, {"type": "sentence", "content": "They can subscribe here."}, {"type": "sentence", "content": "Thanks!"}], "topic": "marketing"}