{"title": "Train a neural network in python to predict robot dynamics", "data": [{"type": "subtitle", "content": "Understand how to work with real robotics data."}, {"type": "sentence", "content": "My life as a robotics learning researcher is mostly data science (understanding data) and a bit of fun math (reinforcement learning). Here’s a snippet you can run for yourself and take lessons away into your projects (and career)!"}, {"type": "subtitle", "content": "Deep learning and robotics"}, {"type": "sentence", "content": "Neural networks have become state-of-the-art in multiple digital domains, particularly computer vision and language processing. The neural networks are complex function approximations (capable of fitting any function sufficiently accurately, from a fun theorem), so why not use them for robotics?"}, {"type": "sentence", "content": "In robots, we want to model the dynamics for two things:"}, {"type": "image", "content": "https://miro.medium.com/max/1232/1*lve6f0F1Vbo9NQ5c_x348g.png"}, {"type": "subtitle", "content": "The optimization problem"}, {"type": "sentence", "content": "When learning with a neural network will predict a discrete step in the dynamics of the system. Dynamic systems take the form shown below:"}, {"type": "image", "content": "https://miro.medium.com/max/1440/1*Etz_bdeG8ga9j0y8JlrYdA.png"}, {"type": "sentence", "content": "What we will model with the neural network (intentionally) is the underlying function, f, and we implicitly capture the disturbance, w, in the data. How do we do this? For data “niceness” we do a couple of things. Niceness means that the data is close to uniformly distributed with a mean of 0 and a standard deviation of 1."}, {"type": "sentence", "content": "What does this look like in the context of a neural network? Specifically, we can minimize the norm squared of the difference between the change in state and the function approximator. This is a mean squared error. It’s implemented in PyTorch here."}, {"type": "image", "content": "https://miro.medium.com/max/1604/1*6baSw1ioUHJzQBEiFK8-0g.png"}, {"type": "sentence", "content": "State of the art is using things like the Adam optimizer, Swish activation function (smooth version of ReLU), a learning rate scheduler, and more. The important way to get NN’s to work is data normalization. If you look closely at the code, I handle it in a very modular way. Without it, fitting models to real data would be near impossible."}, {"type": "subtitle", "content": "The code (PyTorch)"}, {"type": "sentence", "content": "This is how you will run the code. I include a conda environment called ml (PyTorch, AI Gym, Mujoco, and more). The trainer code will be found in the learn directory. Parameters are stored in a configuration file."}, {"type": "subtitle", "content": "The robots"}, {"type": "sentence", "content": "There are pre-filtered data in the repository from real flights of experimental robots learning control with reinforcement learning. It is an active research repository at University of California, Berkeley."}, {"type": "sentence", "content": "The code includes simulators for two flying robots, the Crazyflie and the Ionocraft. Both of these allow you to control the robots at 100 Hz, and the simulator calculates dynamics at 1000Hz. You can find the dynamic simulator here. The specific robot defines the force transforms for different actuators."}, {"type": "subtitle", "content": "Rich NN Object"}, {"type": "sentence", "content": "When working with a complex task (figuring out how to model a robot), it helps to have a configurable network object. You’ll see a series of flags here:"}, {"type": "sentence", "content": "Notice that I use X for states and U for actions."}, {"type": "subtitle", "content": "Create layers dynamically"}, {"type": "sentence", "content": "This may be the most useful part of the article for someone new to PyTorch. It lets you create a network of various depths and widths (the alternate is hard coding the configurations)."}, {"type": "subtitle", "content": "Train the model"}, {"type": "sentence", "content": "Omitting the optimizer code that is publicly available, and detailed in many tutorials, we can have a nice training function as our top-level object. Let lower levels of abstraction handle the details."}, {"type": "sentence", "content": "The neural network code is here. The training script is here. The overall code is here."}, {"type": "sentence", "content": "There is a lot more to play with this repository. I happily will take questions, pull-requests, and feedback. Or you can learn about my research here."}], "topic": "artificial-intelligence"}