{"title": "I Gave Up Instagram and 30,000 Followers", "data": [{"type": "subtitle", "content": "Are you living for the gram? Maybe it’s time to try something else."}, {"type": "sentence", "content": "Once upon a time, I was an Instagram fanatic. I was a pure devotee who used to defend it with zeal. It’s a little embarrassing how much I believed Instagram was the answer. Not only was I complacent in giving the majority of my time to the app, but I was also arguing its importance to others who were skeptical of the “true benefits,” I preached."}, {"type": "sentence", "content": "Fear not, dear reader, my days of convincing are over — at least when it comes to social media. I’m not here to tell you that you need to give up Instagram or that it’s an evil, terrible thing that will eat away at your humanity and destroy us all. Even if there may be some merit to that, albeit with less hyperbole."}, {"type": "sentence", "content": "I’m here to share my experiences and hope that I can offer some insight from someone who has had their fair share of mostly-behind-the-scenes ups and downs with Instagram."}, {"type": "sentence", "content": "If Instagram is your thing and it truly makes you happy, that’s not a bad thing. For some people, it’s part of their job or their entire career. But, if you don’t make a living off of Instagram and spend more time on it than you’d like to admit, I might be able to throw in a few helpful bits of advice."}, {"type": "sentence", "content": "I know a lot of people who’ve told me they hate Instagram, but they just can’t bring themselves to get rid of it. If you’re one of those people, this is for you."}, {"type": "sentence", "content": "Years ago, my professional journey with Instagram began. I was preparing to move out to the mountains to work as a full-time photographer, and I thought it was the perfect time to start using the platform as a portfolio. It ended up landing me a job, and thus the thought, “Instagram is great for my career,” was born. Sharing photos of my travels is when the account began to grow."}, {"type": "sentence", "content": "Since then, Instagram has gotten me multiple jobs over the years, and that continually fed into my false idea that it was a necessary tool to find success. It was easy to rationalize keeping Instagram as a big part of my life when I attributed a lot of my opportunities to it."}, {"type": "sentence", "content": "It wasn’t until I started working for a reputable magazine that I realized just how wrong I’d been all these years. I was suddenly working with all of these incredibly talented and successful people who didn’t even have an Instagram account. Soon enough, I’d learn there was more to life than Instagram. In hindsight, it’s hard to imagine a time when I didn’t understand that."}, {"type": "sentence", "content": "There are certainly some benefits that come with a platform like Instagram. I’m mostly mentioning them for 19-year-old me, or likeminded people out there, who might politely respond to an article like this with all of the reasons why “Instagram can be good — nay, life-changing.”"}, {"type": "sentence", "content": "Yes, you can use it as a portfolio. You can make a living off of it. You can create new connections that have the potential to change your life. You might even find your significant other. These things can be true, but they’re the exception, not the rule."}, {"type": "sentence", "content": "You might find success on Instagram, but, statistically, not everyone can be in the top 10% of creators. I honestly believe that all of these things are not only possible but easier to do using other mediums, be them online or real-life organizations."}, {"type": "sentence", "content": "The funny (and slightly scary) thing is that, although this may seem obvious to so many people, so many of us still feel unwittingly entrenched in the Insta-community. You may be thinking, “Duh! Of course, you can make meaningful connections and find incredible career opportunities without Instagram.” But that’s not the way Western society treats it, and not everybody knows that."}, {"type": "sentence", "content": "We’re taught to put a great deal of effort into concocting our online persona and, while I believe reputation can be important, I think there are more productive and meaningful ways to become the people we want to be."}, {"type": "subtitle", "content": "Obsessing over image"}, {"type": "sentence", "content": "One of the most significant issues with Instagram is an obsession with cultivating the perfect image for ourselves. I’ve heard so many stories about twenty-somethings comparing their lives to their peers, feeling inadequate as a result. I’ve experienced it myself."}, {"type": "sentence", "content": "Some people are perfectly content with their lives until they start comparing what they’re doing, or not doing, to the exciting things they see other people doing online."}, {"type": "sentence", "content": "I wrote this article for The Startup called “Stop Worrying About How Your Life Looks on Instagram.” One of my favorite passages from it is the quote below because so many of my friends who read it reach out to me, saying, “That’s 100% me.”"}, {"type": "sentence", "content": "It can be challenging to figure out which direction your life should go when you’re preoccupied with what others think you should be doing. The more you let theoretical online opinions shape your behavior, the less control it will feel you have over your own life."}, {"type": "subtitle", "content": "​Privacy"}, {"type": "sentence", "content": "One of the biggest things I’ve come to appreciate over the last few years is my privacy. Millennials and Gen Z, two generations which I fall directly in between, have had many parallels drawn between them. One difference, though, is that Millennials have been branded oversharers, while Gen Z is noted to be learning from Millennials’ online mistakes."}, {"type": "sentence", "content": "Instead of learning from Millennials’ mistakes, I feel like I’m learning from my own mistakes. Except I wouldn’t call them mistakes, because I don’t regret my proclivity for sharing on social media. I think it’s allowed me a glimpse into a world I realized I did not want to be a part of. It wasn’t a mistake, but it was the basis for my decision to partially retreat and remove a lot of my personal life from the internet."}, {"type": "sentence", "content": "At my social media peak, I had 33,000 followers across my profiles (Instagram, Snapchat, and Twitter). It wasn’t for me. Being able to spread positive messages to a large following was nice, but it was a lot of work to keep up with. Physically and mentally."}, {"type": "sentence", "content": "While I strongly believe in being transparent and honest, I don’t think I need every detail of my life published on the internet for anyone to see. Especially not 33,000 people who I can guarantee were not all close friends of mine."}, {"type": "sentence", "content": "I realize the irony in saying that when I’m writing about my life in an article that will be read by people who I don’t know. But I’d argue that writing this story for you isn’t the same as posting weekend snaps about everything I do."}, {"type": "sentence", "content": "Taking a step back from Instagram means that I’m living my life for me. It’s mine and nobody else’s. I’ve come to value the parts of my day that I share with myself and the people I care about in my life."}, {"type": "subtitle", "content": "Freedom"}, {"type": "sentence", "content": "There’s an alleviating sense of freedom and a self-assertive power that comes with nobody else knowing where I am or what I’m doing. In my late teens and early twenties, I was so used to everyone knowing everything about me. It’s refreshing to retreat into the privacy of my own home and work on projects that are important to me without the pressure of keeping everyone updated."}, {"type": "sentence", "content": "I’m an open book, don’t get me wrong. Ask me anything, and I’ll most likely be willing to answer it. But there’s a difference between openness to share parts of myself with people who genuinely want to know more about me and projecting unsolicited chunks of my life upon anyone who happens to be around."}, {"type": "subtitle", "content": "Too many connections"}, {"type": "sentence", "content": "In the 1990s, British anthropologist Robin Dunbar studied the average size of primate social groups. Using his research on primates and humans, he proposed that we can only reasonably maintain about 150 stable relationships at once. He explained it as the “people you would not feel embarrassed about joining uninvited for a drink if you happened to bump into them in a bar.”"}, {"type": "sentence", "content": "In my experience, most of us have well over 100 connections on social media sites. These numbers grow so easily because many of us don’t have a very high standard for who we follow or who we let follow us. We seldom think about all of the parts of ourselves we’re sharing when we click “accept follow request,” or if our accounts are public."}, {"type": "sentence", "content": "Before you know it, hundreds, thousands, or hundreds of thousands of people are watching you eat your breakfast and keeping up with your workouts at the gym. If you’re one of those top ten-percenters, bump that number up to millions."}, {"type": "sentence", "content": "Our online profiles are oversaturated with meaningless connections. We’re notified of life updates from people we’ve met in passing, or people we haven’t met at all."}, {"type": "sentence", "content": "Before the entrepreneurs chastise me, I recognize the importance of networking and making widespread connections. It’s a valid objective. You never know what connections you’re going to make or what opportunities may arise from said connections. However, I also recognize that networking isn’t for everyone. If you’re looking to network, maybe I can redirect you to LinkedIn instead of Instagram."}, {"type": "subtitle", "content": "Keeping in touch with real friends"}, {"type": "sentence", "content": "One of the most rewarding parts of being less active on social media is that I catch up with friends in heartfelt ways. Sharing every life update online often means that people don’t really have reason to ask about your life and vice versa."}, {"type": "sentence", "content": "People didn’t need to ask how I’d been doing or what I’d been getting up to because it was always instantly delivered to their feed. People would often tell me what I’ve been up to as opposed to asking because they’ve already seen it."}, {"type": "sentence", "content": "All anyone has to do to “keep up” with you is unlock their phone and open an app. Sometimes, not even that much if they have push notifications enabled. They could be sitting on the couch and, with nothing but the flash of their screen stimulated by an anything-but-subtle push notification, they know that you’ve embarked on a trip to Mykonos."}, {"type": "sentence", "content": "Lack of communication in friendships doesn’t always come from a place of disinterest, nor does it necessarily indicate a fizzled connection. It’s just practicality in the whirlwind of peoples’ busy and overwhelming lives."}, {"type": "sentence", "content": "If Beyonce sees online that Drake was accepted to Oxford for a Masters of Engineering, she may not feel as inclined to personally message him and ask what he’s doing with his life. She knows that he’s at Oxford."}, {"type": "sentence", "content": "I couldn’t think of better fake names."}, {"type": "sentence", "content": "Now, you may be thinking, “Okay, if my friend didn’t ask me about my life just because they’ve seen my Instagram updates, they’re not really my friend.” That’s entirely fair, and it’s kind of my point. Our connections are made weaker by social media."}, {"type": "sentence", "content": "It’s not because we’re always choosing the wrong friends, but because it takes away the natural mystery of life. The appropriate amount of mystery that encourages us to want to get to know someone."}, {"type": "sentence", "content": "I value my close friendships because we make an effort to keep in touch with each other. Our life updates are shared through face-to-face interactions, not the passive action of scrolling and liking."}, {"type": "subtitle", "content": "Get to know me in real life"}, {"type": "sentence", "content": "I’ve had some disappointing encounters in the periods I’ve gone without Instagram. There have been instances where I’ll meet someone new, and they’ll ask to follow me — a social ritual with which many of us are familiar."}, {"type": "sentence", "content": "When I tell them I don’t have it, they’re confused, shocked, disappointed, or all of the above. Sometimes even angry. The anger one really confuses me. It’s usually when I meet them in a “romantic” context, like a dating app."}, {"type": "sentence", "content": "The most common response to why they’re disappointed is, to my dismay, “I wanted to see what kind of person you are.”"}, {"type": "sentence", "content": "That’s the last thing I want. Deciding who I am based on my Instagram? No thank you. Not today."}, {"type": "sentence", "content": "I want people to get to know me by interacting with me, not the pixels on their screen. If you need to know I’m not a catfish, add me on LinkedIn. It’s public and I can guarantee there’s a lot more information about me there than my Instagram."}, {"type": "subtitle", "content": "Finding your voice elsewhere"}, {"type": "sentence", "content": "By putting so much emphasis on my ability to have a voice and make a difference through my Instagram following, I was deterred from finding other ways to use it. I started a podcast while I was in university to begin exploring what it meant to have a voice, and I think it was then that my relationship with Instagram first began to fade."}, {"type": "sentence", "content": "I had one of those right-in-front-of-me-the-entire-time moments when I began to recognize that countless influential people have done great things for the world, and they didn’t have Instagram accounts. It sounds more than obvious when you give it even a second of thought. But it’s not something that’s casually tossed around in our conscious minds."}, {"type": "sentence", "content": "It still took a couple of years after that to get to the point where I’m at now, where Instagram feels like a distant memory. It’s like a relationship that taught me a lot but from which that I’ve ultimately moved on."}, {"type": "subtitle", "content": "Opportunity cost"}, {"type": "sentence", "content": "Missed opportunities are the worst, especially the ones we don’t even know we’ve missed. I can’t tell you how much time I’ve spent on Instagram in the past. I really can’t. I don’t know, and I don’t want to know because the answer would probably be mortifying when I think about all the things I could have been doing instead. I wouldn’t say I was ever an Instagram addict either."}, {"type": "sentence", "content": "I bet if you had a look at your screen time usage, you’d be surprised by how much you’ve spent on it. I go more into detail about this in the first article that I wrote for The Startup, “I Got Rid of My Phone for a Week.”"}, {"type": "sentence", "content": "Think about all the hours you’ve spent scrolling through your feed, absorbing meaningless content, hate-liking vacation photos, comparing your body to Hollister-Esque models, allowing yourself to believe influencers lead perfect lives."}, {"type": "sentence", "content": "Imagine you could take all of those hours and squandered mental energy and put them toward something you care about. Something productive or something that just makes you happy."}, {"type": "sentence", "content": "Now that I think about it, I take it back. I want to know, and I want you to know how much time I used to spend on Instagram. Maybe seeing my number, or you calculating your own, will be a wake-up call of sorts. Here’s some quick math from estimates based on what I’ve seen in the past from my screen-time stats. Ugh, math. I know. But I’m the one doing the work here because, like a loving friend, I care. So no complaints."}, {"type": "sentence", "content": "At my worst, I used to use it anywhere from 2 to 5 hours a day."}, {"type": "sentence", "content": "It was probably more like 4–7 hours a day at my absolute peak."}, {"type": "sentence", "content": "Let’s average 5.5 hours a day on Instagram. I’ll round up to the nearest full number."}, {"type": "sentence", "content": "That’s 39 hours a week. We’re well past an entire day already, and it’s not looking good."}, {"type": "sentence", "content": "168 hours a month."}, {"type": "sentence", "content": "2,008 hours a year!"}, {"type": "sentence", "content": "That’s three months of my entire year…"}, {"type": "sentence", "content": "I know you didn’t sign up for a math session when you started reading, but isn’t it riveting? That’s two months I could’ve spent doing almost anything else. There are so many things I felt I didn’t have time for. Not having time is one of the most common excuses we make for ourselves because it’s just that simple."}, {"type": "sentence", "content": "“I just don’t have the time,” he said as he sat on the couch and binge-watched all six seasons of “Orange Is the New Black.”"}, {"type": "sentence", "content": "The same way you can find things to cut out of your financial budget, you can find something to cut out of your time-guzzling activities so that there’s more time put toward things that matter to you. It’s like a time budget."}, {"type": "subtitle", "content": "Changing your relationship with Instagram"}, {"type": "sentence", "content": "Finally, let go of the idea that you need social media to make you somebody. If you’re lucky enough to have a good relationship with it, I’m happy for you. I’m sure we could all use some of your wisdom (seriously, please let us know). But even you, a reader who doesn’t let Instagram bother them, can hopefully recognize that it’s not a necessary instrument to advance your career."}, {"type": "sentence", "content": "I’m not telling you you shouldn’t use Instagram at all; I’m just saying you’ve got to change your relationship with it. If you use it as a way to satisfy a desire for attention, it’s probably going to make you feel pretty crummy. If you use it to keep up with the people you care about or accounts that inspire you, maybe you’ll have a better experience. If you’re stuck in a headspace where you always compare yourself to others, it might not be the best app for you."}, {"type": "sentence", "content": "I use Instagram on occasion now to share articles or photos of the mountains when I’m out hiking to my story and to keep in touch with a few people. Keeping in touch with people is the only reason I’ve kept it."}, {"type": "sentence", "content": "I spent three months without it at the beginning of the year, and that changed my relationship with it entirely. I keep my notifications off, and I’m not usually logged in. I don’t feel drawn to it like I used to. I only follow people who I genuinely care about keeping up with. I don’t follow celebrities. I haven’t posted anything since last year, and I keep my account private."}, {"type": "sentence", "content": "Whatever you decide to do, I think regular breaks from Instagram can be useful. It’s essential for your mental health and wellbeing that you work on your relationship with it if it’s something you struggle with."}, {"type": "sentence", "content": "Taking a long enough break from Instagram was like going back to a bad ex. After some time apart, I thought maybe things would be different, only to realize things were the same, and I was less interested than I thought I’d be."}], "topic": "social-media"}