{"title": "A Look at Metal Gear Solid V Through Lens of Modern Stealth Mechanics", "data": [{"type": "sentence", "content": "Over the past couple of months, I’ve been playing a lot of stealth games. This has been my go-to genre of video games for decades now. Half of my video game library consists of stealth games with the second half being stealth-like games."}, {"type": "sentence", "content": "I started with the excellent Dishonored 2, beat through the main campaign as Emily (in low chaos, of course), and moved to the controversial but superb Hitman 2016. Once that game was finished, I realized that I also have Metal Gear Solid V: The Phantom Pain installed on my PS4."}, {"type": "sentence", "content": "I’ve booted the game, saw a 78% completion rate, realized how well the visuals hold up, and proceeded to play Hitman 2. Reason? The game didn’t felt mechanically flawed to me. Which is odd as I’ve beaten MSG2 and 3 like a hundred dozen times and these games are superb. What went wrong? I have a few theories, so let’s take a look at each."}, {"type": "subtitle", "content": "The Open World Fatigue"}, {"type": "sentence", "content": "For the past 5 to 6 years, we saw a stupidly huge amount of open-world games being released. Some were excellent, like Horizon Zero Dawn and Breath of the Wild, while others were No Man’s Sky and Assassins Creed Unity. To me, they all share the same issue, and that is boring traversal. I understand that in such games you inherently need to move from point A to B but make the traversal at least a tad interesting. Make them eventful."}, {"type": "sentence", "content": "When your world is all about walking from point A to point B by holding the stick forward, you are wasting a lot of time that you otherwise could have spent progressing in a linear game."}, {"type": "sentence", "content": "The sneaking mechanics in Metal Gear Solid V are great. They are in fact, one of the best in the business. Every animation, every tactical takedown, every audio cue delivers a very gratifying experience. Every time I got caught, that was my mistake and mine alone."}, {"type": "sentence", "content": "Yet despite having very good stealth mechanics, the majority of your playtime you have to run through a barren field for 2 to 5 minutes to find a mission briefing point. After you are done listening to Kaz, you need to do more running but this time to the actual mission location."}, {"type": "sentence", "content": "To add insult to the injury, the game manages to slow you down even further with the seemingly mandatory scouting mechanics. If you plan on completing the mission, you have to spend a considerable amount of time scanning the surroundings using your binoculars."}, {"type": "sentence", "content": "Said goggles will mark your enemies and allow you to see through walls no matter how far they are. It sounds and looks great but it wastes time and removes the improvisation part of the game."}, {"type": "subtitle", "content": "Exploitable Mechanics"}, {"type": "sentence", "content": "A good stealth action game gives you just enough tools to leave undetected in a tricky or unpredictable situation. Take for instance the aforementioned Dishonored 2. The game has an X-ray vision skill that allows you to see through walls in a very small radius. Kinda like MGS V binoculars."}, {"type": "image", "content": "https://miro.medium.com/max/1040/1*PX1F8DbD6cbjRMJFRpvR0A.gif"}, {"type": "sentence", "content": "This skill allows the player to see enemies through walls as well but they can’t really track them all the time since the mana, which is used to activate the ability, isn’t infinite. Furthermore, the duration of the skill is short so the player is forced to improvise and tread even more carefully every time the effect wears off. Something, MGS 5 completely removes from the equation."}, {"type": "sentence", "content": "To make another comparison, Hitman 2016 and its follow-up, Hitman 2 allows you to scan the environment in an X-ray fashion at any given time without any prior scouting. On the surface, this is even more overpowered than MGS 5 binoculars but in reality, it is not. You see, unlike Snake, Agent 47 doesn’t have a reflex mode, meaning every time he is caught, you are forced to improvise."}, {"type": "sentence", "content": "This passive ability (Reflex Mode) that slows time every time an enemy sees you not only allows you to escape any penalties for being caught but can be exploited to quickly dispatch multiple enemies at a time. Yes, somehow the slow-mo effect stacks up and can be used to make the game even easier than it already is."}, {"type": "image", "content": "https://miro.medium.com/max/1040/1*UcGtUiz14U581vIg2J5O6A.gif"}, {"type": "sentence", "content": "If the player is not punished for being caught, it means the player is encouraged to deploy this strategy over and over. It is easy to execute and the effect works 100% of the time, so why shouldn’t you use it? Well, you shouldn’t and don’t take my word for it. Here’s what Doom Eternal director Hugo Martin once said in an interview with Polygon:"}, {"type": "sentence", "content": "Doing the same old strategy will eventually get you bored. And if you are bored with a game, you will boot something else. Something that isn’t so easily exploitable."}, {"type": "subtitle", "content": "The Quiet Companion"}, {"type": "sentence", "content": "While a great character from a story perspective, Quiet is a very over-powered companion that can do most if not all the dirty work for you. Once you reached a certain bond-level with her, you can ask her to scout the enemy base which speeds up the aforementioned scanning issue. However, this ability has an issue."}, {"type": "sentence", "content": "Players can equip her with a tranquilizing sniper rifle if they choose to play in a non-lethal fashion and we all know where this is going. After you’ve asked her to scout the area, you can order her to tranquilize a single enemy… yet for some dumb reason she continues to tranquilize them all. This command will trigger a domino effect and long before you know it, she will obliterate virtually everything in her path."}, {"type": "sentence", "content": "Unless you are fighting a chopper or a tank, no foot infantry stands a chance. She will put to sleep, everyone. Granted, I didn’t learn about this “exploit” till mid-way through the game but the point stands. If all it takes is two button presses to activate this ability, you are bound to use it."}, {"type": "subtitle", "content": "Self-Imposed Challanges is a Must"}, {"type": "sentence", "content": "While the game, from a design perspective, has a few flaws I recognize that it also has a ton of good things in it. I really love the fact that enemy guards will start wearing protective helmets as a result of your shooting in the head all the time."}, {"type": "sentence", "content": "I also recognize the fact that the game has a very good enemy “grey area” of sight. In fact, both Dishonored 2 and Hitman lack in this regard. The AI is very well presented in MGS5 and is in no way hindered by its PS3 & 360 roots. They will scout the area, they will report on blind shots, and they will certainly wake-up sleeping comrades, something that Dishonored ditches completely."}, {"type": "sentence", "content": "And speaking of its last-gen roots, MSG V runs on the impressive but underutilized Fox Engine. This technology is incredibly scalable and very lightweight, especially considering how some of the effects look."}, {"type": "sentence", "content": "I mean, it runs, albeit compromised in a way, on PS3 and 360 at a reasonable framerate with most visual techniques in place."}, {"type": "sentence", "content": "All of this is a technological achievement, especially considering the fact that last-gen machines had only 512 Mb of memory and in PS3’s case not even unified. And speaking of PS3, remember the Cell processor? That didn’t age well at all, yet the game manages to hit it’s 30 FPS frame target most of the time."}, {"type": "sentence", "content": "Thanks to this cross-generational approach to development, the game manages to hit and maintain a nearly flawless 60 fps frame target even on a base PS4 and XBO. And if you are wondering why this is so important, well, Jaguar CPU cores have their roots in mobile technology, after all. Overall the game feels very snappy and looks very good in motion, something both Hitman and Dishonored 2 lack when played on a console."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "Metal Gear is a series I love, especially the older entries, that is why I was so harsh on the latest entry. I know I’m late to the party (very late) but I wanted to give my honest opinion after the release hype went down."}, {"type": "sentence", "content": "You can tell that the 5th entry isn’t exactly finished and I’m not talking about the story. The story needs an entirely separate article in my opinion. But yes, it is clear that Kojima didn’t have enough time to finish the game. If he were to finish it, this would have been the best game in the entire franchise."}, {"type": "sentence", "content": "In a perfect universe, where Kojima and Konami didn’t break-up, what would you like to see changed? What aspects of the game you wish would be improved? Let me know in the comments down below but for now, stay home, wash your hands, and play Metal Gear."}], "topic": "gaming"}