{"title": "Instagram Shouldn’t Be Your Only Source of Traffic", "data": [{"type": "subtitle", "content": "Keep building diversity, keep your business healthy"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*R0vjkGauYWqeF5Vc"}, {"type": "sentence", "content": "Social media is important, it can deepen the relationship between your brand and your customers, it can drive traffic to your business, and it can help you get known. But it is often seen as this magic acquisition platform, consistently and passively attracting new clients."}, {"type": "sentence", "content": "As a social media consultant, I got asked multiple times if I could help brands get more followers. While this is an acceptable request, it’s usually not the priority for these brands to get more business."}, {"type": "sentence", "content": "Very often, when brands don’t have a solid marketing strategy, they start blaming social media, and mostly Instagram, for not bringing enough traffic to their site."}, {"type": "sentence", "content": "Not getting enough traffic is, for sure, a problem, but there are lots of methods that you can experiment with to fix it. From SEO, to influencer marketing, PR, social media, there are lots of different ways you can attract new customers to your website."}, {"type": "subtitle", "content": "Mediocre Social Media Marketing Brings Mediocre Results"}, {"type": "sentence", "content": "Social media is rather cheap, easier to manage, and takes less time and energy than, let’s say, a sophisticated SEO strategy. But because of how accessible social media is, lots of brands tend to choose this only channel to promote their business."}, {"type": "sentence", "content": "Here’s a fact about social media marketing: it’s hard to do social media well."}, {"type": "sentence", "content": "Young brands are usually not sure about their market potential. Their website hasn’t been thoroughly tested. They don’t already know what sells well and what doesn’t. The interface of the site is still a little messy. Now, to all of that, add a mediocre social media strategy. You can imagine that the few people that click on the link in bio might not all become fans and clients."}, {"type": "sentence", "content": "These low conversion rates and few visits issues can be perceived as a lack of traffic by brands. But the problem can be the interface or loading speed of the site. It can be the product they’re selling. It can be pricing. It’s impossible to tell because the mediocre social media marketing is not bringing enough people and data in the funnel. Now to this lack of data, add the fact that a mediocre social media strategy will bring mostly unqualified visitors to the site. They’re now not enough data to know what the problem is, but the little amount of data collected is not relevant enough."}, {"type": "subtitle", "content": "The Proper Way To Test Social Media as a Source of Traffic"}, {"type": "sentence", "content": "If you multiply the ways you get clients and visitors to your site, you may get a good amount of data. You’ll now know if your website converts well, if visitors are interested in what you sell, if your pricing is right or not."}, {"type": "sentence", "content": "If you’re happy with the results, you can now try out social media."}, {"type": "sentence", "content": "Now, the results you’re getting by doing social media can tell a lot more about your strategy, here are a few examples:"}, {"type": "sentence", "content": "And that’s when working with a social media specialist can be worth it. A consultant will help you identify what’s wrong, and will find ways to fix it."}, {"type": "sentence", "content": "But without testing your business through other sources of traffic, it’s hard to target what’s genuinely wrong."}, {"type": "sentence", "content": "I could help a brand get their first 5,000 followers, and I could work on turning them into visitors of the site, but if the checkout page doesn’t work or if the demographics of these followers don’t match the persona that would be actually interested in the brand, then all these social media efforts are pointless."}, {"type": "subtitle", "content": "Don’t Put All Your Eggs In One Basket"}, {"type": "sentence", "content": "It’s important to remember that you don’t own anything on your social media."}, {"type": "sentence", "content": "If Instagram decides tomorrow that your content is not interesting anymore, it won’t show it to its users. Without any notice, your only source of traffic disappeared. It may take time to work around the changes that Instagram can make."}, {"type": "sentence", "content": "That’s why it’s crucial to keep other marketing channels. You want to keep your business healthy, and you need to make sure that it’s fully operating."}, {"type": "sentence", "content": "You can’t conclude from analyzing the data from one marketing channel."}, {"type": "sentence", "content": "Especially if that channel is being poorly managed."}], "topic": "social-media"}