{"title": "Ways to Support Small Business, Stimulate Local Economies, and Create Stronger Communities Post-COVID", "data": [{"type": "subtitle", "content": "Our communities will need us more than ever before"}, {"type": "image", "content": "https://miro.medium.com/max/15904/0*R-FFNJzVZrsJ7r0E"}, {"type": "sentence", "content": "Walking downtown during the height of the shelter in place order was ominous. One store had pyramids of toilet paper stacked in the window, offering a freeroll for every order phoned in and picked up. Others had closure notices posted in the windows. The usually-busy downtown area had few parked cars and almost no pedestrian traffic. It reminded me of those ghost towns you can visit where it seems like the residents just left one day, never to return."}, {"type": "sentence", "content": "Our local businesses will need us now more than ever. While financial collapse seems inevitable, we need to be intentional about what we spend — and where we spend it. It is entirely possible to support small businesses, stimulate our local economies, and create stronger communities. It will, however, require a lifestyle change for many of us."}, {"type": "sentence", "content": "I include myself in this. Delivery services have worn a path to my door during this pandemic, depositing one box after another as shop closures drove me toward online shopping. While Amazon is a convenient shopping experience, I also had to look at how I could support my local economy. I looked for which restaurants and shops were respecting CDC recommendations while also trying to figure out creative ways to survive."}, {"type": "sentence", "content": "Afterlife returns to a new version of normal, local businesses will need our attention so much more than big box stores. Figuring out ways to support them may take more time and effort than falling back into our previous spending patterns, but the impact of intentionally supporting local can be significant."}, {"type": "sentence", "content": "We may wonder just why we should support local. Picture many of our communities without the local shops, restaurants, and historic downtown areas. Local tourism would disappear without a robust downtown economy, and area events we’ve come to expect would grind to a halt. Any road trip through America will show you the abandoned downtown buildings of many towns and the resulting surrounding economic collapse."}, {"type": "sentence", "content": "But it’s more than just having a pretty place for tourists to visit. Local businesses provide superior service, offer a unique experience from chain stores and restaurants, and actually care about the individual customer. We are not just nameless, faceless consumers. Where, but in a small business, can we walk in a shop and be recognized by face or name?"}, {"type": "sentence", "content": "Here are just a few ways we can put money back into the communities where we live:"}, {"type": "sentence", "content": "I try to take a holistic look at local businesses — not just factoring in the brick-and-mortar shops, but the farmers, artists, and other small businesses that may not have a storefront but are still essential to our communities. If we want to shop small and support local more than on one designated day a year, we need to turn it into a lifestyle."}, {"type": "sentence", "content": "Some of these businesses won’t survive. They simply can’t afford the kind of losses big business takes in stride. But many of them could survive if the communities rally around them. Perhaps we need to spread the love around — alternating which local restaurants get our business or which shops we frequent."}, {"type": "sentence", "content": "Of course, many will argue that local shops cost more, and in a hurting economy, we may not have more to spend. Often, we have less. But many of these businesses aren’t as expensive as we think, and they often offer as many specials and sales as bigger businesses. I love getting a good deal, but I also love the warm glow of satisfaction that comes from supporting small, local businesses."}, {"type": "sentence", "content": "Within a week of the shelter in place, one of my favorite businesses closed. It was the hub of our small community, and it was a shock to see it go. To see it shuttered and then gutted by the new owners was deeply traumatic at a time when the loss was heavy enough already. I wondered then how many more businesses would suffer the same fate. Happily, the business was purchased by another local shop that will give it a makeover and a fresh start. While I will miss what was, I look forward to what will be, but I also know that without community support, it can’t hope to survive."}, {"type": "sentence", "content": "Change isn’t coming. It’s here. Renewing our commitment to support local — or making an intentional choice to start — could make all the difference."}], "topic": "business"}