{"title": "Grief, Love, and the Collar She Would Never Wear For Long", "data": [{"type": "subtitle", "content": "Sometimes memory clings to a thing we shared."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*hp9ezvE1hINI0tcY"}, {"type": "sentence", "content": "It’s after midnight, I should be long asleep. I’m drinking a gin and tonic, very much awake. I might be for a while."}, {"type": "sentence", "content": "There are two drawers I haven’t emptied. One contains her lingerie, the things she kept at my house. Sometimes, I hold one or another piece of it. They each have stories. The other smaller drawer has her cosmetics. I emptied that one tonight, after a conversation with a friend."}, {"type": "sentence", "content": "Most of it was simple. A zippered bag with eyeliner, mascara, lipstick, her everyday stuff. Hair scrunchies, lots of them. She had lots of hair. Some random jewelry, which — she’d asked me to — I’ll offer to my daughter, and my daughter will take, because she loved her too."}, {"type": "sentence", "content": "And this very simple, not simple thing. A black leather bootlace, twisted until it started coiling on itself from the middle, doubled full length and knotted at the end, still supple with oil. It’s been out of that drawer a couple times in this last year or more, around my wrist a few times, a coat of Huberds each time."}, {"type": "sentence", "content": "Ugly really, nothing even hinting at elegance. It’s clearly something made from a random raw leather bootlace that happened to be laying about, made quickly and roughly for that moment, with no thought of symbol or permanence. It became something important, and permanent."}, {"type": "sentence", "content": "Collars are often signifiers in D/s relationships. They always felt silly to me. The first time I was in a D/s relationship and she started hinting, I resisted mightily. Part of it was that I’d not yet come to terms with my own desires for control and possession. Partly it was that the symbol itself felt silly. Dehumanizing, making a pet of, in a play-acting sort of way. I wanted nothing to do with play acting."}, {"type": "sentence", "content": "She didn’t give collars enough thought to even think them silly. She was my litle cat, and she didn’t put collars on her own cats. She’d already called me out once for damaging the magical thing we were doing together, by pushing for a vision of control and ownership that I’d thought I wanted, made it clear she was not going to tolerate it. She’d been right — it was my fantasy, my expectation, not the extraordinary reality of what we were together."}, {"type": "sentence", "content": "But we were beginning to realize that somehow she couldn’t say no to me. We’d talked about it, decided already to not pretend anything about safewords, because we knew that if I were doing something I desired and that she couldn’t tolerate, that telling me to stop wouldn’t be something that occured to her. There’s something terrifyingly magical about knowing that."}, {"type": "sentence", "content": "She knew enough already to love and be terrified of it. She knew it from that first time she slapped me, a few weeks after our first date, there on the couch in her living room. She claims I dared her. I’d simply said, when she asked what I’d do if she slapped me, that she wouldn’t dare."}, {"type": "sentence", "content": "She was tiny, less than 5' tall. She’d been a competition power-lifter 25 years before, and cared much too much about herself to let much of that strength leave her. That slap threw my head sideways, weakened me so that I slumped in the couch. If I’d been standing, I would have gone down."}, {"type": "sentence", "content": "But I was sitting, that slap was a dare too, and we both wanted what came next."}, {"type": "sentence", "content": "I remember being startled that my beast leapt out that completely, that fast, even before her arm stopped moving. And that when it was over her clothes were torn, she had marks from her neck to her feet. She was whimpering and screaming, I was holding her to keep her safe, and she was looking at me with adoration and cumming over and over and over."}, {"type": "sentence", "content": "I remember most that she never retreated, never turned or covered herself. That she wanted this as much as I did, and with every bite and grab and slap she felt my desire, and arched her back and offered more of herself to me."}, {"type": "sentence", "content": "She was on my lap. I think it was about a year later, maybe a bit more. We were surfing YouTube, following chains of links to obscure pieces of music we loved, showing them to each other. I remember that my hands went around her neck, and — she always did — she knew what I wanted, and slipped to her knees with that outraged humiliated lust-tinged look on her face that said, ‘Fuck no I’m not going to oh damn it I am kneeling for you,’ as she knelt for me."}, {"type": "sentence", "content": "She gave that to me as she always did — and it was a challenge. Yes, her face and her posture said. Yes, hold my neck, hold me, because this is what we both want. But you’re never going to own this neck, you fucker. Like that slap in the face."}, {"type": "sentence", "content": "I knew where the bootlace was — I’d been working with my boots earlier that day. It was right there to hand, I didn’t have to move. I started twisting the ends, like making a whip cracker — I think she didn’t quite know what I was doing but she damn sure knew what I was making. I twisted until it doubled and coiled on itself, a quick rough overhand knot on the end. She was appalled and already atthe edge of orgasm, a look of need that begged for it as clearly as if she were saying it: ‘Oh god don’t do this…’ Her own desires often appalled her."}, {"type": "sentence", "content": "It wrapped perfectly twice around her neck, the knot fitting through the doubled loop to hold it there. I expected challenge, anger — something like that slap, leading to a kind of rough violent sex. What I got was pure yes, and surrender, and desire, and things I can’t name. Everything else left, both of us. It was just us, and I possessed her and she entranced me, and a kind of worship and magic."}, {"type": "sentence", "content": "That was the first time, those few hours. I noticed reality creeping into our sacred space as we started getting ready for bed. I called her, she knelt for me, and I took it off. And yes, that led to rough violence and sex. Many things did."}, {"type": "sentence", "content": "It never stayed on long. In a few hours, every time, it started to chafe her soul. She was my little cat — not slave, not possession, not property. No one owns a cat. Except that for those few occasions, those few hours of peace and calm and surrender and ownership and a kind of spiky and glorious possession, she gave herself completely to me, and I did. That was enough."}, {"type": "sentence", "content": "It lived with her. Sometimes she carried it in her purse. Sometimes she left it in that drawer. She always knew where it was, could bring it to me in seconds. We would go months without speaking of it, and she would keep it close."}, {"type": "sentence", "content": "She wore it maybe a half dozen times altogether. Once, she asked for it. Never more than a few hours — I talked of a weekend, but we both knew that would fail if we tried. Every time, it was time outside of ourselves, a deep window into a magical place that could not stay open."}, {"type": "sentence", "content": "I think she needed the autonomy that came of resisting and losing, of trying to resist and not being able to. I needed her to be completely who she was, loving and challenging and independent as a cat. I needed the validation of my desire to claim possession, that came with her resistance to it. When she wore her rough makeshift collar, she couldn’t try not to be what I wanted, and in a short time that came between us, every time."}, {"type": "sentence", "content": "But for that short time, each time… no resistance for her, no thought or question of what I wanted for me. We never quite believed it, after. It was like having been read a perfect story, and falling into it, and then at the end emerging into the world and realizing it was a story."}, {"type": "sentence", "content": "It’s tied around my left wrist now, this minute as I write, and wet from my face. Love always hurts, and love is always worth it. I may not sleep for a while, still."}], "topic": "fiction"}