{"title": "Abandon Ship", "data": [{"type": "subtitle", "content": "When life makes other plans"}, {"type": "sentence", "content": "The front door slams behind his ex-wife’s back. He hears her car start. She over revs the engine as she always does but it no longer has the power to set his teeth on edge. He turns to watch his daughter walk down the darkened, narrow corridor and disappear through the door to his room."}, {"type": "sentence", "content": "‘It smells in here, Daddy,’ her voice whines back out at him."}, {"type": "sentence", "content": "He picks up her overnight bag and follows her into the bedsit."}, {"type": "sentence", "content": "‘Sorry, Minx, I forgot to air in here.’ He squeezes between her and the bed and leans across the dresser to open the window. Carolyn’s Toyota pulls noisily away and petrol fumes waft in. She has downgraded her people carrier since their divorce, but the new car is still decent, more than enough room for her and one kid."}, {"type": "sentence", "content": "‘Don’t call me that! I’m nine years old, Daddy, not a baby anymore.’ Milly perches on the edge of his bed. He lays her bag behind her on the faded duvet. She flings her hair back over her shoulders. It’s blonder than usual and straighter."}, {"type": "sentence", "content": "‘Sorry,’ he says."}, {"type": "sentence", "content": "She pouts at him, a hint of gloss shimmers on her lips. He frowns but refrains from saying anything."}, {"type": "sentence", "content": "The last time she visited he had complained about the skimpy t-shirt she wore with ‘I am HOT’ emblazoned in silver glitter across her prepubescent chest. Carolyn refused to come into the house to discuss the matter. She had remained on the doorstep with her arms crossed over her breasts, her eyes hard."}, {"type": "sentence", "content": "‘For God’s sake, Paul, it’s what all her friends wear. You have no idea what it’s like for Milly at school.’ Or for me, raising our child on my own."}, {"type": "sentence", "content": "The unspoken words had flashed from Carolyn’s eyes and hung in the air between them."}, {"type": "sentence", "content": "‘I don’t think it’s suitable for a girl Milly’s age to wear things like that,’ he had said."}, {"type": "sentence", "content": "Carolyn had rolled her eyes. ‘Good luck persuading Milly. She spent the exorbitant amount of birthday money you gave her on them.’"}, {"type": "sentence", "content": "Next time, he resolves, he will take Milly shopping for her birthday rather than entrust the money to her mother. Only, he realises as he rethinks the unpleasant scene, there won’t be a next time. He won’t be around for Milly’s tenth."}, {"type": "sentence", "content": "‘Is Kezia here?’ Milly says. ‘I want to show her my new clothes.’"}, {"type": "sentence", "content": "He pulls out the blow-up bed that he sleeps on during his daughter’s fortnightly visits. The attachment that links the pump to it is missing. His room is barely eight foot by twelve. How, he wonders, can anything get lost in this tiny space?"}, {"type": "sentence", "content": "‘Not tonight, Min…Milly,’ he says, down on the floor on hands and knees searching for the wretched thing. ‘She’s gone to a party.’"}, {"type": "sentence", "content": "‘Oh.’ There is a world of disappointment in his daughter’s voice. For once they are in agreement. Milly’s nights pass so much easier when his other housemates are around. Kezia has a younger sister back home in Poland and entertains Milly with ease."}, {"type": "sentence", "content": "‘You’ll see her in the morning though.’ He locates the pump attachment, stands and dusts off the knees of his trousers. They are shiny with wear."}, {"type": "sentence", "content": "Milly begins to unpack her pink case, neatly laying her clothes on the grubby duvet. ‘I am HOT’ catches the light from the unshaded bulb over their heads and winks up at him."}, {"type": "sentence", "content": "She pulls open the drawer of the cheap dresser that he always leaves free for her and begins to lay her precious clothes into it. His work suits hanging from the drawer knobs usually hinder her but today he doesn’t need to remove them and hang them from the curtain rail. They are no longer there."}, {"type": "sentence", "content": "Air hisses into the bed as he depresses the pump. It will take all of the available floor space once it’s blown up."}, {"type": "sentence", "content": "‘How about pizza takeout tonight then, Minx?’"}, {"type": "sentence", "content": "Lost in fashion adoration his daughter doesn’t notice his slip with her pet name. Or comment on the fact that he’s offered her forbidden fruit. Takeout is expensive and he usually insists on making them food at home."}, {"type": "sentence", "content": "His cooking has improved in the twelve months that he’s been an independent man, but Milly still wrinkles her nose at eating in the tiny kitchen with its ground in smell of boiled cabbage and spicy kielbasa."}, {"type": "sentence", "content": "‘Express though, not Hut,’ she says, not prepared to look a gift horse in the mouth."}, {"type": "sentence", "content": "Paul wakes at six, his body still attuned to work hours. The bed has half-deflated and his back twinges from lying on the hard floor. The sleeping bag tangles around his knees but he manages to get out of the room without waking Milly."}, {"type": "sentence", "content": "The kitchen, reeking of grease and basil, is shaded by the neighbour’s extension and receives little daylight. He flicks the light switch and the long tube overhead flickers into life. He fills the kettle and waits for it to boil as he makes a half-hearted attempt to clean pizza sauce from the green Formica worktop."}, {"type": "sentence", "content": "As he stands at the sink staring at his own reflection in the window an arm snakes around his waist."}, {"type": "sentence", "content": "‘Dzien dobry, przystojny,’ Kezia’s voice whispers in his ear."}, {"type": "sentence", "content": "He leans back against her slim body, her warmth pressing against him. ‘Good morning, gorgeous,’ he repeats in English. He turns and she kisses him, slowly and deliciously. Her breath tastes of peppermint, a hint of beer behind it, cigarette smoke lingers in her black hair."}, {"type": "sentence", "content": "Her friends had taken her out last night for a final booze up in town. It is Kezia’s last weekend in England. With fewer zlotys to the pound the Poles are leaving, a certain sign that England is a sinking ship."}, {"type": "sentence", "content": "‘How was your night?’ he murmurs, as Kezia’s mouth releases his."}, {"type": "sentence", "content": "She grins, her dark blue eyes flash with pleasure. ‘Full of entertainment. My friends back home will never believe the tales I tell when I return. How English girls can totter around their wintry towns wearing almost no clothes and not die of cold.’"}, {"type": "sentence", "content": "Kezia and her friends like to wander the streets between pubs on Friday and Saturday nights. The goose-bumped acres of flesh on display causes them hours of amusement."}, {"type": "sentence", "content": "In his university days, he had drunk and smoked and conducted love affairs with other students but he had also discussed poetry and literature and current affairs. He had taken likeminded girls on dates to the art galleries and museums of London. It was how he had wooed Carolyn."}, {"type": "sentence", "content": "On a night out with Kezia, the drinking and violence and puking, the fumbled couplings in doorways that he spied as he walked the town’s streets as the youth — and not so youthful — binged their way through the weekend had disgusted him. He had not gone out with them again."}, {"type": "sentence", "content": "He hears a thump from his bedroom and reluctantly releases her."}, {"type": "sentence", "content": "‘Kezia!’ Milly cries and his daughter is there between them, staring adoringly up at his housemate."}, {"type": "sentence", "content": "‘Amelia, my darling,’ Kezia laughs, hugging her easily. ‘Paul said you were here.’"}, {"type": "sentence", "content": "Once, Milly’s face would have crinkled in puzzlement at who Paul is. Once, he was only Daddy. Now, Milly doesn’t crinkle. Carolyn never refers to him as Daddy anymore. He is ‘Paul. Your Father, Milly’."}, {"type": "sentence", "content": "‘There is new movie of penguins at the Odeon,’ Kezia says."}, {"type": "sentence", "content": "Milly jumps up and down with excitement. ‘Can we go, Daddy. Please? Can we watch it in 3D?’ She grabs at him, more enthused by her visit now than she was the day before. He smiles at Kezia over Milly’s head and she winks at him."}, {"type": "sentence", "content": "‘Sure, Minx,’ he says. ‘Let me catch up with a few things first though.’"}, {"type": "sentence", "content": "Milly’s face falls. When she was a baby and he would take her for a stroll in her buggy people would stop to look at her. ‘She looks so much like you,’ they’d gush."}, {"type": "sentence", "content": "He had never seen it himself even as the words had warmed him. Milly had Carolyn’s light grey eyes and pale hair. Even the underlying structure of her face, now her puppy fat was receding, was Carolyn’s. As she grew she had begun to take on her mother’s gestures and tone of voice. He hears that tone now."}, {"type": "sentence", "content": "‘Oh, not work stuff, Daddy.’"}, {"type": "sentence", "content": "Kezia meets his eyes again, serious this time, questioning."}, {"type": "sentence", "content": "He gives her a minute shake of his head and bestows a smile on his daughter. ‘No, Minx. Not work. I just need to tidy up.’"}, {"type": "sentence", "content": "Kezia slips her hand into Milly’s. ‘We have a new hairstyle to try out, Amelia. Come.’"}, {"type": "sentence", "content": "His daughter gabbles excitedly as Kezia leads her upstairs to her own room that lies above his."}, {"type": "sentence", "content": "Paul makes tea and carries it back to his bedsit. It is the work of minutes to pack away the blow up bed and straighten out the duvet that Milly has left crumpled in a heap. The covers are still warm from her body. His bed is a child’s single, just the right size for her — when he lays on it his feet overhang the edge. Making love to Kezia in it has required some pretty nifty Kama Sutra wrangling."}, {"type": "sentence", "content": "There is barely a trace of him here; no posters, no books, no hint of the man he was or is becoming. Barely a sign of a life lived within the blank, magnolia walls that surround him. Most of his stuff is still packed up at his parent’s place, a few bits stored in the loft of his ex-house. He has lived without it all for nearly a year now."}, {"type": "sentence", "content": "He cannot recall what exactly ‘the stuff’ consists of. Suits and shirts, gadgets that spent more time in the garage or loft than in making his life more convenient. Childhood belongings that he’d stored at his parents’ through the years of University until he had bought his house and Carolyn had moved in."}, {"type": "sentence", "content": "He thumps up the stairs, taking them two at a time. Kezia’s door is ajar. Oasis rocks gently within. He taps at the wood and pushes it open. His daughter sits on the edge of Kezia’s bed, her bare feet kicking against the side. Kezia is cross-legged behind her on a brightly patterned throw, weaving Milly’s hair into an intricate plait."}, {"type": "sentence", "content": "She has been in the house for only six months, a half a year less than him, but still her room feels more lived in, has more personality than his. He prefers to make love upstairs in her space than in his room."}, {"type": "sentence", "content": "As his lover and daughter chat, he wanders across to the corkboard that hangs on the wall. It is jammed with notes, postcards, Kezia’s cartoonish doodles including a caricature of him that she’d had enlarged and gave him for his thirty-seventh birthday."}, {"type": "sentence", "content": "He studies again the photo that she showed him; a wattle and daub building, barn-like in its dimensions, that her family are renovating at the farm they own fifty miles outside of Krakow. When Kezia returns home, she will live there, in a studio flat built into the oak beams of the roof."}, {"type": "sentence", "content": "‘There, Amelia,’ Kezia says, tying off the plait and regarding his daughter with satisfaction. ‘Beautiful!’"}, {"type": "sentence", "content": "They spend the afternoon at the Odeon. Paul and Kezia hold hands in the dark while his daughter laughs aloud at the antics of penguins and spills popcorn over the floor."}, {"type": "sentence", "content": "When Milly has gone, Paul sits at the tiny table where they ate forbidden Pizza takeout the night before. Kezia sits opposite him, smoke from her cigarette curling between them."}, {"type": "sentence", "content": "Two of the other housemates, Wojtek and Marek, chop cabbage and sausage on the kitchen worktop to make soup. Odd words of their Polish banter make sense to Paul’s ears. Just visible in his line of sight is a cluster of flight bags waiting in the hall, ready for the taxi that will ferry their owners to the airport in the early hours of the morning."}, {"type": "sentence", "content": "A pile of bank statements lies crisply on the table next to his hand. His bank balance is in five digits for the first time since he paid the deposit for the house Carolyn and Milly now inhabit without him. His redundancy package was more than generous given the current financial climate."}, {"type": "sentence", "content": "In his hands, he holds a photo of the wattle and daub barn, the latest one, arrived that afternoon in the post. The faces of Kezia’s two brothers grin welcomingly up at him, as they proudly flank their finished handiwork."}, {"type": "sentence", "content": "Kezia lifts the little red, faux leather booklet that sits between them and opens it. She turns it on its side and studies the photo inside."}, {"type": "sentence", "content": "‘It looks like such a different you,’ she says."}, {"type": "sentence", "content": "He nods and spreads his hands, a European gesture that he has picked up from his housemates. It was a different him."}, {"type": "sentence", "content": "He takes it from her and slips his flight tickets inside. London, Gatwick to Krakow, Poland. One way."}, {"type": "sentence", "content": "The Poles are leaving England."}, {"type": "sentence", "content": "And he is leaving with them."}, {"type": "sentence", "content": "Historical fiction set in 18th Century England by Alex Kilcannon"}], "topic": "fiction"}