{"title": "Ellen DeGeneres and Her Terrible, Horrible, No-Good, Very Bad Month", "data": [{"type": "subtitle", "content": "Social Media"}, {"type": "subtitle", "content": "Recent attacks on Ellen’s reputation expose Hollywood wokeness gone wild"}, {"type": "image", "content": "https://miro.medium.com/max/5696/0*TJrqvd2QCRQF71bM"}, {"type": "sentence", "content": "“It’s easy to forget now, when we’ve come so far, where now marriage is equal under the law — just how much courage was required for [DeGeneres] to come out on the most public of stages almost 20 years ago. Just how important it was not just to the LGBT community, but for all of us to see somebody so full of kindness and light, somebody we liked so much, somebody who could be our neighbor or our colleague or our sister challenge our own assumptions, remind us that we have more in common than we realize, push our country in the direction of justice.” — 44th President Barack Obama Introducing Ellen DeGeneres at the 2016 Presentation of the Presidential Medal of Freedom ceremony ."}, {"type": "sentence", "content": "“Notoriously one of the meaning people alive.”— Comedian Kevin Porter on Ellen DeGeneres — via Twitter"}, {"type": "sentence", "content": "If we are believe the stories leaked over the past two months, the horrible, no-good monster formerly known as Ellen DeGeneres is “one of the meanest people alive.” Yes, the same Ellen DeGeneres who recently donated $1million dollars to COVID-19 Relief and was awarded the 2016 Presidential Medal of Freedom for her achievements as an LGBTQ activist by President Obama."}, {"type": "image", "content": "https://miro.medium.com/max/2592/1*9O_zd4JM8G9-jr2NYt8DrA.png"}, {"type": "sentence", "content": "Questions about the A-lister’s squeaky-clean reputation began to surface with comedian Kevin Porter’s March 20th tweet shading Ms. DeGeneres as “one of the meanest people alive”. Mr. Porter offered a $2-per-story charitable bounty for “the most insane stories you’ve heard about Ellen being mean.” For each story about Ellen’s meanness, Mr. Porter pledged to contribute $2 to Los Angeles Regional Food Bank — a gesture intended to nourish the hungry with someone else’s tears."}, {"type": "sentence", "content": "While the purpose of Mr. Porter’s tweet is still unclear (one can think of a lot less spiteful ways to raise money for charity), what was clear was that the tweet launched a full-scale assault on Ms. DeGeneres reputation that has since captured the attention of media outlets worldwide."}, {"type": "subtitle", "content": "Ellen the Horrible"}, {"type": "sentence", "content": "A quick scroll through the responses to Mr. Porter’s tweets reveals utterly horrific stories that place Ms. DeGeneres on the Mt. Rushmore of evil next to Hitler, Hussein and Scar from Lion King. Take for instance the time in a workout class Ms. DeGeneres allegedly blamed this poor man for her fart:"}, {"type": "image", "content": "https://miro.medium.com/max/2476/1*oyYg3plF1GJ2VFT55th2zQ.png"}, {"type": "sentence", "content": "Or, the time she allegedly almost got someone fired from their waitressing job for having chipped nail polish:"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*g8l9gRT40Lhm8BFA6wV13Q.png"}, {"type": "sentence", "content": "In just a few weeks time, Mr. Porter found himself with hundreds of Ellen-the-Horrible stories detailing the wickedness of Ms. DeGeneres— however, the responses to his tweet were just the tip of the iceberg."}, {"type": "subtitle", "content": "Unflattering Press"}, {"type": "sentence", "content": "In April, popular fashion blogger Nikkie de Jager told Dutch publication &C that the tyrannical DeGeneres denied her use of a private toilet while she was a guest on the The Ellen DeGeneres Show. Said Ms. De Jager (a.k.a. NikkieTutorials) of her experience on the show:"}, {"type": "sentence", "content": "Call me naive, but I kind of expected to be welcomed with confetti cannons: ‘Welcome to The Ellen DeGeneres Show!’ But instead I was greeted by an angry intern who was a bit overworked. I was expecting a Disney show, but got Teletubbies after dark."}, {"type": "sentence", "content": "Ms. DeJager further lamented:"}, {"type": "sentence", "content": "Every guest at Ellen’s had a private toilet, but I didn’t. I was not allowed to use the nearest toilet, because it was reserved for the Jonas Brothers. Why do they get a private toilet, I thought."}, {"type": "sentence", "content": "Next was a claim by Ellen’s one-time Oscars bodyguard, Tom Majercak, about Ellen’s behavior towards him during the 2014 Oscars. Mr. Majercak alleged during the 2014 Oscars, which DeGeneres hosted, that the sinister celebrity refused to say hello or make eye-contact with him. Nearly six years later, Majercak said he felt “compelled” to throw his one-time employer under the bus calling her 2014 actions “cold” and “demeaning. Ellen’s sin? Failing to be warm and bubbly during what was undoubtedly the busiest night of her career."}, {"type": "sentence", "content": "As whispers of Ms. DeGeneres’s no-so-nice private persona have grown to blood-curdling screams, critics are stacking evidence that the beloved A-Lister is actually a snake in Hollywood’s well-manicured grass. A monologue joke during an April 8th quarantine broadcast of The Ellen DeGeneres Show drew the particular ire of the moral police who quickly decried Ms. DeGeneres as insensitive and tone deaf. Joked Ellen on the April 8th show:"}, {"type": "sentence", "content": "One thing that I’ve learned from being in quarantine is that people, uh — this is like being in jail, is what it is — It’s mostly because I’ve been wearing the same clothes for 10 days and everyone in here is gay."}, {"type": "sentence", "content": "With anecdotal evidence piling up about Ellen’s not-so-nice side, I can only think of one, logically-sound and well-reasoned response:"}, {"type": "sentence", "content": "Who cares?"}, {"type": "subtitle", "content": "Perfection Not Required"}, {"type": "sentence", "content": "Let’s make something clear: I am not here to argue that Ellen DeGeneres is perfect or even that she is a “nice” person. And that’s exactly the point … as someone who has done more to positively influence Americans’ attitudes about LGBTQ rights than any other celebrity or public figure, Ms. DeGeneres doesn’t need to be “nice” to deserve our respect or admiration."}, {"type": "sentence", "content": "DeGeneres shattered the mold over twenty years ago when she bravely leveraged her comedy to (very publicly) come out of the closet. For those who are too young, or simply don’t know the story, 1997 was still an incredibly risky time for a celebrity to come out as gay — especially for a woman. What is often forgotten in the story of Ms. DeGeneres’s meteoric rise to mega-celebrity status are the struggles and intolerance she had to endure due to her sexual orientation. Shortly after coming out in 1997, her Ellen show was slapped with a parental advisory warning by ABC and was cancelled the next year. Ellen admitted she fell into depression and struggled to maintain steady work until The Ellen DeGeneres Show launched in 2002."}, {"type": "sentence", "content": "President Obama underscored the bravery it took for Ellen to come out in such a public fashion when awarding the comedian with the Presidential Medal of Freedom in 2016. Said the President:"}, {"type": "sentence", "content": "What an incredible burden that was to bear. To risk your career like that. People don’t do that very often. And then to have the hopes of millions on your shoulders."}, {"type": "sentence", "content": "Where others might have buckled under the weight of ignorance and given up, Ellen persevered and went on to become one of the most influential celebrities of the new century. From The Ellen DeGeneres show to hosting the Oscars to winning the Mark Twain Prize for American Humor to being named the Cover Girl spokeswoman, Ellen blossomed into a once-in-a generation performer who shrewdly leveraged her talents to boldly shine a bright light on LGBTQ causes."}, {"type": "subtitle", "content": "Wokeness Gone Wild — Hollywood Style"}, {"type": "sentence", "content": "Over the past few years we’ve witnessed transformational social movements that will forever changed how us Americans view our world. From Black Lives Matter to the MeToo Movement, there’s been a long overdue discourse shift on social justice issues that has brought awareness and action to some of our deepest and most painful conflicts we face as Americans. Issues such as climate change, gender equality and racial justice will continue to dominate public discourse in the coming years and rightfully demand that we provide our full attention and commitment to these causes."}, {"type": "sentence", "content": "However, there exists a more virulent strain of virtue signaling and wokeness that is weaponized to tarnish reputations, derail careers and destroy lives in the name of self-promotion. David Brooks expertly puts it in his New York Times piece, “The Problem With Wokeness”:"}, {"type": "sentence", "content": "Wokeness places more emphasis on how you perceive a situation — how woke you are to what is wrong — than what exactly you plan to do about it."}, {"type": "sentence", "content": "Brooks continues:"}, {"type": "sentence", "content": "The problem with wokeness is that it doesn’t inspire action; it freezes it… To make a problem seem massively intractable is to inspire separation — building a wall between you and the problem — not a solution."}, {"type": "sentence", "content": "By today’s standards, it’s simply not good enough for Ellen to be normal — entitled to both good and bad days, highs, lows and lapses in judgment that all human beings are entitled to. Not only must she be a spokesperson for social justice and a self-made female in charge of a multi-million dollar personal brand, she has to be perfect while doing it. She must always, 24 hours a day, 7 days a week, be “nice” — whatever that means. A missed “thank you” here and cold stare there and she now finds herself locked in woke prison along with others who had the audacity not to fall short of impossible moral standards."}, {"type": "sentence", "content": "Not only is the recent treatment unfair, it also exposes a double-standard when compared to her similarly successful male counterparts. Steve Jobs, Michael Jordan and Elon Musk are all visionaries celebrated as some of the smartest, talented and most forward-thinking people of the last century — but none were exactly known for their niceness. Jobs was legendarily cruel to his co-workers, but despite his propensity for being a world-class jerk he has achieved near God-like status in American popular culture. Jordan, for all his greatness, was renowned not all for being the greatest basketball player ever, but being one of the sport’s greatest bullies."}, {"type": "subtitle", "content": "It’s Time To Free Ellen"}, {"type": "sentence", "content": "This form of divisive and self-promotional wokeness swirling around Ms. DeGeneres feels less about justice and more about maximizing followers, re-tweets and “friends”. After all, it’s easier to send out Tweet then to take some tangible form of action to make the world a better place. Yes, Mr. Porter ended up raising $600 for the Los Angeles Food Bank, but at what cost?"}, {"type": "sentence", "content": "Ellen is a human being just like you and me. For all this amazing woman has accomplished, she has the right to be herself. If that means she’s not the warm and fuzzy person you see on television — so be it. Just like her male counterparts, she’s more than earned that right."}, {"type": "sentence", "content": "At the end of the day, we should ask ourselves this question: If Ellen DeGeneres really is the “meanest person alive” … where does that leave us?"}, {"type": "sentence", "content": "Thanks for reading! If you like this article, please check out some of my other work below."}], "topic": "social-media"}