{"title": "What It’s Like to Be Raised By Parents with PTSD", "data": [{"type": "subtitle", "content": "A refugee’s child shares her experience in the constantly anxious and fearful environment of her parent’s household"}, {"type": "image", "content": "https://miro.medium.com/max/2802/1*YRO1Xf0wwWv6R4mSA71CEw.png"}, {"type": "sentence", "content": "As a child who grew up in the household of two Vietnamese War refugees, it didn’t occur to me until I was an adult that my parents and extended family operated at a heightened state of tension and anxiety at all times. After describing how my father reacted to unexpected news and decisions with anxiety and anger like they were emergencies, it started to dawn on me that my parents may be suffering from PTSD. It seemed as if they had lost their ability to approach issues with a metered attitude, jumping straight to near-panic whenever something unexpected occurred. I suspect this is a result of what my parents saw and experienced while they escaped from Vietnam on a boat and spent the better part of a year in the Pulau Bidong refugee camp in Malaysia between 1979 and 1980."}, {"type": "sentence", "content": "My parents didn’t detail to me the horrific things they saw, and I understand why they do not want to recount these painful events to their children. Accounts from Vietnamese refugees describe watching family members drown, encountering corpses laying on the street, and being raped by pirates. These are the types of ghastly sights that Vietnamese War refugees have burned into their memory. In addition to the traumatic events of war, refugees were forced to leave family members behind because poor families could not afford to make the journey altogether. The separation from family members is another layer of trauma on top of the horrific events experienced by refugees."}, {"type": "sentence", "content": "These are the vivid terrors that thousands of Vietnamese refugees faced between the years of 1975 and later. Although forty years have passed and the Vietnamese refugees who settled in the United States have re-established relatively stable livelihoods where these life-threatening situations are no longer present, the echoes of their trauma still cast a shadow over many aspects of their everyday lives. The untreated PTSD of immigrants manifests in their attitudes about the world, affecting all those who live in the same households as them, and how they raise their children. Children can become the “container” for a parent’s “unwanted, troubling experiences [of PTSD],” according to a 2006 study published by the American Psychiatric Association. Indeed, I have begun to identify ways in which growing up in the constantly anxious and stressful household of my parents who have PTSD has left an impact on me. I became a container of PTSD, and this impacted my life in unconscious ways I have only recently begun to discover."}, {"type": "sentence", "content": "Yelling occurs every day in my parent’s household. One of my parents would provoke the other and arguments would erupt. I got the sense that my parents didn’t have any control over their reactions. My father was also often angry and his temper would increasingly rise, often running away from him. My mother has the tendency to start babbling about a subject that makes her anxious and not be able to stop even after being asked by family members. She has a hoarding disorder, which is commonly linked to post traumatic stress or experiencing a significant loss that was difficult to cope with, according to Mayo Clinic."}, {"type": "sentence", "content": "One day, I broke the news to my parents that I was moving out of a house we jointly owned in a nice gated community to an apartment in the city. I made the decision to be closer to friends and improve my social life like any normal young adult in their twenties. I thought about the decision for months, visited many apartments to find the best deal and safest neighborhood, and carefully planned how I would manage the finances of rent and a mortgage. I made my decision and signed the lease, then considered how to share the news with my parents."}, {"type": "sentence", "content": "Although I had floated this idea with my parents before, I still dreaded telling them because I knew they would have disagreed with my decision and attempted to change my mind. Emotionally stable parents would listen to the news, and be supportive by asking if their child needed any help moving. My parents cut me off after my first sentence, burst into loud criticisms about my “ungratefulness”, and questioned my financial management. Their concerns would have been assuaged if they allowed me to deliver my full explanation, but their panicked reaction prevented them from processing any information I shared after my first sentence."}, {"type": "sentence", "content": "My parents view the world as an inherently fearful environment and this seeped into every aspect of their daily life. Certain curtains in the house are always kept closed, even during the day, so neighbors cannot look in. My mother checks out the front window every time she hears an unexpected noise. If not every family member is home before dark, my parents become worried as they believe it is very likely that anyone out after dark will fall victim to a crime such as robbery or murder. My parent’s actions communicated these life lessons:"}, {"type": "sentence", "content": "Every crime that is reported in the news becomes a possible reality for my parents. My mother doesn’t drive on the freeway or at night because she heard of gang initiation activity involving random victims and believes this may happen to her. Those rumors have been debunked as a false, misconstrued story by Snopes. Other fears my mother has are: highway robberies, being pickpocketed or robbed point-blank while on one’s phone in the street, and being shot while sitting in your car. She reminds me of these possible occurrences every time I am out at night or go somewhere far away."}, {"type": "sentence", "content": "In one incident which occurred when I was ten years old, I opened the front door of the house for two Mormon missionaries who rang our doorbell. They wanted to share their religious beliefs and politely left after we declined. My mother jumped out of her skin at the sight of the Caucasian men at our door and her version of the story is I had almost let people akin to axe murderers into our house. To this day, she has continued to treat me as if I was the same ten year old, warning me against opening my door to strangers and referencing this incident. From this memory, I observed my mother’s lack of ability to differentiate between real and perceived threats, as well as her inability to put the incident behind her."}, {"type": "sentence", "content": "The legacy of untreated trauma is far-reaching; it can be passed on from one generation to the next in a phenomenon called the intergenerational transfer of trauma. “What is overwhelming and unnamable is passed on to those we are closest to,” says Molly S. Castelloe, Ph.D. Because the source of trauma is often not talked about, the second generation may not be aware of receiving these messages of PTSD from their parents. Regardless of whether children are cognizant of it, they absorb their parents’ unconscious beliefs of trauma through stories and actions."}, {"type": "sentence", "content": "The intergenerational transfer of trauma phenomenon has dark implications for Asian ethnic enclaves; it suggests the mental traumas carried by first generation Vietnamese refugees living in these communities can be passed to their children and continue to persist in future generations if not actively remedied. Limited research has been conducted on the impacts of intergenerational transfer of trauma and its effects on the children and grandchildren of PTSD survivors, but this subject is beginning to receive more attention. One 2017 study conducted by Yael Daneili, PhD on the Holocaust survivors, their children, and the grandchildren found strong associations between the mother’s adaptive response to trauma and the severity of impact on offspring."}, {"type": "sentence", "content": "Several coping strategies for intergenerational transfer of trauma have been identified by researchers. The proper representation and mourning of the trauma will help sufferers heal, according to psychohistorian Howard Stein. Daneili recommends constructing multigenerational family trees that detail the family’s trauma history and thus uncover some of the family’s unspoken secrets. Elena Cherepanov, PhD of the Cambridge College in Boston recommends combining psychotherapy with a pictorial family tree in a method called “survivor genogram” to draw relations between family history, psychological history, and unconscious beliefs passed down through generations."}, {"type": "sentence", "content": "Since becoming aware of the presence of my parent’s untreated PTSD, I have begun to self-reflect on how growing up in this environment has affected me. I found that I have my own traumas which manifest as physical symptoms. I am particularly sensitive in my sleep; loud music and voices coming from nearby rooms cause me to become alert because it reminds me on a primal level of the loud voices of my parents’ shouting. I also occasionally grind my teeth at night from the stress of their arguing, a condition called bruxism. Bruxism is caused by chronic stress in a negative environment, according to a 2014 study conducted by Mieszko Wieckiewicz, the Head of the Experimental Dentistry Department at Wroclaw Medical University."}, {"type": "sentence", "content": "I have since sought therapy to make concrete efforts to define this impact, understand how it has informed my reactions to certain situations (often unconsciously), and find ways to transform some of the responses which no longer serve me in my current circumstances. I found my parents mistrust of others outside the family to be particularly damaging for me as it encourages me to isolate myself and prevents me from developing deeper relationships. I found that I also have a deeply ingrained urge to control the circumstances and people around me. I have to actively remind myself that ambiguity of the future is acceptable and that I should allow matters to develop naturally. It is a constant and ongoing effort to change the unconscious beliefs absorbed from my parents."}, {"type": "sentence", "content": "I had a moment when I realized that I could be free of the anxious and stressful environment of my parents. One day about a year after I moved out of my hometown of Los Angeles, I was alone in my kitchen making dinner when the absence of yelling struck me. I had not heard anyone shouting in a few months. It dawned on me that it was my parents and extended family who brought the loud yelling and fearful warnings into my life. That also meant that I can control my level of exposure to that environment by managing the amount of time I spend with them. Furthermore, it is my responsibility to myself to balance the level of contact with their PTSD while maintaining my relationship with my parents and extended family."}, {"type": "sentence", "content": "In the course of my journey to resolve the trauma I’m carrying, I have constructed my multigenerational family tree with as many details as possible, especially digging into the fifteen years between my parents’ escape from Vietnam and my childhood. I am identifying the trauma within the family and bringing it into psychotherapy as recommended by researchers in this field. I hope these efforts will help the future generations of my family to discontinue the intergenerational transfer of trauma."}, {"type": "sentence", "content": "📝 Save this story in Journal."}, {"type": "sentence", "content": "🍎 Wake up every Sunday morning to the week’s most noteworthy stories in Wellness waiting in your inbox. Read the Noteworthy in Wellness newsletter."}], "topic": "mental-health"}