{"title": "So, Why Haven’t You Called?", "data": [{"type": "subtitle", "content": "Social media could be a tool that assists us in communicating and maintaining relationships. What’s stopping it from being that?"}, {"type": "image", "content": "https://miro.medium.com/max/7046/1*bXBYuTcuYOG8pbvce1y4fw.jpeg"}, {"type": "sentence", "content": "When I was in maybe fourth grade, my best friend handed me a rock."}, {"type": "sentence", "content": "I was a weird kid. I got bullied a lot, and she was my only friend. She had a few other friends though, and having me around all the time started to weigh on her. She took a magic marker and wrote a date, about three weeks in the future, on a smooth palm-sized gray stone. She told me,"}, {"type": "sentence", "content": "So, for maybe a day, I left her alone. I didn’t argue; the formality of having written it in stone suggested that our friendship would be over forever if I violated this order. Heartbroken, angry, I threw away the rock. I panicked (what if she asks if I still have it?) and retrieved it."}, {"type": "sentence", "content": "The next day we were friends again like nothing had happened."}, {"type": "sentence", "content": "Now that most of us are using a digital address book to define who is a friend and who isn’t, formally revoking friendship is a silent, one-button act. But the social protocol that has evolved around online behavior prevents us from trying to save a lost friendship. While it’s easy to say that what we do online doesn’t affect the real world, we know that hasn’t been true for a long time."}, {"type": "sentence", "content": "I realize that referring to society as a whole, when attitudes vary across cultural lines, is reductive, but bear with me."}, {"type": "sentence", "content": "We feel that if someone unfriends us on Facebook, it signals that they don’t want us to talk to them ever again, even to ask why. We have lost the nuance in social behavior that should tell us that a friend of twenty years DMing you asking why you’re not talking to them anymore is different from an abusive ex telling you it’s all your fault; is different from a stranger asking for feet pics. Boundaries have become the most important thing: more important than bonds, responsibility for others, duty to one’s community. Maybe it’s because the discourse on acceptable behavior is driven by people in their teens and early twenties, for whom the most empowering thing they can do in a relationship is, often, to escape it. The idea that you have the right to cut abusive, toxic people out of your life has been expanded to the idea that you’ve done no harm if you abandon a friend over something petty."}, {"type": "subtitle", "content": "This is not simply a new ideology, but behavior driven by the design of the interface."}, {"type": "sentence", "content": "Our social mores regarding friendship and acceptable contact have changed in part in response to the intrusiveness of phone notifications: While there was once some division of time and space created by the limited abilities of the older cell phone, the computer, and the landline phone, smartphones are extensions of our bodies that can access everything at all times. Notifications are unavoidable. Any sort of contact can feel like a violation of our space, an excessive demand on our time. We find ourselves wondering, “Shouldn’t I be paid to answer texts from my boss when I’m off the clock? I’m not a stockbroker, I work at a Jamba Juice!” We may even avoid responding because, though we want to say something to someone, we don’t want them to reply right now and draw us into a whole conversation. We’re left with few options for contacting another person that aren’t tainted somehow with the feeling that communication inflicts harm. All of this is worsened by the association private messages have with harassment. The closeness of the phone to the body lends physicality to verbal harassment that bystanders dismiss as mere words, but such harassment often also leads to doxxing, stalking, threats, and even physical violence. What if the creep who won’t stop sending weird DMs is you, and you lack the social awareness to realize it?"}, {"type": "sentence", "content": "And yet, despite demanding to be left alone, people are lonely: of course, people want to see their friends, they just don’t want their friends busting in like Urkel while they’re on the toilet. Every take on the issue I’ve seen seems incredibly shallow: yes, Facebook makes people lonely, but why? Writers always seem to paint the issue as an unhealthy obsession with likes and shares, a constant need for validation, without asking the question: why aren’t we getting that validation? What ruined being online with all of our friends?"}, {"type": "sentence", "content": "The chain-letter-esque rumor that Facebook’s feed limits the number of friends who can see your posts to 26 is false, but the very fact that such rumors persist suggests that whatever the feed is doing, it’s doing it wrong. The truth is perhaps more sinister: a complex ranking algorithm decides whether or not your posts are good enough to share, and with who. Posts that contain positive, happy content seem to be ranked higher. Friends interacting with your status raises its rank. Basically, you have to compete with your friends for popularity while ads sneak into the gaps. That’s are why your feed is full of dog videos instead of your friends’ posts. It’s why an old friend you haven’t heard from in years will suddenly get through to say he’s recovered from cancer when you never even knew he had cancer. It’s why no one seems to comment on your posts anymore. This feels incredibly isolating: a web site seemingly designed to make you feel like all of your friends are ignoring you."}, {"type": "image", "content": "https://miro.medium.com/max/2750/1*uSmOvi34CNqbEvFIr3Ekfw.png"}, {"type": "sentence", "content": "It seems unlikely that Facebook is intentionally trying to alienate people from their friends, but equally unlikely that a company worth six hundred billion dollars doesn’t pump any money into studying how it impacts the people who use it. This isn’t to say that they’d feel any ethical obligation to make a product that isn’t harmful — just look at the history of tobacco companies — but surely there’s data."}, {"type": "subtitle", "content": "Creating a healthy social environment online is a difficult task because human beings have complex needs."}, {"type": "sentence", "content": "For the most part, the people I actually talk to most of the time, and the people I’m most comfortable talking with about private things in my life, are members of an old internet forum that’s been around in some form or another since the late ’90s. It was kind of an odd choice: the forum was mostly for making fun of weird people on the internet, and it was pretty gross and bigoted — and the members all pretty much grew up and got over that stuff, realizing we were weird people on the internet all along. Rather than a place to be an asshole, it became a place to express whatever parts of our personalities weren’t considered appropriate by our regular peer groups."}, {"type": "sentence", "content": "Many of the reasons the forum works are that it is nothing like Facebook: everyone is anonymous and informally sworn to secrecy. For the most part, we don’t know each other in real life. We have long, threaded discussions in which there are few ways to participate passively: you’re not really there unless you post. Over the years, many of us have learned each other’s real names, contributed to fundraisers for one another, and traveled to other cities to meet up. We’ve created a few chat servers over the years, and lately, I’ve spent more time on the Discord than on the main forum. Some of us have stalked and threatened and harassed each other, as well, and some of the people we mistreated in the past have come back for revenge. We’ve dealt with it without having to dismantle the community, though some irreparable harm has been done and some well-liked members will never return. Besides that, we can freely vent about our lives without fear of getting ratted out to our bosses or the people we talk about."}, {"type": "sentence", "content": "When LiveJournal (sold to a Russian company in 2007, where it remained huge for at least ten more years) was popular on the English-speaking internet, this sort of thing was the norm: people talked about their lives at length, often in more detail than they should have in public — and got themselves in trouble, and withdrew from the internet. But the level of candor they had before this was what drew other people close. People shouldn’t have to keep everything in their lives a secret. But the problem with talking about our personal lives online, besides saying potentially incriminating or embarrassing things about ourselves, is that our lives intersect intimately with the lives of others. It is impossible to talk about your own inner life without mentioning other people, and to them, that’s gossip, subtweeting, callout posts. When everything written online is recorded, archived, and can be used against us, there was a reason that before Facebook, the #1 rule of the internet was “never use your real name.”"}, {"type": "sentence", "content": "Trying to recapture the energy LiveJournal had on a platform like Facebook — without anonymity — seems like a recipe for disaster. Longer-form personal posts were more common on Facebook itself in earlier days, and have now become rare; FB’s colorful backgrounds discourage long statuses, but people stopped writing well before these were created. Google+’s “circles” method for organizing friends and acquaintances to determine levels of privacy might offer a promising means of deciding who sees what, allowing people to open themselves back up. If only that platform hadn’t completely failed."}, {"type": "sentence", "content": "Functionally, Tumblr is not much different from LiveJournal, but the ability to reblog posts radically changed the way users interact. Tumblr’s approach to anonymity was interesting: while most web sites discouraged users from using multiple accounts, Tumblr allowed several blogs under different names to be registered under one master account. Something that social media that relies on real names and photos fails to account for is that in addition to having different aspects of their lives that they need to be able to compartmentalize to different peer groups, people sometimes also use different names and appearances that they present to those groups. A universal social network where everyone sees the same thing — your boss, your grandmother, your fellow luchadores, your orgy buddies, and so on — puts people in a position where they have to present themselves in a way that is acceptable to all those people. For some, this can be stifling enough that there is little they can say or do on the platform."}, {"type": "sentence", "content": "Maybe asking for a single online platform on which we could merge the various private and public spheres of our lives is too much of a risk: after all, even if the app allows us to control who sees what, that doesn’t mean the database is secure, or that the owners of the app themselves can be trusted, or that your speech won’t be censored or reported to authorities in conversations you thought were private. Maybe having multiple aliases on several different online platforms is the way to go, and we just need better ways to form intimate connections with the people we want to trust."}, {"type": "sentence", "content": "I attempted to create a rough draft of a social media site a while ago, out of nostalgia, that was a sort of hybrid of Myspace and Tumblr: maybe some Web 1.0 functions and aesthetics would get people to behave more like they did on the old internet. The philosophy I had in mind was not to allow passive interaction: you couldn’t “like” anything, you had to actually leave a text-based comment any time you wanted to do anything on the site. Ultimately, only a handful of my friends tested it out, and they eventually lost interest. There were never enough users to get a feel for how the site would have worked at full-scale. This is one of the big problems with creating a successful social media site: whether it’s any good or not, the site won’t work unless massive numbers of people are using it constantly. Many alternative platforms have been created. There are an overwhelming number of options if you know where to look. But being one of the first accounts on a mysterious new service seems like a hassle when “all my friends are doing it” is the entire point of a social network."}, {"type": "sentence", "content": "A friend later came up with a proposal: we could change the way we use Facebook. Just don’t use the react buttons. Write comments, message people. And for a little while, we tried. And it felt a little more human. But people can’t resist using a feature that’s built into the design, can they? And if I’m the only person commenting on my friends’ Facebook walls, are their friends thinking, “Who’s this guy? Why is he all over my feed?”"}, {"type": "sentence", "content": "It seems to me that if we want to encourage active use of social media over passive use, the app itself needs to be designed to influence user’s habits. What if in place of the like button, there was a button that sent the user a message requesting a friendly video chat, later, at their convenience? What if the interface was just designed to nudge people toward Messenger somehow?"}, {"type": "sentence", "content": "I appreciated Facebook’s “like” when it was first introduced. I had what I can best describe now as selective mutism, and in addition to the recent popularization of texting, low-effort means of nonverbal communication seemed like an incredible asset. In traditional conversation, a compliment is an opener. But my appreciation wouldn’t last: as the “like” and other reacts became commonplace, they no longer felt meaningful. When the “heart” react was introduced, the “like” became a sort of indifferent nod: yeah, I saw it, whatever man. Where people would once see my reacts as a desire for further interaction and contact me, ask me to hang out, invite me to house parties, now they would simply sometimes react to my posts in return. I was caught in a loop of likes, becoming increasingly isolated."}, {"type": "sentence", "content": "I have come to realize that people equate the capacity for speech with the capacity for thought, with humanity itself, with — if you want to get spiritual — possession of a soul. I was being ignored because people assumed that because I had difficulty talking, that I was an empty shell: I’ve heard myself described as such. Though I know it isn’t true; humanity is unconditional; the horror that I will be dehumanized unless I fill the space between myself and others with words is what drives me to write. I thought that perhaps the isolation I was feeling online was just happening to me because others thought I wasn’t worth their time. And yet, these feelings of loneliness and isolation are described all over the internet as universal truths."}, {"type": "sentence", "content": "When Facebook was new, I added people as friends because I wanted to get to know them better, and connecting with them online encouraged them to interact with me offline. When people were still comfortable having their photos shared online, I photographed nearly every party I went to, and was able to expand my friend network when people tagged one another on Facebook. Those people talked to me; invited me to events. Events became more difficult to invite people to as Facebook transitioned from being a service that helped people connect to friends to a service that sold ad space to businesses: mass invites could be used for free advertising, so we couldn’t have them anymore. With the rise of social media influencers and corporations cranking out faux-homemade videos, the line between personal posts and advertising is increasingly blurred. I know that any sort of creative work I post falls somewhere between sharing my life with friends and promoting myself as a business. I worry at times that my friends may feel exploited when I show them my art or writing, the way they would if I were hawking Herbalife in every post. But from a social media company’s perspective, reaching out and marketing are synonymous for everyone."}, {"type": "image", "content": "https://miro.medium.com/max/800/1*auFZAbCEExWdnfocZO0AzA.png"}, {"type": "sentence", "content": "As the way Facebook functioned and the way people used it changed over the years, new friends no longer reached out. I would meet people, they would eventually send me friend requests, and our interaction would end there. As Messenger became ubiquitous, people no longer shared their phone numbers, but they also gradually stopped sending messages. I was no longer invited to birthday parties. Community gossip no longer reached my ears, and I felt intrusive asking. There was no way to contact people outside of Facebook, yet people frequently deleted their accounts out of dissatisfaction with the service. I found myself afraid that if someone I loved died, I would not be told."}, {"type": "sentence", "content": "And then COVID-19 locked us into our pre-established relationships, removed the capacity to strengthen bonds with those we did not know well enough, and made the very need for physical touch tantamount to violence. I hoped that with communication happening almost exclusively online, people would have more time for the friends they already didn’t normally see in person, but instead they withdrew into smaller, tighter social circles. Some have compared the idea of a limited number of friends you can visit during quarantine to Myspace’s “Top 8.” Such decisions, though necessary, will surely create lasting hierarchies; feelings of abandonment, jealousy, and resentment among friend groups."}, {"type": "subtitle", "content": "Constraints in the form of interaction affect what we say."}, {"type": "sentence", "content": "We tend to think of technology as expanding our abilities: social media apps give us the ability to do things that we were not able to do before. But if there’s a defining aspect of social media compared to older interactive sites, which tried to add as many bells and whistles as they could, it’s that each app limits the ways we can interact in favor of simplicity, convenience, and an identifiable brand aesthetic."}, {"type": "sentence", "content": "Twitter is an obvious example: Tweets were originally limited to 140 characters, a number chosen to fit within the limitations of a text message. Like SMS, tweets are a valuable communication tool with drawbacks created by their format: short and lacking in tone and gesture, they seem terse and passive-aggressive, and especially on a global scale, jokes are hard to distinguish from sincere beliefs. Long stories are broken up into threads. While it’s possible to read an entire thread as intended, it’s also very easy to take any individual tweet out of context, relying on the fact that most people simply won’t bother to read the original thread to spread misinformation. Good ideas can spread very quickly, but can also quickly be stripped of nuance and misused. Arguments can continue long after the original poster apologized simply because the apology is a separate, unseen tweet. Bot accounts can be used to manipulate public opinion, and real people can be mistaken for bots. Those who have been wronged can use Twitter to demand justice just as swiftly as issues of any scale, across the political spectrum, can snowball into targeted harassment campaigns: it seems that within every ideology there are people who are in the fight because they like to fight."}, {"type": "sentence", "content": "Instagram is similarly limited. Users can only post pictures or videos, and only from a mobile device. You can’t link to web sites outside of Instagram in your posts unless you’re a business with a high follower count. The only way to share other users’ posts is through “stories” which disappear after 24 hours, a feature copied from Snapchat, making Instagram users rely largely on connections made through other apps to gain followers. The culture of Instagram, to be honest, is somewhat of a mystery to me: I’m an artist, I’ve been in dozens of shows in multiple cities, and I have fewer followers on IG than I have friends on Facebook."}, {"type": "sentence", "content": "These apps are basically stripped-down blogs: instead of being able to post multimedia essays of unlimited length, you can only post a few types of content, and that content is organized and displayed to others on a feed in a unique way. They have specialized features that make these specific types of posts easier to make."}, {"type": "sentence", "content": "The thing about blogs, forums, and chat rooms is they’re not gone. They don’t require anybody to code a new app for people to start using them again. They’re simply (with some exceptions, like Discord) not popular anymore, and many of them aren’t designed to work well on modern phone screens. We all still have the ability to make phone calls, too, and we’re just not doing it."}, {"type": "sentence", "content": "I’ve tried to imagine what it would be like if Facebook functioned like a Web 1.0 forum: probably something like a cross between Reddit and Craigslist, with a little Nextdoor. Reddit’s voting system, which would turn the community into a popularity contest, would be abandoned. Instead of friending individual people, you would join communities based on regions, subcultures, and friend groups of various sizes. Structured subforums and advanced search functions would replace the confusing infinite-scrolling feeds. Would there be security measures in place to prevent text from being crossposted from private groups to more public ones? Would you have to create a whole new board just to exclude your ex after a nasty breakup, just block them, or learn to share space some other way?"}, {"type": "sentence", "content": "So what would a better alternative to Facebook look like? It’s hard to say: fixing social problems with apps seems ill-advised. The difference between a utopia and a dystopia, after all, is not the technology, but the division of power in society and the social and economic policies that govern the way people live with that technology. But if our behavior has changed in the past twenty years in response to the changes in technology, surely we can create new technology intentionally designed to assist us in maintaining friendships and completing social tasks. We can intentionally design software that encourages people to interact with one another more actively, more compassionately. The app we need (because let’s face it, we’re not all going to pitch our cell phones into the sea) may already exist, we just don’t know it yet. In a world where the goal of creating the next big app is to become a tech billionaire by selling data to advertisers and exploiting loopholes in labor laws, though, can we reasonably expect such an app to succeed?"}], "topic": "social-media"}