{"title": "The Son’s Courage or the Mother’s Sacrifice", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "sentence", "content": "“How could you ask me such a thing?” his mother said in an angry voice she did not know she had until that moment."}, {"type": "sentence", "content": "Holland remained calm; it was as though he was in a hypnotic state."}, {"type": "sentence", "content": "For a second his mother thought he was not there. Her heart was burning from the excruciating pain."}, {"type": "sentence", "content": "The Sun, now arising on the horizon, illuminated their faces along with his mother’s heart and Holland could see the pain inside."}, {"type": "sentence", "content": "The woman before him was the bravest and the kindest person he had ever met in his life. But at that moment, she seemed the most vulnerable human being because she was being a mother whose only child was leaving her behind."}, {"type": "sentence", "content": "Holland hated himself for being the reason for his mother’s sadness. Even though he had decided to tell her in person about the decision he had made, but before he could do it, his mother had found the letter the night before. He did not know about it until now."}, {"type": "sentence", "content": "He was lost in his thoughts when he heard his mother’s trembling voice."}, {"type": "sentence", "content": "The mother said, “You were 5 years old when someone killed your brother because he stood against injustice. Shortly after that, your dad’s body draped in the national flag was brought home,” she was choking back her tears."}, {"type": "sentence", "content": "She continued, “I still managed to breathe enough to survive because your tiny little hands were holding my finger. Looking at your innocent face I told myself I had to live for you, and so, I did.” She put her head in her hands."}, {"type": "sentence", "content": "“I feel that life is like an ocean, and time is an invisible river flowing within an ocean that carries us, and we all get carried away by the current. Time is the refuge of memories, and these memories bring with them the angel called happiness, that is also my companion nowadays, but those memories also bring a devil with them called sadness."}, {"type": "sentence", "content": "“Right now, I am feeling I am entangled by the devil that is creating a sinkhole of my tears in the Time River and pushing me down. Please, don’t let the devil win. Help me disentangling myself. Pull me up. You are my salvation, Son. How can I sever my own lifeline? I cannot let you join the Doctors Without Borders organization. I cannot afford to lose the only piece of my heart left with me, son.”"}, {"type": "sentence", "content": "His mother was crying uncontrollably, and the sinkhole of tears seemed to grow deeper and deeper."}, {"type": "sentence", "content": "“You won’t lose me, Mom,” Holland whispered."}, {"type": "sentence", "content": "He said, “I understand your pain and the fear too, more than I could ever express in words. But this is something I want to do. I plan to travel the world helping people in need. I will lose myself if I don’t. We both know only you can stop the sinkhole of tears from happening. Only you have the power to keep it from taking over.”"}, {"type": "sentence", "content": "“When the tears of happiness fall upon the sunshine of love, it forms a beautiful rainbow. Mom, let me be that colorful rainbow and bring smile to faces wherever I go.”"}, {"type": "sentence", "content": "He hugged his mother and kissed her on the forehead. Her mother’s eyes shed some more tears, but this time, he felt like a rainbow."}, {"type": "sentence", "content": "©️ Simran Kankas 2020. All Rights Reserved."}], "topic": "fiction"}