{"title": "Yes, You Can Stuff Two People into One MRI Machine", "data": [{"type": "image", "content": "https://miro.medium.com/max/2800/1*DneQ708T3I3vRddMigXZLA.jpeg"}, {"type": "subtitle", "content": "Couples’ brains are imaged simultaneously as they interact, proving a point"}, {"type": "sentence", "content": "Some people can’t handle the claustrophobic feeling of being inside a magnetic resonance imaging (MRI) machine, used to visualize the inner workings of the body and brain. So imagine being stuck inside one with someone else. Ten separate couples did exactly that, each for 45 minutes. And yes, they had their heads examined."}, {"type": "sentence", "content": "The couples, each already intimately involved—strangers may not have enjoyed this so much—were stuffed in the MRI tube to prove a point: that their brains could be imaged simultaneously during social interaction."}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*YklHnbctE1_4UBF8b6vS-Q.jpeg"}, {"type": "sentence", "content": "Each person got their own head coil, and other than lie there facing each other, all they had to do was take turns tapping each others’ lips. The resulting scans showed that, as expected, their brains became somewhat synchronized. Parts of the brain involved in movement and sensing showed similar patterns of oxygen consumption in the person tapping and the person being tapped."}, {"type": "sentence", "content": "“During social interaction, people’s brains are literally synchronized,” says study team member Lauri Nummenmaa, PhD, a professor of psychology and neuroimaging at the University of Turku in Finland. “The associated mental imitation of other people’s movements is probably one of the basic mechanisms of social interaction.”"}, {"type": "sentence", "content": "As people talk, they are constantly working to predict what the other might say, and to understand and influence each other, the researchers explain in the journal Frontiers in Psychiatry. It’s impossible to fully grasp how such an interaction affects both people without being able to image two intertwined brains in the act."}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*MUKMhfZLPXlKX__zHSeOnA.jpeg"}, {"type": "sentence", "content": "The new images do not reveal any notable scientific findings. The exciting thing is that social interaction was seen in real time in both individuals, in a somewhat natural setting. (To be fair, modern MRI machines are not as narrow as in the past, nor are they as dark and scary, according to the people who operate them. New machines are open at both ends, further reducing the risk of claustrophobia.)"}, {"type": "sentence", "content": "“This is an excellent start for the study of natural interaction,” says study team member and neuroscientist Riitta Hari, MD, professor emeritus at Aalto University in Finland."}], "topic": "neuroscience"}