{"title": "Developing a Game on Your Own", "data": [{"type": "subtitle", "content": "Meet Arsalan Nadeem, an ambitious, self-taught game developer crafting and launching his own video game"}, {"type": "sentence", "content": "Making a game is not easy. Quite the contrary; it’s an incredibly difficult and daunting task. Game development typically takes teams of people, thousands of hours worth of labor, and hundreds of thousands — if not millions — of dollars."}, {"type": "sentence", "content": "Potential developers spend years in school, build their portfolios, and start at the bottom just to have a chance to be on these elite programming teams. Not everyone has access to these resources, however. Some individuals want to create their dream without corporate interference, some want to develop because they’re passionate about the medium, some want to throw their hat in the ring to content with the big hitters, and others just want to have a hobby and enhance their skills. Several of the biggest names in the industry were developed by one person: Braid, Papers, Please, Spelunky, Stardew Valley, Undertale, and of course, Minecraft. These juggernauts were all created without being syndicated by big business, lines of code being written in the comfort of bedrooms and home offices, with free time being dedicated to these individual’s craft."}, {"type": "sentence", "content": "I was able to sit down with an indie developer and ask a few questions pertaining to the difficulties and revelations of developing a game on your own, as well as discuss a little bit about the game he’s making and what inspired him to do so. His name is Arsalan Nadeem, and this is what he had to say about lending his own voice to the gaming development scene."}, {"type": "subtitle", "content": "What is Mistral Hearts?"}, {"type": "sentence", "content": "SUPERJUMPHi Arsalan! Thank you so much for taking some time out of your day to answer some questions for me."}, {"type": "sentence", "content": "ARSALANYeah, no problem! Thank you as well for taking the time to interview me."}, {"type": "sentence", "content": "SUPERJUMPTell me a little bit about your game!"}, {"type": "sentence", "content": "ARSALANMistral Hearts is a board game style RPG. Think Mario Party meets Dragon Quest. You and up to three other players take turns moving around a board map in which you will solve quests, fight monsters, and progress the story until either you win or lose the campaign. There’s a lot more to it than that but that’s the basic idea."}, {"type": "sentence", "content": "SUPERJUMPWhat gave you the idea to make an RPG and how long have you been thinking about making a game like this?"}, {"type": "sentence", "content": "ARSALAN[Mistral Hearts] was initially an idea I had for a tabletop board game. But as I expanded on the ideas in it, I realized it would be too unwieldy as an actual tabletop game and would be more interesting as a video game. That way the computer can handle all the fiddly calculations and bookkeeping. As for how long, I started working on it a few months after I started thinking about the game seriously, which was over two years now."}, {"type": "sentence", "content": "SUPERJUMPDo you have a coding/programming background?"}, {"type": "sentence", "content": "ARSALANNot professionally, no. I just learned coding through necessity. I used to make games on RPG Maker, where coding isn’t really required. But eventually, as my ambitions for what I wanted to implement expanded, I had to learn Ruby, which was the programming language for RPG Maker. Learning Ruby was a slow and painful process for me, but once I had that down, I learning other languages a lot faster. I still wouldn’t call myself a professional programmer by any means though."}, {"type": "subtitle", "content": "Under the hood"}, {"type": "sentence", "content": "SUPERJUMPWhat is your favorite aspect of the development process?"}, {"type": "sentence", "content": "ARSALANI like the actual design aspect of it. As in, coming up with mechanics that go well together or provide an interesting challenge for the player."}, {"type": "sentence", "content": "SUPERJUMPWhat is your least favorite aspect of the development process?"}, {"type": "sentence", "content": "ARSALANThose long stretches of time where you need to just make a ton of art assets. Things like textures for buildings and roads, stuff like that. Initially it’s all fun and exciting but — especially if you’re working on a large project — the excitement gives way to a sense of “do I really need to make like 20 more of these?” haha."}, {"type": "sentence", "content": "SUPERJUMPWhat made you decide to make a game completely on your own?"}, {"type": "sentence", "content": "ARSALANIt’s not that I specifically want to make games on my own, but it’s just how I’ve always made games, aside from small collaborations here and there. I’m definitely open to working in a team for a full project in the future, but as of now I’ve been content for this to be a solo endeavor."}, {"type": "sentence", "content": "SUPERJUMPWhat resources do you use? Unity, Unreal, etc?"}, {"type": "sentence", "content": "ARSALANFor this project I’m using Unity as the game engine. [I also use] Blender and Photoshop mainly for the art assets, as well as Microsoft Visual Studio as the IDE for coding."}, {"type": "sentence", "content": "SUPERJUMPDo you do your own character/3D modeling? How did you learn how to use the software?"}, {"type": "sentence", "content": "ARSALANYes, and mainly through watching and following a ton of tutorials online through the years. Nowadays, you can learn pretty much anything online. Sure, it’s not as comprehensive as getting a formal education on it, but you can still get by, especially since in game design you need to know quite a wide variety of things. Not only that but there are tons of free art assets available to indie developers online. Sites like CGTrader and Turbosquid have a ton of 3d models you can use and tweak to get what you need. Unity and Unreal also have a lot of good assets on their respective stores as well."}, {"type": "sentence", "content": "SUPERJUMPWhat got you into creating games?"}, {"type": "sentence", "content": "ARSALANPlaying a lot of video games and going “this is a great game but I also wish it did this other thing. And that other thing.” And so on, until getting the urge to just make a game myself. I imagine it’s the same for a lot of indie devs."}, {"type": "sentence", "content": "SUPERJUMPIs this the first game you’ve attempted to release?"}, {"type": "sentence", "content": "ARSALANIt’ll be the first one I release commercially. Mostly I’ve made games for friends on RPG Maker, nothing too amazing but I’ve learned a lot doing it."}, {"type": "sentence", "content": "SUPERJUMPWhat’s the most difficult aspect of making a game?"}, {"type": "sentence", "content": "ARSALANAside from specific technical problems that arise, the main one for me has been maintaining scope. You need to be able to realize what you can and can’t realistically do. I think this is a common pitfall that a lot of us indie devs fall into. You can have the greatest ideas in the world but it’s not going to matter if your game never comes out."}, {"type": "sentence", "content": "SUPERJUMPWhat was your biggest blunder or set back while making the game, and how did you overcome it?"}, {"type": "sentence", "content": "ARSALANI would say implementing online functionality was the biggest hurdle I had to overcome for this project, as it’s not something I had much experience in doing. Thankfully, due to the help of some knowledgeable friends, and lots of online help, I was able to get it working. It’s still something I’m wary of when playtesting and will definitely need some fine tuning in the future."}, {"type": "sentence", "content": "SUPERJUMPHow does a team of one person handle things like quality control, bug fixes, etc?"}, {"type": "sentence", "content": "ARSALANBy pestering anyone you can to test play your game and giving you feedback. Since you can’t exactly hire a QA team as an indie dev, you just have to find other means. There are lots of communities online for game devs with members that will test play your game if you test play theirs. There’s also many discord servers you can join to help with things like this."}, {"type": "sentence", "content": "SUPERJUMPHow do you handle deadlines? Do you keep yourself on a strict schedule, or do you sort of just go with the flow?"}, {"type": "sentence", "content": "ARSALANI think some sort of deadline/ scheduling is vital to gauge your progress and to make sure you aren’t falling behind on what you need to be doing. That being said, I find it difficult to stick to a strict schedule because game design is such an iterative process that it’s hard to map out months in advance exactly what I’ll be doing."}, {"type": "subtitle", "content": "The creative process"}, {"type": "sentence", "content": "SUPERJUMPYou told me you handle all of the writing for the game as well as all the coding, do you have a system for that, as in is everything already mapped out and you go from there or are you writing more as more ideas pop in your head?"}, {"type": "sentence", "content": "ARSALANThe broad strokes of the plot, characters, and quest design are mapped out, but I leave things kind of open until I actually sit down and write them."}, {"type": "sentence", "content": "SUPERJUMPWhere did you learn to write cohesive stories?"}, {"type": "sentence", "content": "ARSALANI’ve always been fond of writing stories. Besides game design, it’s my favorite part of the process. I think writing stories is something you just naturally get better at the more you write. Reading is also essential to getting better at storytelling."}, {"type": "sentence", "content": "SUPERJUMPDid you have any difficulty in knowing where the story was going to go next?"}, {"type": "sentence", "content": "ARSALANYeah, especially since I like games that take player choice into account, it can be difficult planning out exactly how far you want the story to branch out. There’s always a balance to be made between having meaningful choices and maintaining a realistic scope for the project."}, {"type": "sentence", "content": "SUPERJUMPDid you finish the entire story and then start with the development, or was it kind of a joint effort?"}, {"type": "sentence", "content": "ARSALANFor this, the story definitely came after the general mechanics and idea for the game. As much as I like stories, I think for games, it’s a better idea to start with a good set of mechanics first. [This is] just my personal preference though."}, {"type": "subtitle", "content": "Advice for creators, and preferred platform"}, {"type": "sentence", "content": "SUPERJUMPDo you have any advice for someone starting out in development, or considering making a game by themselves like you have?"}, {"type": "sentence", "content": "ARSALANI think you should definitely work on something that interests you. You don’t have to start with a 2D platformer as your first project if you’re not interested in them. That being said, maintaining scope is very important. For the first few projects I recommend doing basically short game demos that show off a few mechanics or game levels. That way you get used to the flow of making games before you start on an actual full project."}, {"type": "sentence", "content": "SUPERJUMPHow long until the game comes out?"}, {"type": "sentence", "content": "ARSALANI’m predicting a year, but you can never predict what life will throw at you, so there’s definitely a possibility that it will take longer."}, {"type": "sentence", "content": "SUPERJUMPOk, last question. Xbox, PlayStation, Nintendo, or PC? If you HAD to play only one for the rest of time."}, {"type": "sentence", "content": "ARSALANAs much as I love my Switch, I’m going to have to go for PC for sure."}, {"type": "sentence", "content": "SUPERJUMPWell, thank you so much for giving me your time and answering these questions, Arsalan! I’m really excited to get a better peek at your game the closer it gets to release."}, {"type": "sentence", "content": "ARSALANIt was my pleasure! Thank you for taking the time to interview me Jared."}, {"type": "sentence", "content": "Keep an eye out for Mistral Hearts, hopefully releasing sometime next year!"}, {"type": "image", "content": "https://miro.medium.com/max/300/1*lKvmHEGaYMRWPDSO5w64Jg.png"}, {"type": "sentence", "content": "Hello everyone! Thank you for reading! Arsalan is a really nice guy and he’s working really hard on this game, and I hope you continue to check it out! He’s currently setting up a website and I will add a link to it once it’s finished."}, {"type": "sentence", "content": "Jared McCarty"}, {"type": "image", "content": "https://miro.medium.com/max/1996/1*3lf9Y6mHxoxpSSFOw6gjlw.png"}], "topic": "ux"}