{"title": "Colonizing Mars may require humanity to tweak its DNA", "data": [{"type": "image", "content": "https://miro.medium.com/max/16384/0*vLhE1_SmYipFRaJU"}, {"type": "sentence", "content": "If humanity is ever going to settle down on, we may need to become a little less human."}, {"type": "sentence", "content": "Crewed missions to Mars, which NASA wants to start flying in 2030, will be tough on astronauts, exposing them to high radiation loads, bone-wasting microgravity and other hazards for several years at a time. But these pioneers should still be able to make it back to Earth in relatively good nick, agency officials have said."}, {"type": "sentence", "content": "It might be a different story for those who choose not to come home, however. If we want to stay safe and healthy while living permanently on Mars, or any other world beyond our home planet, we may need to make some tweaks to our species’ basic blueprint, experts say."}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*kul6wzAIwgVvjng65y9Zqg.jpeg"}, {"type": "sentence", "content": "Genetic engineering and other advanced technologies “may need to come into play if people want to live and work and thrive, and establish their family, and stay on Mars,” Kennda Lynch, an astrobiologist and geomicrobiologist at the Lunar and Planetary Institute in Houston, said on May 12 during a webinar hosted by the New York Academy of Sciences called “Alienating Mars: Challenges of Space Colonization.”"}, {"type": "sentence", "content": "“That’s when these kinds of technologies might be critical or necessary,” she said."}, {"type": "subtitle", "content": "Coming soon?"}, {"type": "sentence", "content": "Genetic enhancement may not be restricted to the pages of sci-fi novels for much longer. For example, scientists have already inserted genes from tardigrades — tiny, adorable, and famously tough animals that can survive the vacuum of space — into human cells in the laboratory. The engineered cells exhibited greater resistance to radiation than their normal counterparts, said fellow webinar participant Christopher Mason, a geneticist at Weill Cornell Medicine, the medical school of Cornell University in New York City."}, {"type": "sentence", "content": "NASA and other space agencies already take measures to protect their astronauts physically, via spacecraft shielding, and pharmacologically via a variety of medicines. So, it’s not a huge conceptual leap to consider protecting them genetically as well, provided that these measures are proven to be safe, Mason said."}, {"type": "sentence", "content": "“And are we maybe ethically bound to do so?” he said during the webinar. “I think if it’s a long enough mission, you might have to do something, assuming it’s safe, which we can’t say yet.”"}, {"type": "sentence", "content": "Tardigrades and “extremophile” microbes, such as the radiation-resistant bacterium Deinococcus radiodurans, “are a great, basically natural reservoir of amazing traits and talents in biology,” added Mason, who has been studying the effects of long-term spaceflight on NASA astronaut Scott Kelly. (Kelly spent nearly a year aboard the International Space Station in 2015 and 2016.) “Maybe we use some of them.”"}, {"type": "sentence", "content": "Harnessing these traits might also someday allow astronauts to journey farther than Mars, out to some even more exotic and dangerous cosmic locales. For instance, a crewed journey to the Jupiter moon Europa, which harbors a huge ocean beneath its icy shell, is out of the question at the moment. In addition to being very cold, Europa lies in the heart of Jupiter’s powerful radiation belts."}, {"type": "sentence", "content": "“If we ever get there, those are the cases where the human body would be almost completely fried by the amount of radiation,” Mason said. “There, it would be certain death unless you did something, including every kind of shielding you could possibly provide.”"}, {"type": "sentence", "content": "Genetic engineering at least lets us consider the possibility of sending astronauts to Europa, which is widely regarded as one of the solar system’s best bets to harbor alien life. (The Jovian satellite is a high priority for NASA’s robotic program of planetary exploration. In the mid-2020s, the agency will launch a mission called Europa Clipper, which will assess the moon’s habitability during dozens of flybys. And Congress has ordered NASA to develop a robotic Europa lander as well, though this remains a concept mission at the moment.)"}, {"type": "subtitle", "content": "Not just us"}, {"type": "sentence", "content": "Genetic engineering almost certainly won’t be restricted to pioneering astronauts and colonists. Recent advances in synthetic biology herald a future in which “designer microbes” help colonists establish a foothold on the Red Planet, Lynch said."}, {"type": "sentence", "content": "“These are some of the things that we can actually do to help us make things we need, help us make materials to build our habitats,” she said. “And these are a lot of things that scientists are researching right now — to create these kinds of things for our trip to Mars.”"}, {"type": "sentence", "content": "Some researchers and exploration advocates have even suggested using designer microbes to terraform Mars, turning it into a world much more comfortable for humans. This possibility obviously raises big ethical questions, especially considering that Mars may have hosted life in the ancient past and might still host it today, in subsurface lakes or aquifers. (Permanently changing our own genomes for radiation protection or any other reason may also strike some folks as ethically dubious, of course.)"}, {"type": "sentence", "content": "Most astrobiologists argue against terraforming Mars, stressing that we don’t want to snuff out or fundamentally alter a native ecosystem that may have arisen on the Red Planet. That would be both unethical and unscientific, Lynch said."}, {"type": "sentence", "content": "After all, she said, one of the main reasons we’re exploring Mars is to determine if Earth is the only world to host life."}, {"type": "sentence", "content": "Originally published at https://www.space.com on May 19, 2020."}, {"type": "sentence", "content": "Please, don’t hesitate to contact me if you have any questions.Recep SÜLÜKER (recepsuluker@gmail.com)MSc Aerospace Engineering at Sapienza Universita di RomaYoutube, LinkedIn, Twitter, Instagram, Facebook"}], "topic": "science"}