{"title": "Money Mindset Shifts That Can Change Your Life", "data": [{"type": "subtitle", "content": "How you think about money affects how much you have."}, {"type": "sentence", "content": "What if I told you that how you think about money affects how much money you have? No, I’m not suggesting you can simply think your way to having more money. I’m not one of those manifestation gurus who believe that imagining yourself with more money is enough to magically add zeros to your bank account."}, {"type": "sentence", "content": "How you think about money does affect your bank account, though. That’s because thoughts lead to actions, and actions lead to results. There are a few money mindset shifts you can make right now, that really will impact how much money you have in the future, so it’s definitely worth making these shifts now. Your future self will thank you."}, {"type": "subtitle", "content": "Stop Thinking In Terms Of ‘Not Enough’"}, {"type": "sentence", "content": "We all feel at times that we simply don’t have enough money, and that doesn’t change when we have more money. In fact, as our income grows, so do our goals. This means we can still feel like we don’t have enough, even on a high income. Whether it’s not having enough to splurge on the designer coffee today, or not having enough for the multi-million dollar home, there will always be times when our finances and our desires just don’t match."}, {"type": "sentence", "content": "This leads to a scarcity mindset, and can really damage your financial health. Try focusing on what your money can buy. Not what it can’t. Think of what you do have enough of, even if that’s something other than money. Sometimes what you do have enough of can be converted into money. Maybe you have enough skills, time, education, or contacts. Switch to an abundance mindset, by focusing on what you have right now, even if that’s not actual cash in the bank."}, {"type": "subtitle", "content": "Banish “I Can’t Afford” From Your Vocabulary"}, {"type": "sentence", "content": "Closely related to the “not enough” narrative, is the “I can’t afford” narrative. It’s time to change that up. Money mindset coaches have a simple fix for this one. Every single time you hear yourself saying, or thinking, “I can’t afford X”, substitute it with “How can I afford X?”. It’s a small change, but potentially a powerful one."}, {"type": "sentence", "content": "There is often a way to afford something small. A budget tweak. A lifestyle change. A sacrifice (or postponement) of something else you want. When it comes to the bigger stuff, then it’s a case of drawing up a long-term plan. Maybe you need to earn more, or save more, or develop a side hustle. In theory, you can afford a lot of what you want. It’s just a case of working out the how."}, {"type": "subtitle", "content": "Treat Your Money Like A Friend"}, {"type": "sentence", "content": "Many of us may have grown up thinking that the love of money is the root of all evil, but that’s not true. Love is a positive thing. Obsession is what’s unhealthy. When you see the evil billionaires out there making bad decisions based on greed, that’s not coming from a place of love. That’s coming from a place of obsession. The greedy billionaires are obsessed with money. They hoard it, and value it over human life, and put it before public health or environmental sustainability."}, {"type": "sentence", "content": "When you love your money, you treat it like a friend. You pay it lots of attention and help it grow. You don’t allow it to get wasted. You check in on it daily to make sure it’s not depleting too fast. You sit down with it every week, or at least once a month, and pay close attention to what it’s doing, where it’s going, and whether you can better support its growth and security in the future."}, {"type": "subtitle", "content": "Have Your Money Work For You"}, {"type": "sentence", "content": "Some financial experts claim this is the major difference between the poor and the rich. The poor work for their money, and the rich have their money work for them. This is mostly a case of necessity, of course. But it’s also linked to mindset. Someone with a low-income mindset thinks about working harder to get more money. Someone with a high-income mindset thinks about saving money and investing it to make more. Your mindset doesn’t always match your income, however. Which is why you can have a high income, and tons of debt, or a low income and at least a modest amount of savings."}, {"type": "sentence", "content": "It’s generally advisable, wherever you are on your financial journey, to pay off your personal debt as aggressively as you can. Once that’s done, however, every dollar you save can be put to work making you more money. That “how can I afford…” question above? Once you have savings, one of the things you’ll be able to look at when you ask that question is whether that money could be working harder for you than it currently is."}, {"type": "subtitle", "content": "Celebrate Security"}, {"type": "sentence", "content": "There are plenty of people who celebrate having money, by spending money. In some ways that’s like celebrating having found the love of your life, by breaking up with her (or him). A positive mindset shift to make is to see money in terms of financial security. Most of us see money in terms of what it can buy us, not what it can provide us with. Money can buy a lot of material goods, but it can also provide peace of mind, security, and confidence in the future."}, {"type": "sentence", "content": "I have a few rules about celebrating financial success. If I’m celebrating business success, any money I spend as part of that celebration will be reinvested in my business (or my own business-related skill set). If I’m just celebrating a milestone in terms of personal savings, I’ll always celebrate in a way that doesn’t cost anything. When I do celebrate a financial success or windfall in a way that requires spending money, it will be a small fraction of what I’ve gained that gets spent. I just don’t feel the need to celebrate having something by immediately getting rid of it."}, {"type": "subtitle", "content": "Shift From ‘Spending’ Money To ‘Using’ It"}, {"type": "sentence", "content": "There are many ways you can use money. You can save it, invest it, donate it, or, yes, spend it. You can set up a business, non-profit, or other organization. You can buy things or experiences. You can save for early retirement, a dream trip, or a big boat. You can invest in your education, your health, and wellbeing, a new startup that’s doing something amazing, or a big public company whose values you agree with. The trick is to use your money in truly important and meaningful ways. If you always think in terms of using your money well, rather than simply spending it, then you’ll tend to end up with a much more interesting, value-based, fulfilling life."}, {"type": "sentence", "content": "Disclaimer: The information in this article is not intended to encourage any lifestyle changes without careful consideration and consultation with a qualified professional. This article is for reference purposes only, is generic in nature, is not intended as individual advice and is not financial or legal advice."}, {"type": "sentence", "content": "Originally published on Wealthtender.com."}], "topic": "mindfulness"}