{"title": "What’s Next For Sidewalk Labs?", "data": [{"type": "subtitle", "content": "The failure of the Toronto Quayside project makes you wonder if Alphabet is the right vessel for urban city improvements."}, {"type": "image", "content": "https://miro.medium.com/max/1400/1*R1jC1KQmahxLqWhsX5Iovw.jpeg"}, {"type": "sentence", "content": "The announcement by Sidewalk Labs CEO Dan Doctoroff that it will no longer pursue the Toronto Quayside project ends a three-year battle by Alphabet’s urban innovation subsidiary against the citizens of Toronto."}, {"type": "sentence", "content": "In the goodbye post, Doctoroff keenly avoids mentioning any tension between residents and Sidewalk, placing the blame firmly on the coronavirus pandemic and Toronto’s real estate market."}, {"type": "sentence", "content": "However, as several reporters have mentioned, Sidewalk’s flagship project had essentially come to a standstill. It had been forced to reduce the size from 190 to 12 acres, agreed to store all data locally, and was still kept in court for over a year."}, {"type": "sentence", "content": "One of the key issues’ residents brought up was Sidewalk’s collection of data. The use of data may have been critical to certain systems working, but for residents, it seemed like a bad sell."}, {"type": "sentence", "content": "So where does Sidewalk go from here?"}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*AxIL2ETkvxNDOEEmCvarTw.jpeg"}, {"type": "sentence", "content": "Doctoroff mentions several key innovations that came from the Quayside redevelopment, although the subsidiary only holds one patent. He also said Sidewalk is an investor in several urban projects, so maybe it could be an incubator inside an incubator. What he doesn’t disclose is the next step for Sidewalk: a new project, a new city, a new ambition."}, {"type": "sentence", "content": "All of Sidewalk’s public identity was in Toronto. Without it, it slithers back into the Alphabet conglomerate, feeding off the “other bets” money without any flagship project."}, {"type": "sentence", "content": "Will Alphabet take a shot with another city? It’s hard to say. I doubt it will invest as heavily without assurances it can start development immediately. Sidewalk never received approval to develop in Toronto, which is why the project stagnated for three long years in legislative hell."}, {"type": "image", "content": "https://miro.medium.com/max/4264/1*CHMV-OvZGIxmaqZ83fZCyA.jpeg"}, {"type": "sentence", "content": "Sidewalk did have some fascinating ideas on urban development. Using timber for residential and offices spaces; public WiFi that connects to traffic sensors; and a redesign of roads to promote non-car transport are all excellent ideas. The urban concept was never the problem. It was how Sidewalk went about the proposals; limited consultation and a lot of splashy press releases."}, {"type": "sentence", "content": "That said, Sidewalk did release a 1,524 page plan, which apparently took eighteen months. It must suck to have put all that attention into the concept, but have local residents shun it. But, homelessness has spiked in the past decade due to skyrocketing rents and unaffordable housing in Toronto, so even without the privacy battles it would have been a difficult project to sell."}, {"type": "sentence", "content": "I do wonder if Sidewalk would not be better served outside of the Google brand. Alphabet definitely keeps them afloat, but one of the main criticisms of the project was privacy and advertising, two things directly linked to Google’s business model."}, {"type": "sentence", "content": "If Sidewalk approached a project as a standalone business, it might have had an easier time convincing residents of the value of its technologies, without worrying their information was being sent back to Google HQ."}, {"type": "sentence", "content": "That said, there’s a reason we don’t have hundreds of urban innovation research labs, with billion-dollar funding rounds. Infrastructure improvements cost a lot of money; legislators can put a project on indefinite hold; and there’s a big chance the company never makes any revenue."}, {"type": "sentence", "content": "Sidewalk was conceived because Larry Page wanted a city for Google to experiment. From the limited interviews he’s given over the past few years, it’s a clear dream of his to have a place where technology companies (or just Alphabet) can experiment without any regulators or laws. I assume living in San Francisco has tarred his view on elected officials’ ability to provide urban innovation, which led to Sidewalk."}, {"type": "sentence", "content": "So in a way, Sidewalk may be hindered by Google, but would most likely not exist outside of it."}, {"type": "sentence", "content": "One of the things Sundar Pichai is going to have to tackle is Larry’s decade of green-lighting anything he found intriguing. Taking a gander at Google’s “other bets”, Sidewalk Labs is definitely on the “this is very unlikely to ever be profitable without massive resources and lobbying” side, so I wouldn’t be surprised to hear it got the axe in a few years."}], "topic": "business"}