{"title": "Bearing Witness", "data": [{"type": "subtitle", "content": "What I Saw on My Visit to Palestine"}, {"type": "subtitle", "content": "A Ramadan Interfaith Meditation"}, {"type": "sentence", "content": "In Surah Ṣād in the Noble Qur’an there is a story about Prophet David (peace be upon him) who, at the time, was King of the United Monarchy of Israel. While in his private quarters one day, two men hopped the wall and came in unannounced taking him by surprise. Seeing that he was startled, the men reassured him that they meant no harm. Rather, they’d come seeking mediation in a dispute between the two of them. One of them had tush’tit the other. Tush’tit means to wrong or act unjustly by exceeding reasonable limits. Before David could respond, one of the men rushed to make his claim first, explaining that his neighbor had ninety-nine ewes yet was demanding that he hand over the only one he had. The plaintiff then says his neighbor “waʿazzanī fī l-khiṭābi” — translated variously as “overpowered me in speech” and “is harsh to me in speech.”"}, {"type": "sentence", "content": "The implied meaning here is that strong-arm tactics were used in the argument as opposed to it being a negotiation between two parties of equal power. A relevant, ancillary meaning of wa’azzani is “to be proud boastful” and “hardened.” It appears, then, that the neighbor also acted arrogantly in his demands. By dominating the hearing with an emotional appeal, King David is immediately sympathetic to his case and rushes to judgment. He deems the neighbor a zaalim (oppressor) before even hearing his testimony, much less verifying the plaintiff’s claim. Does the neighbor actually have more ewes? What is the neighbor’s motive exactly? And how do we know that the plaintiff isn’t guilty of part, if not all, of what he has accused his neighbor of?"}, {"type": "sentence", "content": "The American body politic has many conflicting preconceived notions and ill-informed opinions about the dispute between Palestine and Israel. There’s the idea that the conflict is a centuries-old battle between Jews and Muslims, motivated by Islamic fanaticism. Then there’s the myth that Israel was a land without people when Jews were repatriated to this veritable ancestral homeland following World War II. Another belief is that no peace has been achievable due to Palenstiains’ refusal to negotiate in good faith. These misconceptions obscure the objective reality of the current situation in Palestine and its historical and political antecedents."}, {"type": "sentence", "content": "While such misconceptions are significantly correlated with Americans’ religious and party affiliations, the appeal of the Zionist narrative has transcended such affiliations. This is owed largely to its successful propagation through organizations like AIPAC, pro-Israel politicians, media pundits, and journalists, think tanks, advocacy groups on university campuses, and even propagandistic tourism. American political scientist John Mearsheimer and professor Stephen Walt refer to this coordinated network of individuals and organizations as the Israel Lobby. Its domination of public discourse on what is referred to euphemistically as the “Israeli-Palestinian Conflict”"}, {"type": "sentence", "content": "The result? Across successive democratic and republican administrations, the nation has consistently supported Israelis over Palestinians. In 2019, nearly 60% of all Americans reported being more sympathetic to the case made by the Israelis. When disaggregated by religion and party, more religious and/or more conservative Americans had even higher levels of support for Israel over Palestine."}, {"type": "sentence", "content": "The Boycott, Divestment, and Sanctions (BDS) movement is a Palestinian-led campaign pressuring the Israeli government to follow international law regarding Palestinian human rights and changing the narrative about Palestine. Since its founding in 2005, successful campaigns in the US and abroad have prompted state lawmakers throughout the US to propose anti-BDS legislation. Despite its national influence and international scope, nearly half and over half of republicans and democrats, respectively, have never even heard of it, much less the arguments that undergird its cause. Americans’ rush to judgment means they know very little about the Palestinians’ case against Israel."}, {"type": "image", "content": "https://miro.medium.com/max/1028/1*QFHA-6JZ2sakkh65C8LbkQ.png"}, {"type": "sentence", "content": "On this 72nd anniversary of the Nakba, I am thinking about my late grandfather, Papa, whose family grew up in the Jim Crow south. One day two of his great uncles got into a violent altercation between two white folks in the town, leaving one of them dead. That night, they picked up and left everything behind for the North. Papa was always telling me stories like this. Stories of Black displacement, oppression, and resilience. When I was around thirteen he took me to the remnants of a Black town called Allensworth, about an hour north of Bakersfield. He told me that it once was a vibrant community that Black folks had settled in, less than fifty years up from slavery. I looked around at the rusting farm equipment strewn across the brown grass and the vacant buildings surrounding us."}, {"type": "sentence", "content": "Papa was right. Nearby white farmers were hurting from a drought and diverted the water supply away from Allensworth. Because of the expense required to drill for water, many black folks just moved away. Later on, I had learned that there were many other black towns and villages established after slavery on indigenous land that suffered similar fates. Entire lives uprooted due to threats of violence and the machinations of state power. Land, homes, and property destroyed or left behind to be appropriated by white folks."}, {"type": "sentence", "content": "During my trip to Palestine in June 2019, I saw firsthand that Palestinians too had their own Allensworths. There was one major difference though. Palestinians were displaced via colonial conquest much like indigenous peoples in America. One such example that I witnessed firsthand was a village on the outskirts of Jerusalem called Lifta. Lifta is the only Palestinian village since 1948 that hasn’t been completely demolished and built over. That doesn’t mean attempts weren’t made. In the early part of the last decade, the Israel Land Administration and the Jerusalem Municipality had plans to demolish what remains of the village to make way for luxury condos and a commercial and business sector. A coalition of Palestinians and Israelis fought to preserve it, albeit for different reasons. The Israelis wanted to preserve it for its artistic and cultural value, marveling over its architecture and historic import. For Palestinians, the fight has been far more existential. They want a home to come back to."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*WbH36qzjCZksA3jc6eO0cQ.jpeg"}, {"type": "sentence", "content": "The delegation I traveled with gathered under a tree at the entrance of Lifta as our guide gave a brief history. Once a vibrant, well-to-do Palestinian Arab community, it’s history extends back to well before the Ottoman period. During the Nakba, residents were systematically driven out of their homes and resettled in the surrounding areas. Jewish settlers moved in and out of Lifta and stayed there until the 1970s. Since then it has remained a ghost town, a site of pilgrimage for displaced Palestinians, and a recreation spot for young settlers who know very little about its history. Down the hill from where we stood was a spring and about a dozen scantily clad settlers in their early twenties, smoking, chatting, and laughing. As we passed by them on our way into the village they shot some of us indifferent and curious glances."}, {"type": "sentence", "content": "After walking down a narrow path for just a short while we approached a cluster of large stone buildings on our left. There was a narrow set of stairs that took us to what looked like a courtyard in the middle of several adjacent structures. Our guide explained that they were homes. The walls were covered with graffiti and the floors filled with trash. Towards the back was a building that was larger than the rest. A mosque. I walked inside and my heart was overcome with emotion. Sadness. Anger. Awe. I greeted the mosque with two raka’at of prayer and made a dua’a to be able to see the day when the people of this village would be able to return."}, {"type": "sentence", "content": "When Palestinians and their allies call for the world to support the political position of the Right of Return it means being able to come back to villages like Lifta and rebuild their lives. It means the end of segregated, Jewish only settlements built on top of depopulated and destroyed villages like Lifta. This position doesn’t preclude the right for Jewish self-determination, peace, and security. Rather, it argues that this shouldn’t be at the expense of Palestinian dignity and human rights. In the Israelis’ pursuit of their nationalist vision, they have become the thing they falsely accuse Palenstiains of being — zaalim. They have transgressed the bounds of what is just. They have become extremists, dominating the public discourse with a narrative that not only omits the Palestinian voice but fictionalizes history. Palestine is no more “a land without people” than the Americas were a “pristine wilderness” at the onset of European colonization. Palestinians had always been there, living on and tending to the land of their ancestors. Over the last 72 years, however, that land has been gradually and aggressively appropriated. In short, Israelis have most of the ewes and are seeking to take their neighbor’s last."}, {"type": "sentence", "content": "At the end of the story about the two disputants, King David realizes his error in judgment and repents. He immediately falls down prostrate overcome with remorse and asking for forgiveness. God then tells David to always render judgments “with truth” and do not follow his huwa (desires) because it will cause him to stray from the path of God. In other words, do not follow arbitrary views based on whim and opinion or those that are convenient. Seek out the truth. Nasril bil haqqul bil haqq — make victorious the Truth with the truth."}, {"type": "sentence", "content": "The chorus of voices testifying is growing louder and louder. As more Americans begin to visit Palestine for themselves and take time to learn about Palestinians’ experiences across the diaspora, the veils begin to lift. They begin to see what they couldn’t see before."}, {"type": "sentence", "content": "In Prophet Muhammad’s (peace be upon him) last sermon on Mount Arafat, he stood before his community and asked them to bear witness to the truth of everything he’d taught them. In the end, he gave them a charge saying, “it is the duty of those who were witnesses to inform those were absent.”"}, {"type": "sentence", "content": "Count me among the witnesses. I went to Palestine and I came back. I am part of that growing chorus that includes the voices of Christians, Jews, Muslims, and Sabians. All bearing witness to what we’ve we seen. To what we’ve heard. To what could be. Free Palestine."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*3Rwjie8SBaOSpUSmsabHJg.jpeg"}], "topic": "travel"}