{"title": "MapleStory: The Game That Defined my Childhood", "data": [{"type": "subtitle", "content": "The game was the only source of stability in my life in a time I had none"}, {"type": "sentence", "content": "If there was one game that marked me as a video game addict, it is MapleStory, a 2D MMORPG developed by Wizet in South Korea (they were then purchased by a company called Nexon). I played this game as a child and teenager, and could find myself glued to it for 12 hours straight at times."}, {"type": "sentence", "content": "When I first started playing, I remember that there were two jobs that were the most popular in MapleStory: the assassin and cleric. A lot of people liked being a lightning mage, and some people would try to “tank” and be HP mages, but it was the assassin and cleric that dominated party quests (PQs) in Maple cities like Kerning City and Ludibrium."}, {"type": "sentence", "content": "It took me a while to watch YouTube videos and get a grasp of how to most efficiently distribute skill points, but inspirational videos by Dray86 showing MapleStory’s most accomplished players facing MapleStory’s most difficult bosses. To this day, I remember those names, from Tiger, Suuushi, and VietxHuE. After their reign at the top of MapleStory’s supreme, I remember FangBlade, the first person in Maple to reach level 200."}, {"type": "sentence", "content": "MapleStory taught me how to work hard at mindless tasks like grinding. In MapleStory, grinding was a term used to describe wasting away hours trying to gain EXP (experience points) from hunting boars, snails, or robos. I remember waking up in the middle of the night just so I can have a better shot at getting into PQs because, in the most crowded of times, it was absolutely impossible to get into PQs, the most effective and fun ways to level up."}, {"type": "sentence", "content": "Every Mapler will know terms like PQ, JQ (Jump Quest), and the famed AC, which was an acronym for auto-clicker, which helped you click on an NPC to have better chances of getting into PQ."}, {"type": "sentence", "content": "For me, Maple was just so fun. But it was also very social — I remember that I thought of my best friends as Maplers. I remember when new jobs came out and new locations came out, when the Aran became a new, overpowered job for the new Carnival Party Quest, and when my guildmates were genuinely my best friends in the world even when I didn’t know any of them personally."}, {"type": "sentence", "content": "I loved Maple so much that I would steal my parents’ credit card to try to buy NX clothes, which were just for appearances, a pet with a magnet that could pick up items and coins, and Gachapon tickets which were like chances at playing the lottery. I remember how vicious I was to my parents and my brother — I would whine, scream, and get extremely upset when I didn’t get what I wanted and my parents didn’t use what was left of their savings to pay for my Maple addiction."}, {"type": "sentence", "content": "Maple really sucked up a huge portion of my life, leaving me to neglect my homework, neglect school, neglect my actual social life, and just neglect all the relationships and obligations I had at the time."}, {"type": "sentence", "content": "I didn’t realize it then, but playing MapleStory was my way of coping with the problems I had at home that I had no control over, from my parents’ troubled marriage, to the fact that my family was moving legitimately all the time, to the fact that I couldn’t keep the same friends because we were always moving when my dad found a better opportunity."}, {"type": "sentence", "content": "If life didn’t give me control, Maple did. I found that I was technically sound and savvy at timing and winning jump quests that required precision and timing to land at the top of the map. I found that I was a skilled grinder and PQ asset that allowed my party to get through a party quest as quickly as possible. I found that I could get into PQs ​without​ auto-click by just jamming the left-click of my Microsoft mouse as quickly as I could. I even learned basic business skills from MapleStory, as every player is familiar with trying to find an optimal spot in FM1 (the busiest market place) to “merch” items, meaning buying them at a low price, and selling them at a much higher price."}, {"type": "sentence", "content": "By the way, every Mapler will know what the numbers 133 221 333 123 111 mean in Ludi PQ."}, {"type": "sentence", "content": "MapleStory was a band-aid, but it was an effective band-aid that I, today, have a love-hate relationship towards. I’m glad that I quit playing Maple when I was 14, or else I don’t know what I would be doing with my life at 23."}, {"type": "sentence", "content": "I remember why I stopped playing MapleStory at times: I got hacked. Some people told me they could add 10 million mesos (the Maple currency) to my account if I gave them account information. Since I that amount of money was unfathomable to me, I gave in, completely not knowing that they were just going to change my account and run away with my very hard-earned characters."}, {"type": "sentence", "content": "In retrospect, it was really good for me to have my accounts let go of, but at the time, I cried that I lost things I put so much work into."}, {"type": "sentence", "content": "If there’s one thing I wish Nexon, the owners of MapleStory, would have done differently, it would have just been to be more consistent and reward its most loyal and consistent players. I get that Nexon was a company that needed to use MapleStory to survive, but the changes were always extremely drastic and undermined hard work that so many players put in."}, {"type": "sentence", "content": "Whether it was the 4th job that came out, which you could achieve at level 120, that led many high-end Maplers to quit because their damage would be extremely inferior to people that caught up to them, or whether it was the new jobs like Aran, or the Big Bang which made it significantly easier to level up, or whether it was raising the maximum level to 250 instead of 200."}, {"type": "sentence", "content": "Change is good and every company needs to adapt, but when MapleStory changed, it changed drastically in a realigning manner that prioritized new players much more than the players already there. I was one of those players — and I wish that Maple would have given more notice and taken player feedback seriously. Maple still is surviving today for a reason, and I don’t know if without the changes it made, it would have."}, {"type": "sentence", "content": "MapleStory held me afloat for much longer than I could possibly admit — I played days, weeks, and months at a time and the game meant everything to me. If it wasn’t MapleStory, it would have been something else, but the game made me realize the priority of relationships."}, {"type": "sentence", "content": "There were things you had to do in the game that absolutely ​sucked, ​like grinding for days on boars to reach level 30, that were significantly easier with others. When you found a guild, you had people who would give you their items and mesos when they quit, people who would PQ with you, people who died on a ship against the Crimson Balrog with you, and let you know you weren’t alone in your trials and tribulations."}, {"type": "sentence", "content": "MapleStory defined my childhood in more ways than I could possibly imagine. Yes, I probably would have had better grades without MapleStory, and pleased my parents more, but the game was the only source of stability in my life in a time I had none, and for all those things, I will always be a Mapler."}], "topic": "gaming"}