{"title": "Sears, Trump and the Age of Bull", "data": [{"type": "subtitle", "content": "How BS is affecting 21st Century America."}, {"type": "sentence", "content": "If there’s been anything that has been heartbreaking for me to watch over the last few years, it has been the demise of Sears and Kmart. Yes, like a lot of places a lot of other retailers, you could say this is the story of two retailers that did not update with the times. But the story of Sears is in reality, the story of a hedge fund manager who either didn’t know how to run a company or didn’t care. Since 2005 Eddie Lampert has had a role in Sears and he never ran the company well. When Lampert came on the scene in 2005, Sears and Kmart had some 3500 stores. Now Kmart is down to 34 stores. That wasn’t a typo."}, {"type": "sentence", "content": "Lampert’s business style is head-scratching. He has run the company in a ruthless and cold-hearted fashion. For a long time, I’ve thought this was all about the evils of hedge funds and private equity. I still think that has a role, but another thought has come into my mind: what if besides being cold-hearted, he is incredibly incompetent? What if he thinks he is the best businessman there is and can’t see how bad he really is?"}, {"type": "sentence", "content": "In a 2017 interview with the Chicago Sun-Times, he seemed to think that Sears was well ahead of his competitors. “I feel like we’re ahead of J.C. Penney, we’re ahead of Macy’s, we’re ahead of Target, in some aspects of where the world is going.”"}, {"type": "sentence", "content": "Huh? Had he walked into a Target lately?"}, {"type": "sentence", "content": "What you start to learn is that Lampert lives in his own world where he is a genius."}, {"type": "sentence", "content": "So yes, he was a failure and delusional. There are lots of people like that. It’s gets dangerous when people are affected."}, {"type": "sentence", "content": "This leads me to a question that I’ve been noodling about for years: why didn’t anyone stop Lampert? JC Penny hired Ron Johnson to be their CEO in the early teens armed with a new look and strategy. The end result is that the company lost $1 billion. I personally think the company should have given him time, but the fact remains: Johnson failed to turn the company around and he was gone. Of course, the difference is that while Johnson was hired, Lampert owned Sears. The employees and board of Sears were stuck with Lampert and seemed helpless as the horror unfolded."}, {"type": "sentence", "content": "The thing is, Lampert’s actions are familiar. A man that is incompetent and lives in his own world where he is the king? It sounds very familiar because it also happens to be found in Washington, DC. President Donald Trump is in many ways Eddie Lampert, but with nuclear weapons."}, {"type": "sentence", "content": "The thing is, I believe we are seeing Sears happening on a larger scale with the United States. President Trump has been a failure of a president. His most recent failure was not preparing for the coronavirus pandemic. Over and over again, Trump has not made an effort to govern effectively."}, {"type": "sentence", "content": "Like Ron Johnson, past presidents such as Jimmy Carter and Herbert Hoover paid dearly for repeated failures in office. But Donald Trump? He seems to not have paid any price for his incompetence. Why is that? Why has he been able to do well, even when his party is failing?"}, {"type": "sentence", "content": "So why have Lampert and Trump been able to get away with their bad leadership?"}, {"type": "sentence", "content": "I believe it comes down to one word: bullshit."}, {"type": "sentence", "content": "(As a pastor, I feel weird made a swear word the center of an essay. So, I will be spare in my using the whole word.)"}, {"type": "sentence", "content": "Harry Frankfurt wrote the famous essay, On Bullshit in 1986 which later became a book. Bullsh**ting is not the same as lying. As Matthew Yglesias wrote in 2017, the liar wants to be seen as telling the truth. The bs artist, however, doesn’t care if what they say is true or not. Why? Frankfurt explains in 2016 essay for Time:"}, {"type": "sentence", "content": "The end goal for someone who flings bull is to control people, bend reality to his will and signal to certain constituencies that he is on their side."}, {"type": "sentence", "content": "The person who creates bull is trying to create an image of success even though everyone knows the reality is quite different. But they don’t care, because the goal is to make people believe it even when their eyes tell them otherwise. Going back to that 2017 interview, Lampert was good at spinning reality to look like a turnaround for Sears was just around the corner. When asked in that interview if Sears has time, this is how he answers:"}, {"type": "sentence", "content": "He says he needs people to see that things aren’t so bad and then reveals that his goal is to paint a reality that will bring change- or to get people to believe that this reality can come true."}, {"type": "sentence", "content": "Which is maybe why he has been able to hang on as the head of Sears. He was able to convince shareholders, board members and others that a revival was just around the corner. Maybe they wanted to believe that a turnaround was possible and Lampert was able to give them what they wanted."}, {"type": "sentence", "content": "On March 13, President Trump gathered on the White House lawn with executives from a number of corporations. The President stated there would be testing done at several major chains such as Target, Walmart and CVS. I remember sitting in church hearing this press conference and was surprisingly pleased that maybe this President was going to take this crisis seriously."}, {"type": "sentence", "content": "Nope. The President was just flinging bull yet again:"}, {"type": "sentence", "content": "Why would the President just bullshit his way on something so serious as a pandemic? When it comes to the President, most of his followers are aware that a lot of what Trump says isn’t true. They weren’t expecting that there were going to be testing sites tomorrow. That doesn’t matter to them. Trump isn’t the usual politician, but a salesman. Like Lampert, Trump was involved in real estate. He tells people what they really want to hear and even if it doesn’t totally come true it doesn’t matter- what matters is that Trump gives them the reality they desire and he is able to get his way. In the case of the March 13 press conference, he was able to create a reality for himself and his fans where he was doing something about the crisis, even if the reality was far different."}, {"type": "sentence", "content": "But at the end of the day, we must ask ourselves why bullsh**ting is dangerous and how to combat it. Let’s take these one at a time."}, {"type": "sentence", "content": "First BSing is dangerous because it can have adverse effects on people. President Trump is telling people he is taking hydroxychloroquine as a prophylactic against the coronavirus. Most people think he isn’t taking the drug. Trump doesn’t care if hydroxychloroquine works or not. But what it does is sow doubt in the experts and makes the President into something of a genius even though he has no idea how the drug will work and frankly doesn’t care."}, {"type": "sentence", "content": "For a democracy to work, you have to trust others. In fact, you have to trust that some people might know more about an issue than you do and you have to give that person the power to make decisions on your behalf. But if a demagogue comes along and tells people that they shouldn’t listen to Senator so-and-so or Dr. so-and-so about a certain issue or illness and people start to not listen to the expert or the leader. They lose legitimacy and the BS artist is lifted up and ready to do more damaging bullsh*tting about another issue."}, {"type": "sentence", "content": "How do we stop bullshitting? That means calling out the bullshit. People have to be willing to ask questions about the comment. Calling out the BS gives other people permission to ask more and more questions about the BS and that weakens the power of the person shoveling the BS."}, {"type": "sentence", "content": "What would have happened if journalists and politicians were willing to ask Trump hard questions in 2016? Would Lampert have been able to keep wrecking Sears if someone on the board had asked the Chairman the specifics of his vaunted turnaround plan? Who knows, but maybe asking for some proof, some evidence would have caused people to stop, think and hold the bullsh**ter accountable."}, {"type": "sentence", "content": "There is actually an old tale about bullshitting. The Emperor’s new clothes tells the story of two tailors who promise a king that they will make the most dazzling garment for him. Whenever the king came by, they would tell him they were working on a loom that wasn’t really there. But they acted like it was and the king, wanting approval, went along. When the king’s “clothes” were done, he again pretended to see the clothing even though there were not clothes. The tailors are able to get the king to strip naked and put on his new “clothes.” His advisors were also afraid to point out the obvious and they talked about how beautiful it was."}, {"type": "sentence", "content": "The final scene of the tale has the king marching down the street showing of his new ensamble to his subjects. Everyone knew the king was naked. Even the king knew he was naked. But no one says anything, except for one young boy who was too young to know any better. He tells his Mom in a loud voice, “the king has no clothes!”"}, {"type": "sentence", "content": "If we want American society to be healthy, then we need to have more little boys who are willing cut through the BS. We can’t afford having more people who can’t admit the king is walking around in the buff."}], "topic": "leadership"}