{"title": "How to Enjoy Playing Video Games With Your Partner", "data": [{"type": "subtitle", "content": "Helpful tips to make the most of your gaming time together"}, {"type": "sentence", "content": "At this point in the global pandemic, our options are wearing thin. We’re all looking for something new, or at least different, to occupy our hours. For many of us, probably more now than ever, that something is gaming. We want to involve our partners in what we love too, but how best to do it? A few simple questions and a bit of self-examination will have you on your way!"}, {"type": "subtitle", "content": "Which type of game?"}, {"type": "sentence", "content": "There’s two goals here: enjoying gaming together, and not fighting about it. There’s really just two types of games, competitive (fighting each other) and cooperative (fighting everyone else together). Gamers are a passionate lot for the most part, and things can get heated, which isn’t good for anyone."}, {"type": "sentence", "content": "A good friend of mine has been playing games with her husband for years. I asked her what tips she had for couples who wanted to do the same. She knows they are both too competitive to play games against each other, so they only play games where they are on the same team."}, {"type": "sentence", "content": "If this describes you and your partner, you’ll likely want to look for games where you can be in the same party, contributing to a common goal.Some role playing games allow this, with both players working through the story-line together. Sports games are popular as well, allowing both players to be on the same team, enhancing the good vibes you get from working together."}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*Y7lio6xuMtppwsG-"}, {"type": "sentence", "content": "If you’re both good with going head to head, though, there’s nothing to say you shouldn’t. A recent survey even showed that one in three couples felt their relationship benefited from competitive gaming. Mario Kart and Call of Duty were the top two games cited in the survey. You may want to consider limits though, to keep the pot from boiling over. Set a length of time you will play, or a certain number of matches, before you take a break."}, {"type": "subtitle", "content": "Communication is key"}, {"type": "sentence", "content": "Communicating with your partner is always important, no less so when it comes to gaming. No matter what style or genre you choose, talking to your partner increases your success and helps avoid stress. Working to talk out a problem or conquering a hard level is great teamwork for the both of you."}, {"type": "sentence", "content": "My friend tells me that when she plays loot-based games such as Divinity: Original Sin 2 or Borderlands, they discuss who will get what loot. Most games distribute loot on first-come first-served basis, so this pre-planning eliminates the battle to get there first. Working together, not against each other, is the key to success."}, {"type": "sentence", "content": "Another place where communication matters is in picking the game you play together. If your partner hates sports, you’re not going to fire up Madden and ask them to hit you on an out route. If they are new to gaming, you wouldn’t want to subject them to Helldivers, a notoriously difficult trial by error game that could easily be frustrating."}, {"type": "image", "content": "https://miro.medium.com/max/2220/1*TnG7h5_Z1lBCiuNBCOhR3w.jpeg"}, {"type": "subtitle", "content": "It’s OK to watch"}, {"type": "sentence", "content": "Let’s say you can’t convince your partner to play a game with you (or vice versa). Some people just aren’t fans, and accepting that is part of the communication process. There’s still a way to spend time where both sides can be entertained. With the right game, your partner can watch you play and have a great time doing it."}, {"type": "sentence", "content": "You know what your partner likes for movies and TV, now it’s time to apply that standard to pick a game you will both love. If emotional drama is your thing, The Last of Us is a renowned character drama with plenty of thrilling action. If you or your partner love comedy, check out Goat Simulator, where you literally control a goat doing all sorts of tricks; the South Park games are a wonderful ode to the infamous cartoon, assuming you don’t offend easily."}, {"type": "sentence", "content": "Video games with great stories have been in a renaissance for several years. No matter what your interests are, chances are good you can find something worth watching, that you or your partner will love playing. And who knows, you both may discover a new favorite genre or game studio along the way."}, {"type": "sentence", "content": "Stay safe, and long live gaming."}], "topic": "mental-health"}