{"title": "How to Make the Right Decisions in Challenging Times and Avoid Bad Ones", "data": [{"type": "subtitle", "content": "7 decision-making tools that will help you tackle tough calls"}, {"type": "image", "content": "https://miro.medium.com/max/11520/0*5m9rplbeQ7L-qSo2"}, {"type": "sentence", "content": "Do you know how many decisions we make every day?"}, {"type": "sentence", "content": "Researchers at Cornell University estimate we make 226.7 decisions each day on food alone."}, {"type": "sentence", "content": "And as your level of responsibility increases, so does the multitude of choices you have to make. It’s estimated that the average adult makes about 35,000 remotely conscious decisions each day."}, {"type": "sentence", "content": "For example, which TV service do I use and then once it’s hooked up, which channel will I watch? Do I want a regular coffee or a cappuccino? What should I wear to work? Which route do I take to get to work? Do I “like” a friend’s post on Facebook?"}, {"type": "sentence", "content": "You get the idea."}, {"type": "sentence", "content": "Each decision, of course, carries certain consequences with it that are both good and bad."}, {"type": "sentence", "content": "And there are bigger decisions we make every day rather than liking a Facebook post, choosing a TV channel or pouring milk to a coffee."}, {"type": "sentence", "content": "It’s easy to get bogged down with a big decision."}, {"type": "sentence", "content": "But your choices don’t have to be overwhelming."}, {"type": "sentence", "content": "As Michelle Obama said you need to have a strategy, game-winning principles for tough calls."}, {"type": "sentence", "content": "Principles that help you to break things down, find clarity and make confident decisions, regret-free."}, {"type": "subtitle", "content": "1. Eisenhower Matrix: Avoid the Urgency Trap"}, {"type": "image", "content": "https://miro.medium.com/max/998/0*wZ4biTdMiSHzwGZ5.png"}, {"type": "sentence", "content": "If you’re overwhelmed with a long list of different tasks, the Eisenhower Matrix can help you focus on the right things."}, {"type": "sentence", "content": "Everything on your plate can be organized into 4 categories: important and urgent, important but not urgent, not important but urgent, and not important and not urgent."}, {"type": "sentence", "content": "If you go through the process, you’ll probably realize only a handful of tasks are actually both important and urgent. You can immediately prioritize them and create a short term focus list to get done first."}, {"type": "sentence", "content": "Instead of long lists, you can strip them down into a clear set of immediate priorities, quick actions, things to outsource, and eliminate."}, {"type": "sentence", "content": "Be more productive and eliminate time-wasting activities by using the Eisenhower matrix."}, {"type": "subtitle", "content": "2. Regret Minimization: How to Live With Minimal Regret"}, {"type": "image", "content": "https://miro.medium.com/max/1272/0*5WKR6WYeAQs0t__f.jpg"}, {"type": "sentence", "content": "An interesting concept by Jeff Bezos which makes it easier to strip down a big life decision into a simple yes or no question:"}, {"type": "sentence", "content": "If it’s a “yes, I’ll regret this”, don’t do it."}, {"type": "sentence", "content": "If it’s a “no, I won’t regret this”, do it."}, {"type": "sentence", "content": "Jeff Bezos explains the concept with his own words: “I wanted to project myself forward to age 80 and say, ‘Okay, now I’m looking back on my life. I want to have minimized the number of regrets I have,’”"}, {"type": "sentence", "content": "It is virtually impossible to live a life without regret, yes, but if we use the regret minimization framework the next best thing is indeed achievable: living a life with minimal regret."}, {"type": "sentence", "content": "Regret minimization framework forces you to think beyond the moment, past all fears and doubts, and consider your decision among the grand scheme of things."}, {"type": "sentence", "content": "Turns out, fear of regret can be very motivating, especially when you have to make tough decisions. Regret minimization framework forces you to think beyond the moment, past all the fears and doubts that you may have."}, {"type": "sentence", "content": "Research backs him up on at least one major aspect of his big decision — as Bezos suspects, science says that we tend to regret actions not taken far more than we regret failed attempts."}, {"type": "sentence", "content": "If it’s a “yes, I’ll regret this”, don’t do it. If it’s a “no, I won’t regret this”, do it."}, {"type": "sentence", "content": "However, there is also reality. While the regret minimization framework is a useful way of thinking to avoid future regrets, it’s easy to get carried away with this line of thinking."}, {"type": "sentence", "content": "It is wise to ask the following questions to yourself before applying the regret minimization framework to your decisions:"}, {"type": "sentence", "content": "So, while the regret minimization framework can be a nice way to avoid future regret, it’s important to also be realistic. Be brave and be willing to take the risk when the time is right, but make sure the time is right."}, {"type": "subtitle", "content": "3. Circle of Competence: How Warren Buffet Avoids Mistakes"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*W7osvcmWJiCnMp3gLnfaxw.png"}, {"type": "sentence", "content": "A circle of competence is the subject area that matches a person’s skills or expertise. The mental model was developed by Warren Buffett and Charlie Munger."}, {"type": "sentence", "content": "In 1996, Warren Buffet gave the following advice to his investors in the 1996 Shareholder Letter:"}, {"type": "sentence", "content": "Every time you’re making a decision, ask yourself this question:"}, {"type": "sentence", "content": "The circle of competence is simple. Each of us, through experience or study, has built up useful knowledge on certain areas of the world. Some areas are understood by most of us, while some areas require a lot more specialty to evaluate."}, {"type": "sentence", "content": "Buffett’s strategy to avoid problems is fairly simple. It’s a two-step process: Firstly, know your circle of competence, especially its boundaries, and secondly, stick within it."}, {"type": "sentence", "content": "Understanding your circle of competence helps you avoid problems, identify opportunities for improvement, and learn from others."}, {"type": "sentence", "content": "If you want to improve your probability of success in life and business, then define the perimeter of your circle of competence, and operate inside. Over time, work to expand that circle but never fool yourself about where it stands today, and never be afraid to say “I don’t know.”"}, {"type": "subtitle", "content": "4. Fear Setting: How to Conquer Your Fears and Take Action"}, {"type": "image", "content": "https://miro.medium.com/max/1346/0*UqOOGKbmVGsAGmtq"}, {"type": "sentence", "content": "How many times has the fear of what might happen prevented you from taking action on something you wanted to do?"}, {"type": "sentence", "content": "Maybe you wanted to ask for a raise, ask someone out, or quit your job to start a company…"}, {"type": "sentence", "content": "In his Ted Talk, Tim Ferriss explains “fear setting” — how to handle life’s difficult choices, and the results from either taking action or not taking action by defining the fears you have."}, {"type": "sentence", "content": "If you’re nervous about things going bad, it’s often helpful to define exactly what the worst-case scenario would look like."}, {"type": "sentence", "content": "If you can attach clear parameters to that worst case, you’ll probably find that it’s a lot easier to deal with."}, {"type": "sentence", "content": "Fear is uncomfortable, so the initial reaction is to avoid it. But by looking at it more closely, you gain a clearer understanding of your thoughts."}, {"type": "sentence", "content": "Fear tends to warp your thinking, causing you to…"}, {"type": "sentence", "content": "Use “fear setting” to clarify your thinking and take action in the face of fear."}, {"type": "sentence", "content": "Use fear setting:"}, {"type": "image", "content": "https://miro.medium.com/max/1600/0*tqdUgfDOsJBspT8S"}, {"type": "sentence", "content": "Take a piece of paper and make three columns: define, prevent, repair."}, {"type": "sentence", "content": "In column one, define everything you fear about the idea of taking action."}, {"type": "sentence", "content": "In column two, list ways you could reduce the likelihood of each of the worst-case scenarios from happening."}, {"type": "sentence", "content": "In column three, list ways you could repair the damage if this situation were to come true."}, {"type": "sentence", "content": "Assess the impact of these worst-case scenarios on a scale of 1–10."}, {"type": "sentence", "content": "By applying this exercise to your decision-making process, you’ll likely see that things aren’t as bad as they seemed."}, {"type": "sentence", "content": "Instead of vague fears, you’ll be able to consider specific numbers. Then you can make a rational decision about whether you can handle the risk or not."}, {"type": "subtitle", "content": "5. The Decision-Making Matrix"}, {"type": "image", "content": "https://miro.medium.com/max/3788/1*WwssNk2dPbFmrUQYyi03uQ.png"}, {"type": "sentence", "content": "This can be a quick, structured thought process for someone making a decision alone."}, {"type": "sentence", "content": "This chart might look like a generic pro/con list, but the real magic happens when you put it to work."}, {"type": "sentence", "content": "You can use a criteria-based matrix to more effectively evaluate a list of ideas/decisions to extract the most qualified pieces to meet your goals."}, {"type": "sentence", "content": "This decision-making template is useful for prioritizing and weeding out inferior alternative options."}, {"type": "sentence", "content": "You can also customize it with criteria that are suitable for your particular situation."}, {"type": "subtitle", "content": "How to Use Content Decision-Making Matrix"}, {"type": "sentence", "content": "Next time when you’re faced with a mental quagmire, pull out your decision grid, and start calculating."}, {"type": "sentence", "content": "With careful consideration and basic math skills, you can find the clarity and confidence you need to move forward on decisions big and small."}, {"type": "subtitle", "content": "6. Inversion: Working Backwards to Solve the Problem"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*LTceCI18NgpOFT3njilfEw.png"}, {"type": "sentence", "content": "As Charlie Munger said:"}, {"type": "sentence", "content": "Sometimes the best way to get clarity on something is to look at its opposite — then work backward to avoid it."}, {"type": "sentence", "content": "In other words, instead of only thinking forward about what you need to do to get what you want, you’d flip it in reverse and think backward about what you don’t want to happen."}, {"type": "sentence", "content": "Because if you think about it, the usual process of getting to the right idea, is by eliminating a lot of bad ideas. This philosophy is also called Via Negativa. It refers to what is not, rather than what is. And that is what Inversion is all about."}, {"type": "sentence", "content": "For example, if you’re thinking, “I want to write a successful article……”, you’ve got an endless jumble of scenarios that could look like a successful article."}, {"type": "sentence", "content": "Instead of thinking about what I need to write a good article, focus on avoiding mistakes in writing a bad article."}, {"type": "sentence", "content": "Inverting a problem won’t necessarily solve it, but it will help you see it in a different light. Sometimes that’s all you need to solve it."}, {"type": "sentence", "content": "But, spending time thinking about the opposite of what you want doesn’t come naturally to most people. And yet, this is the work you have to do to improve your thinking and decision-making skills."}, {"type": "subtitle", "content": "7. The Scientific Method"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*RhrTuUBGy7U8KCkRBDYspA.png"}, {"type": "sentence", "content": "Many people are unintentionally emotional about their decisions, especially the important ones."}, {"type": "sentence", "content": "If that sounds familiar, you can use the scientific method to create rational, evidence-based decisions."}, {"type": "sentence", "content": "It’s pretty simple. Just turn your decision into a question, form a “best guess” conclusion, then test that conclusion with more data and external input."}, {"type": "sentence", "content": "If the process can’t “break” your conclusion, then it’s probably right. You can move forward knowing that you tested the idea properly."}, {"type": "sentence", "content": "If the process does “break” your conclusion, then you should either pass on the decision or form an adjusted conclusion to test again."}, {"type": "sentence", "content": "Do this testing process until your hypothesis isn’t broken!"}, {"type": "sentence", "content": "These are but a few of the many decision making concepts and frameworks you can use to tackle tough calls. I love to use these frameworks when I’m on the edge of a big decision. You can also use them on your own, to find a better outcome for yourself."}, {"type": "sentence", "content": "If you’re trying to switch from an analytical mindset to creative thinking, here is a “7 Creative Exercises to Unlock Your Inventive Thinking”. I have compiled a list of exercises that I’ve found helpful and that I think you will benefit from:"}], "topic": "productivity"}