{"title": "10 eye-catching logo animations you’ll wish you made", "data": [{"type": "subtitle", "content": "Logo Design"}, {"type": "subtitle", "content": "Showcase your brand in a way you never thought possible."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*6KpMu3AsphxUm_Jugziwyw.gif"}, {"type": "sentence", "content": "Have you ever watched paint dry? No? I didn’t think so. How about watched a turtle crossing the road? Probably not. Maybe spent an hour standing in line at the post office? Well that’s pretty likely. But isn’t it so boring?"}, {"type": "sentence", "content": "Without movement, things lose their buzz. Motion is exciting. It often tells a story that text or static images could not do alone. That’s why animated logos have taken a rise in the last few years."}, {"type": "subtitle", "content": "Why animate a logo"}, {"type": "sentence", "content": "Our eyes gravitate to things that move. Large corporations like Google have invested time and money in giving their logo a life of its own. Google’s Daily Doodles are displayed on their homepage. It separates the top search engine from others and only deepens their brand value to the communities it serves."}, {"type": "image", "content": "https://miro.medium.com/max/2000/1*WSpyQoSprbSuoAu5V7YmQw.gif"}, {"type": "sentence", "content": "The animations don’t drive sales, improve traffic, or guarantee customers. However, the consistency and quality of the Daily Doodles change how we think of Google. They humanize the company."}, {"type": "sentence", "content": "The investment is not for short term profits, but to increase brand longevity. The benefits of an animated logo go deeper than money:"}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*e7satdDlZhwK6FaNbzEG6Q.jpeg"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*mF5JwS7GDaARZmc6iUETJg.gif"}, {"type": "sentence", "content": "You do not need to be a billion-dollar company to transform your logo into something exciting. Animations look great on any logo! Here are some to inspire you:"}, {"type": "subtitle", "content": "1.) Goodhabitz by Wevoke"}, {"type": "sentence", "content": "Doesn’t it just look amazing when a logo’s proportions are all in check? Each letter extends perfectly to its cap line and falls on the baseline just as well. The structure of a design will either make or break an animation. Now that’s a good habit to never break."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*V694Qxs6C8rMZk45km-fxw.gif"}, {"type": "subtitle", "content": "2.) Billiards by Mate Miminoshvili"}, {"type": "sentence", "content": "A direct shot into the corner pocket! This animation by Mate Miminoshvili is playful and physics induced. The transformations of the B and the dot over the first “i” into the white ball was nothing short of spectacular."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*oi1pMTe2UXCo-pOd8OyBhQ.gif"}, {"type": "subtitle", "content": "3.) Gotikket by Tubik"}, {"type": "sentence", "content": "Some logo animations just make you feel happy inside. Maybe it’s the smile, but I love this little face! Gotikket is an easy-to-use service helping travelers stay covered as they get to their destinations."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*u0YCdeOCEKjOfboJSphNTg.gif"}, {"type": "subtitle", "content": "4.) Pivotal Logo by Pivotal"}, {"type": "sentence", "content": "Now this is how you make a splash with your debut logo. Did you catch the fading debris at the end?"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*-PgasC7eK0RXTrPIRwofMQ.gif"}, {"type": "subtitle", "content": "5.) FourPlus Studio Logo Animation by FourPlus Studios"}, {"type": "sentence", "content": "The almighty infinite loop. I could just stare at it for days. This is a very smooth animation. Do you guys notice the pull and shadow around each curve? The attention to detail delivers this one flawlessly."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*qDCME2O7XA5TfXDGzSAcsg.gif"}, {"type": "subtitle", "content": "6.) A.I. Logo & Animation by Brien Hopkins"}, {"type": "sentence", "content": "Usually you don’t want a logo up for interpretation. Keeping it simple and straightforward eliminates confusion, but this one… this is just fun. What do you see? A cube? A fingerprint? A maze?"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*uWWUhIch94WgZBPmrcu6eQ.gif"}, {"type": "subtitle", "content": "7.) 368 Broadway Av. Casey Neistat Concept Logo by Julien"}, {"type": "sentence", "content": "Wait until the end. Nothing fancy or explosive. Just some good old fashion squares and numbers. Sometimes that’s all it takes."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*7f_TapuyfIDvpHd1u37H7Q.gif"}, {"type": "subtitle", "content": "8.) Ebay by Cyrill Durigon"}, {"type": "sentence", "content": "Cyrill brings us into the future with this one and expands the well-known eBay color scheme into a palette fit for an eCommerce giant."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*gPXLDbrfvuA_7ySFCCcS8w.gif"}, {"type": "subtitle", "content": "9.) Mustard Media Logo by James David Horton"}, {"type": "sentence", "content": "Isn’t it amazing the things a designer can conjure up with one shape? Very reminiscent of the TARS robot from Interstellar. If you haven’t seen the movie, do yourself a favor. Grab a box of tissues and then go see it."}, {"type": "subtitle", "content": "10.) ThreeStars by Pavel Pavlov"}, {"type": "sentence", "content": "I love that we get a bit of the process on this one. Notice that the finished design is not a blatant visual representation of the brand name. Instead the abstract shape provides a unique identity and moves away from the obvious."}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*-1ByntD-iZMDGo3JY_CDuQ.gif"}, {"type": "sentence", "content": "A logo animation depends on factors like the product or service, nature of the brand, and so on. Crafting a logo is a job for a skilled graphic designer. An animator or a motion graphics expert takes that skillset to the next level."}, {"type": "sentence", "content": "Sure an animated logo looks fancy but it leaves an impression in a person’s mind. Anything that sets your business apart is something to look in to. Hopefully these inspired you to give your designs some new energy."}, {"type": "sentence", "content": "If I had to pick my top 3, it would be tough but numbers 9, 7, and 6 in that order were my favorites. What about you? Let me know in the comments."}], "topic": "design"}