{"title": "My Mother Has Dementia — Why Do We Not Have a Cure?", "data": [{"type": "subtitle", "content": "DEMENTIA"}, {"type": "subtitle", "content": "If we tackled degenerative brain disease the same way we fight a new virus a cure would be here by now"}, {"type": "image", "content": "https://miro.medium.com/max/9856/0*I0Fivi388wz2f6NF"}, {"type": "sentence", "content": "My mother was our rock. She was the glue that kept our family unified. She was strict, kind, stubborn, generous, resilient, loving, but most of all determined — she had determination beyond belief."}, {"type": "sentence", "content": "During the 90s I was a competitive swimmer. When I was16 years old I just failed to break the Irish national junior record in the 200m Butterfly at a national meet, by just over a second. My coach wouldn’t accept it. He called my ‘Mam’ days later with an opportunity:"}, {"type": "sentence", "content": "At the time Ireland was recovering from a prolonged recession, a generation of ‘promise’ was lost through emigration during the previous decade, the 80s."}, {"type": "sentence", "content": "My father was unemployed when the call came from my coach, Kevin Williamson, an ex-Olympian."}, {"type": "sentence", "content": "The cost to travel to the UK, just 4 weeks later, was a stretch too far for my parents. There were bills to pay and food to put on the table."}, {"type": "sentence", "content": "My ‘Mam’ did what she always did. She was incredibly resourceful when the odds were stacked against her. Unbeknownst to me, my very proud ‘Mam’ hit the streets while I was at school, asking (begging) for sponsorship."}, {"type": "sentence", "content": "A week before the Sheffield World Cup kicked off my ‘Mam’ had raised enough sponsorship to fund my trip."}, {"type": "sentence", "content": "I didn’t appreciate it as much at the time, but writing this I’m in awe of her determination, her resilience. Her ability to make something happen for one of her children that a month earlier was near impossible."}, {"type": "image", "content": "https://miro.medium.com/max/2494/1*VQ7eKTd1Lm4DMxF9SiZ89A.png"}, {"type": "sentence", "content": "That week in Sheffield, at 16 years old, I broke the decade-old national junior record in the 200m Butterfly, thanks to my mothers’ unwavering determination and incredible resilience."}, {"type": "sentence", "content": "She was instrumental in my swimming career."}, {"type": "sentence", "content": "Today my ‘Mam’ has dementia."}, {"type": "subtitle", "content": "Brain Disease"}, {"type": "sentence", "content": "Can our generation develop a cure or an effective treatment for dementia? This is a long-standing challenge for researchers."}, {"type": "sentence", "content": "Dementia treatment addresses the symptoms, not the cause itself. Cause and effect— the cause we got, the effect was overlooked for years."}, {"type": "sentence", "content": "Also, treatment doesn’t have much effect on how the disease progresses. That is to manage the condition and delay the onset through early diagnosis."}, {"type": "sentence", "content": "The global impact could be significant — reducing healthcare costs for millions worldwide."}, {"type": "sentence", "content": "Dementia is a gradual affliction. A degenerative brain disease with little or no symptoms initially. So early diagnosis is a challenge. Clinicians use a range of tools like memory tests, medical history, blood samples, and as a last resort, an MRI scan."}, {"type": "sentence", "content": "It’s estimated that about 20% of cases are misdiagnosed, yet, worryingly, dementia diagnosis has increased in recent years. It is asymptomatic to begin, a silent pandemic."}, {"type": "sentence", "content": "The only way to validate dementia is to do so medically, by analyzing brain tissue samples through a microscope, posthumously."}, {"type": "subtitle", "content": "Hope"}, {"type": "sentence", "content": "Research indicates that brain signal dysfunction occurs prior to structural damage. This is where opportunity resides and where MEG technology can play a role."}, {"type": "sentence", "content": "So what is MEG?"}, {"type": "image", "content": "https://miro.medium.com/max/8064/0*H47ueQEOEo7eYPea"}, {"type": "sentence", "content": "It's a neuroimaging technique that maps brain activity using highly sensitive magnetometers called “superconducting quantum unit interference devices” or SQUIDs."}, {"type": "sentence", "content": "Did I mention that these magnetic fields are tiny? To put it into context, they’re about a trillion times smaller compared to a standard magnet. The good news is that SQUIDs can measure these signals emitted."}, {"type": "sentence", "content": "In practice, a MEG machine has a few hundred SQUID sensors mounted on a head-piece. The number of sensors enhances spatial resolution, improving better source localization in brain signals when conducted in a shielded room that dampens interference."}, {"type": "sentence", "content": "This means that we can visualize the brain on a deeper level, exploring sequential events for every decision or movement we make."}, {"type": "sentence", "content": "From my limited research, I now understand that MEG technology is gaining traction in dementia research."}, {"type": "sentence", "content": "Thus far, tiny signals can indicate lower activation and response delay in regions of the brain. The benefit is that this can accelerate diagnosis i.e. distinguishing between healthy brain matter versus individuals with neural-impairment — signs of dementia."}, {"type": "image", "content": "https://miro.medium.com/max/1230/1*YctD-RInfv8stoER3-DGcg.png"}, {"type": "sentence", "content": "It also has the potential to differentiate between the sub-types of dementia-like ‘Louis body dementia’ or ‘Vascular dementia’."}, {"type": "sentence", "content": "Computational models form longitudinal research means that scientists should be able to predict when and what parts of the brain are at risk of structural deformation. Damage associated with dementia."}, {"type": "sentence", "content": "This will further refine traits and symptoms to identify those at risk of developing dementia during their lifetime."}, {"type": "sentence", "content": "MEG will also enable early disease management. This will improve the quality of life of individuals and families living with the disease."}, {"type": "sentence", "content": "MEG has been around for a while, since the late 60s. In its infancy, sensitivity was low, but technology advancements have improved efficiency to capture patient mapping."}, {"type": "sentence", "content": "In fact, some practitioners are even using MEG to diagnose epilepsy. The aim is to locate the epileptic regions of the brain in order to understand it better to improve treatment or better, find a cure."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "Compared to other methods, MEG doesn’t use radioactive dyes or magnetic fields (X-rays). It’s non-invasive. It’s safer, hence the reason why it’s used to study fetal cognitive development with expecting mothers."}, {"type": "sentence", "content": "The prospect that advanced imaging technology might allow us to better understand brain networks is amazing. That said, the world only has a limited amount of MEG scanners, about one hundred. They’re expensive too, “about $2 million” each and most are used for research purposes."}, {"type": "subtitle", "content": "Famous people"}, {"type": "sentence", "content": "Dementia knows no age, race, or profession. Many well-known people have been afflicted by the disease:"}, {"type": "sentence", "content": "MEG should be an integral part of diagnostic protocols. If we can spend billions on a virus at the drop of a hat then why not life-longevity."}, {"type": "sentence", "content": "I’m no expert like Shin Jie Yong or Brian Pennie (Neuro Scientist and writer), but their work and that of others will hopefully discover new insights that may lead to a cure in our lifetime."}, {"type": "image", "content": "https://miro.medium.com/max/4608/0*IiFSE28p8DTjo5JX"}], "topic": "neuroscience"}