{"title": "How Traveling Empowers Me Like Nothing Else Did", "data": [{"type": "subtitle", "content": "Yes, I am claiming that vacation can break the glass ceiling."}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*LK684F1jlSK8m4pR"}, {"type": "sentence", "content": "Traveling empowers women."}, {"type": "sentence", "content": "There, I said it. Is it confusing? They’re not two topics that people would normally equate, and it’s not like women are the only people traveling out there. It’s not as though leaving an oppressed life to go trot the globe has resulted in mind-blowing power surges among women everywhere. I didn’t board a plane one day and come back saying, “I’m not going to let people push me around anymore.”"}, {"type": "sentence", "content": "But it was something else — a little sprout of confidence, a boldness that bloomed within me from years of my avid jet-setting lifestyle."}, {"type": "sentence", "content": "I’m going to go ahead and drop a quick disclaimer that traveling is by no means a requirement to feel more assertive and empowered, and if you don’t have the means or time to travel, you’re not missing a rite of passage on the way to boss lady mode. These explanations are also not exclusive to women."}, {"type": "sentence", "content": "But I know that I, along with countless other women, have a near obsessive passion with traveling, and I want to share why the feelings and experiences taken away from these trips makes traveling so much more than just vacation."}, {"type": "sentence", "content": "Let me tell you why traveling’s been empowering for me, as a young woman about to go into the working world."}, {"type": "subtitle", "content": "1. Travel expands and diversifies your perspective from just your life to that of a world and cultural scale."}, {"type": "sentence", "content": "This is absolutely incredible. It is both empowering and humbling simultaneously, because you gain so much knowledge and perspective all at once, but also realize just how small you are — one cog in the giant, constantly turning machine of the globe. There’s 7 billion of us on this planet, and to only confine your mind to your little town or state or even country is doing yourself a disservice."}, {"type": "sentence", "content": "Bringing new perspectives to the table is invaluable. I’ve seen people complain time and time again about “forced diversity” and things like, “They’re only hiring [person] because they’re a minority.”"}, {"type": "sentence", "content": "You know why diversity’s such a “craze” these days? It’s because it’s been proven time and time again that diversity makes for better, more well-rounded, and more creative teams. And the main playing factor in diversity is the different experiences and perspectives that the people partaking in the idea generation have or have had. When you travel, you’re absorbing culture and perspectives from the world over, and you have the opportunity to bring that back to your table — whether it’s an office workplace or even just a conversation with your friends."}, {"type": "sentence", "content": "And let’s not even talk about how traveling is an antidote to ignorance. When I say this, I don’t mean hopping on an air-conditioned tour bus where an English-speaking guide drops the names of famous landmarks whizzing by — I mean getting into a country, walking the roads, and experiencing the culture."}, {"type": "sentence", "content": "Much of racism and ignorance stems from simply not understanding how other cultures behave and ignoring how that behavior has influenced and is important to the people in that culture. By traveling, you uproot yourself and land in a totally different context where you often are the extreme minority. You’ll be forced to become accustomed to how that culture lives, and in doing so, you educate yourself and become appreciative of the way another group lives. As Mark Manson wrote in his book The Subtle Art of Not Giving a F**k,"}, {"type": "sentence", "content": "Boom. And just like that, ignorance dissolves under the sun of experience and understanding."}, {"type": "subtitle", "content": "2. Travel forces you to be more independent, self-sufficient, and courageous."}, {"type": "sentence", "content": "This one, up front, seems like kind of a no-brainer. Whether or not you’re a rabid trip planner like me or more of the wandering, wherever-the-wind-takes-me type, you need some level of forethought when traveling."}, {"type": "sentence", "content": "You have to take into account factors when picking a location, travel dates and times, your itinerary, balancing finances, and especially have backup plans for unexpected circumstances, because I can guarantee that they will happen — and often. No one’s holding your hand when you’re navigating an Icelandic mountainside or exploring the mazelike cities of Italy (which, yes, I have gotten hopelessly lost in). You have to solve the problems, and you know that no one is going to solve them for you. The independence boost you get from traveling is just plain insane. In fact, 73% of women feel travel has made them stronger."}, {"type": "sentence", "content": "Also, did I mention the overall improvement in courage and not caring about what people think? When you’re traveling and you’re totally lost, sometimes you have to shelve your fear or pride and just ask people or locals for help."}, {"type": "sentence", "content": "Back in high school, I was one of those people who would rather suffer in silence than ask someone a question that I thought might be dumb, simply because I was afraid of being judged or laughed at. Nowadays, my go-to is often just to ask a quick question, even if it seems silly."}, {"type": "sentence", "content": "People that you meet when traveling are often so kind to a degree that you certainly wouldn’t expect from strangers, and that will encourage you to continue making ventures and asking for help when you feel like you need it, without regard to judgment that doesn’t matter anyway. Like, you’re almost guaranteed to never meet these random locals again in your lifetime. So what if they think you’re a stupid tourist or that you suck at speaking the local language? It doesn’t have an impact on your life, so start focusing on what matters. Once you realize that you can brush off the fear of being judged, you can’t help but feel a little more confident walking down the street. I know I sure do."}, {"type": "sentence", "content": "Women make 80% of travel decisions, whether or not they’re traveling with other men. This puts us in an environment where we can get more comfortable and, dare I say, be more socially acceptable at calling the shots."}, {"type": "sentence", "content": "In the office, if I had a dollar for every time I purposefully avoided sitting at the table or making a bold comment, I would probably have enough money to fund my next trip now. And I know I’m not alone — unfortunately, this meekness is something that’s been drilled into us women, and is now often self-imposed on top of societally reinforced. That’s why traveling is such a freeing opportunity — you have to make the decisions, and often you’ll find that when you do make a call, the people you’re traveling with will generally go with it. For me, this really helped me build confidence in the power and validity of my opinions and ideas. And bringing that confidence back to the classroom, office, project group, or wherever you are is, for once, as easy as it sounds."}, {"type": "subtitle", "content": "3. Travel challenges you to deal with your regular life from a new perspective and stops you from being complacent."}, {"type": "sentence", "content": "Alright, so you took a couple trips, you got to experience amazing places and meet incredible new people, armed with new cultural know-how. Maybe you’ve been making your way across Iceland for a couple weeks, cell signal-less and relying mostly on word of mouth. Maybe you’ve been in Costa Rica, where the people are uber-nice but you have no idea what tico Spanish is and have been directing the taxi drivers exclusively with hand gestures."}, {"type": "sentence", "content": "And then you come back to your day job. And you’re sitting there in the familiar high-rise building with a swivel chair and the same annoying coworker in the adjacent cubicle who’s been there for the past six months. How did it come back to this?"}, {"type": "sentence", "content": "If you’d never gone anywhere, you wouldn’t have been able to compare this lifestyle to the kind that you had when you were abroad. You could’ve stagnated for years — running the rat race, cycling through the same routine every day, shutting down your voice at the table out of fear, avoiding confrontation."}, {"type": "sentence", "content": "But because of the traveling experience, you have something to judge your lifestyle against, and it’s up to you to decide what will be the status quo. It’s hard to feel intimidated at an office meeting when you once had to figure out how to get to a town 3 miles away with just a bike, no GPS, no phone battery, and no knowledge of the country’s language, all while in the dark. (And yes, this happened before, throwback to Berlin.)"}, {"type": "sentence", "content": "86% of women say they are not afraid to travel, regardless of what is happening in the world today. So how come we aren’t afraid to get on a plane to a foreign country where we don’t know a single person, but we struggle to speak up in our workplaces and everyday social lives with the people that we see and interact with every day?"}, {"type": "sentence", "content": "I’m not saying that women aren’t strong until they travel. I think we all know that women are incredibly strong — there have just been so many barriers, both inwardly instilled and socially expressed, that it can be crazy difficult to break out of those restraints. But travel allows for a space where women can nurture that strength, explore it in ways that often feel impossible in the stifling nature of the workplace, and realize how to bring it back to the table. And once you do bring it back to the office, you start to notice the contrast between the woman you were before and the woman you have come back as."}, {"type": "sentence", "content": "Now that we know that traveling forces you to realize that you indeed are strong, that busts down another huge barrier that I myself and a massive number of women have also faced for years. That’s right — I’m talking about imposter syndrome."}, {"type": "sentence", "content": "Imposter syndrome is exactly what it sounds like. You feel like an imposter — you feel as though you’re somehow tricking everyone into believing that you’re talented and hard-working and valuable, because your accomplishments must have been done by someone else, right?"}, {"type": "sentence", "content": "Travel takes that imposter syndrome and beats it right up. As we already mentioned in the previous point, no one is there to take credit for your accomplishments from traveling, even if you wanted them to. There is no one else who’s a viable candidate for making your itinerary or researching your flight or going to the places that you went — you are the only one who has had that unique experience, so there’s no one to be an imposter of. You have undeniable proof that you are the one who went and did all of those things."}, {"type": "sentence", "content": "It’s a totally different feel from, say, a project or sprint at work, where everyone has chipped in to finish the project and therefore you could potentially feel as though someone else deserves all the credit for your work. Like, did everyone chip in to somehow make a human to go visit the Yucatan? I don’t think so."}, {"type": "sentence", "content": "I cannot claim that traveling will make imposter syndrome disappear overnight. But I can proudly say that through traveling, and through the experiences that I know are my own and I take all the credit for, I’m slowly starting to fight off that imposter feeling."}, {"type": "sentence", "content": "One last thing to leave you with before you hit the keyboard regarding my hot take."}, {"type": "sentence", "content": "Even if you come back to your “regular life” after traveling, a little bit of that magic and memory will linger with you. You’ll be filled with inspiration because you’ve already seen so many different, incredible things, and that’s totally to be expected — 69% of women draw inspiration from travel. Whether that’s creative passion, lifestyle inspiration, or joining the wanderlust crew, it all stems from being inspired from the time you had on your travels. There’s a reason why people say they’ve been “bitten by the travel bug” — once you join, it’s hard to stop! You start feeling the incessant itch of wanderlust because you know what it’s like."}, {"type": "sentence", "content": "Don’t be complacent in your life. You’ll bring back so many gifts, so many skills, that come from traveling. You educate yourself. You learn how to be courageous. Heck, you’re even forced to confront the fact that you are courageous and that you’ve changed!"}, {"type": "sentence", "content": "I know what I’m trying to share is an unconventional method that I happened to explore and was fortunate enough to benefit infinitely from. I know that so many women want to feel more confident, if only they knew how. The path to feeling more assertive and confident is a massive mountain that is daunting to climb. In comparison to an abstract goal like that, taking a vacation sounds super easy. I thought this could be an alternate way for women to comfortably explore and develop their own strengths and come back from these wonderful travel experiences so much stronger than before."}, {"type": "sentence", "content": "Traveling has been empowering for me. And I seriously believe that it can be for you, too."}], "topic": "travel"}