{"title": "4 Stages of Meditation Everyone Who Meditates Should Know", "data": [{"type": "subtitle", "content": "And everything you need to overcome their major roadblocks"}, {"type": "sentence", "content": "There’s a famous parable in Tibetan Buddhism that describes a young meditator’s journey on the Path of Samatha, or the Path of Tranquility."}, {"type": "sentence", "content": "The parable is based around a trio of characters as they make their way up a mountain: a meditator, an elephant that represents the mind, and a monkey that represents distraction."}, {"type": "sentence", "content": "In the beginning, the monkey is well and truly running the show. It’s leading the elephant all over the shop and into all sorts of trouble, while the elephant leaves huge footprints and a tonne of destruction in its wake."}, {"type": "sentence", "content": "As the meditator progresses up the path and uses such tools as a rope, which represents mindfulness, and fire, which represents effort, gradually the elephant and monkey begin to slow down and respond to their efforts."}, {"type": "sentence", "content": "As the path winds on, the monkey gradually gets fed up and bows out of the journey altogether, while the elephant becomes more obedient. At one point, a random rabbit representing dullness and drowsiness pops up, but with patience and persistence, it soon hops away. Eventually, even tools such as the fire of effort and even the rope of mindfulness are put aside."}, {"type": "sentence", "content": "After reaching the crest of the mountain and taking a little nap together in a cave, the journey concludes, or more like begins (samatha is considered one quality of an awakened mind, the other being vipassana or insight), with the meditator sitting calmly on top of the elephant’s back, holding a sword (the sword of Wisdom, of course), and with a rainbow streaming out of their heart, representing perfect equanimity (why not)."}, {"type": "sentence", "content": "In paintings of the parable, you’ll also see the animals are colored black and gradually turn white. This represents the overcoming of certain psychological obstacles while on the path, and is also key to knowing what stage you’re at and what you should be working on."}, {"type": "sentence", "content": "I love this tool/parable/system as it is an incredibly valuable way of explaining the typical meditator’s journey, right through from complete beginner to master elephant whisperer."}, {"type": "sentence", "content": "I first came across it in John Yate’s book, The Mind Illuminated, in which he maps out the entire path by dividing it into ten stages. I’ve since found it to be the most accessible and yet comprehensive overview of meditation around."}, {"type": "sentence", "content": "Before I found it, I spent many years chasing the elephant and the monkey around in circles, trying to physically wrestle them both to the ground, tiring myself out, and generally losing my way and ending up sleeping in the bushes."}, {"type": "sentence", "content": "Today, I wouldn’t say I’m riding the elephant bareback like a boss. But we’re definitely good buddies. Even the monkey and rabbit still make frequent appearances, but I know exactly what to do with them when they do."}, {"type": "sentence", "content": "For anyone that’s just getting started on the meditative path or are well on their way, I’ve put together an overview of the first four stages, including their major obstacles and how to overcome them. For me, this is where it’s all at—it’s where you go from being an average Joe to a skilled meditator."}, {"type": "sentence", "content": "Once you’re a skilled meditator, flying elephants and the rainbow-filled sky are the proverbial limit. Best of all, if you stick at it, it’s possible to progress through all ten stages and be flying free in a matter of months."}, {"type": "subtitle", "content": "Stage One: Establishing a Meditation Practice"}, {"type": "sentence", "content": "Stage one seems like the simplest of all stages. All you have to do is get on the damn path and start giving chase to the wild and unruly animals."}, {"type": "sentence", "content": "But establishing a daily practice, where you meditate at a regular time every day to the best of your ability, is where most people fall down."}, {"type": "sentence", "content": "To really master this stage, you need two things: consistency and diligence."}, {"type": "sentence", "content": "The default approach to beginning to meditate is brute force or relying on external support or reinforcement. Such approaches may work for a time, but they eventually fail. And when they do, you can end up beating yourself up and confirming your suspicious that you’re not disciplined enough or cut out for meditation."}, {"type": "sentence", "content": "The way to consistency and diligence in your practice isn’t by whipping yourself or rewarding yourself after every session with a double choc fudge brownie. It’s by having strong and clear intentions."}, {"type": "sentence", "content": "When you have strong and clear intentions, action follows. In fact, as John Yates points out, pretty much anything we ever do—from learning to catch a ball to enjoying a movie to sustaining your attention on the breath—originates from your intentions."}, {"type": "sentence", "content": "Yates also says he doesn’t know anyone who’s established a meditation practice in their spare time. The fact is, you need a powerful and tangible enough reason to make the time and to sit down and persist through the initial resistance. Then, soon enough, the benefits speak for themselves."}, {"type": "sentence", "content": "The above rule is at the heart of how meditation works. But before we get into that, a good way to support your initial intention to meditate is to create the conditions to make it as easy as possible. Two ways you can do this are:"}, {"type": "sentence", "content": "Then, use the meditation journal to capture your intentions. Take one of the first pages and write at least a paragraph answering the following questions:"}, {"type": "sentence", "content": "Why do you want to meditate? What would you like to get out of meditation?"}, {"type": "sentence", "content": "The answers shouldn’t be grand and abstract things like “I want to find inner peace” or “to attain self-mastery”. The more detailed and relevant to you, the better. But it’s not so important what they are—they’ll change over time."}, {"type": "sentence", "content": "What’s important is to find what motivates you right now. Whether that’s to be more productive at work so you can save for your own apartment because you hate your neighborhood or roommates, or because that girl you like thinks mediation is cool and you want to impress her, it doesn’t matter."}, {"type": "sentence", "content": "Any intention that gets you to take the time to sit down and meditate, and that you can remember and come back to for motivation, is a good intention."}, {"type": "sentence", "content": "Once you’ve actually got your butt on the cushion, there are a few preliminary practices John Yates recommends to get started. The main one is the six-point preparation in which you review areas such as your motivations, posture, diligence, and expectations. I’ve written about the six-point preparation here."}, {"type": "sentence", "content": "Stage One Goal: To set clear and strong intentions and to develop a daily meditation practice."}, {"type": "subtitle", "content": "Stage Two: Interrupted Attention & Overcoming Mind-wandering"}, {"type": "sentence", "content": "Stage two marks the time when you’re well and truly on the path—you’re sitting down to meditate every day—but the mind and monkey are still pretty much running the show."}, {"type": "sentence", "content": "No dur. You’re trying to get your mind to do something incredibly unusual: nothing. So it’s also very likely it seems like the elephant and monkey have ramped things up a notch. In other words, as you’re becoming more physically still and aware of your internal landscape, you’re noticing just how damn freaking insane they are."}, {"type": "sentence", "content": "All this means it’s also the time you’ve probably realized or are realizing that willpower isn’t what’s going to help you get them under control. More like the opposite: the more you try resolve internal conflict by forcing the mind to comply, the more you find ourselves at unrest and divided."}, {"type": "sentence", "content": "The focus of stage two is dealing with the biggest culprit that is to blame for getting off track and losing focus of the breath: mind-wandering."}, {"type": "sentence", "content": "Becoming aware of mind-wandering and noticing how it happens are key to meditation. John Yates describes the process as starting with a distraction, which leads to forgetting, which in turn causes mind-wandering."}, {"type": "sentence", "content": "Becoming aware that your mind is wandering is the “aha!” moment when you suddenly realize there is a disconnect between what you wanted to do (focus on the breath) and what you’re actually doing (fantasizing about pizza)."}, {"type": "sentence", "content": "You’ve probably heard at this point you should just return your attention to the breath. But there is a tendency to return to the breath with force and with self-judgment. This is a key point not to be rushed past."}, {"type": "sentence", "content": "It’s in these moments that you recognize you cannot prevent yourself from forgetting the breath. In other words, you realize that trying to consciously control the mind to get it to do what you want is futile."}, {"type": "sentence", "content": "Some unconscious part of your mind made you consciously aware you were supposed to be attending to the breath. This is the difference between having an intention to keep your attention on the breath and trying to keep your attention on the breath through sheer will and conscious effort."}, {"type": "sentence", "content": "The latter approach suggests the way to calm the mind is to dominate and control it. But believing we should be in control of the mind only leads us to start thinking there is something wrong with this dysfunctional “thing” that won’t behave for us. We begin to objectify “the mind” and start thinking it’s somehow broken or harmful."}, {"type": "sentence", "content": "But nor would we want to beat the unruly mind into submission. Attention is constantly moving to help us lookout for things that could help us survive or reproduce. Our job is merely to train a less used capacity: stable attention."}, {"type": "sentence", "content": "Ultimately, the mind is a collective of mental processes and at any given moment one part takes the hat for a while and claims it has control over the rest. In meditation, we sit without needing to put a hat on any part—i.e. without trying to control or claim anything as “I”, “me”, or “mine”. Bringing these diverse, unconscious mental processes into harmony through intention is what John Yates calls “unification of mind” (cittas’ekagata)."}, {"type": "sentence", "content": "At this point, you don’t need to worry about learning any fancy terms or studying Sanskrit. The focus is simply on shortening periods of mind-wandering by waking up to it when it happens and making it happen quicker and more often by not judging yourself or rushing back to the breath but recognizing it as a positive sign of progress."}, {"type": "sentence", "content": "Long periods of mind-wandering can be discouraging to start, and it’s all too easy to turn meditation into a dictatorship and get caught up in the negative aspects. It’s therefore a good idea to balance things out by finding enjoyment in the practice and fostering feelings of being alert, relaxed, and comfortable."}, {"type": "sentence", "content": "John Yates offers the following formula to find joy in such moments of discouragement and mind-wandering: Relax and look for the joy; observe; let it come, let it be, let it go."}, {"type": "sentence", "content": "Stage Two Goal: Shorter periods of mind-wandering and extended periods of sustained attention on the breath."}, {"type": "subtitle", "content": "Stage Three: Extended Attention & Overcoming Forgetting"}, {"type": "sentence", "content": "There’s an analogy in Tibetan Buddhism of someone trying to train a young elephant by tethering it to a stake in the ground."}, {"type": "sentence", "content": "At first, the elephant lunges in every direction, trying to escape. But soon enough, when it realizes it can’t, it lies down and goes to sleep."}, {"type": "sentence", "content": "Whether or not you agree with training elephants, the story is meant to demonstrate how when we tether the mind to the breath and don’t entertain its natural tendency to seek stimulation, it too starts to fall asleep."}, {"type": "sentence", "content": "Stage three is the time when you start to encounter the hindrances of dullness and drowsiness. Dullness and drowsiness come in many forms:"}, {"type": "sentence", "content": "There are obvious things you can do to guard against dullness: get better sleep, try meditating standing up, exercise before meditating. But like the young elephant who finds itself suddenly stuck in one place, the mind often relies on stimulation to stay awake, and so when it’s taken away, dullness and drowsiness will appear. And so we need to know how to work with them."}, {"type": "sentence", "content": "Building on what you’ve learned in stage one, the focus here moves from mind-wandering to dealing directly with the forgetting part of the equation."}, {"type": "sentence", "content": "There are several ways to help you remember the breath. For instance, becoming more aware of the full cycle of the breath by setting intentions to notice different parts of it, such as the sensations at the very beginning of the in-breath and in the gap between it and the out-breath."}, {"type": "sentence", "content": "This works particularly well as dullness and drowsiness often arise because attention isn’t tethered to its anchor strongly enough. It is rather scattered all over the place and nothing in particular is perceived at all."}, {"type": "sentence", "content": "On top of increasing awareness of the breath, the real key to overcoming forgetting is noticing distractions before they lead to forgetting. One common reason forgetting happens is due to overusing attention in meditation as we do in daily life. What this means is when we’re focusing on the breath, we’re doing so while trying to shut out everything else from our conscious awareness, in what John Yates calls “awareness deficit disorder.”"}, {"type": "sentence", "content": "This may be the way to do some types of meditation, but on the samatha/tranquility path we’re working on both concentration and awareness. And so, although attention is limited to the bodily sensations of breathing, nothing is limited, excluded, or suppressed from arising in the field of conscious awareness."}, {"type": "sentence", "content": "With this in mind, there are tools you can use to help strengthen awareness so that every little thing that arises doesn’t become the object of attention. One of the traditional mindfulness methods for this is mental noting or labeling."}, {"type": "sentence", "content": "Noting is a practice that is a kind of progression from the “aha!” method of remembering. Instead of just waking up to realize you’ve been fantasizing about pizza for the last ten minutes, you identify distractions by noting “thinking”, “planning”, or “remembering”, in the very moment you realize you’re no longer on the breath."}, {"type": "sentence", "content": "By practicing noting, you’ll get closer to noticing the actual distraction that initially took you away from the breath. Eventually, you’ll be able to note potential distractions long before forgetting even happens."}, {"type": "sentence", "content": "Stage Three Goals: Overcome forgetting and falling asleep."}, {"type": "subtitle", "content": "Stage Four: Continuous Attention & Overcoming Gross Distraction"}, {"type": "sentence", "content": "This is the stage where you’ve passed the first and biggest milestone on the path. You’re able to sustain your attention on the breath for longer periods of time and you even may begin enjoying, or at least not resisting, the act of sitting down to meditate."}, {"type": "sentence", "content": "But don’t get too cocky. As the path isn’t linear, you can easily slip back to previous stages. And there’s also other newer and bigger obstacles to contend with: gross distraction and strong dullness."}, {"type": "sentence", "content": "We touched on strong dullness in the last section, so here I want to focus on gross distraction. Gross distraction isn’t when you suddenly become distracted by an image of your gran sitting on the John. It’s one of two common ways by which we lose focus of the breath or object when meditating:"}, {"type": "sentence", "content": "Dealing with distraction is a means of building again on what you’ve learned in the other stages. In particular, the method of let it come, let it be, let it go."}, {"type": "sentence", "content": "There’s a belief that stilling the mind requires getting rid of thoughts and blocking out all distractions. If you encounter something that’s pulling for our attention, you should try and suppress it by focusing more intently on the breath or the meditation object."}, {"type": "sentence", "content": "As we’ve seen, if you try and force the mind to do anything in meditation, you’re not going to get very far. The alternative approach is developing mindfulness by becoming more conscious than ever of all background mental activity, and, you guessed it, allowing it all to come, to be, and to go."}, {"type": "sentence", "content": "Imagine you’re carrying a steaming hot bowl of pasta through the living room when suddenly, you become distracted by the dog peeing on your plants."}, {"type": "sentence", "content": "If you only have ultra focus and zero awareness, you may suddenly see her out the corner of your eye and at the same time unconsciously throw the pasta up into the air, toward the ceiling fan."}, {"type": "sentence", "content": "Alternatively, if you’re both focused on the pasta and fully aware of what’s going on around you, you will be able to finish safely delivering the pasta to the sofa before you tell Mable how much of a naughty girl she is."}, {"type": "sentence", "content": "Such an ability is important at this stage of meditation as once attention stabilizes a little, more subtle phenomena can start appearing from the unconscious. I.e. shit can start to get interesting."}, {"type": "sentence", "content": "If you only have tunnel vision and are not able to allow such phenomena to arise in your experience without it becoming the focus of your attention, you’ll quickly find yourself getting more interested in random memories that have long been buried and new ways of dealing with problems and strong emotions or sensations that are rising to the surface than your dull breath."}, {"type": "sentence", "content": "As the mind gets quieter and quieter, it’ll come up with newer and ever more enticing ways to call for your attention. The challenge is simply being able to notice and be with the thought or sensation or whatever it may be, without it drawing you away from the breath and disrupting your initial intention."}, {"type": "sentence", "content": "One formula that John Yates shares for dealing with such charged and particularly difficult material at this stage is the formula of acknowledging, allowing, and accepting."}, {"type": "sentence", "content": "When you do this, you’re moving from focusing on the contents of the mind to looking at the movements of attention. This is key in allowing yourself to feel and experience things without having to identify with them."}, {"type": "sentence", "content": "This approach can be mistaken for becoming “detached” or “disassociating”. But in fact, it is the attachment to particular emotions that detaches us from our experience. By acknowledging whatever is happening, allowing it to be there without analyzing it, judging it, or pushing it away, and accepting it for what it is, we stop trying to latch onto rocks and instead become more able to see and flow with the constantly changing river of experience."}, {"type": "sentence", "content": "Don’t worry if by this stage you still find yourself getting distracted (hey gran!) and taken away from the breath. Once you start working more on also maintaining awareness with such methods as noting and the above, you’ll notice them more quickly as subtle distractions. And by remembering to let them come, let them be, and let them go, they will dissipate on their own."}, {"type": "sentence", "content": "Stage Four Goals: Gross distractions no longer push the breath into the background and breath sensations don’t fade or become distorted due to strong dullness."}, {"type": "subtitle", "content": "Continuing The Path: Stage Five and Beyond"}, {"type": "sentence", "content": "From here, the only way is up."}, {"type": "sentence", "content": "One thing to emphasize, though, is the path isn’t exactly linear. You might notice several overlaps between the stages, and at times you may even find yourself jumping up or down several stages within a single session."}, {"type": "sentence", "content": "Likewise, due to stressful events or natural changes in life, it’s also possible for even the most advanced meditators to find themselves dropping right back down to the beginning."}, {"type": "sentence", "content": "For this reason, it’s important to know that when an experience isn’t reliable or intentionally repeatable, then it’s just an experience. In this way, the Path of Tranquility can remind you where you’re at, give you a rough idea of how long it might take to move to the next stage, and alert you to what you should be focusing on at any given point in your journey."}, {"type": "sentence", "content": "So, whether you think you’re stage minus five or stage four, get on the path today. It doesn’t matter where you are or where you start, what matters is simply that you’re on the path and are giving chase."}, {"type": "subtitle", "content": "Want to go from noob to skilled meditator?"}, {"type": "sentence", "content": "Sign up for my newsletter and receive details about my new 4-Week Learn to Meditate in The Modern World email course: joehunt.net"}], "topic": "mindfulness"}