{"title": "From Procrastination to Motivation: Manipulating Dopamine", "data": [{"type": "sentence", "content": "We hear this sentence multiple times throughout our lifetimes — Knowledge is power — but in reality, is it knowledge or is our understanding of that knowledge that is powerful?"}, {"type": "sentence", "content": "If we understand how something works, we can always make it work better, no? How can we make dopamine work for us and not become its slaves, like the rats in the lab experiments continuously pushing that dopamine supply button and ignoring survival necessities like food in exchange for another hit of that high?"}, {"type": "sentence", "content": "Although we often hear about these chemicals, or hormones as often referred to in general discussions alongside oxytocin, serotonin and glutamate, it is rarely mentioned that dopamine is part of our primal brain, the neurological pathways that are responsible for survival. It is very old if we are speaking in evolutionary terms of the human nervous system."}, {"type": "sentence", "content": "From the get go of our biological existence as humans the natural function of this chemical reaction in the brain is to help keep us focused on activities that promote the primal goals for survival and reproduction. For example, when a starving person eats, the brain receives a nice dose of dopamine which makes us feel rewarded (in other words, makes us feel good) and consequently makes us desire to re-experience the activity again and again, and most importantly helps us, well, not die."}, {"type": "sentence", "content": "Now, this was all good and well when our basic biological goals were survival and reproduction and not much more. However, as our societies and lives have gotten more complex, stimulus-packed and even evolved, we lose the need to only satisfy these primitive needs . Our rewards as well as our goals are more multiplex, with this comes procrastination, multi-million corporations that capitalise on this specific chemical reaction — making video games, apps like Instagram, and generally what we know as the entertainment industry, and to top it off we also have various addictions."}, {"type": "sentence", "content": "Another issue to consider is when we flood ourselves with distractions on a daily basis, be it doing more than two or three tasks at the same time, procrastinating, bouncing our focus between activities like it’s a rubber ball, it’s never going to end well. One day we’re binge watching our favourite series and the next day we’re 85 years old, where did the time go? Of course, yes, hyperbole for effect."}, {"type": "sentence", "content": "The idea is — our lives will fly by us and were we really doing the things we truly desired, were we full of joy on most days, did we do what we were really passionate about? And that’s not even the worst of it. Feeling uninspired, lost, lack of purpose and, for some, even depressed could all be simply a result of needing a bit of a dopamine detox."}, {"type": "sentence", "content": "Maybe we think we are lacking motivation, psychologically speaking that’s actually impossible. The real issue is what we put our motivation into. We can never lack motivation as it is the driving force for our existence, whether we choose to lie down and watch Netflix or we choose to go for a 5km run, we are motivated to do one of them."}, {"type": "sentence", "content": "If we are depressed, feeling lost, don’t know what we’re doing with our lives, it is a good idea to consider that maybe we’re just too overloaded on dopamine to give our brain the time and space to focus on those areas. When we preoccupy our mind with ‘easy-access dopamine’ filled activities we do not give ourselves the time for insights to our desires, understanding our own beliefs and seeing the problems we’ve diverted our attention from. And what about solutions for those problems?"}, {"type": "sentence", "content": "It is always a good idea to keep a balance — to have days without Instagram, to use TV and Netflix as rewards, rather than main activity of the day, for accomplishing something throughout your day (may it be cleaning your house, exercising for 90 minutes or writing an article or a chapter in your book) or have select full days where you are just painting, meditating, reading, learning something new or simply going outside for the whole day. It will not only lead to a more healthy lifestyle but also to a clearer mind."}, {"type": "sentence", "content": "We are always a decision away from leading a different life. And the best time to access all the possibilities we have is only now."}, {"type": "sentence", "content": "Let’s be honest, there are no other options. You cannot change the decisions of the past and you cannot make decisions in the future. So, what does that leave us with? Well, the best time to make decisions and make a change — the now."}, {"type": "sentence", "content": "Check out this TedTalk on Misunderstanding Dopamine and its connection to addiction"}], "topic": "productivity"}