{"title": "How I Quit My Job to Travel the World for 1-Year", "data": [{"type": "image", "content": "https://miro.medium.com/max/5806/1*CJm2CUIwrNDhOpKl_xwanQ.jpeg"}, {"type": "sentence", "content": "In early 2019, I quit my comfortable corporate job in Los Angeles, to travel the world full time. I left all that was familiar to me behind, for a life of adventure and uncertainty on the road. I packed my backpack, sold my belongings, and moved out of my overpriced 2 bedroom apartment in Beverly Hills."}, {"type": "sentence", "content": "Many of my friends and family thought I was crazy. With a four year degree at one of the best Universities in the United States, I felt an immense sense of pressure to live up to the expectations set upon me. Nevertheless, I knew deep in my soul I wasn’t happy. I wasn’t myself. I was accustomed to living a mundane, routine life in an effort to please others, but this wasn’t a life I wanted for myself."}, {"type": "sentence", "content": "I knew how much joy travel gave me. There was so much to see out there and I knew now was the time. Below are the steps I took to muster up the courage to finally leave behind my comfortable life, for a life of I had always dreamed of."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*ll1fLqXdGyKiEJxm_BDM5w.jpeg"}, {"type": "subtitle", "content": "Save Up:"}, {"type": "sentence", "content": "Before you can even think about leaving, you have to prioritize saving your money. Traveling for an entire year can add up and ensuring you have a safety net of funds for when you return is also imperative."}, {"type": "sentence", "content": "Prior to leaving, I did a ton of research in regards to the average daily budget for each of the countries I planned to visit. I multiplied that daily budget by the number of days I planned to be there, which gave me a rough estimate for how much I needed."}, {"type": "sentence", "content": "As a young 24-year-old living in Los Angeles, saving was hard. I constantly had to say no to dining out with friends at expensive restaurants, nights out, and of course shopping, but to me it was worth it. Over the course of 2 years, I was able to be frugal with my money to save enough for my world adventure."}, {"type": "sentence", "content": "I also set aside a solid amount of money to have leftover for when I returned. This gave me the security I needed to cover a few months of rent, car payments, and student loans when I returned."}, {"type": "sentence", "content": "Once you have the funds, you can officially start thinking about leaving your job!"}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*7sGE2hqjpVT_v3aqYT5SSA.jpeg"}, {"type": "subtitle", "content": "Quit the Job:"}, {"type": "sentence", "content": "Now, I don’t know about you, but I am a people pleaser. I hate to let others down. I am also extremely loyal. Now in all fairness, this wasn’t the first job I quit, but it was my first ‘big girl job’ I quit."}, {"type": "sentence", "content": "To add to that, I wasn’t quitting because I had received a better offer elsewhere, I wasn’t leaving because I was unhappy, there was no family emergency. I was quitting because I wanted to travel! This can be rather confusing in corporate America."}, {"type": "sentence", "content": "Nevertheless, I had to take the plunge and put in my two weeks notice at work. I will never forget the all-consuming fear of the unknown. Was I throwing away a great opportunity? How would this decision impact my future? My career goals? All of this running through my mind."}, {"type": "sentence", "content": "My biggest tip for you if you leave any job is to make sure you leave on good terms. You never want to taint relationships with your superiors because you never know how and when they can help you down the line."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*cnxY1nNxRUAwGA07Agza_w.jpeg"}, {"type": "subtitle", "content": "Buy the Flight:"}, {"type": "sentence", "content": "After wrapping up loose ends at work, I knew the next step was to purchase the flight! This was the exciting part and once it was purchased, it really made this whole process final."}, {"type": "sentence", "content": "I spent around $1,000 on a one-way ticket, so there was truly no turning back now. This was the point of the process where the excitement set in. I was really doing this, I was going to be living life on my terms."}, {"type": "sentence", "content": "One of my biggest tips in this process is to stick with a one-way flight. There is a certain level of spontaneity in travel. You never know who you will meet, or what country you will end up in. Plus, you can often times score some killer last minute flight deals if you wait!"}, {"type": "image", "content": "https://miro.medium.com/max/3854/1*B_Nou0yMeC0-12QqOTBI8w.jpeg"}, {"type": "subtitle", "content": "Sell Your Belongings:"}, {"type": "sentence", "content": "Moving is never fun, especially when you have nowhere to move to! I saw this as an opportunity to sell the majority of my belongings and use the extra income towards my trip."}, {"type": "sentence", "content": "This was my first taste of becoming a minimalist. Learning how to live a life with less was such an important lesson I learned on my travels."}, {"type": "sentence", "content": "Sell the things you know you won’t need and try to store the important treasures for your return."}, {"type": "image", "content": "https://miro.medium.com/max/6002/1*m4Tg4-1cwYJdOqlgY1a1_A.jpeg"}, {"type": "subtitle", "content": "Pack Your Bags:"}, {"type": "sentence", "content": "Piggybacking off of becoming a minimalist, I learned that traveling for an entire year out of one backpack requires you to be strategic with your packing."}, {"type": "sentence", "content": "I can recall doing dozens of Google searches for ‘how to pack for a year-long backpacking trip’ myself. I came to the conclusion that these were the most important things to consider when packing. Versatility, value, and necessity."}, {"type": "sentence", "content": "Versatility: Think ‘capsule wardrobe.’ In a capsule wardrobe, you have very few items that can work interchangeably. Once a shirt can be worn with shorts, a skirt, or a pair of jeans you know it’s the one to bring. Sticking to basics was great for this!"}, {"type": "sentence", "content": "Value: It is important to keep in mind that anything you bring with you, you must be okay if it gets lost, stolen, or damaged. Leave behind all your designer crap and only bring cheap items with you. Trust me, it is not worth the stress or hassle."}, {"type": "sentence", "content": "Necessity: There is a difference between things you want to bring and the things you need to bring. You may want to bring a bag full of makeup, but you may need a bag of medications. I learned how to become comfortable without makeup on this trip and got good at only taking what I knew I would absolutely need on the road."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*yRfg5rFJLfqaVaDrckIOmA.jpeg"}, {"type": "subtitle", "content": "Be Brave:"}, {"type": "sentence", "content": "If you got yourself this far, it is about following through and being brave. Taking a ‘permanent out of office’ is a scary thing, especially in this day and age."}, {"type": "sentence", "content": "That being said, I can tell you that once you are on the road you will never look back. Not a day went by where I regretted my decision or continued to feel guilty for my choices. Pursuing my passions and pushing myself to experience new cultures only adds to my character in the end."}, {"type": "sentence", "content": "We have a whole life to live, so make sure you are living it on your terms!"}, {"type": "image", "content": "https://miro.medium.com/max/5940/1*CVf9YHgAVlxczOoKba8Sag.jpeg"}], "topic": "travel"}