{"title": "Why Steve Mnuchin Doesn’t Want to Talk About Jobs", "data": [{"type": "subtitle", "content": "The GOP is determined to protect corporations and the stock market. Even if it kills us."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*-qDSBMUqkbu3r-7Pk0e0nw.jpeg"}, {"type": "sentence", "content": "Remember when it dawned on you that the arrow on the Amazon logo wasn’t a smile, it was a subliminal message that the company has everything ‘from A to Z?’"}, {"type": "sentence", "content": "How about when you realized the FedEx logo has a giant arrow buried in it? How about when it hit you that the ‘BR’ in Baskin-Robbins’s logo has the number ‘31’ inside of it, representing their thirty-one flavors of ice cream?"}, {"type": "sentence", "content": "After I watched Treasury Secretary Steve Mnuchin’s testimony (Fed Chairman Jerome Powell also testified) before the Senate Banking Committee this week, that’s exactly how I felt."}, {"type": "sentence", "content": "Working on Wall Street requires one to be a political junkie. I absorb tons of political and economic information, although my trading days are behind me, much like a retired drill sergeant that still rises at the crack of dawn even though he has no troops under his command."}, {"type": "sentence", "content": "Mnuchin said something in his testimony that jumped out and hit me right between the eyes. It was like this first time you notice a hidden message buried inside a logo you see every day of the week."}, {"type": "sentence", "content": "More on that later."}, {"type": "sentence", "content": "First, let me give you some background on America’s dire economic situation:"}, {"type": "subtitle", "content": "Here’s the horrific state of U. S. economy:"}, {"type": "sentence", "content": "Due to the coronavirus, every U.S. worker has effective losses of nearly $8,900. According to the Federal Reserve, almost 40% of Americans living in households earning $40,000 or less annually lost their jobs in March. The Congressional Budget Office expects second-quarter GDP will drop to 11% and unemployment to spike to 15%."}, {"type": "image", "content": "https://miro.medium.com/max/1650/1*4bDiZjECGEKpd-ZlXA71Hg.png"}, {"type": "sentence", "content": "Heading into Memorial Day weekend, initial jobless claims — the measure of Americans seeking unemployment benefits for the first time — rose by 2.98 million. That means a total of 38.6 million people filed for benefits since mid-March."}, {"type": "sentence", "content": "But things are even worse than they look:"}, {"type": "sentence", "content": "As bad as those numbers seem, they do not include hundreds of thousands of additional claims from traditionally ineligible workers (freelancers or gig workers, for example) receiving assistance through the federal Pandemic Unemployment Assistance (PUA)program."}, {"type": "sentence", "content": "This means the actual number of jobless Americans is much higher than the initial jobless claims figures indicate."}, {"type": "sentence", "content": "According to a new report, things may get even worse for the unemployed:"}, {"type": "sentence", "content": "Four million homeowners are in mortgage forbearance, allowing them to negotiate a lower rate, or skip their monthly mortgage payments for up to a year. As many as 15% of all homeowners will likely fall into arrears — levels not seen since the Great Depression."}, {"type": "sentence", "content": "Nearly 16.5 million rental households have at least one worker in a sector of business affected by the pandemic. As many as 50 million have lost a job and/or income. These renters are most likely to be people of color."}, {"type": "subtitle", "content": "Most of the Senate’s questions focused on ‘re-opening’ the economy:"}, {"type": "sentence", "content": "For the record, I hate the ‘re-opening’ buzzword. I think it’s a lazy way of looking at things. The economy never ‘closed’ — it just slowed down. A lot. There is no question things are disastrous for massive numbers of Americans, but things are still bought and sold every day."}, {"type": "sentence", "content": "People still shop for food and clothing. Papa John’s Pizza sold more pizza last quarter than at any time in their history. Walmart and other big-box companies like Target are printing money."}, {"type": "sentence", "content": "And if you’re lucky enough to billionaire Jeff Bezos — things couldn’t be better."}, {"type": "sentence", "content": "That’s why I think the ‘open/closed economy’ talk is just nonsense."}, {"type": "subtitle", "content": "Here’s the part of Mnuchin’s testimony that got my attention:"}, {"type": "sentence", "content": "I’ve watched the back-and-forth between Senator Sherrod Brown of Wisconsin and Secretary Mnuchin a dozen times. This question from Senator Brown made headlines:"}, {"type": "sentence", "content": "Sure, the question was sort of hyperbolic, but I get the senator’s point. To me, what came next was more important, although this part of their Q&A got less attention:"}, {"type": "sentence", "content": "Mnuchin was evasive when asked if corporations could receive government funds, then lay off workers down the road. But Sen. Brown had asked a valid question."}, {"type": "sentence", "content": "For those trying to decipher the GOP’s worldview on how the economy should work, this exchange is key. It is also important to recognize that under the CARES Act, the U.S. Treasury Secretary controls nearly $500 billion with very few limitations."}, {"type": "sentence", "content": "Restrictions on buybacks and bonuses, for example, were part of bipartisan negotiations. Other than that, Mnuchin has broad authority to negotiate terms with corporations in need of government assistance."}, {"type": "sentence", "content": "Why? Just look at what’s already happened with the airlines."}, {"type": "sentence", "content": "The CARES Act earmarked $25 billion specifically for the airline industry, with a requirement to “refrain from conducting involuntary furloughs or reducing pay rates and benefits.”"}, {"type": "sentence", "content": "What happened next? After taking over $6 billion federal money, Delta and Jetblue decided to cut employee hours anyway. That’s why Senator Brown’s question was legitimate."}, {"type": "sentence", "content": "Senator Brown knows Mnuchin has the authority to insist on hazard pay for workers or paid sick leave for workers, instead of leaving it to corporations."}, {"type": "sentence", "content": "So why isn’t Mnuchin doing this?"}, {"type": "subtitle", "content": "The GOP’s ‘hotbox the worker’ strategy for the economy:"}, {"type": "sentence", "content": "In baseball, sometimes a runner gets caught between bases. You’ve probably seen it, even if you aren’t a fan of the game. Whenever this happens, the runner desperately runs back forth between the bases, trying not to be tagged out."}, {"type": "sentence", "content": "It’s called a Hotbox or Rundown. Some people call it a Pickle situation. Nearly every time I’ve seen this, the runner gets tagged out. I have no idea of the statistics, but my guess is maybe 3 out of every 10 runners are lucky enough to make it to a base."}, {"type": "sentence", "content": "As far as the GOP is concerned, business — big business, in particular — is the economy. They think business drives the economy, not people. To them corporations are the automobile, CEOs drive the car, and employees are the replacement parts."}, {"type": "sentence", "content": "That is why they are fine with opening a meatpacking facility filled with folks working elbow to elbow, in a toxic soup of sickness. It is also why they don’t mind if your unemployment runs out, or if you can’t pay rent next month."}, {"type": "sentence", "content": "They think you’re getting too much help in the first place."}, {"type": "sentence", "content": "They’ve seen the numbers, so they know there aren’t enough jobs to go around. But instead of worrying about how you’ll pay your car payment next month, they want to make sure Ford keeps making cars."}, {"type": "sentence", "content": "That is why they need you to get back to work, to ‘re-open’ the economy, despite the unhealthy working conditions. And if you have the gall not go back to your bartending job or your call center job, for fear of getting sick or, God forbid, taking sickness home to your family — then bye-bye unemployment."}, {"type": "sentence", "content": "So it’s your money or your life. Your job or your family’s life. For the good of the economy. In case you haven’t figured it out, you’re the guy in the hotbox. You’re one of the 10 unemployed workers, desperately scraping to be one of the 3 new hires."}, {"type": "sentence", "content": "That is why Steve Mnuchin doesn’t want to talk about jobs."}, {"type": "sentence", "content": "Thanks for reading this story! If you like politics, the economy, and a little humor, sign up for my upcoming newsletter:"}], "topic": "economy"}