{"title": "The Great Pause Within", "data": [{"type": "image", "content": "https://miro.medium.com/max/6400/1*YKKP0ynSXsfDo2v1g6jR_g.jpeg"}, {"type": "sentence", "content": "It has been aptly stated that we are in the midst of The Great Pause right now. With people largely staying home and businesses shuttered across the world, it certainly feels that way. This change, while painful, is also causing a great rethink about our priorities — the Western world madness in the way that we seek external products and experiences to soothe our unsettled inner emotions and minds."}, {"type": "sentence", "content": "Businesses profit mightily from this view of reality. It is a convenient and happy marriage that their product will soothe your ill. Nearly everyone has bought into this belief. The mistake is that you never need any product to be happy. You only need what cannot be bought. Space, time, and deep concentration to enter the silence within — and determination to stay the course."}, {"type": "sentence", "content": "While the wheels of consumerism were still spinning on their heels before COVID-19, I spent the past year on a Great Pause Within. In the midst of a cathartic personal transformation, I quit my job of 20 years, overcame significant health issues and felt a deep inner stirring within waiting to be uncovered. Honestly, I was fed up being a slave to the whims of my fleeting, haphazard mind."}, {"type": "sentence", "content": "Though I had many failed attempts at meditation in the past, I dove into it with renewed purpose to overcome the monkey mind angst. This time I tried again but with the help of technology and coaching. With determination, patience, and excellent teachers, I shed layer upon layer of inner narrative voice. Slowly, slowly, by simply sitting, breathing and watching my mind, I learned the art of one-pointed focus and witnessing. I learned how to rest in awareness and become the witness to my own thoughts AND the external world. Naturally, inner joy and equanimity started to arise from some place I could not name."}, {"type": "sentence", "content": "Finally not seeking and searching for external comfort, I ended the madness of fluttering like a leaf in the winds of life, pushed around by this thing and that thing. Instead, like a tree, I sent a deep taproot into the depths of my being to harness my own inner resilience and strength. There I found this precious truth. I don’t need anything external to be happy. I discovered how to live as a tree, not as a leaf."}, {"type": "image", "content": "https://miro.medium.com/max/5200/0*Yk0jRvmA97aoIFoU.jpeg"}, {"type": "sentence", "content": "Here’s the real truth. Every business in the world thrives when we are the leaf. “Here” they say, “Let me sell you this product to soothe and comfort you. I have something wonderful to excite your senses. Let me take you on a spectacular adventure.” In this view, the world is a curiosity shop of delicious wonder and thrill with extraordinary tantalizing delights for our senses. The realization dawns that these are all happiness traps with no resolution and all part of a grand illusion — Maya as it’s been called in Sanskrit."}, {"type": "sentence", "content": "I am NOT making a call for you to become a monk or nun and renounce every physical possession or comfort — though you may want to when you experience the most profound meditation states. I, for one, deeply appreciate a well-designed product or delicious nourishing meal. But, once freed from the illusion of external happiness, these are simply gifts to be appreciated and we are unbound from desire — our hearts turn instead towards gratitude, equanimity and deep compassion for those less fortunate."}, {"type": "sentence", "content": "More and more people are awakening to this realization — the one shouted from rooftops for millennia from sages, religions, philosophers, poets, musicians, artists —"}, {"type": "sentence", "content": "Take the Great Pause Without and leap into the Great Pause Within. Discover for yourself what the sages were talking about. There is a door within you just waiting to be opened."}, {"type": "sentence", "content": "Sit down, close your eyes and open the door."}], "topic": "mindfulness"}