{"title": "Proven Benefits of Meditation", "data": [{"type": "image", "content": "https://miro.medium.com/max/15360/1*w_rFw1dAOzPXNONIRcr-hw.jpeg"}, {"type": "subtitle", "content": "How the simplicity of meditation can improve quality of life"}, {"type": "sentence", "content": "During our unprecedented times, why not listen to a youtube meditation video and practice the art of mindfulness? There is no better time than the present. Meditation provides many benefits, and it is guilt-free relaxation of the mind and body."}, {"type": "sentence", "content": "Meditation isn’t biased, it welcomes everyone and it’s never too late to start."}, {"type": "image", "content": "https://miro.medium.com/max/11912/1*omEe-J-O2NQZikFyIylgTA.jpeg"}, {"type": "sentence", "content": "There are many benefits to this ancient form of positive focus."}, {"type": "subtitle", "content": "Improves health"}, {"type": "sentence", "content": "A meditation regime does not require anything other than quiet, focus and relaxation. It’s one of the simplest and most effective ways to declutter your mind. Meditation helps to reduce anxiety, depression and stress."}, {"type": "sentence", "content": "Vital functions such as digestion and blood pressure are regulated through the autonomic nervous system. Chronic stress has been proven to affect the autonomic nervous system. Scientists have discovered many benefits of meditation to decrease heart disease, chronic pain, irritable bowel syndrome, fibromyalgia, psoriasis, and post-traumatic stress disorder."}, {"type": "subtitle", "content": "Improves sleep"}, {"type": "sentence", "content": "Studies have shown proper sleep hygiene to be a vital requirement in good health. The New York Academy of Sciences suggest meditation to have a strong effect on quality of sleep and reduction of sleep disturbances."}, {"type": "sentence", "content": "If we can reduce our stress and anxiety through meditation, our sleep performance is bound to improve."}, {"type": "subtitle", "content": "Increased concentration"}, {"type": "sentence", "content": "Meditation helps teach us to calm our mind, reduce negative thoughts and learn to be in the present moment. With this comes the benefit of increased concentration. Forbes senior contributor; Alice G. Walton, PhD found studies to suggest meditation, after only a few weeks have a positive effect on concentration, cognitive function and reduced aging of the brain."}, {"type": "subtitle", "content": "Balances emotions"}, {"type": "sentence", "content": "The fight-or-flight response, as important as it can be involves the amygdala; studies suggest regular meditation correlates with a moderate reduction within this brain region. As a result this would improve our ability to control our emotions."}, {"type": "subtitle", "content": "Promotes life satisfaction"}, {"type": "sentence", "content": "The benefits of meditation are ample. Reduced stress and improved control of our emotions will better equip us for problems that eventually move toward our direction. Combine these benefits with better sleep and improved health and higher satisfaction in life is sure to follow."}, {"type": "sentence", "content": "Emotional, mental and physical health are responsible for our well-being. Although we can’t always control our health either emotionally, mentally, or physically, we can take measures to decrease the effects and pain of the condition."}, {"type": "sentence", "content": "I truly believe in meditation, and I encourage those who are ‘meditation-shy’ to listen to the youtube videos I have recommended. Find a comfortable spot on your own, close your eyes and listen to the prompts."}, {"type": "sentence", "content": "Before you can say om, you will be meditating. Find a few minutes each day, and before you know it, this will become routine."}, {"type": "sentence", "content": "I challenge you to take the reins and give meditation a try!"}, {"type": "sentence", "content": "Thank you for reading, you can also find me at Lifestyle by Design!"}], "topic": "mindfulness"}