{"title": "Does Losing Your Sense of Smell Erase Your Past?", "data": [{"type": "subtitle", "content": "Without the ability to smell, odor-evoked memories disappear"}, {"type": "image", "content": "https://miro.medium.com/max/7748/0*Zt3Ye48cxHGm6Tjk"}, {"type": "sentence", "content": "One of the more obscure symptoms of COVID-19 is the loss of the sense of smell. While I can think of some occasions where that could come in handy — like for those of us who are elbow deep in diapers — the inability to smell can come with some major consequences."}, {"type": "sentence", "content": "These consequences extend far beyond bland tasting food. The sense of smell is often used to detect potentially dangerous situations, such as spoiled food, gas leaks, and fire."}, {"type": "sentence", "content": "It is also used in memory recall. Without it, you may never again recall certain memories."}, {"type": "sentence", "content": "That is because our sense of smell is more closely tied with memory than any of our other senses and it can bring back memories that others can’t."}, {"type": "subtitle", "content": "How we smell"}, {"type": "sentence", "content": "Inside the nose are small nerve cells, called olfactory sensory neurons, that are covered with hairlike cilia. At the tips of the cilia are odor receptors that are stimulated by microscopic molecules that enter the nose. These molecules are released by everything in the environment, from your morning coffee to freshly cut grass."}, {"type": "sentence", "content": "While humans have around 10 million neurons, we can differentiate between about 1 trillion scents. This means that we don’t have a neuron for each smell. So, how do we differentiate one scent from another?"}, {"type": "sentence", "content": "To answer that question, in a study published in 2019, scientists looked to the 400 dedicated olfactory genes located in each neuron."}, {"type": "sentence", "content": "For decades, researchers couldn’t figure out why the neurons, which each have those hundreds of genes, choose to only activate one of them when they come in contact with a scent molecule. But in this study on mice, they discovered that by moving around in 3D space and rearranging itself, the genome chooses a particular gene that then works with a team to interpret the scent."}, {"type": "sentence", "content": "In this way, they create the diversity needed to detect the vast number of smells we encounter."}, {"type": "subtitle", "content": "Smell and memory"}, {"type": "sentence", "content": "As information about these scents is transmitted to the brain, they can evoke a particular memory."}, {"type": "sentence", "content": "Starting at the olfactory neurons, information in the form of electrical impulses is passed through the olfactory nerve to the olfactory bulb, which connects to the primary olfactory cortex region of the brain."}, {"type": "sentence", "content": "This region is in a very special location within the brain. It is just a couple synapses away from another region called the amygdala, which is involved with emotions, and a region called the hippocampus, which is involved with memory."}, {"type": "sentence", "content": "No other sense has a more direct connection to those regions. They first travel to the thalamus before the information is sent to other parts of the brain."}, {"type": "sentence", "content": "This is why memories evoked by odor create such a strong emotional response compared to the other senses and why scents can bring back memories that may otherwise be forgotten."}, {"type": "sentence", "content": "In a 2006 study, scientists triggered the autobiographical memories of older adults using three different senses: hearing by saying a word, sight by showing a picture, or smell by introducing an odor."}, {"type": "sentence", "content": "They found that memories evoked by odor are different from memories sparked by the other senses."}, {"type": "sentence", "content": "As expected, odor triggered memories came with more emotion, such as a stronger feeling of being brought back in time. But the particular memories each sense evoked was different as well."}, {"type": "sentence", "content": "Memories triggered by odor were older, taking place before 10 years of age, while the memories triggered by words or pictures typically occurred during early adulthood, between 11 and 20 years of age."}, {"type": "sentence", "content": "Without the sense of smell, these childhood memories may never be recalled."}, {"type": "subtitle", "content": "Smell and memory loss"}, {"type": "sentence", "content": "The strong relationship between the sense of smell and memory is also evident in reverse — when memory is lost."}, {"type": "sentence", "content": "Issues with the sense of smell, like being unable to recognize odors, have been linked to neurodegenerative disorders associated with memory loss, like dementia and Alzheimer’s."}, {"type": "sentence", "content": "Little is known on how this connection works, but scientists are beginning to unravel the mystery by looking at a region of the brain associated with these disorders — the anterior olfactory nucleus, which is located just behind the olfactory bulb."}, {"type": "sentence", "content": "A 2018 study on mice discovered that this region may be responsible for the vividness of our odor-cued memories. Within this region, information about space and time combine to create a memory that includes not only what the smell was, but where it occurred and when it happened."}, {"type": "sentence", "content": "Through more exploration of this region, they uncovered a pathway between the anterior olfactory nucleus and the hippocampus, which is an important region for memories and contextual representation."}, {"type": "sentence", "content": "They went on to look at how disconnecting the two regions affected how the mice reacted to odor. They discovered that mice without this connection kept returning to old smells, which, in mice language, means that they didn’t remember them."}, {"type": "sentence", "content": "Severing the connection between the anterior olfactory nucleus and hippocampus mimicked the odor memory problems seen in patients with Alzheimer’s. Their study suggests that what these patients are lacking is the “when” and “where” portion of the scent memory, making it difficult for them to recall what the scent is."}, {"type": "subtitle", "content": "How we lose our sense of smell"}, {"type": "sentence", "content": "In addition to neurodegenerative disorders, there are many other ways in which you can lose your sense of smell."}, {"type": "sentence", "content": "One way is through an injury that causes the bone that houses the olfactory neurons to shift, severing their connections to the brain. If you lose your sense of smell this way it is most likely permanent."}, {"type": "sentence", "content": "You can also lose it by a blockage in your nasal passage. This can come in the form of growths in your nose called polyps, allergies, or a sinus infection. In cases like these, the ability to smell can be restored either through removing the polyps through surgery, cleaning your nose with a saline solution, or simply by recovering from the illness."}, {"type": "sentence", "content": "Patients with COVID-19 are also experiencing a loss in their sense of smell."}, {"type": "sentence", "content": "This virus can cause upper respiratory infections, which often result in inflammation in the nasal passages and making it difficult to smell. Luckily, most patients have been reporting that their sense of smell returned in just a few weeks."}], "topic": "neuroscience"}