{"title": "If You Have to Travel, Should You Take a Plane or Car?", "data": [{"type": "subtitle", "content": "Here’s what the experts say"}, {"type": "image", "content": "https://miro.medium.com/max/10240/1*JkGy3LqCYXse2JRXdLsnrg.jpeg"}, {"type": "sentence", "content": "The pandemic has thrown a wrench into the summer plans of people around the world. Right now many places have stay-at-home orders that largely restrict travel. However, as states begin lifting these restrictions or people need to move, there are questions about the safest way to do so. Is it better to take a road trip but risk stops along the way? Or is it better to take an airplane and spend hours in tight quarters with strangers?"}, {"type": "sentence", "content": "“Any form of travel at this current time in the Covid-19 pandemic involves risk,” says Dr. Jill Weatherhead, an assistant professor of tropical medicine and infectious diseases at Baylor College of Medicine. “Knowing the most up-to-date information regarding the virus and travel restrictions is critical.”"}, {"type": "sentence", "content": "Weatherhead points out that taking public forms of transportation like buses, trains, or planes can undoubtedly mean close exposure to more people in different areas of the country. “While waiting within airports, bus spots, and train stations as well as while riding in planes, buses, and trains, practicing social distancing as much as possible; disinfecting highly touched surfaces such as seats, trays, armrests; and wearing a facial covering may help reduce viral transmission during travel,” she says."}, {"type": "sentence", "content": "What about the lack of airflow on a plane? “Modern planes are equipped with high-efficiency particulate air (HEPA) filters which filter particles from recycled air, reducing risk of viral spread through the air,” says Weatherhead. “However it won’t necessarily prevent droplet or contaminated surface transmission of the virus if in close contact with sick individuals.”"}, {"type": "sentence", "content": "Dr. Robin Patel, president of the American Society for Microbiology, takes a stronger stance on flying. “Traveling in your own car, either by yourself or with members of your household, is certainly safer than traveling by airplane right now in terms of acquiring Covid-19,” she says. “Even with physical distancing measures on an airplane, there is a risk of exposure to Covid-19 due to the sheer number of people not from the same household sharing the same space.”"}, {"type": "sentence", "content": "Patel says that because Covid-19 can be spread from people without symptoms or people who haven’t yet developed symptoms, there’s no easy way to know who might be carrying it. “Having air travelers wear a mask, properly cleaning surfaces in airports and on planes, and washing your hands regularly can help, of course, but if you’re alone or with others from your household in your own car, there’s really little risk of acquiring Covid-19 there; it’s pretty much like being at home.”"}, {"type": "sentence", "content": "Weatherhead says that while driving may reduce close contact with large groups of people, “driving requires frequent stops with exposures at restaurants, rest stops, and gas stations.” Her advice: “Ensure everyone in the car is from the same household. Reducing stops and washing hands regularly may also prevent spread of infection while on road trips.”"}, {"type": "sentence", "content": "The bottom line is that any transportation is going to come with a set of risks, especially if you’re attempting to travel across states or for a long period of time. In some cases, the distance may make the decision easier. In any situation, try to stay spread apart from others, keep washing your hands, and wear your mask (and seat belt)."}, {"type": "sentence", "content": "Read more on travel:"}], "topic": "travel"}