{"title": "The CEO of Airbnb Taught Us an Extraordinary Lesson When He Fired 25% of His Company", "data": [{"type": "subtitle", "content": "Being human makes you more money in the long-term."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*ohNqdoV9lKPcxTAUpA2NqQ.png"}, {"type": "sentence", "content": "Letters from CEOs rarely move me. They’re often full of corporate-speak and half-truths. The CEO and Co-Founder of Airbnb, Brian Chesky, changed that with his letter to employees."}, {"type": "sentence", "content": "The global economy is having a sudden cardiac arrest and despite Brian’s social media following and celebrity status amongst the startup community, he too has been forced to act. His beloved company will axe 1900 out of their 7500 employees."}, {"type": "sentence", "content": "There is no easy way for a CEO to do that. Many CEO’s before Brian have had to do exactly the same and mostly done it in a heartless way with an in-genuine apology. I remember being let go from my job last year and crying for no reason at all. It hurts. I wouldn’t wish that feeling on my worst enemy."}, {"type": "sentence", "content": "But Brian gave us hope with his letter."}, {"type": "sentence", "content": "He took a different approach that we can all learn from, even if you’re not the CEO. He taught us how to do business with people again in this incredibly difficult time in human history."}, {"type": "subtitle", "content": "Ensure People Don’t Blame Themselves"}, {"type": "sentence", "content": "As soon as you get made redundant — even if you’re the Rocky Balboa of a Wall Street Investment Bank, driving to work in a Ferrari — you blame yourself. Last year, when I got fired, I blamed myself. It. Hurt. So. Much."}, {"type": "sentence", "content": "I told myself: “You idiot! You did it again! How could you be so stupid?” This internal punishment in my head went on for some time. Because I wasn’t given a valid reason for being fired and there was no context or warning, the only answer I could come up with in my head was, “I must be shit.”"}, {"type": "sentence", "content": "Brian prevented this situation from playing out for his employees by ensuring they knew it wasn’t their fault, or performance, or skills that were being questioned. This might look like a small thing, but years later these redundant Airbnb employees will realize how much of a gift they have been given by Brian."}, {"type": "subtitle", "content": "Always Reflect on the Company Mission"}, {"type": "sentence", "content": "Airbnb’s mission is centered around belonging. To make people redundant hacks away at that mission with a chainsaw. Brian decided to state the obvious and tackle their mission statement head-on."}, {"type": "sentence", "content": "Every decision a company makes is supposed to be reflective of their mission statement. During a recession, the mission statement is often forgotten about and replaced with graphs of revenue going down and the number of employees needing to be fired going up."}, {"type": "sentence", "content": "It’s easy to forget those people who get fired are humans."}, {"type": "subtitle", "content": "Reveal the Decision-Making Process"}, {"type": "sentence", "content": "Often job losses are communicated by CEOs without mentioning how the decision was made. This makes the staff who are staying and the people who are leaving confused."}, {"type": "sentence", "content": "When confusion arises over job losses, assumptions are made."}, {"type": "sentence", "content": "These assumptions become a toxic culture that destroys a lot of what a company has built. That toxic culture looks like this: every man and woman for themselves. This is how you act when you don’t understand properly why redundancies occur and how people were chosen to be let go."}, {"type": "sentence", "content": "Brian revealed his decision-making process because he understands transparency breeds confidence and loyalty in uncertain times. And those two things are how you rebuild a business after a recession has brought your company to its knees."}, {"type": "subtitle", "content": "Don’t Try to be The Smartest Person in The Room"}, {"type": "sentence", "content": "Not even the smartest people in the room knows what is going to happen."}, {"type": "sentence", "content": "By talking about the uncertain future, Brian shows us that nobody knows and therefore, we’re all just as smart as each other. Rather than look like a senior leader who has all the answers, he looks like an employee that knows as much as the next person."}, {"type": "subtitle", "content": "Capture the Feelings of Customers and Employees with Your Words"}, {"type": "sentence", "content": "Brian tried to plant himself inside his employee’s heads to understand what they might be thinking and feeling. He said this about customers:"}, {"type": "sentence", "content": "“But people will also yearn for something that feels like it’s been taken away from them — human connection”"}, {"type": "sentence", "content": "Then, he captured how employees would feel about letting their work family members go with this line:"}, {"type": "sentence", "content": "“The result is that we will have to part with teammates that we love and value.”"}, {"type": "subtitle", "content": "Have a Clear Set of Guiding Principles"}, {"type": "sentence", "content": "Making a decision to fire good people who have rent and bills to pay is not easy. You can become evil in the process if you don’t have principles to guide you. Brian used these principles when firing 25% of his workforce:"}, {"type": "sentence", "content": "The human side to dealing with a recession is found in the principles you become obsessed with in the process. By knowing what he stood for, he had a measuring stick to use for every decision that had to be made."}, {"type": "subtitle", "content": "“Other companies will be lucky to have them.”"}, {"type": "sentence", "content": "This is one of my favorite lines in his letter. He assumes the people that are being let go are talented, and he hopes that other companies (even his competitors) will hire them."}, {"type": "sentence", "content": "Non-compete agreements can really delude leaders in a recession. The best talent, who get made redundant, can go to a competitor and the people left over can hate them for it and even use it against them."}, {"type": "sentence", "content": "Brian decides to drop this scarcity mindset and welcome his competitors to grab the talent he must let go."}, {"type": "sentence", "content": "He hopes other companies will benefit from his company’s loss. This is beautiful on every level. It transcends business."}, {"type": "subtitle", "content": "Make the Departed Shareholders and Keep Them Invested"}, {"type": "sentence", "content": "The employees who are let go should remain owners of the business they helped build. It’s a reflection of their hard work and a lifelong reminder of what they were a part of."}, {"type": "sentence", "content": "Giving equity to redundant employees helps them have a vested interest in the future of the company and leaves the door slightly open if they want to return one day."}, {"type": "subtitle", "content": "Help Potential Employers See Your People’s Great Work"}, {"type": "sentence", "content": "This is an unusual gift Brian gave those departing."}, {"type": "sentence", "content": "By allowing company information to be accessed by the public and future employers, he has made it easier for the staff who are leaving to be successful in interviews and have clear evidence to back up their claims."}, {"type": "sentence", "content": "Making it easier for redundant staff to get their next job is always the right thing. And doing the right thing is always the right thing."}, {"type": "subtitle", "content": "Pivot Your Recruitment Resources for the Greater Good"}, {"type": "sentence", "content": "This helping hand goes even further — it’s like Brian is trying to outdo his own compassion. I haven’t seen a CEO make a decision like this in my entire career."}, {"type": "sentence", "content": "Just reading this paragraph of Brian’s letter makes me emotional. I could have only dreamed of this support last year. This good deed will be remembered for decades to come and will make Airbnb an employer of choice in the long run."}, {"type": "sentence", "content": "Companies that truly care for their employees and show it through their actions have a huge, invisible, competitive advantage. I suspect Brian wasn’t thinking about this though when he made this offer and it came from a good place and nothing else."}, {"type": "subtitle", "content": "Give Them their Company Laptop"}, {"type": "sentence", "content": "Brian was so hardwired into the people’s minds who were leaving that he even thought about what computer they would use on their job search."}, {"type": "sentence", "content": "Knowing that a new Mac was going to cost an unemployed person a lot of money, he made the bold choice to give them their laptop."}, {"type": "sentence", "content": "That laptop with an Airbnb sticker will forever be a reminder to that person of the selfless action Brian took."}, {"type": "subtitle", "content": "Give Crystal Clear Instructions and Clarity"}, {"type": "sentence", "content": "There’s no room to assume or hypothesize in Brian’s letter."}, {"type": "sentence", "content": "His instructions are clear in his letter right down to the email subject lines people could expect to see. During a time of panic, clarity provides calmness rather than chaos."}, {"type": "subtitle", "content": "“I want to give everyone the next few days to process this”"}, {"type": "sentence", "content": "Redundancies often feel like a public execution. The axe is swung quickly and swiftly and then everybody is just supposed to file through the door on the right and go back to their working lives."}, {"type": "sentence", "content": "Brian realized that letting people go would be like mourning the death of a loved one. Giving people time to think and come up with ways to be helpful and beautiful to those leaving was yet another brave move."}, {"type": "sentence", "content": "Proper farewells and human conversations were given time to be had."}, {"type": "sentence", "content": "I remember being marched to the lift straight after I was told I was fired and being treated like a criminal who would steal choc-chip cookies from the cookie jar on the way out. This is not the way to let people go."}, {"type": "sentence", "content": "With chaos, comes conversation. It’s a good idea to make time for that."}, {"type": "subtitle", "content": "A Heartfelt, Non-Masculine, Non-Ego-Driven, Vulnerable Approach"}, {"type": "sentence", "content": "Many CEOs act like total d*cks during times of massive layoffs."}, {"type": "sentence", "content": "They say stuff they don’t mean and read letters written for them by the marketing department. They flex their ego in subtle ways and there’s no sign of a beating heart in sight. You can’t hear them let alone feel them. Vulnerability is not to be found anywhere either."}, {"type": "sentence", "content": "The CEO doesn’t tell you that they had sleepless nights or that they considered quitting or that they were in tears before the press conference. Nope. They walk around like they are heroes from a Marvel Comic Book and that everything they touch turns to gold. Like they know the future before it’s happened because their MBA says so."}, {"type": "sentence", "content": "Brian completely obliterated what a CEO looks like in this global recession."}, {"type": "sentence", "content": "Forget the corporate macho role models."}, {"type": "sentence", "content": "Brian took vulnerability, uncertainty, emotion and heart, and used it for good. Each of us has the opportunity to do the same."}, {"type": "subtitle", "content": "Honor the Fallen Soldiers through Your Example"}, {"type": "sentence", "content": "Brian treats those leaving like heroes and he celebrates them the whole way through his letter."}, {"type": "sentence", "content": "The clever way he honors them is by reminding those Airbnb employees who are staying that they must honor the legacy of those leaving. The people staying must take over the work from the soldiers who are departing and make them proud."}, {"type": "sentence", "content": "Employees that get made redundant are not losers; they are soldiers in this financial war caused by an invisible virus. Everybody must respect that."}, {"type": "subtitle", "content": "Go Back to the Past to Guide the Future (it will be a revelation)"}, {"type": "sentence", "content": "Going back to where Airbnb started was an interesting choice by Brian."}, {"type": "sentence", "content": "It’s clear that in order to understand where Airbnb could go to as a company, in the future, Brian had to go right back to the start. He shares another vulnerable and unexpected thought when he ties the mission of Airbnb back to belonging — and then he says “belonging is love.”"}, {"type": "sentence", "content": "This last line reminded me of when Elon Musk said “love is the answer.”"}, {"type": "sentence", "content": "Tech visionaries like Elon and Brian often come across as so smart and brilliant that they’re almost robot-like. Believing they have a heart or understand the core of what is at the center of humanity is easily forgotten."}, {"type": "sentence", "content": "But what gives me immense hope is that after everything Brian went through in writing this letter and watching his company be turned upside down, he came to the same revelation as Elon: “Belonging is love because love is the answer.”"}, {"type": "subtitle", "content": "He Didn’t Do Everything Right — There Is a Problem"}, {"type": "sentence", "content": "Up until this point, you might believe Brian Chesky is a perfect human being who never makes a mistake and loves everybody."}, {"type": "sentence", "content": "It’s my job to be fair when telling this story and talk about the downside too. Every leader makes mistakes."}, {"type": "sentence", "content": "What else could he have done?"}, {"type": "sentence", "content": "Well, Brian didn’t show that he was sharing any of the financial pain personally."}, {"type": "sentence", "content": "The icing on the cake would have been for Brian to give away some of his shares, or sacrifice some (or all of his) salary or take a reduction in bonus. He didn’t share the personal financial pain, only the mental pain."}, {"type": "subtitle", "content": "Final Thought"}, {"type": "sentence", "content": "Reading this letter from Brian changed the way I thought of CEOs. There are many lessons in his letter that are worth studying. The best life/career advice from experience is always found in practical examples."}, {"type": "sentence", "content": "Brian showed what it means to be human in business during uncertain times through the clever use of compassion, humanity, a sense of purpose, transparency, humility, abundant thinking, generosity, selflessness, honor, imperfection, serving the greater good, and understanding the power of love in business and life."}, {"type": "sentence", "content": "Each of these traits are tools of the trade for the modern-day person trying to make it through one of the most difficult times in history."}, {"type": "sentence", "content": "Brian’s letter to employees is leadership at its finest — take note."}, {"type": "subtitle", "content": "Join my email list to stay in touch."}], "topic": "leadership"}