{"title": "Let’s not go back: It’s time to give kids a democratic education", "data": [{"type": "sentence", "content": "Even before the COVID-19 crisis, too many youths were oppressed and not served well within our educational system. There is a constant push in our society for assimilation into the dominant culture. The current educational system doesn’t offer a place for kids that do not fit into that culture, especially those that are repressed because of socioeconomic status, ethnicity, gender identity, learning styles, or because they choose not to conform. Often these young people are pushed out of the school system — negatively impacting their identities and their long-term quality of life."}, {"type": "sentence", "content": "A democratic classroom offers a different framework for approaching education, one which fosters community and embraces inclusion. Working towards eliminating the educational and societal disparities is a highly politicized undertaking; initially, I did not center my work in the context of democracy. However, I was deeply perturbed by the re-segregation of schools in the US, over-identification of youths of color for Special Education, and they’re under-identified for Talented and Gifted programs. I am also concerned by the cutbacks (and elimination) of arts programs since we know they have a positive impact on academic, social, and emotional development."}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*RpiL5b4Z9ONZ9WosE5uY4g.jpeg"}, {"type": "sentence", "content": "Almost a decade ago, while researching alternative education, I was encouraged to take a graduate course on the philosophy behind a democratic classroom. Finally, I found a unifying theory with practical and realistic solutions to many of the issues I observed in schools."}, {"type": "sentence", "content": "In their texts about creating a democratic classroom, Art Pearl and Tony Knight (2000) describe six attributes of democracy which can be used to create an optimal learning environment."}, {"type": "sentence", "content": "• the determination of important knowledge;• the nature of educational authority;•the ordering and inclusiveness of membership;• the definition and availability of rights;• the nature of participation in decisions that affect one’s life; and• equality • They then add a seventh — an optimal learning environment made available to all students."}, {"type": "sentence", "content": "After being introduced to this educational approach, I strived to incorporate it into my teaching and encouraged other educators to do the same. I was often met with fear and reluctance because it means a radical paradigm shift in the way we think about learning. However, since schools shuttered their doors due to COVID-19, parents, students, and educators are questioning the way things have always been. It seems people are ready to explore their options."}, {"type": "sentence", "content": "What does democracy look like in the classroom?"}, {"type": "sentence", "content": "In a democratic classroom, students share control of the learning environment. They have a say in the rules, what is studied, and how learning takes place. Students have a stake in their classes — and this often translates to them being more engaged in their communities. All students have an equitable opportunity for participation. The multiple perspectives shared between students and teachers become the glue that holds the learning environment together. Students learn to value and validate each other’s voices, creating a dynamic learning environment, which builds a sense of community and brings out students’ cooperative nature."}, {"type": "image", "content": "https://miro.medium.com/max/9986/1*VuGi1VkRRiIJWd9rvvOVVQ.jpeg"}, {"type": "sentence", "content": "What are some results of a democratic approach to education?"}, {"type": "sentence", "content": "Students get excited about learning, develop critical thinking skills, gain a sense of autonomy, and become self-managed, independent learners. Instead of feeling like school is drudgery, learners report having favorable views of education. Teachers let go of the reins and become active partners empowering students to follow their interests and discover and reach their potential. This cooperative learning process keeps teachers and students excited and engaged and creates positive relationships!"}, {"type": "sentence", "content": "How is the COVID-19 crisis changing ideas about schooling?"}, {"type": "sentence", "content": "Many parents are sharing with me that they are rethinking the purpose of school. They are seeing their kids get excited because they have more time to explore their interests. Many youths who weren’t thriving in the traditional school setting are saying they don’t want to go back. They want to do something different. The economic crisis is stimulating existential discussions about the meaning of life."}, {"type": "sentence", "content": "Is getting a good job and making money really what life is all about?"}, {"type": "sentence", "content": "Too often, the end goal for schooling is couched by educators and parents as “what kind of job do you want?” Getting a job, in and of itself, is not generally a motivator for youth. Therefore, it is not enough for schooling to simply focus on steering kids towards employment. We must also focus on their quality of life (now and in the future)! They are thinking about it!"}, {"type": "sentence", "content": "We should be empowering young people to discover what makes them happy, how they can contribute to their families and communities, and be successful (as defined by them). There is a tremendous amount of uncertainty in the world today; young people are the ones inheriting the problems that previous generations have created, their voices, concerns, and ideas must have a forum where they can be expressed, and solutions can be designed."}, {"type": "sentence", "content": "That forum should be the foundation of their educational experience. How can we expect young people to be self-determined and ready to manage big problems if we don’t give them space to explore, be creative, take risks, and think for themselves?"}, {"type": "sentence", "content": "Continue the conversation in the Facebook group Allies for Teens and Young Adults."}, {"type": "sentence", "content": "References:"}, {"type": "sentence", "content": "McCluskey, K., Treffinger, D., (1998). Nurturing talented but troubled children and youth. Reclaiming Children and Youth, 6, 215–219."}, {"type": "sentence", "content": "Knight, T., Pearl, A. Democratic Education and Critical Pedagogy. The Urban Review 32, 197–226 (2000). https://doi.org/10.1023/A:1005177227794"}, {"type": "sentence", "content": "If you enjoyed this article you might also enjoy:"}], "topic": "education"}