{"title": "The Ways in Which Managers Can Be Heroines and Heros as Their Employees Return to Work.", "data": [{"type": "subtitle", "content": "And, can potentially help slow the spread of COVID-19 along with it. Bad-ass bosses, here they come!"}, {"type": "image", "content": "https://miro.medium.com/max/11520/1*3kVMzkImrzQdEd2_02AUEQ.jpeg"}, {"type": "sentence", "content": "There are several ways that managers can do a world of good for both, their employees and for the fight against dissipating COVID-19 on a larger scale."}, {"type": "sentence", "content": "The first would be remembering that just because our lunatic President has pushed and authorized “re-opening” everything (which is happening as we speak), does not mean that is the right thing to do for people’s health, wellbeing, nor for slowing the spread of Coronavirus. In fact, it is almost certainly the opposite. Numerous health experts and researchers the world over have said so. That opening things now is going to be a grave mistake and one that is likely to result in far more unnecessary sickness and death (as opposed to if we waited longer)."}, {"type": "sentence", "content": "Thus, the first thing managers can do for the safety of themselves and their employees is to remember and keep this at the forefront of their minds."}, {"type": "sentence", "content": "Following (and in connection) with that, one central way of honoring such knowledge is that, assuming your employees can generally do their jobs from home? Encourage and let them continue to do this. In the last couple of months, we’ve seen that a boatload of work roles can be done remotely (which we hadn’t necessarily thought possible prior). Let this endure for the immediate future. It’s a gesture that showcases your concern for the health and welfare of others, as well as, a sense of flexibility and adaptability. It also makes obvious a sense of trust you have in your employees."}, {"type": "sentence", "content": "Basically, all around, it’s a good thing. Continuing remote work for everyone that can do so."}, {"type": "sentence", "content": "If employees must ride public transportation in order to get to work, this presents another danger for the individual, as well as their colleagues. Sure, public transportation will (supposedly) be more carefully cleaned, but who knows how much this protects us further? And “cleaner” is a relative term. What exactly does that mean? How clean? Regardless, people riding buses and trains are more likely to catch the virus than those who have the luxury of a car or who have enough excess funds to shell out for regular Uber rides."}, {"type": "sentence", "content": "This can result in them bringing the virus into the office unknowingly and spreading the disease to others, or, in getting quite sick themselves. Thus, allowing people to work remotely keeps both, the workplace sparsely populated and lowers these risks when people aren’t forced into making the trek via public transport."}, {"type": "sentence", "content": "Letting people opt-out of making that journey every single day can also help free up otherwise clogged roadways, as well as crammed trains and buses. When we remove workers from the commuting pool, this makes it easier (read: faster) and less tightly packed for everyone else. If all managers did this, it would have a trickle-down effect that would improve things for everyone in the city."}, {"type": "sentence", "content": "Another method of doing this is staggered schedules. Allowing people to shift their working hours and not being rigid about such a thing (maybe they work part of the day in the office and are allowed to leave early and can finish out the day remotely). This lets people travel off-peak hours, it doesn’t keep them sitting in an office when they don’t really need to be there (past peak, productive, necessary hours), and it’s better for commuters and health protection all around."}, {"type": "sentence", "content": "These are not backed by any sound logic. Of course, some professions require people to be on-site to do their work. A few examples include surgeons, doctors, garbage collectors, bakers and chefs, lawyers, and police officers. A lot of jobs, however, do not. Vast numbers of offices that we pack full of people who sit, hunched over in cubicles, typing away on a computer all day, do not actually need to be there. They could just as easily do the work from their homes."}, {"type": "sentence", "content": "In fact, our country’s strict working day hours result in clogged roadways, longer commutes for all, and larger crowds at the same times each day. All, very bad things to have to navigate during a pandemic. And, inefficient, bad things for our city’s general livability."}, {"type": "sentence", "content": "Permitting employees to have more flexible working days (remote work and staggered hours) also contributes toward goodwill between managers and employees. One employee told HBR that having his manager offer a flexible work schedule struck him as “a huge recognition.”"}, {"type": "sentence", "content": "What’s more, flexible schedules can also make people more productive, since working on their terms allows ideas to flourish, rather than just watching a clock until it’s time to go home."}, {"type": "sentence", "content": "And, allowing employees more freedom cultivates a sense of trust. That trust tends to lead them to give back smart, consistent, better work."}, {"type": "sentence", "content": "One last crucial thing that great managers will do? Assume that, because we are “opening things up” WAY before we should (every researcher and health expert with half a brain has said this many times over), this is going to result in many more people getting quite sick. Meaning, there is a high chance that some of your employees will get ill with COVID in the coming weeks and months."}, {"type": "sentence", "content": "In which case, you should step up then and offer them the protections our Government is failing to give its citizens, which is job protection, and a paycheck for the duration of while they are out sick. This might be one of the greatest gifts you could offer someone if the time comes when they need it."}, {"type": "sentence", "content": "Truly excellent managers will be understanding, empathetic, and leading the pack with regards to thought-processes and behaviors such as these."}, {"type": "sentence", "content": "Lastly, it’s a show of good faith, trust in, and respect toward your employees, allowing them a degree of autonomy and control over their workday. It’s a display of your value in them. And this type of thing bodes well for a long-term employment relationship. It results in employees far more likely to continue wanting to work for you. Many employees are going to feel far happier, less distressed, and more satisfied in allowance to work remotely when they might wish to (or, flexibility and respect toward their working day in other regards). It also lends a sense of treating your employees like autonomous adults, rather than, in a sense, children who need to be supervised by their superiors."}, {"type": "sentence", "content": "Now is the time, if ever there was one, to become far more flexible as managers and think outside the box. To move forward, not at the direction of our dysfunctional and sociopathic Government, but with the welfare and health of your employees in mind, as well as, wanting to do everything you can to help your employees feel safe and respected. This is the mark of an emotionally mature, intelligent, fantastic manager."}, {"type": "sentence", "content": "For more on what makes a marvelous manager, COVID adjustments aside, take a read through this article from the Harvard Business Review on the topic."}], "topic": "leadership"}