{"title": "The Halt of a Breath", "data": [{"type": "image", "content": "https://miro.medium.com/max/6000/0*55MxV6i_GeRfEZ_4"}, {"type": "subtitle", "content": "Inhale, exhale, lungs fill, lungs deplete, hold, release, live, die"}, {"type": "sentence", "content": "The notion of *time disappears*and you become what you do."}, {"type": "sentence", "content": "I only repeat what’s so radically divine and almost incomprehensible. Might you feel the same? When you hold your breath, you literally are altering the body’s response to: oxygen consumption, heart rate, blood pressure, muscle tension, breath allowance, thoughts and imagery. Instead of wondering if you need to tackle on the question of fight or flight based on rapid breathing due to the so-called emergency response, your body wills itself to calm until it’s reached the point of stillness — entering the parasympathetic response — when slowing your breaths and then, halting them altogether by holding them whilst your lungs are full."}, {"type": "sentence", "content": "But of course, our bodies aren’t always responding to emergencies, and sometimes our bodies are even confused as to what dictates the call for the emergency response. An example? Back before we had grocery stores and the ease of shopping around for food, us humans had to fend for ourselves, whether we were farming or hunting or even, gathering. What if a bear were to intercede on man’s hunt? Well, fight or flight response kicked in, and he was forced to make a decision and fast! But now… now, we have it quite easy in terms of food. We go to the store, walk the aisles, try to avoid contact with other humans — lest we get the newly spread coronavirus — and try to decide which brand of oats to get. Not only which brand, but what type: rolled, steel-cut, organic, quick, whole, chopped? The options are nearly endless, and too many choices can seriously stress the body, even if it is just deciding which fucking oatmeal to buy. In either situation (a bear, or too many choices of oatmeal) though, our bodies begin to enter panic-mode, forcing our breaths to become more rapid, our heart beats to quicken pace, our sweat to exude from our pores profusely, our oxygen supply to limit itself."}, {"type": "sentence", "content": "Most humans don’t know how to react to such involuntary (I say involuntary, because in times of emergency, our bodies respond as if on auto-pilot — sometimes at a level in which we aren’t even aware) responses, so they allow their breaths to become shallow and rapid, exposing them to the life-threatening force we like to call stress."}, {"type": "sentence", "content": "But have no fear, nor stress for that matter, because there is an answer, and it’s quite simple:"}, {"type": "sentence", "content": "Holding your breath not only negates the body’s response to emergencies, but it also reverses the body’s response to that once critical question of fight or flight. We alone have the power to calm our bodies to the point of tranquility, as if we are floating in water, devoid of thoughts, senses, emotions, awareness. But the ironic thing is… we aren’t devoid of any of those things in actuality; instead, we are more cognizant of our thoughts, senses, emotions, awareness. We more properly understand our situation at hand when we simply hold in our breaths, but not just in times of crises. We can also train our bodies to better handle emergencies, albeit most emergencies these days aren’t actually emergencies, when they arise by developing breathing techniques into our routine of life."}, {"type": "sentence", "content": "Before learning to properly hold your breath, it’s crucial to first learn to properly inhale and then, exhale, according to your body’s physical and even mental capacity. To learn more about the art of breath-holding, please visit Nicklas Johansson’s page as a reference and guide."}, {"type": "sentence", "content": "Holding the breath alters our perception of time because it opens our awareness to that of a yogi. Rather than focusing on our past, our future, our courses of action that we can no longer change, our upcoming scheduled events that are noted on the calendar, we instead focus on the now, completely wrapped up in the moment at hand, serenely soaking up all of our surroundings and experiences and thoughts and thus, perceptions of the current situation. We are no longer anything but ourselves, following the path of the words: I am. No more words to follow I am."}, {"type": "subtitle", "content": "It’s not: I’m stressed, because you aren’t stress. It’s: I am, because you are."}, {"type": "sentence", "content": "Now, it’s I am."}, {"type": "sentence", "content": "So we inhale, filling our lungs and holding our breaths, as we live.Then we exhale, depleting our lungs and releasing our breaths, until we die…until life as we know it, has stopped completely, and we no longer are."}, {"type": "sentence", "content": "We alter our perception of time as we hold our breaths, re-gaining control of our inner calmness that would otherwise be suppressed, buried to the point of almost no return, until we resuscitate our desire to live, urging us to find the awareness of the moments passing by us like the hands on the clock — never stopping, always flowing. It’s when we enter that flow state that all else seems to stop, muted in the background of our momentous now, giving us free reign over the remarkable present, to which we are attentive, appreciative, aware. We become what we’ve always been: ourselves."}, {"type": "sentence", "content": "And much like the human bodies that can hold their breaths to fulfill that yearning of wanting to feel utter bliss, the universe too, can learn to hold its breath and then, stop life altogether, stopping us."}, {"type": "sentence", "content": "According to Ted Chiang, the universe’s breath allowed us humans to be alive, having full range over our thoughts and even, time. But like the constant flow of air in our bodies maintaining our livelihood, the universe too must eventually allow its flow of breath to stop, ceasing the existence of humans, thoughts, and thus time."}, {"type": "subtitle", "content": "Inhale, exhale, lungs fill, lungs deplete, hold, release, live, die."}, {"type": "sentence", "content": "This is the cycle of flow, of time, of perception, of experiences, of life itself."}, {"type": "sentence", "content": "So live fully and learn to halt your breath once in a while, because the moment we have right now is all we have. And the breaths we allow to enter our body and then, leave us, allow us the honorable awareness to appreciate time and what it has to offer us now, as we breathe in and breathe out and laugh and cry and jump and lie and play and rest and live and then, die."}, {"type": "sentence", "content": "The universe too, must eventually die, and with it us. But we’re alive now, and that’s quite possibly the only thing that matters in this weird time-space continuum in which we all live."}, {"type": "sentence", "content": "Remember: I am, because we are."}, {"type": "sentence", "content": "And you alone control your notion of time, and I, mine."}, {"type": "sentence", "content": "Natalie Maddy writes about dark inspirations, digging through the filth of the world to unveil its beautiful truths — in forms of abstract, fantasy, and bewilderment. She is the author of: The Reddest Rose Bleeds the Deepest."}], "topic": "mindfulness"}