{"title": "Why Spotify Wants You To Watch Videos", "data": [{"type": "subtitle", "content": "It’s trying again to tackle videos in 2020"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*6UwF6w2RveUxhxdi"}, {"type": "sentence", "content": "Spotify has become a household name as a music streaming service that rivals Apple Music."}, {"type": "sentence", "content": "Founded in 2006 in Sweden, it has built into an international organization with a footprint expanded into 81 countries worldwide."}, {"type": "sentence", "content": "Recently, however, Spotify will start experimenting around video podcasts. This has started with reports it will let Youtube stars Zane Hijazi and Heath Hussar (two youtube celebrities who host Zane and Health: Unfiltered) upload a few videos to accompany the podcast episodes. These will sync with the audio feed and continue playing even if listeners lock their phones."}, {"type": "sentence", "content": "Additionally, only half the show’s audience will see the video footage, most likely a test from Spotify to see the reception of the videos."}, {"type": "subtitle", "content": "This isn’t the first time Spotify has tried to do video"}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*5aTbyrqSGIHblGYh.jpg"}, {"type": "sentence", "content": "For those that might remember, Spotify used to have video."}, {"type": "sentence", "content": "It didn’t last long, however, and closed down in 2017."}, {"type": "sentence", "content": "One of the key reasons was to give Spotify more control over user interactions with the app. Historically, when using Spotify, you simply press play, and it becomes just a background application. It wanted to tackle this by introducing video to help create attention but also to add video advertising products most likely."}, {"type": "sentence", "content": "Since then, Spotify has been doing small tests, including looping videos for specific music clips. It also acquired The Ringer and other podcast platforms to solidify its position within the industry."}, {"type": "sentence", "content": "It seems like Spotify is ready to hit the video market once again and this time with more presence."}, {"type": "subtitle", "content": "So why does Spotify want to do video?"}, {"type": "image", "content": "https://miro.medium.com/max/1472/1*8cyeH8kS4SJs87cNcJm1_g.png"}, {"type": "sentence", "content": "As an audio streaming application, why would Spotify want to get into the video space with apps like Youtube and even TikTok dominating the industry?"}, {"type": "subtitle", "content": "Higher revenue margins"}, {"type": "sentence", "content": "One of the reasons Spotify is looking to explore video is to increase advertising revenue, primarily since the majority of its users use the free version of its service."}, {"type": "sentence", "content": "As mentioned previously, Spotify wants your attention, and video is one way of doing this."}, {"type": "sentence", "content": "This will help boost revenues, especially with higher costs associated with advertising via video services. Additionally, original video shows won’t encounter the same kind of royalty and distribution costs that the music industry usually has."}, {"type": "subtitle", "content": "The growth of podcasts (video and audio)"}, {"type": "sentence", "content": "It’s been obvious lately that Spotify has been focusing heavily on podcasts. Since buying Gimlet and Anchor in 2019, it has doubled down on this industry with good reason."}, {"type": "sentence", "content": "Podcast advertising revenue is tipped to hit a billion dollars by 2021 with a 65% CAGR (Compound Annual Growth Rate)."}, {"type": "image", "content": "https://miro.medium.com/max/2314/1*Bok7P4SgubdUBfrbKVaVwA.png"}, {"type": "sentence", "content": "Spotify has even made a move around specific shows, recently buying exclusive rights to the Joe Rogan Experience podcast. The WSJ cited that from its anonymous sources, it was tipped that the deal was worth well over the $100 million mark."}, {"type": "sentence", "content": "This means Spotify is ready to make a serious impact in videos, utilizing podcasts as a gateway into the market."}, {"type": "subtitle", "content": "The video industry is bigger than music streaming"}, {"type": "image", "content": "https://miro.medium.com/max/11850/0*qnZVPeoVU2A0dO8-"}, {"type": "sentence", "content": "The global music industry topped out at $20.2 billion in revenue in 2019, with growth slowing down tremendously for streaming services by $500 million. This number combines both video and audio, which means audio alone is only part of the total number."}, {"type": "sentence", "content": "In comparison, Youtube generates over $15 billion in 2019, while Netflix hit the $20 billion mark. Additionally, between 2020–2024, it is estimated the video content market will grow by $41.54 billion."}, {"type": "sentence", "content": "These figures alone paint the picture on why Spotify is looking to get into this space. With podcasts achieving incredible growth rates right now, Spotify is looking to invest heavily in the next few years to capitalize on the situation."}, {"type": "subtitle", "content": "Spotify looks ready to take on the video industry"}, {"type": "sentence", "content": "With substantial investments in recent years, Spotify is looking to expand beyond its music streaming services."}, {"type": "sentence", "content": "With COVID-19, content consumption has skyrocketed, and Spotify wants to be in the center of all of this."}, {"type": "sentence", "content": "Unlike 2016–2017, this time, it looks like it will be making some headway, especially with the larger footprint into the video podcast industry."}], "topic": "business"}