{"title": "The Art of Being Me", "data": [{"type": "subtitle", "content": "PERSONAL ESSAY | LIFE LESSONS | PERSONAL GROWTH"}, {"type": "sentence", "content": "Being by myself has brought me tremendous happiness and personal growth, and it has helped me reach “me.”"}, {"type": "sentence", "content": "There was a time when I used to look at those blissfully in love couples and feel depressed. There was a time when I used to feel that I will never find someone to love me. There was also a time I thought that I was never capable of receiving love, even from myself."}, {"type": "sentence", "content": "But, all this is history. My history. A chapter of the book of my life, which is now over. I have written it, read it, and now I am completely done with it. Now I am on a much better chapter writing with a new pen."}, {"type": "subtitle", "content": "I have started loving myself. And, that is a big achievement, if you are not well-versed in the art of love and life. Loving myself is the biggest gift that I have ever given myself."}, {"type": "sentence", "content": "When I used to think that I am incapable of receiving love, the thought stemmed from my inability to love myself. My insecurities were dragging me down."}, {"type": "sentence", "content": "I had been through a life-threatening event and the consequent traumatic experience which led to my weight gain. I was overweight and used to think that I looked “ugly.” And, that is the same thing I expected others around me to think, too. I was afraid of interacting with boys at that time because I used to think “Why would they ever like spending their time with me?” I am not pretty like the other girls. I am the “fat” one. That was the teenage me thinking about what teenage boys thought! So, you understand where this was coming from."}, {"type": "sentence", "content": "Movies and TV shows also did not help at all. The way they portrayed plus size girls and women surely did put a dent in my confidence. The “fat girl” would never get a guy. The “fat girl” would never be thought of as attractive. The “fat girl” would be laughed at. The “fat girl” would never have a boyfriend who would love her. The “fat girl” would never be shown as successful in life. The “fat girl” would always be the side character and never the heroine."}, {"type": "subtitle", "content": "So many people do not realize the impact of their words. Sometimes, I am baffled at their ignorance. How can you not realize that your words and actions can be hurtful?"}, {"type": "sentence", "content": "I have been hurt by similar words and actions myself. They came from those close to me and also from those who didn’t know me. When I was 19, I was focused on my education and getting my Bachelor’s degree. That was also the time my anxiety and panic attacks started. My therapist told me they stemmed from my earlier trauma."}, {"type": "subtitle", "content": "I don’t know how many people truly understand anxiety and what happens in a panic attack."}, {"type": "sentence", "content": "Statements like “Oh, I just had an anxiety attack!” or “I get anxious, too. It’s no biggie!” are made so casually, that it makes me scream out in frustration. Anxiety robs you of all your confidence, every last bit of it. It makes you scared of living with yourself. It makes you scared of being alone. It makes you scared of being scared."}, {"type": "sentence", "content": "No one, apart from those who truly experience anxiety and panic attacks, will ever understand the wave of despair that these conditions bring at their onset. My onset period was excruciatingly difficult for me to deal with. I found it difficult to breathe, to be by myself, and I was deathly afraid of dying. That was also the time I had started college. Most of those days I focused only on my studies to overcome these feelings."}, {"type": "sentence", "content": "I excelled at academics, but it took a lot out of me. Focusing on my academic work while consciously working on my distorted cognitive thinking simultaneously, although took a lot of effort, it also gave me the gift of empathy. My being a student of psychology truly helped."}, {"type": "sentence", "content": "I learned a lot about mental health struggles and what goes in the mind because I experienced it first hand. My own life experiences contributed to my professional expertise and my confidence in myself. These factors coming together helped me to start loving myself. But it didn’t happen overnight. It took me some 20 years to achieve it."}, {"type": "sentence", "content": "Meanwhile, I completed my Master’s Degree with distinction or all grade A’s. I was over the moon. After all those thoughts of “I am not good enough,” I had proof that I am capable of doing what I am meant to do. I started my first job within a few months. That was my turning point."}, {"type": "sentence", "content": "The independence and confidence that I got from this job were tremendous. I was helping people. I was helping people overcome their challenges, just the way I wished someone would have helped me when I was young. That gave me immense satisfaction and pride in what I was doing with my life."}, {"type": "sentence", "content": "I helped people understand that they can learn to rely on and believe in themselves. That this works. You need to put in the effort and a few tears, or maybe lots. But, you do come out stronger."}, {"type": "sentence", "content": "I still love working in my field (psychology) and I am now working on the positive side of it — focusing on what’s best in an individual and enhancing it from a young age (positive psychology). I am in a much better place, with 7 years of professional career under my belt. I have struggled at times, but there has been more personal growth and resilience in this decade. I have worked on my anxiety majorly by myself and some with professional help, and have made tremendous progress in managing it — almost 90%. That’s a big number, by the way!"}, {"type": "subtitle", "content": "I have found that I am happier when I am by myself."}, {"type": "sentence", "content": "When I was having a panic attack, there was no one else who could help me through it. It was me. It was always me. I was my coach. I was my guide. I was my therapist. I have been there for myself through the good and the bad. And, I have fallen in love with myself during this process."}, {"type": "sentence", "content": "Being by myself gives me a kind of happiness where I get to be completely me and do the things I want. I have not yet found someone whom I love and who loves me. But, this does not make me depressed anymore. It has allowed me to be by myself and made me enjoy my time with myself. It has given me time to understand, grow, and love myself, first."}, {"type": "sentence", "content": "I have learned languages, read books, followed my passions and dreams. I have coffee dates with myself while reading a book in a cafe. That’s one of the most peaceful things I have done. I have learned driving. Yes, I learned late, but, I have learned! I have found that I am good at poetry. I have written quite a few pieces here on Medium. I cook. I paint. I sing."}, {"type": "sentence", "content": "I spend time engaging in kindness and spreading hope at random times with random people. I never let anyone around me put themselves down in any way. I have learned to be an encourager. That’s what I have been taught by my life lessons."}, {"type": "sentence", "content": "I have fallen many times, but I have picked myself up, always. I didn’t need another hand to help me emotionally. I was there for myself."}, {"type": "sentence", "content": "If I meet someone and fall in love with him, it will be a love that will stem as a by-product of my self-love. I will love someone with all their imperfections because I do the same with me. I know perfection doesn’t exist. There are challenges in every relationship and when it does come my way, I will face those challenges like I have always done before."}, {"type": "sentence", "content": "Till then, I am happy to love myself. I am happy to be with me and learning more about myself. I am happy growing from all the pain that had scarred me in the past. The physical ones that left visible scars and the psychological ones that left invisible scars. I have learned to live with them and show them off as my badges of courage, growth, and resilience."}, {"type": "subtitle", "content": "They always say that before loving someone else, you should be able to love yourself. I do not completely agree with this statement, even though, in my case, it has been that way."}, {"type": "sentence", "content": "Many people find growth through love received by someone else and that is also something to applaud and appreciate. It’s alright if you are still unable to love the parts of yourself that you deem unlovable. I understand that it is not easy and our minds never make it easy for us."}, {"type": "sentence", "content": "I will just say, grab on to any love that comes your way. Whether it comes from your partner, your parents, your friends, your grandparents, your sibling, your child, or yourself. Love is precious and it is a part of yourself. Don’t cut it off. Let it enter and fill you up to the extent that it overflows and reaches someone else who might require it."}, {"type": "subtitle", "content": "So, to sum it up. These are the lessons I have learned by the art of being me:"}, {"type": "subtitle", "content": "1. I can love myself without being selfish:"}, {"type": "sentence", "content": "Yes, you can love yourself. You can put yourself first. You can be assertive. You can give yourself a break. You can be kind to yourself. And this doesn’t necessarily mean that you are selfish."}, {"type": "subtitle", "content": "2. It takes time, but it’s worth the effort:"}, {"type": "sentence", "content": "It is not an easy path. You struggle a lot and fall. Many times there won’t be a hand reaching out to help you. But you will gradually learn that sometimes you may not need that hand. You can do it all by yourself."}, {"type": "subtitle", "content": "3. You will feel like giving up, but please don’t:"}, {"type": "sentence", "content": "Giving up will seem so attractive and comfortable. You will many times feel like hanging up your boots. But please don’t do it. It might take a lot of time and a lot out of you, nevertheless, you keep going. Because that destination, that unreachable place, does exist."}, {"type": "subtitle", "content": "4. Find meaning in life:"}, {"type": "sentence", "content": "What are the things that give you immense satisfaction after doing them? Those things are likely to give meaning to your life. Find them and pursue them. Make them a part of your day. For me, it has been psychology and writing. Especially, when my counseling guides someone to cope better and my writing resonates with someone and gives them hope."}, {"type": "subtitle", "content": "5. Don’t be afraid of being alone:"}, {"type": "sentence", "content": "This is important. You need to be able to live with yourself. That means enjoying the time when you are alone. A lot of things can be done and accomplished when you are by yourself. You can learn things that you never thought you would be able to. And that will give you immense confidence in yourself."}, {"type": "subtitle", "content": "6. Keep believing in all things magical, romantic, miraculous:"}, {"type": "sentence", "content": "I am a romantic at heart. I romanticize many things in life. Initially, I used to feel silly about thinking this way. Many say that it is being unrealistic. But what is truly real? Nobody knows. So why not spend your time believing in things the way you want them to be? Beautiful, magical, full of miracles, and made of life and soul. I am getting this one chance at life. And I am going to spend it on believing things that make me feel good and give meaning to my existence. That’s the lesson I have learned from my pain."}, {"type": "sentence", "content": "This was the art of being “me.” Do you want to share the art of being “you”? Please do! And tag me if you write one. I would love to read it!"}, {"type": "sentence", "content": "Dipti Pande is a psychologist. She has an inclination toward positive psychology — that believes in enhancing what is best in an individual. She loves writing poetry that uplifts and has optimistic undertones. She is a firm believer in personal growth."}, {"type": "sentence", "content": "She is an editor at Illumination and Polyglot Poetry."}, {"type": "sentence", "content": "Connect with her on Twitter Instagram & Facebook"}], "topic": "mental-health"}