{"title": "The Day Mike Moved Out", "data": [{"type": "subtitle", "content": "On June 6th, 2019, Mike decided he was going to leave his wife and kids."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*8jTvvnrZiGHcFubfbl_Ntw.jpeg"}, {"type": "sentence", "content": "On June 6th, 2019, Mike decided he was going to leave his wife and kids. Technically he decided three months prior when he signed an apartment lease. But on Friday, the morning of June 6th, as Mike squirted shaving cream onto his face and slid his razor down the white sheath, like a snowblower clearing the sidewalk, Mike knew. Today had to be the day."}, {"type": "sentence", "content": "June 6th in Mike’s kitchen looked no different than June 5th. His wife, Theresa, wore a faded Led Zeppelin t-shirt, a souvenir from the first concert she and Mike attended together, except now dried vomit stained the sleeve. She didn’t look up when Mike entered, but the two hardly interacted since Mike relocated to the guest room. Theresa’s sandy hair sat on her head like a bird’s nest as she rocked Joey, their crying, eight month old son. The baby’s beady eyes pierced Mike’s, like he had a premonition to Mike’s plans."}, {"type": "sentence", "content": "Mike rotated towards the counter. He stared at the hand-woven fruit basket, one of their wedding gifts. Theresa used to bake the overripe bananas into a succulent bread. These days the fruit rotted until flies buzzed so loudly that Mike tossed the whole bunch."}, {"type": "sentence", "content": "Across from Theresa sat Tommy, the couple’s ten year old son. He swirled his spoon around his frosted Cheerios and milk, peering into the bowl like it contained life’s secrets. Maybe it did. Tommy didn’t speak much, and when he did, he referred to himself in third person. Tommy was simple — he cleaned his room and went to bed when he was told — but Mike couldn’t understand him. One time he brought Tommy to a baseball game. The boy seemed to have fun; he feasted on cracker jacks and in the gift shop, said “Tommy would like a pack of baseball cards.” That night he borrowed Mike’s scissors to lobotomize the players and reglue their limbs onto new bodies."}, {"type": "sentence", "content": "“Have a great day at school, buddy,” Mike said, ruffling Tommy’s hair. “I’ll see you after work.”"}, {"type": "sentence", "content": "Theresa finally looked at Mike. “Pick up some diapers before you come home. We’re running low.”"}, {"type": "sentence", "content": "“Got it,” Mike mumbled, grabbing an oat bran muffin before he left the kitchen. He swung his briefcase over his shoulder and locked the front door behind him. Mike bit the muffin, recoiling as the dry flour sandpapered his esophagus. He should’ve expected it was expired."}, {"type": "sentence", "content": "June 6th was the fastest work day of Mike’s life. His boss still reeked of tuna fish and slammed Mike with weekend assignments, but the weight of Mike’s impending decision hit him like a bulldozer. Mike stayed overtime; he alphabetized his file cabinet, sharpened thirty pencils, and dusted every cubicle, but procrastination wouldn’t exempt him from the evening’s dreaded conversation. The sun lowered, like a cookie in milk, as Mike began his hour-long commute home. His new apartment was only ten minutes away."}, {"type": "sentence", "content": "June 6th in Mike’s den looked no different than June 5th. The TV illuminated Tommy in the dark, his wide eyes glued to the screen as he ate mac and cheese. Mike tiptoed into the room and sat beside Tommy on the couch. Theresa sat on the opposite end, next to the bassinet where Joey slept. Mike wondered if Theresa cooked herself dinner. He knew better than to ask; she rarely saved him a portion when she did. It wouldn’t matter after today, anyway."}, {"type": "sentence", "content": "Tommy cackled as a cartoon rabbit drooled onto a carrot. Tommy had watched this movie over ten times, but each time he laughed as hard as he did during the first. Mike wondered why adults couldn’t maintain that same spirit. Why did life’s magic dull into monotony?"}, {"type": "sentence", "content": "He glanced at Theresa. She stared at him, probably curious why he sat with them, but averted her gaze when Mike’s eyes met hers. The three hadn’t watched a film together since Tommy was six. Mike and Theresa used to bring their bedroom comforter to the couch and snuggle Tommy like seals protecting their young. Mike’s stomach growled. The movie faded to black and the credits rolled onto the screen. Mike turned off the TV and cleared his throat."}, {"type": "sentence", "content": "“There’s something I need to tell you,” he said, looking at no one in particular. He turned towards Tommy."}, {"type": "sentence", "content": "“I’m moving out.”"}, {"type": "sentence", "content": "For a minute there was no sound other than the ceiling fan, until Theresa spoke."}, {"type": "sentence", "content": "“What?”"}, {"type": "sentence", "content": "“I’m moving out,” Mike repeated. “Tonight.”"}, {"type": "sentence", "content": "“What do you mean, you’re moving out?”"}, {"type": "sentence", "content": "“I’m leaving,” Mike said slowly, enunciating each letter like a child learning how to read, “I’m moving into my new apartment. Tonight.”"}, {"type": "sentence", "content": "“New apartment?” Theresa shrieked, standing, “What do you mean, new apartment? What’s wrong with you?”"}, {"type": "sentence", "content": "“You knew this was coming,” Mike said calmly, but his voice quivered."}, {"type": "sentence", "content": "“What about our family? You’re going to leave the children?” Theresa screeched, her face turning scarlet."}, {"type": "sentence", "content": "“I still want to be in their lives.”"}, {"type": "sentence", "content": "“You can’t be. If you walk, you can’t. You can’t have both.” Her forehead vein throbbed. Joey started crying."}, {"type": "sentence", "content": "Mike looked at Tommy. The last time his son wore that expression was at the playground, when Tommy fell off the monkey bars and ran to Mike’s bench. “Tommy wants to go home.” The boy burst into tears as soon as he entered the car."}, {"type": "sentence", "content": "“I’m sorry. I never wanted it to be this way,” Mike’s voice cracked."}, {"type": "sentence", "content": "He looked at his wedding photo on the wall, waiting to feel trepidation."}, {"type": "sentence", "content": "Nothing."}, {"type": "sentence", "content": "“You’re ruining this family!” Theresa grabbed the fern off the coffee table and chucked it at the wall. The ceramic pot smashed into the photo; glass and dirt rained into the carpet like confetti."}, {"type": "sentence", "content": "Joey bawled. Theresa screamed. Tommy threw up his mac and cheese."}, {"type": "sentence", "content": "Mike left the house."}], "topic": "fiction"}