{"title": "An Engineered Virus Could Cure Color Blindness", "data": [{"type": "subtitle", "content": "Reengineering Life"}, {"type": "subtitle", "content": "Scientists are testing gene therapy in people who see in monochrome"}, {"type": "sentence", "content": "Reengineering Life is a series from OneZero about the astonishing ways genetic technology is changing humanity and the world around us."}, {"type": "sentence", "content": "People with total color blindness see the world in monochrome — black, white, and shades of gray."}, {"type": "sentence", "content": "The rare disorder also makes people sensitive to light and reduces the sharpness in their vision. There is currently no cure for it — or even for the more common types of color blindness, which affect only certain colors. But in the future, a one-time treatment known as gene therapy could help these people see in technicolor."}, {"type": "sentence", "content": "In a small trial in Germany, an experimental gene therapy improved the vision of nine people with total color blindness, also known as known as achromatopsia. After receiving the gene therapy, the eight men and one woman in the trial could see some color, as well as more letters on a vision chart."}, {"type": "sentence", "content": "Developed by researchers at the Ludwig Maximilian University of Munich and University Hospital Tübingen, the therapy, which involves a genetically engineered virus, is designed to correct a defect in a gene known as CNGA3. Mutations in this gene are responsible for about one-third of all cases of total color blindness."}, {"type": "sentence", "content": "Gene therapy uses viruses because of their natural ability to get inside cells. The viruses are modified, however, so that they can’t cause infection, and they’re also engineered to carry healthy copies of a gene to compensate for a mutated one. In this case, the scientists in Germany inserted normal copies of the CNGA3 gene into the engineered virus particles. The hope was that the healthy version of the gene would correct the eye’s cone cells, which are faulty in people who are color blind."}, {"type": "sentence", "content": "Each of the participants received an injection of the drug in one eye — their worse one — then waited a few weeks for it to take effect. Though the study was mainly intended to test the safety of the approach, the researchers found that the therapy improved vision somewhat in terms of focus, contrast, and color vision. The results were published on April 30 in the journal JAMA Ophthalmology."}, {"type": "sentence", "content": "For years, scientists have imagined gene therapy as a way to correct red-green color blindness, the most common type of color vision deficiency, in which people have trouble distinguishing reds from greens. About one in 12 men have this kind of color blindness."}, {"type": "sentence", "content": "In 2009, researchers had a breakthrough when they cured red-green color blindness in adult monkeys using gene therapy, but there have not been clinical trials yet for gene therapy that aims to correct this type of color blindness on humans. Instead, researchers have focused their efforts on trying to cure the more severe achromatopsia. These trials, which use a similar approach as the one in Germany, are ongoing in the United States and in the U.K. If the approach works, it could open the door to correcting more common forms of color blindness, which are typically inherited."}, {"type": "sentence", "content": "The German researchers think the therapy will be more effective if patients receive it in childhood, when the brain is still able to rewire itself. The parts of the brain that are responsible for processing vision lose their plasticity — the ability to make new neural connections — as a person ages. But people with total color blindness have never never learned to process color, so their brains might need some plasticity in order to process that information.The researchers plan to enroll children in the next phase of the trial."}, {"type": "sentence", "content": "This of course is an early trial, and the therapy will need to be tested in more patients before it can be approved. If that happens, it could still be out of reach for many people. A gene therapy designed to restore vision is already on the market, but in the United States it costs $850,000 — or $425,000 per eye. Called Luxturna, it was approved by the Food and Drug Administration in December 2017 for children and adults with a rare genetic mutation that often results in blindness."}, {"type": "sentence", "content": "Gene therapies are currently in development for many other inherited disorders that aren’t related to vision, including sickle cell disease, hemophilia, and muscular dystrophy. One for spinal muscular atrophy, called Zolgensma, was approved in the United States in May 2019. At $2.1 million per dose, it is the most expensive drug ever. The therapy is given to children less than two years old with a severe form of the muscle-wasting disease, which normally kills infants before that age."}, {"type": "sentence", "content": "Novartis, the company that makes Zolgensma, devised a lottery system to provide up to 100 free doses of its gene therapy per year in countries where Zolgensma is not yet approved to be sold. It’s a high-stakes game for families, since children with spinal muscular atrophy are only eligible for the therapy before they turn two."}, {"type": "sentence", "content": "Like other gene therapies in development, Luxturna and Zolgensma are given just once. The hope is that their effects will last a lifetime. But as more of these life-altering gene therapies come onto the market, we’ll have to face some difficult questions over how to pay for them — and who gets access."}], "topic": "neuroscience"}