{"title": "You are not a designer; you are a negotiator", "data": [{"type": "subtitle", "content": "Apply hostage negotiation tactics toward excellent design."}, {"type": "sentence", "content": "Pause for a moment and imagine hearing those words. Maybe it is not your daughter — it is your brother, a partner, or a loved one. You gasp, trying to catch your breath, beating back your heart rate. These feelings are what most business leaders experience when a designer presents a creative brief or proposal. The pitch signals, “give us your business, and for one million dollars, we will give you something cool.” Not a chance!"}, {"type": "sentence", "content": "While you are not threatening actual lives, you are creating fear and anxiety — especially when it comes to the world of design. The problem is most designers are just terrible negotiators. I know, as I was one of them."}, {"type": "sentence", "content": "We tend to think, “I don’t need to negotiate. That is what we have account executives for.” Yet, when you go into your daily stand-up with the customer, they turn down your ideas."}, {"type": "sentence", "content": "A certain amount of ego begins to strangle your breathing. You feel rebuffed and confused, wanting to quit because the “no one understands me…” floods your thoughts."}, {"type": "sentence", "content": "The trick is we need to learn to negotiate. Period."}, {"type": "sentence", "content": "Designers are like hostage-takers making lots of demands of the business. We take employees hostage inside design workshops. We kidnap their culture using words like iteration, ideation, and innovation."}, {"type": "sentence", "content": "After a few months of the “design thinking” back-and-forth, business leaders surrender paying your ransom in hopes you just go away. After all, they just want their business back."}, {"type": "subtitle", "content": "What it means to negotiate."}, {"type": "sentence", "content": "Hostage-taking — and therefore, hostage negotiating — has existed for a long time. But until the Nixon administration, hostage negotiating as a process was limited to sending in troops and trying to shoot their way into freeing the hostages."}, {"type": "sentence", "content": "In 1971, thirty-nine hostages were killed when police tried to settle the Attica prison riots in upstate New York with guns. Then at the 1972 Olympics in Munich, eleven Israeli athletes and coaches were killed by Palestinian captors after a botched rescue attempt by the German police."}, {"type": "sentence", "content": "It wasn’t until George Giffe Jr. hijacked a plane in Nashville, Tennessee that law enforcement turned negotiation into science than a brute force. The unfortunate incident ended with Giffe murdering two hostages — his estranged wife and the pilot — and then killed himself."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*UFFTFtZ7W7_aF9iMKEnXkg.jpeg"}, {"type": "sentence", "content": "In Chris Voss’s page-turner, Never Split the Difference, the former FBI negotiator explores the everyday uses of negotiation — minus the bad guys and guns. Through stories of sloppy bank robbers, kidnappers in the jungles of Ecuador, and a murderous rampage in Rochester, New York, Voss educates us on methods of negotiation."}, {"type": "sentence", "content": "The Giffe incident and the ensuing landmark Downs v. United States decision of 1975, the U.S. Court of Appeals concluded that “a reasonable attempt at negotiations must be made prior to a tactical intervention.”"}, {"type": "sentence", "content": "The blame fell to the FBI when two agents became impatient during a refueling stop in Jacksonville, Florida. There, the agents shot out the engine believing they would thwart Giffe’s plan. As we now know, it pushed Giffe to the red zone."}, {"type": "sentence", "content": "The case and ruling came to embody what not to do in a hostage crisis and has gone to inspire today’s top negotiation theories, training, and techniques."}, {"type": "subtitle", "content": "Two negotiation tips for design work"}, {"type": "sentence", "content": "While design spans a significant number of disciplines, I am focused on experience design. This can include user, customer, and employee experiences aimed at increasing the adoption of technology and new processes."}, {"type": "sentence", "content": "Organizations like PepsiCo and Steelcase see the value of design. However, many traditional corporations continue to be afraid of ‘it’. However, it is our job to negotiate for design and to get what we need to do great work."}, {"type": "sentence", "content": "Using two techniques from Voss’s book, you can get the work you want without a compromise in quality. That’s right — without compromise. But it is also our job to ease the business into the warm bathtub that is Design."}, {"type": "subtitle", "content": "TIP #1 — Never Compromise"}, {"type": "sentence", "content": "Like the title of his book, Voss suggests never splitting the difference — do not compromise. Voss puts it best when he writes:"}, {"type": "sentence", "content": "Why do we desire compromise often when it leads to poor outcomes? Because it has been ingrained into our thinking. Many leaders and role models suggest compromise as a healthy option backed by moral good."}, {"type": "sentence", "content": "We don’t compromise because it feels good; we do it because we are lazy! We do it so we can walk away, saying, “Well, at least I got half of the pie.” All of these feelings of laziness are backed by science."}, {"type": "sentence", "content": "According to the research by Daniel Kahneman and Amos Tversky, all the laziness boils down to risk aversion. The two theorized in Prospect Theory that people are drawn to sure things over probabilities. They would rather have a short-term gain over the possibility of losing the whole thing."}, {"type": "sentence", "content": "In the creative space, like experience design, inspirational solutions almost always come with some risk. At the bare minimum, the design comes off as annoying or confusing because you are building it in real-time."}, {"type": "sentence", "content": "Accommodation and compromise will produce nothing creative nor inspirational. We need to embrace the hard stuff. Voss points out, “And that’s what great negotiators do.” Embrace the hard stuff."}, {"type": "subtitle", "content": "TIP #2 — Be A Mirror"}, {"type": "sentence", "content": "As designers, we can often present as aloof, emotional, and anti-social. For me, I actually do better working with lots of people, to a point. Then I want to go back to my desk and get shit done. There is a reason why my online presence says Do Not Disturb."}, {"type": "sentence", "content": "We cannot hide away in our work. We are required to tell stories about our work, get people excited about it, and where it is going. You need to be your own marketing department. But that doesn’t mean presenting as a salesperson or an Instagram-like influencer."}, {"type": "sentence", "content": "For good designers to become good negotiators, you have to be clear about what you want. This could be a new deadline, an extended license for tooling, or access to an intern. But that request will fall flat if you haven’t kept your business counterpart apprised of what’s going on with your work."}, {"type": "sentence", "content": "Don’t just talk about yourself. You will want to know how the counterpart is doing. Going in, you will prepare for surprises; these surprises may reveal new insights."}, {"type": "sentence", "content": "In negotiation, each new insight provides a step forward to understanding your counterpart — you know, the person you want stuff from. You should engage them with a mindset of discovery and an appetite to learn more."}, {"type": "sentence", "content": "The act of discovery begins with mirroring. Mirroring is a way to listen actively to your counterpart and replaying back what they say. For example, if your request for an extended deadline was denied, ask why. When they give you the reason, repeat back what they said. Continue this until you have clarity and understanding."}, {"type": "sentence", "content": "Understandably, the exchange is a hypothetical “happy path” in negotiation. However, mirroring provides an opportunity to playback the exact words your counterpart is using. To the boss, it wasn’t so much the typography or the layout, she simply wanted the Support page live in 48-hours."}, {"type": "sentence", "content": "From a neuroscience perspective, mirroring is unconscious behavior. It’s a sign that people are bonding, in sync, and establishing the kind of rapport that leads to trust."}, {"type": "subtitle", "content": "The Great Lessons"}, {"type": "sentence", "content": "What we don’t know about our customers and their concerns can end design deals quickly. Uncovering these concerns, while being mindful of our own, can change the course of our negotiation bringing unexpected success."}, {"type": "sentence", "content": "Whether you are engaged with the customer or fellow designers, don’t avoid honest, apparent conflict. It lifts clarity and responsibilities to the surface. It can also save your professional relationships."}, {"type": "sentence", "content": "You can still be open and empathetic while speaking clearly and confidently in your point of view. It starts with treating your counterpart with dignity because it is more the situation that is a problem than it is the people."}], "topic": "ux"}