{"title": "How To Get Started on Instagram", "data": [{"type": "subtitle", "content": "A guide to your first 1,000 followers"}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*zZp13e6_IWdGNbg5"}, {"type": "sentence", "content": "It’s easy to get lost in the sea of information you can find online on how to grow your Instagram account. When you get started, you don’t know what’s the best way to get your first followers and how to get this initial fan base that will give you leverage in the long run. You’ve read about engagement groups, mass-following bots, engaging with influencers, the $1.98 method by Gary Vaynerchuk, but you’ve also learned that there are no shortcuts and that most of these methods don’t work in the long run."}, {"type": "sentence", "content": "The truth is the growth methods all change depending on the number of followers you have."}, {"type": "sentence", "content": "You don’t grow an account from 0 to 1,000 followers the same way that you do for an account to go from 100k to 500k followers."}, {"type": "sentence", "content": "Most of the resources you’ll find online will work on accounts that already have a significant amount of followers. So if you’re just getting started on Instagram, doings these methods are going either going to be very inefficient or have no effect at all."}, {"type": "sentence", "content": "Because you’re also trying strategies that don’t work, you’re tempted to switch plans all the time, which is also not ideal if you want to grow consistently."}, {"type": "subtitle", "content": "There’s No Shortcut to Getting Followers, and it Will Take Time."}, {"type": "sentence", "content": "This might go against a lot of content you may have been reading about Instagram growth, but building an audience takes time, and it takes more time than ever."}, {"type": "sentence", "content": "Instagram keeps making it harder and harder to get a lot of organic reach, making it hard to grow quickly on the platform. It’s tempting to look for shortcuts and hacks to gain a few followers here and there, but these methods don’t work long term and are usually patched rapidly by Instagram."}, {"type": "sentence", "content": "These hacks can also compromise your account. The follow-unfollow method was trendy a few years ago to grow quickly on the platform. The technique consists of following lots of accounts every day hoping for these people to follow you back; then unfollow these people a few days later to keep a clean follower to follow ratio. Instagram is aware of this method and now gives penalties to accounts using it. Some even got their accounts deleted by the platform because of going against Instagram’s rules. If you’re seriously considering Instagram as a marketing channel, that’s the last thing you want to happen."}, {"type": "sentence", "content": "Without a solid marketing strategy behind your growth, you won’t be able to maintain constant and sustainable growth."}, {"type": "sentence", "content": "That’s why going for a clear strategy is essential. You don’t want to get your account deleted, and you don’t want to have your only growth strategy patched by Instagram in a few weeks."}, {"type": "sentence", "content": "Most importantly, you want to keep the same strategy. Changing strategy every other day won’t bring you any result as results accumulate over time, by following a specific routine every day."}, {"type": "subtitle", "content": "The Preparation."}, {"type": "sentence", "content": "Before diving into the details of the best strategy to follow to get your first followers on Instagram, let’s talk about what you need to make sure you have in order first."}, {"type": "sentence", "content": "These five steps are the bare minimum before you start growing your account. If you don’t have these things ready before you begin implementing a growth strategy, you won’t get followers."}, {"type": "sentence", "content": "These 5 points are going to help your audience and potential new followers, understand what you are about, and what you can bring them. If they’re convinced, they will follow you. If they don’t know what you’re doing or don’t see how your content can be valuable for them, they’ll simply ignore you."}, {"type": "subtitle", "content": "The Growth Strategy."}, {"type": "sentence", "content": "Now that you have a beautiful looking profile that clearly explains what you’re doing on Instagram, and for who your content is for, you can start driving traffic to your account."}, {"type": "sentence", "content": "The strategy here is quite simple: you need to have people visit your profile, and hopefully, some of them will end up following you and start engaging with what you do."}, {"type": "sentence", "content": "Here are a few ways to do it:"}, {"type": "sentence", "content": "Every day, take 15 to 30 minutes of your time to do some of that. Create a routine around it: for 15 to 30 minutes, you will engage with people in your niche, you’re going to show that you exist, that you care and that you have value to bring to them."}, {"type": "sentence", "content": "Some of these people will ignore you, sone will visit your profile, and like a couple of pictures, some will click the follow button."}, {"type": "sentence", "content": "The point of this routine is to grab people’s attention. By engaging with them, you send them a notification. If they’re curious, they will visit your profile. If they like your profile, they will follow you. This is why the previous preparation step is crucial; it’s your profile that’ll convert your visitors into subscribers."}, {"type": "subtitle", "content": "Optimizing This Strategy."}, {"type": "sentence", "content": "Seems simple enough, right? You make a pretty looking profile that promotes the value you can bring to your audience, and you engage with people within your niche to make sure they see this profile."}, {"type": "sentence", "content": "To make sure that this strategy works, and works well, you need to make sure you know the people in your niche well, which means that you need to know what content they like, who they follow, and how to talk to them. One of the few traps that people fall into is that they engage with other people that are in the same business as them. For example, a fitness coach engaging with other fitness coaches, or a photographer engaging with other photographers. There’s nothing wrong with that, but if you’re trying to sell your coaching programs through Instagram, it’s unlikely another fitness coach is going to buy it (unless that’s explicitly what you are going for.)"}, {"type": "sentence", "content": "Knowing who your audience is is the key to all marketing strategy, and that’s what’s going to bring you the most results with this strategy."}, {"type": "sentence", "content": "Now, it may seem like a non-scalable method, and that’s partly true. You’re getting your followers one at a time, after all."}, {"type": "sentence", "content": "However, just imagine how much engagement and content you’re putting out there by engaging with others every day for 15 to 30 minutes. After a little while, by doing it every day, that’s thousands of comments, thousands of accounts engaged with, maybe other people in the industry will realize that you’re commenting all the time and they might get curious about what you do."}, {"type": "sentence", "content": "There’s so much power and results with an accumulation routine. And that’s why it’s essential to keep doing it, every day, for a while, to see results. As I said in the first section of this article, it will take time to get your first thousand followers, but if you can keep a routine and commit to engaging with others every day for at least a month, you’ll see incredible results."}, {"type": "subtitle", "content": "After The 1,000 Followers"}, {"type": "sentence", "content": "If you follow this strategy, publish good quality content regularly, and keep engaging with the right people in your field, it shouldn’t take you too long to get your first 1,000 high-quality followers."}, {"type": "sentence", "content": "As I said earlier, growth strategies change depending on the number of followers you have. Of course, having more than a thousand followers is no excuse to stop engaging with other people, but this method might not be the best one to take your account to the next level."}, {"type": "sentence", "content": "After you hit the 1,000 followers mark, you can start optimizing your hashtags, start contacting other people in your niche and do guest posts, or Instagram Lives together, and all different sorts of techniques to get from 1,000 followers to 10,000 followers."}, {"type": "sentence", "content": "One thousand followers are enough to start having some leverage, allowing you to explore new growth techniques that will give you better and quicker results than the method I just shared."}, {"type": "sentence", "content": "I’ve tried this method multiple times for multiple clients that are getting started at Instagram, and it has worked every time."}, {"type": "sentence", "content": "I know that this technique is a lot less popular than most of the shortcuts and hacks that are super popular online. But unlike these methods, the one I just shared is not going to be patched by Instagram, and it will always work, regardless of the changes Instagram will do to the algorithm of the platform."}, {"type": "sentence", "content": "If you just get a few things out of reading this article: stop using hacks and other short term techniques to get followers because they won’t work long-term, and they might compromise your account. But also, keep in mind that following a routine and a seemingly non-scalable technique may bring you a lot more results than you may think."}], "topic": "social-media"}