{"title": "Living Abroad Transformed My Life", "data": [{"type": "subtitle", "content": "And why I would do it all over again with my child"}, {"type": "sentence", "content": "‘Do you want to sit’, a middle-aged lady said as she got up to give me her seat. My grandmother smiled at the lady and edged forward taking the seat for herself. She gently pulled me close as she sat me on her knee. It was 1992 and we had been living in Hong Kong for almost a year."}, {"type": "sentence", "content": "My mum a slender woman in her mid-twenties with an afro had landed a job for the South China Morning Post Newspaper. One minute I was in London, England in Kindergarten with my friends and the next thing I knew mum and I were on an 18-hour plane journey leaving the cold English weather behind us."}, {"type": "sentence", "content": "I later learned that it was the custom there to give up your seat to the younger generation. In Britain, the US, and many other places adults do not usually offer their seats to children they didn't know. I got a sense very early on that they really appreciated young people."}, {"type": "sentence", "content": "To get to Sheko O where we lived you had to be brave. I have vivid memories of the no 9 bus ride up a steep mountain to our village. The bus twirled around each corner which gave me both a sickening and thrilling feeling in my stomach. I was five years old."}, {"type": "sentence", "content": "I attended Quarry Bay School which had a large pond and grounds where we could run around at playtime. My teachers were kind and caring. Recently I came across a school report which read ‘ Z has the biggest smile in HK’. I thoroughly enjoyed my time in the school learning some Cantonese along the way."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*4-LMbYzx9ZtK-kDVN7MyzQ.jpeg"}, {"type": "sentence", "content": "Every couple of months we would visit the opera and sometimes on weekends mum would take me with her to one of her friend’s lavish dinner parties. I found the Chinese to be wonderful ballerinas because of their small and delicate frames."}, {"type": "sentence", "content": "I remember coming home in tears one day because one of my classmates told me I was too tall to do ballet. However, that didn’t stop me from trying. I also learned to ice skate."}, {"type": "sentence", "content": "Chinese New Year was a time of reflection and gratitude. Children were given money to put in red shiny envelopes. There were traditional food and dancers."}, {"type": "sentence", "content": "It was a time of celebration and if you were lucky they would let you see the dragon which would parade around the whole village. (I later found out it was a number of locals dressed up under the masks and costumes)."}, {"type": "sentence", "content": "Living in another country so far from home wasn’t always easy. I had to make new friends, learn other customs, and navigate as the brown girl from England. Today I see how much confidence it gave me as well as coping mechanisms which enabled me to deal with many challenges that came later in my life."}, {"type": "sentence", "content": "Now a mother of a six-year-old I have been pondering about how amazing it would be to travel with my son and his dad around the globe when things go back to normal."}, {"type": "sentence", "content": "If it’s one thing this quarantine has taught me it’s that life is fragile."}, {"type": "sentence", "content": "I am a big believer that we shouldn't wait for conditions to be perfect to make things happen. Sometimes we have to be brave enough to say the time to make it happen is now!"}, {"type": "sentence", "content": "Take this opportunity to do something courageous as tomorrow isn’t promised. Whether it means learning a new language or signing up for an online course you keep putting off."}, {"type": "sentence", "content": "Sharing memories of exploring new places has given me hope that this world offers much joy and peace, we just have to reach out and grab it with both hands. So even if things are not perfect right now that shouldn't stop us from being brave enough to try something different. It’s in being bold and courageous that we find peace in the darkest of days."}, {"type": "sentence", "content": "©️ Zinze-ena Riley 2020"}, {"type": "sentence", "content": "Zinze-Ena is a writer, mother, and teacher. She lives in her hometown of London, England with her son and foster child."}], "topic": "travel"}