{"title": "Consider This Before Raising Children Bilingually", "data": [{"type": "subtitle", "content": "2 fundamentally different languages can make bilingual raising extremely hard. Here is how you do it."}, {"type": "image", "content": "https://miro.medium.com/max/11138/0*43Mld7oZ6IPc2_-Q"}, {"type": "sentence", "content": "I am half Chinese half German. Although I went to school and grew up in Germany, I speak Chinese like a native without any accents. Growing up, I was friends with some children whose parents were both Chinese. Today, most of them and other bilinguals I know, who grew up mainly in Germany like I did, aren’t nearly as sufficient in Chinese as I am. From personal experience, here is what my parents did differently. They have saved me years of actively learning my language of origin."}, {"type": "sentence", "content": "Our goal is to make the child identify with both cultures and languages, which is why many cultural aspects are included here as well (This is a must, or you might fail!)."}, {"type": "subtitle", "content": "One Parent — One Language"}, {"type": "sentence", "content": "As my dad is a German native, he always spoke German to me, although he can understand and speak Mandarin himself. My mother, the Chinese blood, stuck to only speaking Chinese with me, although she was sufficient in German. Here comes the difficult part that I need to stress for you to understand."}, {"type": "sentence", "content": "Whenever my mother spoke Chinese to me, I would answer in German. She could say anything, and I would not speak Chinese to her. I cannot even remember why, but it turns out that this is quite common. She was the only person in my environment to speak that language, and I knew that she could speak German, so I didn’t bother answering in Chinese. So, she had to do all the work."}, {"type": "sentence", "content": "Cooking, doing the household, changing diapers, she would always repetitively teach us Chinese vocabulary. Like, when she was washing dishes, she would say ‘洗碗’ repetitively."}, {"type": "subtitle", "content": "Where there is a language, there must be a culture"}, {"type": "sentence", "content": "In China, there is the Chinese New Year, the National Teacher’s Day, and for birthdays, they usually give money than presents to children."}, {"type": "sentence", "content": "The person teaching the foreign language should live to the cultural norms and celebrate the holidays the way they do in their culture of origin. This is important, because the sufficiency of a language does not suffice if you want your child to also be able to live in the other country sooner or later. For cultures which are vastly different, like China and Germany, this is particularly important also because you need to normalize the language and its practises. Asian children will often face racism and stigmata. For them to not feel ashamed, you need to normalize what feels foreign to the social environment. When Asians smack, most people are disgusted by it. If your child isn’t, you know you have done a damn good job raising it bilingually. For this cultural part, language can be a prerequisite, but plays a small role. Rather, it is about the excitement when Chinese New Year comes up, the understanding of why wearing white is mostly socially inacceptable."}, {"type": "sentence", "content": "Only by living your culture, your child will identify with it. Otherwise, it will only ever have a foreign language in mind — and connect it to all the bad experiences that will come with the bilingual being, which brings us to the next point."}, {"type": "image", "content": "https://miro.medium.com/max/11536/0*xcruohESAoi5BFof"}, {"type": "subtitle", "content": "Avoid Black and White Thinking"}, {"type": "sentence", "content": "We want our child to belong 100% to both of its cultures. For cultures with high cultural distance, this is nearly impossible. For example, for me, the Chinese policies and moral often meets disapproval in Germany — which puts me into awkward situations where I feel pushed to justify my homeland. Wherever you go, with different cultures, your child will always have to live between them, where there is no land to stand on."}, {"type": "sentence", "content": "You need to compensate the cultural differences and clashes for your child not to feel lonely, isolated, foreign, or to even turn against their own origin for the sake of belonging somewhere. I saw a girl, 9, hate her Chinese mom who has done everything for her. Today, she just turned 14, and she is still ignoring her Chinese origin. Although Germany has become a mixture of many cultures recently, cultural distance and clashes are hard to overcome. Avoid generalizing that holidays, like Chirstmas, are bad or useless because that takes away the sparkle. Let your child choose a birthday cake although your culture has other traditions — let your child experience both and don’t judge which practise is better."}, {"type": "sentence", "content": "Bilingual people live in no man’s land. They are sliding between two cultures. Don’t make them turn their back to one of them. No parent should judge cultural practises of the other culture — the social environment and friend groups will do that for you. Your child will be confronted with all the differences soon enough."}, {"type": "sentence", "content": "They know about the views and values of each culture and they will realize how different they are soon enough."}, {"type": "sentence", "content": "Please be open minded in a way that you don’t force your child to think in a certain way. You have succeeded in this task is your child inherits your values and practises what you taught them with joy, although that is against the local norms— without you telling them to."}, {"type": "subtitle", "content": "Let them know there is more than one way of living"}, {"type": "sentence", "content": "This refers to cultural exposure. Your child will mainly talk to people who don’t understand their second mother tongue and culture. It is highly necessary, therefor, to make them understand and realize as soon as possible, how the way they are living and interacting with others is one of two ways that they are raised with — from which they may or may not choose from in the future."}, {"type": "sentence", "content": "All that this refers to is the dilemma situations that children often find themselves in, in which they don’t know that is right and what is wrong. Bilingual people who live between very very different cultures need to “grow up” faster by understanding racism, cultures, perspectives, etc. You need to give them confidence in their identity."}, {"type": "image", "content": "https://miro.medium.com/max/8892/0*uZFJAiSYrYEXrVZk"}, {"type": "subtitle", "content": "Language — school or home schooling"}, {"type": "sentence", "content": "Just like speaking, I beg you to invest time in this one. If there are two very different languages with characters of likewise, you have to teach your child to read and write parallel when they to go elementary school. For example, Chinese people can distinguish characters written from a native and a language learner at first sight. For them to be good writers, they have to grow up writing characters. Here, I allow you to force your child, I allow you to sit down to them to practise — at least once a week, best would be every day — just to let them watch you write characters."}, {"type": "sentence", "content": "Give them an idea of how the other language is written — they need to feel the language on paper. This is very hard. Most parents fail here because this takes lots of time."}, {"type": "sentence", "content": "There might be Chinese schools in the neighbourhood to solve this problem. If there are, make your children go there — if it costs money, every cent will be worth it."}, {"type": "subtitle", "content": "What can happen if you “fail”?"}, {"type": "sentence", "content": "You might have succeeded in teaching a language. But you haven’t succeeded in raising someone bicultural AND bilingually."}, {"type": "sentence", "content": "Most often, children get into fights with their parents when they have no sufficient cultural connection to their parent’s mother tongue. For example, if a mother wants her son to make a doctors degree, the son might argue against her wishes without attempting to understand her mothers’ wish. Ultimately, teenagers and adults who are bilingual have to make their own decisions — but if the cultural understanding lacks, missing soft skills will make conversations feel like a dangerous fight between fire and water, in which one of them will die — making the other one feel no less miserable in the long term."}], "topic": "education"}