{"title": "The path to COVID recovery: the urgent need for the EU Green Deal and a new approach to Industrial Strategy", "data": [{"type": "image", "content": "https://miro.medium.com/max/11796/1*g6T4LiugUF4Ck9hmzggjlg.jpeg"}, {"type": "sentence", "content": "By: Mariana Mazzucato, George Dibb and Martha McPherson"}, {"type": "sentence", "content": "Due to the COVID19 crisis, states and governments are having to step up in unprecedented ways to intervene in their economies. The European Union (EU) is currently discussing the size and shape of a European Recovery Fund; and working out how to make this demonstrative of solidarity between member states, whilst also having relaxed its state aid rules."}, {"type": "sentence", "content": "This immediate response is needed, but the long-term future path for EU policy looks, by contrast, uncertain. In the early stages of response to COVID19, there were worrying signs that the European Green Deal looks set to be delayed or diluted (Politico, Euractiv) and there are fears that the EU’s ‘New Industrial Strategy’ announced just a month ago now lacks the scale of ambition needed for the post-COVID renewal (Bloomberg, Glass for Europe)."}, {"type": "sentence", "content": "Even before the COVID-19 crisis hit, Europe already had a fragile macroeconomic context, not having recovered to its pre-2008 crisis GDP level until 2014 and by the end of 2019 was still performing worse than most major economic areas. Furthermore, within the eurozone, countries continue to have very different levels of competitiveness, often down to the fact they have different levels of investment in key drivers of growth, such as education, R&D and skills."}, {"type": "sentence", "content": "Unless Europe kickstarts a new action plan that looks at both the rate of growth and its direction, we risk a decade of stagnation for the continent. This was true before Covid19 hit us, and is even more true now."}, {"type": "sentence", "content": "The European community should use its missions approach, its renewed industrial strategy, and its Green Deal to provide the direction, as a vital and pivotal opportunity to reframe economic growth, and to re-imagine the role of the public and private sectors in a thriving, mutually beneficial and public value-led economy. They are critically interlinked policies, that come with the potential for new ways of doing capitalism, for new routes to economic growth, and a new prioritisation of citizens in the post-COVID society. A missions approach can be used for stimulating innovation in areas as different as vaccines, to online education for the digital divide experienced by students while studying from locked down homes. Rather than being neglected, hollowed out or overlooked, policy-makers and industry alike should count these as the key stimuli needed to restart and reshape European economies. COVID19 is the moment which makes mission-oriented, innovation-led economic renewal urgent."}, {"type": "sentence", "content": "Missions, Industrial Strategy and the European Green Deal"}, {"type": "sentence", "content": "On the back of the report on Mission Oriented Research and Innovation in the European Union (Mazzucato, 2018), which brought a challenge-oriented approach to innovation policy, the European Commission decided on 5 mission areas. It also simultaneously launched its new European Industrial Strategy in March 2020, which aims to foster a green and digital transition and advance global competitiveness. Using the missions approach to bring a cross-sectoral lens to the EU industrial strategy — with the priority on the green deal — is what we focus on here."}, {"type": "sentence", "content": "As pioneered at IIPP, modern industrial strategy is most effective when it can help galvanise different actors and sectors across the economy to work together to solve big societal ‘grand challenges’. At IIPP we transform these challenges into ‘missions’ that require cross-sectoral collaboration to solve. IIPPs work (such as the UCL Commission on Mission-Oriented Innovation and Industrial Strategy) has focussed on how these missions could be framed to better mobilise cross-sectoral innovation and have long-term economic and technological spill-overs, as well as how they can be backed up by a toolkit of supporting policy measures."}, {"type": "sentence", "content": "There is a call — now more than ever — for mission-oriented industrial policy. This means governments getting engaged not just in fixing the failures of markets, but directly creating or shaping markets — to directly address the world’s most pressing challenges."}, {"type": "sentence", "content": "Towards the end of 2019, the EU launched its plan for a European Green Deal (EGD) to reach net-zero carbon emissions by 2050, to move towards a circular economy, and to restore biodiversity and cut pollution."}, {"type": "sentence", "content": "Despite doubts about the commitment of the Commission to the EGD, Ursula von der Leyen recently announced that the EGD will be the “compass” and “motor for the recovery”. Taking up long-term, mission-oriented, and newly established policies to respond to the current public health crisis sends clear signals that handling the economic crisis and the climate crisis are not mutually exclusive; and that the EU is ready to use this opportunity to reshape the economic pathway of the continent."}, {"type": "sentence", "content": "The Just Transition Mechanism is a crucial supplement to the EGD and Industrial Strategy in ensuring that the rights of workers, who have lost out hugely in the COVID19 crisis so far — are prioritized in the ‘build back better’ approach to a carbon-neutral continent. This mechanism and fund, if used correctly, can ensure that new structures are built between workers, employers and organisations, towards a fairer, ‘stakeholder capitalism’."}, {"type": "sentence", "content": "Citizens need to be the first consideration in a public health crisis: and they need to be in the climate crisis too. While transition away from brown industries is important, so are the people currently relying on these industries for their livelihoods. With unemployment in the Eurozone currently at 7.3%, there are a lot of unemployed people who could be put to work on many of the promises of the EGD — an opportunity to increase economic growth and job security. A proactive governance approach entails targeted training, infrastructure investments, preferential lending arrangements for new local companies and income maintenance support. In Governing Missions in the European Union IIPP addressed the importance of engaging citizens in the innovation process, both in terms of defining the direction of transformation, but also in its implementation and evaluation. In the context of the green deal, in this sense, the ‘deal’ part of ‘green deal’ being developed is just as important as the ‘green’ part."}, {"type": "sentence", "content": "A Green Industrial Strategy in the time of COVID-19"}, {"type": "sentence", "content": "Now, industrial innovation must bring together COVID recovery responses[1] — which are urgent — ranging from rapid vaccine discovery; to ensuring no school child falls behind due to online learning gaps; to safety net provision in the informal economy — with long-term green transition plans, to protect us from the next crisis — that of the climate emergency."}, {"type": "sentence", "content": "Post-COVID industrial strategy and economic restricting calls for the strategic use of conditionalities in bailouts to shape markets for a more healthy, innovative and sustainable economy. When conditionalities are done well, they align corporate behaviour with the needs of society. In the short term, this focuses on preserving employment relations during the crisis and maintaining the productive capacity of the economy, whilst avoiding extraction of funds to financial markets and executive compensation. In the long-run, it is about ensuring that business models lead to more inclusive and sustainable growth."}, {"type": "sentence", "content": "The European Commission recently agreed that, despite calls from economists and climate crisis advocates, there would not be a Europe-wide green conditionality requirement on the provision of state aid bailouts to industries such as airlines, which have been eager for support since global travel collapsed over the last two months. This leaves it up to national governments to make their own decisions on conditionalities, leading to inconsistent outcomes; at the same time as the French government put green conditions on Air France — to decrease CO2 emissions in domestic flights by 50% by 2024; to stop flying domestic routes where there are rail competitors; it seems likely that Germany’s Lufthansa will be bailed out with no green conditionalities and limited state involvement. A joined up investment and bail-out approach would push further — leading to a co-ordinated air travel and rail system; where rail, air and road investment plans act as carbon-friendly complements, rather than competitors. At a time when more pan-European thinking is needed, this feels like a missed opportunity for direction — which may also stoke resentment between countries whose carriers, in this example, likely fly directly competing routes."}, {"type": "sentence", "content": "Conclusion"}, {"type": "sentence", "content": "European readiness and willingness to transition must not be thrown away in a misguided vision of COVID-19 and climate change as a zero-sum investment game, in which incumbent (brown) systems are invested in because they seem like the most straightforward way to re-start the economy. This would risk locking in decades of innovation and investment into a high-carbon path, because of short-term reactive, rather than long-term strategic, approaches, to the COVID crisis. Yes, action must be taken quickly to avoid the worst depths of this ‘greater depression’ crisis. But rapid action does not mean short-termist decision making. It means setting in motion the structural pathways of industrial and social change that had been carefully designed in the Green Deal."}, {"type": "sentence", "content": "In recent weeks IIPP academics have been applying their thinking on how to make sure the post-COVID-19 economy is one that is more inclusive and sustainable. Our COVID-19 policy briefing papers are available here."}, {"type": "sentence", "content": "In addition, you can also read more about our perspective in a selection of press pieces:"}, {"type": "sentence", "content": "How to Develop a COVID-19 Vaccine for All, by Professor Mariana Mazzucato & Els Torreele (Project Syndicate)"}, {"type": "sentence", "content": "Capitalism’s Triple Crisis, by Professor Mariana Mazzucato (Project Syndicate)"}, {"type": "sentence", "content": "The COVID-19 crisis is a chance to do capitalism differently, by Professor Mariana Mazzucato (The Guardian)"}, {"type": "sentence", "content": "Coronavirus and the UK economy: Why this pandemic needs a bolder macroeconomic response, by Josh Ryan-Collins (IIPP Medium)"}, {"type": "sentence", "content": "Purpose-driven innovation in a time of COVID-19 by Rowan Conway (IIPP Medium)"}, {"type": "sentence", "content": "Drug Companies Will Make a Killing From Coronavirus, by Professor Mariana Mazzucato (The New York Times)"}, {"type": "sentence", "content": "References"}, {"type": "sentence", "content": "[1] IIPP is working closely with governments — from South Africa to Italy to The Vatican — to support their industrial plans for the COVID recovery."}], "topic": "economy"}