{"title": "9 Surefire Ways To Overcome Procrastination", "data": [{"type": "image", "content": "https://miro.medium.com/max/4416/0*Bc-Ngt1mkEbJ3zfY"}, {"type": "subtitle", "content": "Don’t beat yourself. Beat those projects piling up instead."}, {"type": "sentence", "content": "I don’t pretend to know why people procrastinate. I have my reasons, and you have yours. I can guess general terms as to what makes people put off projects — both personal and professional. I suspect we feel overwhelmed at times. I suspect we all fear failure a little bit. I’ve read some productivity gurus suggest we fear success, which doesn’t make sense to me."}, {"type": "sentence", "content": "That said, while I’m not an expert on the root causes of procrastination — not even my own — over the years, I have found a number of strategies you can use to succeed in overcoming whatever is blocking you from getting things done."}, {"type": "subtitle", "content": "1. Tidy Your Workspace"}, {"type": "sentence", "content": "I live in a pretty small house with my wife, a very active three-year-old, dog, and a cat. It gets a little crowded at times. My workspace tends to collect clutter throughout the day — mail, bags from the store, used coffee cups, loose crayons, etc."}, {"type": "sentence", "content": "That kind of chaos does not nurture positive work energy."}, {"type": "sentence", "content": "A quick tidying of your workspace will help you approach your project. Whether you’re working at a desk, a workbench, or a kitchen, try to bring some order to it."}, {"type": "sentence", "content": "Don’t spend too much time on tidying, however. That could quickly become the new excuse you’re using not to get your work done."}, {"type": "sentence", "content": "Straighten things up and put things in order just enough to make you feel professional and productive, then see how well that helps you get the job done."}, {"type": "subtitle", "content": "2. Avoid Distractions"}, {"type": "sentence", "content": "Turn off the TV. Yes, many people work better with background noise, but the visual element of TV is going to be an ongoing distraction you don’t need."}, {"type": "sentence", "content": "Try music instead. Or a podcast."}, {"type": "sentence", "content": "Or try silence. You might be surprised to find that silence works best for you."}, {"type": "sentence", "content": "If you live or work in a noisy environment, try headphones if you can. Or talk with those around you and explain that you need to focus, and if they could hold things down to a dull roar (or, better yet, leave) for a few hours, that would be great."}, {"type": "image", "content": "https://miro.medium.com/max/5000/0*TIjzkWkUnBLxQBVo"}, {"type": "subtitle", "content": "3. Schedule Tasks"}, {"type": "sentence", "content": "I don’t mean, “Oh, I’ll take care of that this afternoon.” I mean more like, “I’ll sit down and start formatting these articles at 2 pm. I’ll take a break at 3:30, then work on that cover design until it’s finished.”"}, {"type": "sentence", "content": "Scheduling tasks makes a to-do list more concrete. Some people try to schedule every job days in advance. I find that overscheduling only leads to frustration as life rarely goes exactly according to plan."}, {"type": "sentence", "content": "Instead, I will sit down at noon and schedule my afternoon. Or I’ll sit down after dinner and schedule my evening’s work. Short-term scheduling makes managing the to-do list more real, and it allows me to chunk up a project into different pieces and take care of them one-by-one."}, {"type": "sentence", "content": "This leads us to the next tip."}, {"type": "subtitle", "content": "4. Breakdown Large Tasks With a Select To-Do List"}, {"type": "sentence", "content": "I live by my to-do list, but I have to be careful about it."}, {"type": "sentence", "content": "If I have an intimating project sitting on my to-do list and I’m still avoiding it for whatever reason, that’s only going to raise my anxiety and guilt."}, {"type": "sentence", "content": "What I’ll do instead is have a select to-do list devoted to that project alone with individual steps for that project listed. For example:"}, {"type": "sentence", "content": "YARDWORK"}, {"type": "sentence", "content": "__ Hedges"}, {"type": "sentence", "content": "__ Pick up branches"}, {"type": "sentence", "content": "__ Mow front lawn"}, {"type": "sentence", "content": "__ Mow back lawn"}, {"type": "sentence", "content": "__ Mow sides"}, {"type": "sentence", "content": "__ Collect yard waste"}, {"type": "sentence", "content": "__ Put yard waste by curb"}, {"type": "sentence", "content": "Or"}, {"type": "sentence", "content": "JOURNAL LAYOUT"}, {"type": "sentence", "content": "__ Insert articles"}, {"type": "sentence", "content": "__ Do basic formatting"}, {"type": "sentence", "content": "__ Insert images"}, {"type": "sentence", "content": "__ Add captions"}, {"type": "sentence", "content": "__ Fine-tune formatting"}, {"type": "sentence", "content": "I get a surprising amount of satisfaction checking each item off until I’ve checked off everything and find my Big Daunting Project is now complete."}, {"type": "subtitle", "content": "5. Just Do It"}, {"type": "sentence", "content": "I hate this advice. The “no excuses” attitude disregards any legitimate issues people experience when it comes to procrastination. It’s the motivational equivalent of “If you’re depressed, you should just go for a walk in the woods!” Sure, that sounds great, but for many people, it’s virtually worthless advice."}, {"type": "sentence", "content": "That said, I include it because it is an approach popular with some people, and I can only assume it works for them. If that’s the case, I couldn’t be happier."}, {"type": "sentence", "content": "If you can look at a project that’s been intimidating you for whatever reason, psyche yourself up, then launch headlong into it with a “Just do it!” can-do attitude, I think that’s great. I know people this works for, and maybe you’re one of them."}, {"type": "sentence", "content": "It’s worth a try. Just do it."}, {"type": "image", "content": "https://miro.medium.com/max/12032/0*FtPcqIvYLV6V0zIQ"}, {"type": "subtitle", "content": "6. Buddy Up"}, {"type": "sentence", "content": "We’re social animals. Doing projects by oneself can be harder than working near someone else who also has a project they need some motivation on. Consider these two scenarios:"}, {"type": "sentence", "content": "(Over the phone) “Hey, Jen! Whatcha working on?”"}, {"type": "sentence", "content": "“I need to finish five illustrations for a client’s book. What about you?”"}, {"type": "sentence", "content": "“Taxes.”"}, {"type": "sentence", "content": "“Uf. Make a pot of coffee. I’ll be over in 15 minutes and we’ll each work on our projects in silence.”"}, {"type": "sentence", "content": "“Sounds like a plan!”"}, {"type": "sentence", "content": "Or…"}, {"type": "sentence", "content": "(Husband to wife) “I just dropped the kid off at grandma’s. You know what that means, right?”"}, {"type": "sentence", "content": "“You do the back yard, and I’ll do the front?”"}, {"type": "sentence", "content": "“Hedge clippers are in the garage.”"}, {"type": "sentence", "content": "Hey, it works. Two, three, or more people all working in the same general area, but keeping to themselves, can create a community-driven encouragement to get things done."}, {"type": "subtitle", "content": "7. Visualize Yourself Completing Your Project"}, {"type": "sentence", "content": "I admit, I almost didn’t include this as it seems a little too metaphysical rather than practical. Just the same, it is a method I do on occasion when trying to beat some kind of block in tackling a project."}, {"type": "sentence", "content": "Certainly, it’s not a step to be taken by itself, but in conjunction with these other methods. By visualizing a project’s completion, you’re not attaching any negative emotions or feelings to the task at hand, but approaching it from a more positive, encouraging one."}, {"type": "sentence", "content": "It can’t hurt, right?"}, {"type": "subtitle", "content": "8. The Great Motivator"}, {"type": "sentence", "content": "Of all of these tips for beating procrastination, this is the one I find most effective when it comes to freelance work projects that get put off for one reason or another. It merely boils to, “If you don’t do the work, you don’t get paid.”"}, {"type": "sentence", "content": "I accompany this method by looking at a stack of bills that need attention. Sure, no one in their right mind wants to edit and format 400 pages of old radio transcripts (for example). Still, it’s a job that was taken on in exchange for payment, and that payment is going to help keep the lights on and the refrigerator stocked."}, {"type": "sentence", "content": "When all else fails, the Great Motivator comes through."}, {"type": "image", "content": "https://miro.medium.com/max/10618/0*PtUaQEVfEg6lzpGf"}, {"type": "subtitle", "content": "9. Dial It Down a Notch"}, {"type": "sentence", "content": "This is less about dealing with procrastination now as it is avoiding it in the future."}, {"type": "sentence", "content": "Many people are working harder than ever. If you’re a freelancer or part of the gig economy, it’s hard to turn down work. Just the same, taking on too much at once leads to overwhelm. Sure, you may have a filled schedule of paying work lined up, but if you freeze up and turn jobs in late (if at all), then how will that serve you in the future?"}, {"type": "sentence", "content": "It won’t. You’ll burn out. You’ll find work harder to get."}, {"type": "sentence", "content": "Pick and choose your projects wisely and avoid the temptation to pack your schedule. Leave yourself breathing room, and what projects you do have scheduled will seem less daunting."}, {"type": "sentence", "content": "There is no one-size-fits-all answer to procrastination, but there are a number of options available to try out."}, {"type": "sentence", "content": "No one likes the feeling associated with watching projects pile up uncompleted or not even started. Fortunately, there are ways to overcome this. Give them a try. Get the momentum started."}, {"type": "sentence", "content": "Things will move on from there and, soon enough, you’ll be caught up and feeling fine."}, {"type": "sentence", "content": "Thank you for reading. I’d love to share more with you via my Weekly Word Roundup newsletter sent to subscribers every Sunday. It will feature news, productivity tips, life hacks, and links to top stories making the rounds on the Internet. You can unsubscribe at any time!"}], "topic": "productivity"}