{"title": "How to Craft a Sales-Driving Brand Message", "data": [{"type": "subtitle", "content": "The worst-case-business scenario is that nobody hears about you"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*Kb32i9rzGvc4SzJq"}, {"type": "sentence", "content": "The underlying rule of marketing is simple: Don’t confuse your potential customer. To make it as a marketeer, make your message accessible and easy to understand."}, {"type": "sentence", "content": "We don’t have time to decypher alphabet soups. The Internet features gazillion products. Your nearest supermarket offers gazillion products too. We’re buying stuff that we clearly understand."}, {"type": "sentence", "content": "Think Different. Have you heard the phrase before? Think Different is a two-word slogan that represents one of the biggest shifts in modern marketing history."}, {"type": "sentence", "content": "Steve Jobs’ 1983 two-page ad in the New York Times is the perfect example of a complicated message. The ad geek talks about the technological advancement of Lisa, a new personal computer. For just $10,000, Lisa features a whooping 5MB hard drive. The ad even offers charts and IT diagrams. Who doesn’t like a good diagram in a product message, right?"}, {"type": "sentence", "content": "Lisa becomes a multi-million failure, and Apple can barely cover the costs of production. Steve Jobs is forced out of the company."}, {"type": "sentence", "content": "Steve Jobs returns to Apple in 1996. The company rolls out a new line of products, and Jobs buys another section in the New York Times."}, {"type": "sentence", "content": "Instead of 2 pages of IT riddles and graphs, the new message is just two words long: “Think Different.”"}, {"type": "sentence", "content": "What happens next is modern history. The world is crazy about iMacs, iPods, iPhones, iTunes and all the expensive iStuff. Apple becomes the richest company on the planet."}, {"type": "subtitle", "content": "How to Make Your Message Sound More like iPhone and Less Like Lisa"}, {"type": "sentence", "content": "The first step in advertising your product is having a clear message. Of course, you need to have a product or an idea first, but once you know what you’re selling, focus on your message. How to coin a simple, yet enticing line?"}, {"type": "sentence", "content": "First: Don’t make the customer overthink."}, {"type": "sentence", "content": "Second: Tap into their survival instincts and eliminate the noise."}, {"type": "sentence", "content": "Third: Answer customers’ questions."}, {"type": "subtitle", "content": "1. Don’t Make your Customer Think to Hard"}, {"type": "sentence", "content": "Clear and simple is far better than unintelligible. You can apply the same rule in other parts of life and business. People don’t like alphabet aerobics. Even if stuff is complicated, don’t make it unintelligible."}, {"type": "sentence", "content": "When the potential customer sees your product, he’s probably going to decide in the next millisecond if the stuff is worth the time. If the customer understands the message, maybe they’ll buy the product. Nothing can truly guarantee the conversion. But the sure way to lose a sale is by confusing the customer."}, {"type": "sentence", "content": "Instead of saying that your product has “5MB RAM, GUI, and integrated software,” simply say: “think different.”"}, {"type": "sentence", "content": "The Apple example might be complex. Let me simplify with the slogan for 2 Minute Madness — a recent Medium publication. The initial message of Come Alive with 2 Minute Madness is a bit confusing."}, {"type": "sentence", "content": "I’ve remodeled the slogan to say: Helping You Become Healthy, Wealthy, and Arty. The reader, in this example, doesn’t need to think about the message. 2 Minute Madness curates short stories about wealth, health, and art."}, {"type": "subtitle", "content": "2. The survival instict and eliminating the noise"}, {"type": "sentence", "content": "The first thing on customer’s mind is survival. When you walk into a concert hall, your brain automatically maps the exit signs. You don’t really care about the number of seats, the sound system or the floor material."}, {"type": "sentence", "content": "The same happens when someone sees your product. The customer runs it through the survival filter. The work that is making the customer more interesting, socially adept, or physically stronger gets the priority — everything else is noise."}, {"type": "sentence", "content": "Do you remember Maslow’s Hierarchy of Needs? Maslow claims we can sort our primal needs in three different groups: fundamental, psychological, and self-fulfillment. Products that communicate to one of the categories in the hierarchy are interesting."}, {"type": "sentence", "content": "Think Different talks directly to the psychological need for prestige, accomplishment and creative nourishing. Do you feel any of the above when you buy an iPhone or iMac? (Prestige, creativity, acomplishment.)"}, {"type": "subtitle", "content": "3. Answer the Crucial Questions"}, {"type": "sentence", "content": "Every customer has three questions before buying a product. The process is barely concious as it usually takes less than a second."}, {"type": "sentence", "content": "The questions:"}, {"type": "sentence", "content": "Ideally, your message offers the answer to all three. Marketing wizards are famous for communicating the response in less than five syllables. “It’s toasted,” or “Think Different” are great examples. But taking a longer route like: “Helping you become healthy, wealthy and arty” is better than confusing people with a monstrosity like “Come alive.”"}, {"type": "sentence", "content": "What does Apple offer? Latest gedgets that are well designed."}, {"type": "sentence", "content": "How is the product making my life better? I’m enjoying a certain level of recognized prestige, creativity, and accomplishment."}, {"type": "sentence", "content": "How can I buy the product? Swipe your card here, and walk away with a new gadget. Also, you can use the one-click purchase button if you prefer shoping online."}, {"type": "sentence", "content": "Whatever you do, don’t confuse the potential customer. Providing a clear answer to the questions above enhances your change of gaining referrals, leads, or making a sale."}, {"type": "subtitle", "content": "The Takeaway"}, {"type": "sentence", "content": "Customers don’t like product puzzles. The mesage is cler even with the jigsaw puzzle sets. Buffalo Games sells globaly popular jigsaw products. Buffalo’s message is clear: “1000 piece puzzle party set.”"}, {"type": "sentence", "content": "The following steps can help you filter your message:"}, {"type": "sentence", "content": "We don’t have time to run around figuring out what your brand represents. We’re buying stuff that we clearly understand."}], "topic": "startups"}