{"title": "A Fallen Angel’s Apple Seed", "data": [{"type": "subtitle", "content": "And a poisonous trust"}, {"type": "image", "content": "https://miro.medium.com/max/5000/1*XDDtoyc63reQsmQ8Mk9Sow.jpeg"}, {"type": "sentence", "content": "A soul found me in my dreams. His face glowed and I yearned for his touch."}, {"type": "sentence", "content": "We whispered and laughed. He was charming and likable. It felt like I knew him but I couldn’t pinpoint from where."}, {"type": "sentence", "content": "He gave me an apple — Granny Smith, my favorite. The fruit’s waxy finish shined so brightly I could see my reflection. It looked like me but something was different. I felt foreign to my vessel as if I was sharing it with someone or something. I ignored my seemingly useless worries and relished the tartness of the first bite. He told me to eat the seeds, though I never did."}, {"type": "sentence", "content": "“I thought they were poison,” I questioned. “No, eat them and you will be saved,” he replied with adoring eyes. I wished to please him and did as he said. I lowered my eyes in contemplation. “Saved from what?” I thought."}, {"type": "sentence", "content": "Then he took me to his doorstep. He lived in Brooklyn. His hovering stance dominated the space. I looked away to admire the brick staircase. I started to feel odd when the brick chipped away when I touched it. It felt like I was on a cheap set. My stomach churned yet my intuitive thoughts were shooed away. This was very odd. Something was inside of me — with me. I then dismissed a bubbling gut."}, {"type": "sentence", "content": "He grabbed my wrist and cut me with a piece of glass. I gasped sharply and yelped in pain with narrowed eyes, while my wrist gushed and I felt faint. I didn’t fight and had an undying desire to win his affection. Who was I? An entity had taken control of my human form. This wasn’t me."}, {"type": "subtitle", "content": "I knew it was a dream."}, {"type": "sentence", "content": "I closed my eyes tight and the scene changed. I ran from the wind in an abandoned city but she chased me. I found myself lost in the streets amidst twilight. The few faces I met were scrawny and pale. They looked like ghosts and smelled like cigarettes. They stared at me but said nothing."}, {"type": "subtitle", "content": "I thought I could bear the poison of the apple seed, but I fell to the ground with aching tremors in my gut."}, {"type": "sentence", "content": "The man appeared again and he showed me his wings, but they smelled of must and were stained black from oil. He carried me for a long time, and the warmth of his chest soothed me."}, {"type": "sentence", "content": "I was on his doorstep again. The glass lay in my writhing gut as I moved in and out of a trance."}, {"type": "sentence", "content": "I wished to wake."}, {"type": "sentence", "content": "I couldn’t leave."}, {"type": "sentence", "content": "The moon caressed me while I cried my prayers. I lay alone on his doorstep in the night. My tears burned the skin of my cheeks."}, {"type": "sentence", "content": "I was stuck in my dream. It started to feel real."}, {"type": "sentence", "content": "Where is he?"}, {"type": "sentence", "content": "My eyes grew heavy."}, {"type": "sentence", "content": "I wake in a bed that wasn’t mine. I am in his bed now, and he dressed my wound while I slept."}, {"type": "sentence", "content": "His fingers linger on my face and he kisses my forehead. His lips singed my skin. His touch repulsed me, sending shivers down my spine. I have noticed too late, his evil intentions."}, {"type": "sentence", "content": "My body is weak. I’m motionless. Then he raises an ax and bites into an apple. His stoic demeanor is unbreakable."}, {"type": "sentence", "content": "He takes my life."}, {"type": "sentence", "content": "It was just a dream."}], "topic": "fiction"}