{"title": "Amazon’s dog food Wag and curious marketing", "data": [{"type": "subtitle", "content": "Obviously Amazon has its own dog food, along with everything else"}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*Gg6uE-EG_TImpquJgKDySw.jpeg"}, {"type": "sentence", "content": "Of course Amazon has a dog food. Why wouldn’t future trillionaire Jeff Bezos test out the pet market, especially considering he’s challenged just about every single other market ever? Whether you’re an Amazon Prime enthusiast or an occasional shopper, it’s difficult to deny the marketing machine that is Amazon.com. Generally speaking, everyone knows the company name “Amazon.” However, Amazon’s private dog food brand is eye-catching for a different reason— the name Wag."}, {"type": "sentence", "content": "Wag! is also the name of the on-demand dog walking company that was founded in 2015. Accessible in all 50 states and 4,600 cities (according to the official website), it’s a place where dog walkers, dog boarders and dog sitters can all find a one-stop-shop pet profession. And it makes absolute sense that a company like this would create a dog food brand, considering their five-year brand. But nope, instead it’s Amazon who is using this name — sans the exclamation point and in a different font."}, {"type": "sentence", "content": "Legally it may seem odd that Amazon was able to get away with it during its creation in 2018 — three years after Wag! was founded. Then again, when a company owner is willing to almost lose $100 million in a three-month time span (through Amazon Mom) just so he can one-up competitors, it may have been more trouble than it’s worth for the dog-walking company to challenge the dog food brand name, Wag."}, {"type": "subtitle", "content": "What’s on the Wag dog food menu?"}, {"type": "sentence", "content": "When TruthAboutPetFood.com tried to find out who the actual manufacturer of the pet food was, they ran into a wall. Two years later, the explanation for the brand is still pretty vague: “Yes, the Wag brand is owned and distributed by Amazon. Amazon works directly with a supplier to manufacture Wag dry dog food.”"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*b8ZnndFiy9W7LDQJ7cMb_g.jpeg"}, {"type": "sentence", "content": "In all fairness, lots of store brands use their own company name and manufacturers may not be the “star” of the product. But it’s really this particular name that makes it stand out more, specifically because of the well-established dog walking company. Other private label dog foods would never be confused for another company (ex. Blue Buffalo, Dr. Harvey’s, Nature’s Variety, etc.)."}, {"type": "sentence", "content": "Additionally, dog owners are not even clear where all the ingredients are from. The “number one ingredient” of beef is documented as sourced in the United States, but the rest of the dry food is from “a variety of countries around the world.” It’s the right amount of vagueness that could make dog owners curious about the popular online merchant but not quite clear what they’re feeding their dog. Meanwhile Amazon assures dog owners that, “The supplier of Wag dog food adheres to stringent food safety protocols, constantly monitoring and testing raw materials, production environment, processes and finished products.” The problem with that explanation is Amazon doesn’t have the best track record of making sure all their items are safe to purchase, specifically when it comes to third-party sellers."}, {"type": "subtitle", "content": "Amazon dog food refunds: Is Wag covered?"}, {"type": "sentence", "content": "Amazon’s A-Z policy often allows for consumers to get their money back. And their safety measures are much less cavalier when it comes to items that they sell directly. But will a popular company like Amazon releasing its own dog food make people want to rush out and buy it? The results are still unclear two years later."}, {"type": "sentence", "content": "One of the main problems with Amazon — specifically for bulk customers — is they’d rather get their larger items on the spot. Why wait for a non-essential package from an online merchant when wholesalers Sam’s Club or Costco skip the pricey shipping fees? Why invest in the tip dog owners (should feel obligated to) give a delivery person for lugging that huge bag of food to the door when they can just buy it at the nearest wholesale store? Or, what about just ordering from a proven pet food membership company like Chewy? (Every auto-ship includes a 5–10 percent discount.)"}, {"type": "sentence", "content": "Whether on Chewy’s site or Amazon’s site, dog owners can get their dog’s next meal. But in addition to the shipping woes, there’s an added frustration for consumers who can clearly see refund policies printed on the backs of the bags of uneaten food. Manufacturers often offer refunds for uneaten portions, with a receipt purchase. That is, if online merchants are willing to honor the manufacturer’s deal at all. It’s much easier to handle this kind of paperwork in brick and mortar stories — in smaller packages — to avoid shipping costs and back-and-forth messaging. But with Amazon’s Wag option only available online, consumers will just have to take a chance."}, {"type": "sentence", "content": "Is it worth it? Bezos clearly is willing to test the idea. When Chewy went public and PetSmart bought them, it was hard to ignore that $8.7 billion price tag. If Chewy can do it, why can’t Amazon? Better yet, why can’t Wag? With more than 2,900 ratings for Amazon’s dry foods (62 percent of which are five-star ratings, as of the publication time), time is still ticking on whether Wag dog food will be as successful as those Amazon Mom diapers were. Either way, Amazon’s dog food name is certainly piquing dog owners’ and dog walkers’ attention."}, {"type": "image", "content": "https://miro.medium.com/max/600/1*ptgUHesIDUrlOQz7pX66RA.jpeg"}, {"type": "sentence", "content": "Shamontiel is a dog lover to her core: 467 completed walks with 76 dogs, eight dog-housesittings and four dog boardings at the time of this publication. Would you like to receive Shamontiel’s Weekly Newsletter via MailChimp? Sign up today!"}], "topic": "business"}