{"title": "The Habit of Challenging the Status Quo", "data": [{"type": "sentence", "content": "Lately, it seems like everyone’s cheese has been moving around a lot. From working in the office to working remotely to hybrids. From one strategy that made sense “before” to the new approach adjusted to the “new normal.” Can we say the status quo is being changed if there isn’t one?"}, {"type": "sentence", "content": "One of the things I’m finding most intriguing currently is how quickly teams seem to adapt to the changes. Sundry processes and habits are going through adaptations, and the vast majority of people are doing fine, not reeling around."}, {"type": "sentence", "content": "Contrast this with the preciousness that seems to abound in the tech industry in the last few years. Jeremiads would accompany every change and adjustment. Advising executives, I’ve learned that the status quo is something we fear prodding, even though that is where our biggest next leaps await."}, {"type": "sentence", "content": "We have now demonstrated that we are capable of ongoing such changes rapidly, and the best teams I’m helping are using these changes to come out of the pandemic better than they came into it. Instead of sanctifying the status quo, you should hold your organization’s neuroplasticity sacred and the growth that it enables."}, {"type": "sentence", "content": "As we are emerging out of our cocoons, we should not forget these lessons. You can change swiftly. You can alter the status quo. Now, rather than adjusting your status quo reactively, you should do so proactively. Imbue on your culture the need to continually challenge the status quo. Voice your ideas. Speak up. We shouldn’t require a pandemic to reinvent ourselves."}, {"type": "subtitle", "content": "Your toolkit"}, {"type": "sentence", "content": "Embracing criticism: When I was a in the IDF corporal I got into an argument with a lt. colonel about the right solution to solve a pressing issue we had to solve. Only later had I realized that having the safety to do that is not straightforward. Create a culture where you embrace criticism and feedback. Egos should be put aside and valuable inputs should be broadcast so that the safety to speak up is instilled in everyone."}, {"type": "sentence", "content": "Implementing wholeheartedly and rapidly: One of the reasons we shy away from change initiatives is that we have change fatigue. You have to treat these changes with the importance they deserve and require everyone to commit to them and execute. Lower your doubling time!"}, {"type": "sentence", "content": "Communication: When you decide on change initiatives, it has to be accompanied by clear communications and explanations. Decision clarity is required so people know that something is going to change and the reasoning behind it."}, {"type": "sentence", "content": "Visible improvement: To maintain your team’s trust and cooperation they have to see that these changes are positive. Even if not every change is a slam dunk, make it a habit to review these after the fact and communicate the results. Share your successes and how they were measured so everyone can celebrate the improvements together."}, {"type": "sentence", "content": "Autonomy and a labs approach: Not all changes require a consensus to get the ball rolling. Providing smaller teams with the autonomy to tinker and share their learnings can be a great change catalyst."}, {"type": "sentence", "content": "© Aviv Ben-Yosef 2020 — Originally published on avivbenyosef.com"}], "topic": "leadership"}