{"title": "How To Live In The Present", "data": [{"type": "subtitle", "content": "Why it can help you and how you can do it"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*hwh9BTOogYBcEBUq"}, {"type": "sentence", "content": "*First Published on my personal blog March 2019 (see note at the end)*"}, {"type": "sentence", "content": "Lately, I’ve been immersing myself in mindfulness. It’s a simple concept, but it’s hard to actually practice it."}, {"type": "sentence", "content": "For those of you that don’t know about it, mindfulness is all about being present in the moment. Not to down your lunch in 30min whilst thinking about what you have to do next, and what that guy said on the way to work, and how will you dress for that fancy night out that’s coming up. But instead to savor your meal and appreciate the things around you at that given time and then when the time is appropriate to wonder or worry about all the other things."}, {"type": "sentence", "content": "As a Masters student that has been living away from my country for the past five years, mindfulness is a very important skill that I know for my sake I need to practice as often as possible. Because, if I don’t, I might be stuck living in a world of memories and ‘what ifs?’ that will just drain my energy and probably give me a heart attack by the time I’m 50."}, {"type": "sentence", "content": "Sadly, I only came to realize this after a couple months of therapy. As some of you know I do struggle with anxiety and depressive mood (not depression, just low mood (dysthymia), don’t worry) and I’ve been for the past few years on and off therapy."}, {"type": "sentence", "content": "Cognitive behavioral therapy -the one that I do- focuses on the acknowledging of thinking patterns and the behaviors that these thoughts create and how they affect your mood and self-talk."}, {"type": "sentence", "content": "So, a basic example of this approach is the student that gets stressed about the upcoming exams. Since she is worried and can’t concentrate she procrastinates in order to find some relaxation, and because she procrastinates she ends up worrying more and more about the exams and about how unprepared she is, and all of this culminates in bad grades."}, {"type": "sentence", "content": "Now, if the said student were to focus on taking it one day at a time, and just revising a little bit every day, taking some breaks and what not, the exam will come and the student will be prepared and not drained and full of cortisol. This is what CBT and mindfulness do; you acknowledge that exams are coming and you are worried, but instead of living in a world of imagining the worst possible outcome if you fail the exams and procrastinating, you just focus on doing the best you can, one day at a time."}, {"type": "sentence", "content": "As Lao Tzu said:"}, {"type": "sentence", "content": "Now, as I mentioned before, it’s way easier said than done. Like everything else in life, it requires practice, and practice, and more practice."}, {"type": "subtitle", "content": "Here are some things that I’ve found useful:"}, {"type": "sentence", "content": "First of all, thinking about the past should be reserved for two occasions: to be grateful and to learn from it. It should definitely not be used to regret or wish to have done things differently so as to change your present. Doing this will only leave you feeling bad and frustrated. Because the past is the past and nothing will change it. And the only thing that will change your current state is the actions you do right now."}, {"type": "sentence", "content": "What you have to realize is that the decisions you made in the past, that led you to this moment, were the best decision at the time. Otherwise you would have done something different."}, {"type": "sentence", "content": "It sounds hippie, but it’s true. Even the ‘bad’ decisions that you did, you made them for a reason, maybe that reason was cause you were unprepared, or you were in a bad mood or something along those lines. But the fact is that that was the state in which you made the decision and at that point in time that was the best decision for your past self, and for becoming who you are now."}, {"type": "sentence", "content": "Remembering in the form of regret is only useful if you are about to make a similar decision, then you can be aware of how in the past that decision played out and if you want to change it or make the same decision. But otherwise, there is just no use in regretting things."}, {"type": "sentence", "content": "Same goes to thinking about the future. If you are going to plan and be proactive for something that is coming, then great, go for it. But if you are going to worry, and ruminate in the possible negative consequences without being proactive and preparing for them, then there is absolutely no point in thinking about the future. As cheesy as it sounds, we live in the present, we live in the now; thinking and stressing about what will happen in 10 days, 10 months or even 10 years it’s a waste of your cortisol if you are not going to be active about it."}, {"type": "sentence", "content": "A very real example is what happened to me back in December. I had a presentation to do in front of my class. First, I decided to panic about it because I remembered how awful my presentations have been in the past and so I just imagined it being just as bad as those ones. And then I only stressed about it and kept on wishing I didn’t have to do it and so on and so on. What ended up happening? I did have an awful presentation that reinforced my belief that I’m bad at presenting and I should not be allowed to talk in front of people. Ever."}, {"type": "sentence", "content": "Now I’m halfway through my Masters and there is a presentation due in July. The presentation of my six months dissertation project, in front of my program leader, supervisor and some other students and markers. So instead of remembering my awful past presentations and feeling bad about myself and trying to come up with excuses not to make it, or even ways to break my leg the week before or cut my tongue out. I’ve decided that it’s about time I apply what I’ve learned through CBT and Mindfulness. This means: I acknowledge that my previous experiences have been bad so I need to train or change something drastically so as not to pass out or puke in front of the audience."}, {"type": "sentence", "content": "And, most importantly, I’m not even thinking about the presentation and how nervous I’ll be or what if this and that goes wrong. I’m focusing on signing up for some small public speaking opportunities, and do some training, and I’m generally just focusing on having a solid dissertation to present. Will this ensure that my presentation will be a success? Maybe not, maybe it will just be added to my bad record of public speaking. But at least this time I’m focusing on what I can do RIGHT NOW and not wasting headspace imagining worst case scenarios and stressing myself five months before it."}, {"type": "sentence", "content": "So, that’s it."}, {"type": "sentence", "content": "When you are feeling stressed, put everything down on a paper, and try and find actions that you can make now to work towards that thing that is stressing you. And if you look into the past to regret, just be thankful that at least now you know you didn’t like that decision or that moment, and be active so as to change those situations in the future."}, {"type": "sentence", "content": "Hope this helps you in some way."}, {"type": "sentence", "content": "I’m not perfect and I have a lot to learn and to practice, but it’s good to remind ourselves that the past is there to learn and smile at, the future is there to aspire to be better, and the present is here to be lived."}, {"type": "sentence", "content": "Happy present!"}, {"type": "image", "content": "https://miro.medium.com/max/6048/0*v5pba4X_2CyfoUB9"}, {"type": "sentence", "content": "Published in March 15th of 2019 on: https://cristinasmindfulmess.wordpress.com/2019/03/15/live-in-the-present/"}, {"type": "sentence", "content": "As of May 2020, I’ve managed to succesfully manage my anxiety and I no longer suffer from low mood. Partly thanks to the advice written in this post, but also thanks to yoga and some self-experimentation. There is a post about ‘How I Overcame Anxiety’ on my profile if you are interested. Thank you for reading!"}], "topic": "mindfulness"}