{"title": "Endless Losses — Red Lobster’s Crab Leg Disaster", "data": [{"type": "subtitle", "content": "Why you need to understand human beings"}, {"type": "image", "content": "https://miro.medium.com/max/10944/1*t8RtQk32HQ6aW0a5NSAmBg.jpeg"}, {"type": "sentence", "content": "I was a competitive swimmer my entire childhood. We trained for hours after school."}, {"type": "sentence", "content": "On the way home, if we were lucky, we’d eat at Golden Corral. It’s an all-you-can-eat buffet in many southern states."}, {"type": "sentence", "content": "I can remember walking up and down the food aisles, filling up my plates with delicious green beans, hot buns, chicken, and mashed potatoes. It was the perfect place for a swimmer: lots of well-earned calories at my beck and call."}, {"type": "sentence", "content": "But I can also remember marveling at some of the people I saw. They seemed to live in this buffet, waiting to get hungry, eating again, going to the bathroom, eating again, waiting, eating again. They’d grown to disproportionate sizes."}, {"type": "sentence", "content": "This is an unfortunate truth of living in America. We have a widespread obesity problem, and all-you-can-eat buffets do us no small favors."}, {"type": "sentence", "content": "And so I was surprised to learn of the strategy that Red Lobster took on — which would ultimately cost the CEO her job."}, {"type": "sentence", "content": "Red Lobster is a chain seafood restaurant that offers a limited all-you-can-eat buffet. Not all menu items are all-you-can-eat. Some seafood is too pricey to just let people gorge themselves to oblivion on."}, {"type": "sentence", "content": "One such item is snow crab legs. They are specialized import items that come off of actual fishing boats from the arctic. They grow slowly and aren’t as easy to farm produce."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*E0GaQ2bFFfKPISR_"}, {"type": "sentence", "content": "Edna Morris, then the CEO of Red Lobster, took a bet that if they offered a specialized all-you-can-eat snow-crab-legs buffet for $22.99, it would increase revenue."}, {"type": "sentence", "content": "Through their internal calculations, they determined that the price point was just high enough (versus the normal $14.99 all-you-can-eat) to create adequate demand for profit."}, {"type": "sentence", "content": "The problem? The people who were willing to pay that $22.99 were either big fans of snow crab legs or they really hated snow crabs — and eating them was their way of expressing that hatred."}, {"type": "sentence", "content": "As the promotion rolled out, people started rolling into this restaurant and devouring snow crab legs. The special would still be profitable if customers ate two plates of snow crab legs. But the people who showed up were often eating more than double that. They were skipping sides and other things, filling up almost entirely on crab legs."}, {"type": "sentence", "content": "Crabmeat isn’t thick. You have to eat lots of those legs to actually fill up."}, {"type": "sentence", "content": "People got their money's worth — and then some."}, {"type": "subtitle", "content": "And then operations had problems"}, {"type": "sentence", "content": "Store management realized it was taking customers a really long time to eat these crab legs. People were spending hours at these tables. They weren’t turning over tables fast enough. The process of cracking open crab legs was too tedious."}, {"type": "sentence", "content": "Because snow crab is an import item from a natural habitat, the government regulates it so that we don’t over harvest. During the promotion, as crab-leg consumption increased, they lowered quotas (less farming allowed), causing the prices to rise. (High demand + low supply = high price.)"}, {"type": "sentence", "content": "Red Lobster had to keep buying up crab legs at exorbitant prices. Combine this with overeating, and the monthly accounting reports began turning red."}, {"type": "subtitle", "content": "And then the scoreboard went official"}, {"type": "sentence", "content": "In one quarter, the company took a $3.3 million in profit loss (which is crushing in the cut-throat restaurant industry). Then, turning a bad problem into a terrible problem, Wall Street analysts downgraded the stock due to their mismanagement. This led to a panicked selloff, leading to $400 million in value being lost."}, {"type": "sentence", "content": "Unfortunately for Red Lobster president Edna Morris, sh*t rolls uphill. She was forced to resign as the chain skipped near the brink of bankruptcy. Their holding company, Darden, was only able to absorb the shock because their other restaurant, Olive Garden, was pulling its weight."}, {"type": "sentence", "content": "Edna’s basic premise for their marketing promotion wasn’t wrong. She took a high-risk, high-reward bet that could have paid off. Unfortunately, she learned the hard way that pricing calculations must be ironclad and include externalities (which this one didn’t). Also, it’s generally dangerous to bet against the hunger of American consumers. We like to eat."}, {"type": "sentence", "content": "Today, you can still eat yourself sick with snow crab legs at Red Lobster. But it’s going to cost you a lot more than $22.99."}], "topic": "marketing"}