{"title": "The Perfection of Resident Evil 4’s Game Design", "data": [{"type": "image", "content": "https://miro.medium.com/max/3840/1*W85_YQm9acbLbHEqTJ04ew.jpeg"}, {"type": "sentence", "content": "Even 15 years and almost 3 console generations apart from its original 2005 release date, the fourth main outing in the Resident Evil franchise continues to be heralded as the pinnacle of the series, if not one of the greatest games of all time. There’s plenty to love about Resident Evil 4, such as its oppressive horror atmosphere and self aware B-movie plot line. However, these aspects pale in comparison to the core game design, which dictates how players are forced to interact with the game on its own terms through a multitude of mechanics that intermingle to deliver an intended experience."}, {"type": "sentence", "content": "The successes of the design on display here are no more evident than seeing its branches rooted throughout contemporary games big and small alike. Whether it’s the over the shoulder camera angle, enemy damage reaction, upgrade systems, or quick time events, the influence of Resident Evil 4 is undeniable; franchises such as Gears of War, Dead Space, or The Last of Us wouldn’t exist as they are without Resident Evil 4. Unfortunately you can also blame this title for the inception of copy cat third person shooters flooding the market in the middle of the 7th console generation; Resident Evil 4’s score attack Mercenaries mode was later adopted (and made even better) in Gears of War’s Horde mode, which in turn popularized the game mode into such an over saturated trend that incarnations to this day continue to assimilate the title of “Horde Mode.” Capcom, the developer and publisher behind the title, took the accolades Resident Evil 4 garnered as a sign that the franchise should be further pushed into an action oriented direction, which was met with wide financial success despite fan outcry."}, {"type": "sentence", "content": "Resident Evil 4 utilizes the “ancient” design of Tank Controls not as a limitation or lack of innovation indicative of its time of release, but as a key pillar in the overall game design. In contemporary times Tank Controls have met reactions of derision, with arguments fielding that their inherent lack of speed and natural control over a player character leads to frustration; these arguments aren’t without merit when painted in broad strokes, but the entirety of Resident Evil 4’s surrounding design is built around this “limitation” in order to solidify the tension of vulnerability that players feel as they’re unable to effectively dodge throughout combat arenas. This design forces players to compensate for their lack of movement capabilities by adapting strategies that compliment it, such as utilizing spatial awareness to prevent avenues of attack from behind you; a popular strategy is to funnel enemies from a singular direction such as a door or corridor. Failure to fend off onslaughts often result in the player being forced to abandon their hastily occupied post in search of a new sanctuary in which they can effectively cut down the horde’s numbers. This is how the the game is designed to be played, a session of musical chairs where players must adapt to ever changing scenarios while keeping in mind their speed deficiency. This unique brand of tension and horror based movement can’t be matched by mechanics driven by mobility."}, {"type": "image", "content": "https://miro.medium.com/max/600/1*0WcU14wOfbwZ_GXz4Gav6w.jpeg"}, {"type": "sentence", "content": "The inception of Tank Controls in earlier titles were a necessary evil due to the nature of the usage of fixed camera angles. Tank controls prevented players from becoming disoriented as they reached a new camera angle; using a modern control scheme only results in the opposite, with players becoming frustrated as they’re pulled out of any illusion of an immersive experience by being forced to constantly reorient themselves as their characters awkwardly jerk around on screen. The Tank Controls affected the entirety of the older titles combat scenarios, with an emphasis placed on tight enemy encounters in narrow hallways. The HD Remaster release of the original Resident Evil implemented a modern control scheme in conjunction with Tank Controls, which shattered the balance of the game design in the process. Enemy encounters became a joke, with players now being able to swerve and juke around the undead with ease."}, {"type": "sentence", "content": "It’s for this exact reason that a demand for a modern control scheme for Resident Evil 4 is often shot down by fans, as the game design was built and balanced with Tank Controls in mind. Everything from the environment to the enemies’ movement and attacks are constructed around the limitations of the player; enemies themselves are restricted to Tank Controls, you won’t see them sprinting, strafing, or spinning on a dime. Without Tank Controls, Resident Evil 4 would just be yet another run ‘n gun shooter. Formulating strategies that compliment your movement restrictions creates an even greater sense of accomplishment for players."}, {"type": "sentence", "content": "While the implementation of Tank Controls play a vital part within Resident Evil 4’s design, the meat and bones of its lasting influence over gaming stems from the combination of the camera perspective and aiming mechanics. As previously established, the camera perspective alone has proven to be one of the most pervasive elements still noticeable in contemporary games, and it’s fora damn good reason. The over the shoulder perspective heightens the effectiveness of the pressure of horror and action simply by pulling the player closer the events occurring on screen. Seeing a zombie chomping into your character in earlier games unfolded feet away from the camera; in Resident Evil 4 the violence and looming threats are mere inches away from you. While modern games such as the Uncharted franchise only utilize the over the shoulder camera when the player is actively aiming their weapon, Resident Evil 4 is unrelenting in its grip on it. This solidifies to the player that the anxiety of danger is ever present."}, {"type": "sentence", "content": "However the camera perspective also serves as a constraint, as it provides a limited field of view that only displays enemies directly in front of the player. This in conjunction with aforementioned lack of mobility maintains the tenet that players must preserve a constant state of spatial awareness. This train of thought can be adapted into arguing for the superiority of first person games over third person, but the former inherently disconnects players from the consequences of failure; dying in Amnesia results in the camera falling over, dying in Resident Evil 4 results in your character being decapitated. on full display."}, {"type": "image", "content": "https://miro.medium.com/max/3326/1*0AXvSURkHR9IqyDiZv6Xgg.jpeg"}, {"type": "sentence", "content": "Whereas shooters enjoy using pin point accuracy, Resident Evil 4 welcomes the principles of inaccuracy and immobility to envelop players in a blanket of horror and uncertainty if their next bullet will be able to save their life."}, {"type": "sentence", "content": "Resident Evil 4 employs a diegetic laser sight instead of a reticule, this serves the dual purpose of creating a more immersive experience as well as sewing the thread of inaccuracy. The laser ebbs and flows in correlation with the shakiness of Leon’s hand, with aiming at distant targets resulting in a myriad of failed attempts. This resulting inaccuracy encourages players to engage enemies in close quarters, where both Leon and the undead are at their deadliest. This culminates in the core doctrine of the game, ensure the player is constantly in danger. This principle faces a divergence, as it doesn’t apply as effectively to rifles, which instead use a scope for pinpoint accuracy (albeit with some minor aim sway). This exception is what makes the rifles such an important weapon in the player’s arsenal, as this unique ability empowers it’s utility into another realm of value. The rifle easily becomes a dedicated instakill machine for basic enemies, but the game balances this by supplying far fewer munitions in comparison to the rest of your weapons."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*sE9mEtZdO2e8_WYziNR1Nw.jpeg"}, {"type": "sentence", "content": "Not being able to move proves another fruitful avenue of placing players in danger, forcing them to dedicate themselves to a position instead of relying on contingency plans of simply walking backwards. This in particular is a popular talking point of contention, but it ultimately suits the horror themed action."}, {"type": "sentence", "content": "Combat flow revolves three methods of offensive capabilities, shooting, knifing, and context sensitive melee attacks. When properly intermingled with one another these tactics allow players to thin out enemy forces while effectively rationing their ammunition. While not as strict with its resources as previous titles, players are still urged to use their ammo wisely lest they run out."}, {"type": "sentence", "content": "The increase in resources and offensive outputs culminates in a distinct shift away from strictly survival horror, instead aiming for action based gameplay. Resident Evil 4 aims to make the character simultaneously vulnerable and empowered through the aforementioned increase in resources, methods of attack, and and ever growing arsenal of death. This effectively puts Resident Evil at a crossroads of what is a more effective means of horror, being completely vulnerable and forced to run away (Outlast, Soma, etc…), or being vulnerable but being forced to confront it head on. This sense of empowerment only continues to magnify as the game continues, with ammo being such a common commodity that you can afford to spray enemies non discriminantly because the surplus of munitions won’t even fit in your inventory. The transformation from a frightened survivor rationing their single box of handgun ammo into the Rambo esque action hero is felt directly by the player."}, {"type": "sentence", "content": "Offensiveness as a focal point is only magnified by the Merchant, a mysterious NPC who serves the purpose of upgrading your arsenal in exchange for treasure found by either killing enemies or exploring the environment. The mere existence of the upgrade system changes the core dynamics of the franchise, as players are now incentivized to kill every enemy in sight in order to grow stronger; this spits in the face of earlier titles’ philosophy of avoiding any and all unnecessary fights. With this change the player is pushed to become the hunter, not the hunted."}, {"type": "image", "content": "https://miro.medium.com/max/1272/1*A7xuPzHgEKNJvU8yCXhshA.jpeg"}, {"type": "sentence", "content": "This in turn also creates a meta risk vs reward scenario in which players need to assess if they have enough resources to properly engage with optional challenges; success in these challenges means nothing if you’re left with nothing afterwards. An early manifestation of this is birthed when the players is forced to choose between fighting a hoard of villagers or a boss fight against a hulking monstrosity of a giant, suitingly named El Gigante. A complete risk driven gamer can even choose to tackle both challenges if they’re daring enough, thus guaranteeing that their weapons will be as prepared as possible for upcoming bosses."}, {"type": "image", "content": "https://miro.medium.com/max/680/1*lBdWzxKLVBUD9pxSGor1IA.jpeg"}, {"type": "sentence", "content": "While the aforementioned is a premeditated decision, a more visceral and immediate one is made when the player is attacked by two Gigantes concurrently; one of these colossal titans is more than enough of a challenge, facing two is almost certain death. Thankfully for the player a nearby mechanism allows them to open up a non conspicuous fire pit to instantly kill a single giant, leaving them with only a single headache to tackle."}, {"type": "sentence", "content": "The downside of this option is losing out on the pile of treasure if the player had slain the beast via normal methods. The player is forced to evaluate if spending twice the amount of resources for treasure is even worth it, or if they can even surmount the obstacle at all."}, {"type": "sentence", "content": "Despite Resident Evil 4’s ever present influence in contemporary games, it is an outright travesty that its enemy reaction mechanics haven’t been implemented as widely (The Resident 2 Remake carries the torch wonderfully, although the remake of 3 sacrifices this game performance). in the overwhelming majority of modern shooters enemies simply brush off being shot as being ultimately inconsequential until the moment they die from the killing blow. Resident Evil 4’s enemies have dynamic reactions and animations based on where they’re attacked. Bullets and guns feel powerful because the kinetic force of their impact exerts against enemies, with limbs and torsos being pushed back and twisted. Shooting an enemy in the fact will send it reeling backwards or grasping it in pain. Arm shots stun and force enemies to drop any weapons they’re carrying, while leg and knee shots are an effective means of bringing them down to the ground for a period of time."}, {"type": "sentence", "content": "Another innovation that Resident Evil 4 and God of War pushed to the forefront was Quick Time Events (QTE), a mechanic that has been bastardized by the industry to the point of actively being an annoyance that has mostly disappeared in recent years; these annoyances stem from constant button mashing or being implemented for menial tasks such as opening doors."}, {"type": "sentence", "content": "Resident Evil 4’s approach to QTE’s is using them strictly to ensure that players remain in a vigilant state of stress, regardless if it’s during normal gameplay sections or cutscenes. Gameplay QTE’s come in the form of forcing Leon to quickly dodge enemy attacks, such as in the Verdugo chase sequence where relentless attacks are being launched by an unseen enemy, prompting players to anticipate and react in a split second to the eventual onslaught."}, {"type": "image", "content": "https://miro.medium.com/max/800/1*52GkzkQpLkpfoxacxlebeA.jpeg"}, {"type": "sentence", "content": "A core pillar of design that separates the debauchery of modern QTE’s from Resident Evil 4’s application of them is it’s consistency and reliability of buttons used. Evasive maneuvers are exclusively tied to two button combinations while mashing sequences are one of two dedicated inputs. By constraining itself the game creates a sense of fairness, as player instincts will have them well prepared for either prompt."}, {"type": "sentence", "content": "One of the most sinister additions to the series is the Game Rank system, a hidden feature that subtly changes the game difficulty on the fly for the purpose of keeping players consistently within just the right amount of danger; developers want you to escape death by the skin on your teeth. These types of systems are commonplace nowadays, with one of the more common instances being the last tenth of your health bar actually being worth more than its perceived percentage. Left 4 Dead brought this subtlety into the limelight with its Director, which was highlighted in previews up to the game’s release. This director assessed how well survivors were playing and dynamically change item and weapon locations, as well as spawning in tougher special infected as needed. Resident Evil 4 disseminated this trend into the mainstream with its Game Rank mechanic, as it would change enemy numbers,health, and damage output in accordance to how (in)effective players are. There are a few select areas in which a high Game Rank will spawn extra mobs of enemies, such as a segment in the castle where archers and scythe wielding foes present an even more difficult confrontation; repeatedly taking damage and dying will eventually lead to your rank falling below the threshold that generates these adversaries."}, {"type": "sentence", "content": "Resident Evil 4’s influential grip is undeniable, whether it originates from its over the shoulder perspective, upgrade system, quick time events, or procedurally changing the game difficulty. As it stands, this 2005 entry remains one of the best games available on the modern gaming landscape."}], "topic": "gaming"}