{"title": "You’ve Got a Fern Request", "data": [{"type": "image", "content": "https://miro.medium.com/max/3020/1*KojOtvCnw5xZN3wkcPe8ig.png"}, {"type": "subtitle", "content": "What if plants could follow you online?"}, {"type": "sentence", "content": "Here’s the story on how I got my houseplants to set their social media profiles (sorta)."}, {"type": "sentence", "content": "Prototypes are my favorite activity and part of the design process, and I feel that every time I start a prototype, something completely different comes out, which is even better than I had hoped. There are very few other ways to get as much learning in a short time than from building prototypes for your ideas."}, {"type": "sentence", "content": "Yesterday, I woke up feeling exhausted after a week of reading and writing a lot, I thought to myself, that for whatever I was going to do today, I would want someone else to create all the content for me. That someone else was AI in this case, and that thing was a social media profile for houseplants."}, {"type": "subtitle", "content": "My houseplants, a strong bunch"}, {"type": "image", "content": "https://miro.medium.com/max/2888/1*nXDnQ7xBGY6NfYBGgopeKg.png"}, {"type": "sentence", "content": "While folding the laundry, I started to think about my houseplants and how the ones I have now are the strong ones that survived without much care. I realized that some that didn’t make it weren’t fit for my apartment and care style — consisting mostly of watering them. So I thought about immortalizing this particular group of survivors and wondered if other people who have the same kind of plants could help me find a greater variety of species that would survive in my house."}, {"type": "sentence", "content": "But photos weren’t enough to set my plan in motion, I had to know more about these green warriors to connect with others."}, {"type": "subtitle", "content": "Tell me more about you"}, {"type": "image", "content": "https://miro.medium.com/max/1844/0*ODVuevnb4j-ZdUWv"}, {"type": "sentence", "content": "Since plants can’t talk, and I also don’t want to do any content creation work today, I figured I’d had computer vision help me tag my plants. I used the Vision AI API to generate tags for my plants based on the photos. This would allow me to categorize them, and I could use the generated tags to find more information. Remember, I still don’t want to create any content, if possible."}, {"type": "subtitle", "content": "Don’t leaf me alone!"}, {"type": "image", "content": "https://miro.medium.com/max/2448/0*FqRH21R3f8RBFvyK"}, {"type": "sentence", "content": "Now that my plants had tags, I realized they’d be alone and friendless unless I could find other similar plants. That would also help to get more tags and correct some that might be off."}, {"type": "sentence", "content": "I fetched similar images of plants from the Vision AI API and it seemed like I was still getting away with my plan of not creating content."}, {"type": "subtitle", "content": "Can’t make friends without knowing their names"}, {"type": "image", "content": "https://miro.medium.com/max/2464/0*8lf9Id1RkuLnseWD"}, {"type": "image", "content": "https://miro.medium.com/max/2416/0*VB_4Q3sSikFHU-7V"}, {"type": "sentence", "content": "At this point, I had a nice profile set for my plants, but our silent housemates would need names to find and connect with those other plant owners. I figured there had to be a service that would generate names by entering the tags or keywords. A quick google search and I was looking at a service called Namelix, which solved my plant name problem reasonably fast."}, {"type": "subtitle", "content": "Plants need bios"}, {"type": "image", "content": "https://miro.medium.com/max/2960/0*D-U1Mx9cWETSccCf"}, {"type": "sentence", "content": "I realized that my plants couldn’t generate content, but I wasn’t going to let their profiles go empty; after all, I was way past my initial goal and into the dark side of my prototypes."}, {"type": "sentence", "content": "I used Rapidminer to extract random bios from Twitter users, draw nouns, and create a replacement map with the tags. The result was a list of potential bios for my plants."}, {"type": "sentence", "content": "Now we’re talking."}, {"type": "image", "content": "https://miro.medium.com/max/1532/0*dVH0J9WrWEc0Dtq4"}, {"type": "subtitle", "content": "No posts, no followers"}, {"type": "sentence", "content": "Now that my plants had somewhat of a personality, they had to also have a voice. What could I possibly do to create their social media posts? I figured it would be easy to use their new shiny bios and generate content based on that. Cue Talk to Transformer, a service that will create content using a neural network to complete text."}, {"type": "image", "content": "https://miro.medium.com/max/1928/0*zLlI10V060j09OHe"}, {"type": "subtitle", "content": "Will these houseplants try to sell you Herbalife products on social media?"}, {"type": "sentence", "content": "Just so that they don’t spend too much time online and veer off the good path, I’ve figured I’d give my plants jobs. Using Brand Mark, a service to generate professional logos for business, I created possible employers for my oxygen-giving friends."}, {"type": "image", "content": "https://miro.medium.com/max/2824/1*iCUR3zFIXouPBB7Sq7Ru4Q.png"}, {"type": "subtitle", "content": "The end result"}, {"type": "image", "content": "https://miro.medium.com/max/5300/1*yyoBjgU5FVf80V5CGuDGOQ.png"}, {"type": "sentence", "content": "Get to know my lovely plants and their profiles."}, {"type": "subtitle", "content": "What I’ve learned from being lazy about content creation"}, {"type": "sentence", "content": "I was amazed at how much I could generate from this short experiment. I probably tested around 20 generators and APIs I had no idea about and feel that I understand more about what’s happening right now in terms of AI-assisted content generation."}, {"type": "sentence", "content": "I believe this information will come handy later at some project, or maybe when I feel lazy again in the future. I see a lot of potentials for generating novel prototypes or as an activity for someone trying to learn more about AI."}, {"type": "sentence", "content": "Do you know any other content generators? I’m still trying to figure out how to get the plants to talk to each other, but maybe that’ll stay for another day."}, {"type": "sentence", "content": "Thanks for reading, and remember to water your plants."}], "topic": "data-science"}