{"title": "5 Reasons I Was Broke As a Beginner Freelancer", "data": [{"type": "subtitle", "content": "It wasn’t a lack of work. It was my mentality."}, {"type": "image", "content": "https://miro.medium.com/max/4096/1*kavW7Ux8uAEayQpci2gVfA.jpeg"}, {"type": "sentence", "content": "Have you seen the articles about people quitting their jobs and then earning $100k in their first year of freelancing?"}, {"type": "sentence", "content": "Yeah, I’m not one of those people."}, {"type": "sentence", "content": "For the first 2 years after quitting my job and going freelance, I was barely making ends meet. I had plenty of work, but somehow that didn’t mean lots of money. I had to work all types of side-jobs to survive (which was a positive experience, but another story)."}, {"type": "sentence", "content": "I think it takes a certain type of person to run a successful business. No, it’s not ‘talent’ — you aren’t born that way, but you do need to grow into that person at some point in your life. Some may take to business naturally, others, like myself, need to make a lot of mistakes to get there."}, {"type": "sentence", "content": "I’m going to share everything I did wrong in the beginning of my freelance career. Some of these may be just my personality, but I’m sure I’m not the only one."}, {"type": "sentence", "content": "I hope this helps someone that’s struggling like I was."}, {"type": "subtitle", "content": "1. I was terrified of video and voice calls"}, {"type": "sentence", "content": "I always hated talking on the phone when I was a kid. And despite being 23 years old when I started my freelance journey, I was still very anxious about calls with clients."}, {"type": "sentence", "content": "A call scheduled in the evening would be a dark stormcloud over my head all day. During the call, I would stumble over my words and sometimes even forget normal English grammar. After a call, my shirt was drenched in sweat."}, {"type": "sentence", "content": "I know I’m not the only person that is like this. Telephobia is a real thing for many people — becoming even more common in our modern age of instant messaging and no voice calls — and it will kill your freelance career if you don’t overcome it."}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*s-fnZmE-maM_R-to0iTcyw.jpeg"}, {"type": "sentence", "content": "The thing is, freelancing is so often a long-distance thing, and you need to earn your clients trust. Nobody wants to pay someone thousands or even hundreds of dollars if they’ve never even heard their voice or seen their face."}, {"type": "sentence", "content": "You have to put yourself out there, let a person get to know you, show some personality on your website, and yes, you must overcome your fear of voice and video calls."}, {"type": "sentence", "content": "How do you do that? Practice. I’m not a psychiatrist, but I can tell you that each call will be just a bit easier than the last. If each call is just 1% easier, after 100 calls you will have no fear at all. For me it took around 20–30 calls to stop being stressed about them."}, {"type": "subtitle", "content": "2. I was uncomfortable talking about money"}, {"type": "sentence", "content": "Clients always request extra features, projects always change in scope. It’s a fact of life."}, {"type": "sentence", "content": "In these situations, you just need to remind the client of the agreed-upon scope of work, and tell them that extra work will cost extra. No problem, right?"}, {"type": "sentence", "content": "Except it’s an awkward and potentially confrontational conversation. So instead of saying that something was going to cost extra, or that it was out of scope, I found it easier to just do that extra bit of work without saying anything. I also felt like I was being greedy asking for more money."}, {"type": "sentence", "content": "This was a loser’s mentality. I was realistically giving away 5–10 hours a week in free work, simply because I was uncomfortable asking for more money."}, {"type": "sentence", "content": "Freelancing is a business. There is no such thing as being greedy, there’s only the numbers you need to keep the lights on. You need to start acting like a real business, and to do that, you need to think about your pricing as a company policy, not your personal desire."}, {"type": "sentence", "content": "What I mean is, imagine if it wasn’t your business. If you were just an employee of a company — you would have no problem talking about the costs of the company’s services, right? Try to keep that mentality when you talk to a client about money."}, {"type": "subtitle", "content": "3. I had a ‘poor mindset’"}, {"type": "sentence", "content": "For the majority of westerners, being more money-conscious is a good thing. The common issue is that they earn a lot of money, but overspend and don’t have any left over."}, {"type": "sentence", "content": "I had kind of the opposite problem. Since a very young age, I knew that money didn’t grow on trees. My family were immigrants in an expensive country, we weren’t ‘poor’, but definitely quite money-conscious and frugal in our spending habits. Whereas someone else might have spent $100 on a night out, for me this was crazy. It should be carefully budgeted on groceries for the week."}, {"type": "sentence", "content": "Now fast forward about 15 years to the beginning of my freelance career (and my first years living alone and paying rent), and $100 still seemed like a lot of money for me. I subconsciously thought that everyone else was broke like me, and I was genuinely concerned about overcharging my clients. I would feel very guilty if they had to pay me an extra $20 or so."}, {"type": "sentence", "content": "The reality is, people with businesses that are hiring web developer, don’t think much of $100. It took me a long time to realize this. But with experience, I saw how some of my clients treated their money. I saw how they viewed $2000 as not a big deal, and I realized, damn, people actually have money. I don’t need to feel guilty about doing my job."}, {"type": "sentence", "content": "You can’t run a business while thinking that $100 is a lot of money. The world is a very scary and expensive place when you think that way. You have to think bigger."}, {"type": "subtitle", "content": "4. I didn’t value my time"}, {"type": "sentence", "content": "Let’s say I charged $40/hour. This is on the low end for web development work, but ok for a beginner, right? It can work if you are effective in charging for your time."}, {"type": "sentence", "content": "Here’s how you make it not work."}, {"type": "sentence", "content": "I would charge $20 for a task because it should only take 30 mins. In reality, it would take 1 hour, and the time spent communicating with the client would be another hour. Two hours of work for $20? So I was effectively working at $10/hr."}, {"type": "sentence", "content": "Did I adjust my rates after realizing that? No, not for a long time! Because I stuck to the idea that it should only take half an hour, and if it took me an hour, it was because I was sh*t at my job. So I should have to pay for that, and not my client."}, {"type": "sentence", "content": "It was much later that I realized my estimations were just unrealistic. When I saw the work of other web developers — the poor quality of it, how long they took, and how much they charged — I realized that my clients were getting an absolute bargain!"}, {"type": "sentence", "content": "I was actually good at my job. Better than 90% of the competition, and I was undercharging, not just in my hourly rate but in my time estimations."}, {"type": "sentence", "content": "This wasn’t one realization either. It happened in several stages, with me gaining confidence each time. So if you doubt yourself and your skills, try to look at yourself objectively, and compare to someone of your own level (not the top bloggers in your industry)."}, {"type": "subtitle", "content": "5. I didn’t want to take on responsibility"}, {"type": "sentence", "content": "At the beginning, I was focused on ‘small tasks’ and maintenance work. This is a type of work common in web development."}, {"type": "sentence", "content": "The reason I started with this kind of work is because you don’t need to promise anything big. And often, you don’t even need to have a call with the client."}, {"type": "sentence", "content": "The problem is that its cheap work. You will never be able to pack so many small tasks into your day to make a decent income."}, {"type": "sentence", "content": "The way to bigger money is bigger projects. And with bigger projects, you need to promise that you can actually do something, and you need to deliver what you promise."}, {"type": "sentence", "content": "It can be a daunting thing, to take responsibility for the success of a client’s website, and for a long time, I avoided it."}, {"type": "sentence", "content": "Eventually, you will just need to step up your game. People need a professional that can solve their problems for them. Not just a pixel pusher."}, {"type": "sentence", "content": "Once I actually started thinking about my client’s problems — instead of what they told me to do — I found that I could steer a project towards more simple and elegant solutions."}, {"type": "sentence", "content": "If you just do what your client asks you to do, you will often find yourself completing very difficult and awkward tasks. You have to be the expert and take the lead."}, {"type": "sentence", "content": "Taking responsibility over a project actually made my job easier."}, {"type": "subtitle", "content": "Despite all this, I love freelancing because it forces you to grow"}, {"type": "sentence", "content": "As a freelancer, you are your business, and your personal failures directly affect your income. Therefore, to earn more money you must become a better person. This is amazing and I know of no other career path that will do this for you."}, {"type": "sentence", "content": "No other career will challenge you in so many ways. No other career will give you that immediate feedback whether you are doing something right or wrong. (To get fired in a full-time job, you need to really screw something up)"}, {"type": "sentence", "content": "Leaving the safety of employment if like going out into the forest to hunt for your own food. You’re either going to starve, or you’re going to learn how to hunt. Some are naturally good hunters, and some, like me, need to starve for a bit to learn the lessons they need."}, {"type": "sentence", "content": "But once you’ve learned the lessons, you are a more capable and independent human being."}, {"type": "sentence", "content": "So if you're a broke freelancer or a starving artist, I hope my article doesn’t discourage you. Just know that I’m able to write it now because that’s not me anymore. I’ve grown out of those mistakes, and you will too."}, {"type": "sentence", "content": "Join my email list to stay in touch."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}