{"title": "Nobody Cares About Your App Idea — Here’s How to Change That", "data": [{"type": "image", "content": "https://miro.medium.com/max/4096/1*Rrm16km4tCCAQmeeiEnRyg.jpeg"}, {"type": "subtitle", "content": "Harnessing Live Video for the Next Generation of Gaming & Apps"}, {"type": "sentence", "content": "You know that app idea that’s been rattling around in your head? The one that’s too good to tell others about, where the details are sketched in your favorite notebook. It has your favorite songs and references. It’s so you, and finally the world will see what you have to say."}, {"type": "sentence", "content": "No one wants it."}, {"type": "sentence", "content": "Not me, not the person next to me in line at the coffee shop, and not the people working there either. Why does your app matter to us? What do your users need in their lives? Have you even asked? People download and delete apps at a dizzying pace, ravenous for new games. Let’s figure out why your idea deserves to exist, and how you can make it matter to today’s mobile users."}, {"type": "sentence", "content": "Before we do any more sketching or coding, let’s look at some mobile market stats."}, {"type": "subtitle", "content": "The Market for Mobile Games"}, {"type": "sentence", "content": "The mobile market is expanding, yet retention is declining:"}, {"type": "sentence", "content": "In other words, if you attract 1,000 users through your initial launch, by Day 2 you’re at 360, but by Day 7 it’s dropped to 115, and by Day 28 it’s maybe 50 people."}, {"type": "sentence", "content": "The market for mobile games is increasing year-over-year, yet the amount of people who will stick around long enough to play your cool-new-thing is shrinking. Perhaps people are looking for something else in a market saturated with clones of other games. What are they looking for? Better yet, why are they looking for new games in the first place?"}, {"type": "subtitle", "content": "An Entrepreneurial Approach to a Crowded Market"}, {"type": "sentence", "content": "Instead of inducing more nostalgia with new games, let’s look to solve a problem facing our society today. If we can tap into a need that’s unmet by culture, we differentiate our product beyond factors like “genre” and “art style” and create something fresh that brings value to a noisy market."}, {"type": "sentence", "content": "An issue that faces Americans today is the increasing phenomenon of loneliness."}, {"type": "sentence", "content": "Almost every other person you walk past on the street feels lonely most of the time, and the trend is heading upwards."}, {"type": "sentence", "content": "While the real root cause for this loneliness is up for spirited debate, I think it’s fair to say that in American society today, we are spectacularly failing at providing the culture or services to nourish our relational needs and personal esteem. Social bonds are a fundamental need of humanity. We don’t function properly without interaction and feedback from the groups we participate in."}, {"type": "sentence", "content": "Never in history have our peers been more accessible. With a few taps of my thumb on a smartphone I can order a pizza to my friend’s house and video chat them to see how it was. Yet we painfully yearn for the simple pleasure of having a friend we deeply trust and interact with daily. Again, why are people looking for new games in the first place? We’re lonely, don’t know what to do about it, and hope that new games will help."}, {"type": "sentence", "content": "What can we do as developers to more effectively meet this underserved need?"}, {"type": "sentence", "content": "We can build apps and games that are aimed at creating and improving human bonds, thus enhancing the lives of players everywhere. In doing so, I believe we’ll experience a massive improvement in the retention, conversion rate, and monetization of this new wave of experiences."}, {"type": "subtitle", "content": "Your Vibe Attracts Your Tribe"}, {"type": "sentence", "content": "Let’s say we want to build a mobile game where a community is inseparable from the experience."}, {"type": "sentence", "content": "Since our experiential and monetary success are tied to people finding satisfaction interacting with other players during play, let’s analyze some choices for implementing interaction into our experience."}, {"type": "sentence", "content": "On one hand, we can use a standalone service like Discord. It’s relatively simple, well known in the game space, and effectively removes the overhead of setting up communication services. While making things easier in the short run, players associate their interaction and communication with Discord, instead of your game."}, {"type": "sentence", "content": "Another option is to embed the interaction directly into your game using a service like Agora. By empowering developers to easily integrate group video-chats within the context of the experience, players can quickly spin up group video/voice chats to talk and play in the same place. As a result, the associations of interaction, gameplay and community are streamlined into one experience."}, {"type": "sentence", "content": "As people participate in this community that they have helped to build, the intrinsic value generated adds value to your game. Time-in-app and app loyalty increase, significantly boosting the likelihood of in-app purchases."}, {"type": "sentence", "content": "Players will advocate for your game, word-of-mouth brings in interested friends, and the community strengthens. Your application is now a hangout spot, a stomping ground, and something of value that people participate in."}, {"type": "sentence", "content": "People want to play your game so they can hang out, and they want to hang out so they can play."}, {"type": "subtitle", "content": "The Value Added by Live Video Engagement"}, {"type": "sentence", "content": "Fortunately, there has never been a better time than today to leverage technology to connect people using Agora."}, {"type": "sentence", "content": "Let’s look at the effects of Agora’s face-to-face capability in a real use-case. As a successful pre-existing dating app, EastMeetEast integrated Agora’s video chat services into its platform. By enabling users to connect face-to-face:"}, {"type": "sentence", "content": "To put that into context, let’s say I have a user base of 1,000 people, each of whom are using the app for 5 minutes a day. On a normal day, I can expect about 5,000 minutes of usage inside my app. After integrating Agora video chat, I can now expect roughly 8,220 minutes of usage per day (1,370 users engaged for 6 minutes a day). That’s a 64% increase of total time spent in my app per day! Put another way, imagine making $8220 instead of $5000 per month because people can see each other in your app."}, {"type": "sentence", "content": "This increase in engagement was created solely from users seeing each other live and connecting on a deeper level. By using Agora, you are tapping into the next generation of human interaction, and this is only just the start!"}, {"type": "sentence", "content": "Agora’s superiority in facilitating real-time engagement is maintained by three key advantages:simplicity, power, and support."}, {"type": "sentence", "content": "SimplicityAgora enables creators and devs of all levels to get up and running quickly. The SDK is easy to use, supports numerous platforms, and tutorials are supported to reduce your time from start to successful connection. Simply plug-and-play to tap into the world’s leading real-time engagement platform."}, {"type": "sentence", "content": "PowerAgora is built upon our SD-RTN, which is essentially a private, VIP internet optimized for voice/video chat and interactive streaming. It’s globally accessible and performs above competition despite varying devices, latency, and location. “With Agora, you get 20–30 video/audio profiles with the ability to choose according to your use case. Agora’s option to choose the lowest video profile to reduce impact on the device and latency was a game changer,”-Selcuk Atli, CEO of Bunch"}, {"type": "sentence", "content": "SupportAgora provides best-in-class developer support. Our team is dedicated to designing solutions specific to your individual use-case to provide the best quality possible for your experience. We also offer 24/7 support services to unblock developers when they are stuck or looking for best practice tips."}, {"type": "sentence", "content": "So yes, the number of paying players in mobile games is increasing year-over-year, alongside the difficulty for players to see and advocate for your app. However, I believe there is a huge opportunity for developers to use the next generation of tools to facilitate meaningful interactions between people, and create products that stand out amongst the crowd."}, {"type": "sentence", "content": "By using Agora, you can focus on the experience that makes your product great, and avoid the headache required to set up your own globally accessible video-chat network. I look forward to seeing what you all make, and to a brighter future because of you, intrepid developer!"}, {"type": "sentence", "content": "If you would like to reach out, feel free to email or find me on Slack at agoraiodev.slack.com"}, {"type": "sentence", "content": "Cheers,"}, {"type": "sentence", "content": "Joel"}], "topic": "gaming"}