{"title": "Bear Tracks", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "sentence", "content": "Jacob locked the door behind him and waved to his friend Brandon in the driver’s seat of the black SUV in his driveway. He tossed his bag into the trunk and closed it before getting into the seat behind Brandon’s girlfriend of four years, Jessica."}, {"type": "sentence", "content": "“Hey, Jacob,” said Jessica. “This is my friend, Abby.”"}, {"type": "sentence", "content": "“It’s a pleasure to meet you,” said Jacob. He nodded and shook Abby’s hand."}, {"type": "sentence", "content": "“You excited, man?” asked Brandon."}, {"type": "sentence", "content": "“I’m not excited about waking up before seven on a Saturday,” replied Jacob. “Around what time should we get there?”"}, {"type": "sentence", "content": "“We’ll be at the cabin before noon,” replied Jessica. “Won’t take long to situate ourselves once we’re there and then you boys can get started on lunch.”"}, {"type": "sentence", "content": "“I brought a ton of burgers,” said Brandon."}, {"type": "sentence", "content": "“Sounds delicious,” said Jacob. He brushed his hand through his curly black hair and let out a heavy sigh."}, {"type": "sentence", "content": "Jacob watched as the world he knew drifted further away in a green blur out the window. He wasn’t sure why he agreed to come along, but Brandon always seemed to have a way of convincing him — having once even convinced him to go skydiving despite his fear of heights."}, {"type": "sentence", "content": "The stations on the radio would drift in and out, and Jacob couldn’t help but smile whenever a country song would suddenly cut out, not because he didn’t like it, but because Brandon seemed to like it a little too much and knew the words to practically every song."}, {"type": "sentence", "content": "It was around ten, just after they’d stopped for a quick bathroom break and to refill their coffees, that the song on the radio sent Jacob into a memory he’d been trying to push away. The song was classic rock, and had been one of his favorites ever since he could remember. It was the song that brought him and his most recent ex-girlfriend closer together when they’d first met — finding things in common was his go-to when it came to first dates. Eventually the song became their song and he’d find a reason to play it every time they got into the car together, even plotting ways to incorporate it into an engagement if things ever got that far. Four months later and he still couldn’t shake the memories of them swaying in the car to the song while going to friends parties, family gatherings, or just out for a drive."}, {"type": "sentence", "content": "“Brandon,” said Jacob, “could you, uh, the song.”"}, {"type": "sentence", "content": "“Oh, right,” said Brandon. “My bad.”"}, {"type": "sentence", "content": "“What’s wrong with the song?” asked Jessica."}, {"type": "sentence", "content": "“It’s nothing,” said Brandon. “He just doesn’t like it.”"}, {"type": "sentence", "content": "“I’ve never much cared for that song,” said Abby. “I’ve always preferred grunge to hair metal.”"}, {"type": "sentence", "content": "“Me too,” said Jacob."}, {"type": "sentence", "content": "When they arrived at the cabin Jacob helped Brandon bring the bags from the trunk inside. The cabin was cozier than Jacob had imagined when his friend first told him about the trip."}, {"type": "sentence", "content": "“Just like I told you,” said Brandon. “Two bedrooms.”"}, {"type": "sentence", "content": "“And one bathroom,” said Jessica. She was unpacking one of the bags on the couch, pulling out can after can of various vegetables."}, {"type": "sentence", "content": "“We’ll be fine,” said Brandon. “Jacob and I can just go outside, right?”"}, {"type": "sentence", "content": "“Don’t wink at me for that,” replied Jacob. “One will be fine. Should I sleep on the couch, or…”"}, {"type": "sentence", "content": "“Nonsense,” said Jessica. “You’re sharing a room with Abby.”"}, {"type": "sentence", "content": "“Are you okay with that?” asked Jacob, looking over to Abby as she stood by the window."}, {"type": "sentence", "content": "“Of course,” she replied. “I won’t bite.”"}, {"type": "sentence", "content": "“Jacob’s been known to nibble,” said Brandon."}, {"type": "sentence", "content": "“Stop saying things like that and then winking,” replied Jacob. He cracked a smile and was relieved when everyone began to laugh. He walked out onto the porch and then around to the back patio that overlooked a rather large fishing pond. On the other side of the pond sat an older man, most likely retired thought Jacob, alongside a woman of around the same age. He waved to them and they returned the favor."}, {"type": "sentence", "content": "“Mind if I join you?”"}, {"type": "sentence", "content": "Jacob turned around and saw Abby walking towards him."}, {"type": "sentence", "content": "“Sure,” he replied. “I’m actually going to sit for a bit, could use the company. I’m sure Brandon will come find me soon enough to help with lunch.”"}, {"type": "sentence", "content": "“He likes messing with you, doesn’t he?”"}, {"type": "sentence", "content": "“I return the favor every now and then, we’ve known each other for so long that it’s just the way things are with us.”"}, {"type": "sentence", "content": "“How long have you known him?”"}, {"type": "sentence", "content": "“Since middle school,” replied Jacob, his gaze was lost somewhere in the pond. “More than ten years. It doesn’t feel like it’s been that long. How about you, have you known Jessica long? I’m surprised we haven’t met before.”"}, {"type": "sentence", "content": "“Only a few months,” replied Abby. “I was at a bar with some friends and she was with Brandon and some of their friends and then we all started mingling. I’ve hung out with her almost every weekend since. We like to meet up for coffee on Sundays, sometimes to discuss the week, other times to try and piece together what happened the night before.”"}, {"type": "sentence", "content": "“Sounds like you two hit it off. Brandon and I will usually hangout a few times a month, usually over a cocktail or two in my backyard.”"}, {"type": "sentence", "content": "“Lovebirds!” Jacob turned around and rolled his eyes as Brandon walked towards him. “Mind if I borrow him for a bit, Abby?”"}, {"type": "sentence", "content": "“I suppose,” she replied. “But not for too long.”"}, {"type": "sentence", "content": "“You have my word,” replied Brandon. “Come on, pal. We need to get cooking. I’ll get the burgers started. You like shucking corn, right?”"}, {"type": "sentence", "content": "“Doesn’t everyone?” replied Jacob, smirking at Abby as he got up from his chair."}, {"type": "sentence", "content": "Jacob brought over four ears of corn on a plate and placed them on the table beside the grill."}, {"type": "sentence", "content": "“I prefer my burger a bit more on the medium side,” said Jacob."}, {"type": "sentence", "content": "“Well-well done is about all I’ve got,” replied Brandon. “I went to grab us some beers and well, yeah. Here,” he handed Jacob a can of light beer. “Let’s get the burgers off this grill and let the corn takes its place. Did you butter those up yet?”"}, {"type": "sentence", "content": "“And salted them,” said Jacob."}, {"type": "sentence", "content": "He watched as Brandon took an ear from the plate and placed it beside a burger, then continued to swap them back and forth until all the corn was on the grill and all the burgers were on the plate."}, {"type": "sentence", "content": "“Could always use some more salt,” said Brandon."}, {"type": "sentence", "content": "“I don’t think that’s a good — ”"}, {"type": "sentence", "content": "“What?”"}, {"type": "sentence", "content": "“Never mind.”"}, {"type": "sentence", "content": "“So, how are things going with Abby? Jessica thinks you two would make a great couple.”"}, {"type": "sentence", "content": "“You know I’m still not over what happened with Bridgette yet.”"}, {"type": "sentence", "content": "“That was months ago, man. You know she’s already dating someone new, right?”"}, {"type": "sentence", "content": "“She is? I mean, that’s okay.”"}, {"type": "sentence", "content": "“Bridgette wasn’t the nicest to you either, man. I know it’s tough to hear, but think of all the trust issues you have because of her.”"}, {"type": "sentence", "content": "“We were working things out, until,” he looked to the ground and kicked a small stone. “We were looking for different things. That’s all.”"}, {"type": "sentence", "content": "“All I’m saying is you should give Abby a chance,” said Brandon. He used the tongs and rotated each ear of corn. “You deserve to be happy.”"}, {"type": "sentence", "content": "Jacob placed a pitcher of water in the middle of the table before taking his seat next to Abby."}, {"type": "sentence", "content": "“Looks great,” said Jessica."}, {"type": "sentence", "content": "“You seem surprised,” replied Brandon. “I’m a great cook.”"}, {"type": "sentence", "content": "“Nobody cooks a hockey puck like you do,” said Jacob as he doused his burger with ketchup."}, {"type": "sentence", "content": "“Think I’ll be needing some of that too,” said Abby."}, {"type": "sentence", "content": "“Is this corn or a salt lick?” asked Jessica."}, {"type": "sentence", "content": "“Hey, hey,” Brandon raised his hands in the air. “Jacob was in charge of the corn.”"}, {"type": "sentence", "content": "“Don’t you even dare,” said Jacob."}, {"type": "sentence", "content": "After dinner Jacob set out to gather some fire wood, with Abby joining him as Brandon and Jessica cleaned up the dishes."}, {"type": "sentence", "content": "“Dinner was good,” said Abby, sticks crunching under each footstep as she walked alongside Jacob."}, {"type": "sentence", "content": "“Would’ve been better with less salt.” Jacob looked over to see Abby crack a smile. “I’m full, though, and I guess that’s what counts.”"}, {"type": "sentence", "content": "“What’s that?”"}, {"type": "sentence", "content": "“What’s — ” Jacob’s tongue trembled as he looked to where Abby was pointing. They were a few yards away from a stream and in the soft soil a trail of large footprints seemed to be headed towards the water. “We should head back. Abby?” He followed her gaze, which had shifted from the ground to across the stream. His eyes grew wide when he noticed what she’d been staring at. “What, what do we do?”"}, {"type": "sentence", "content": "Across the stream was a large grizzly bear, the kind Jacob had only ever seen in nature documentaries. The bear wasn’t paying them any mind and instead seemed more interested in the fish trying to escape its grasp in the stream. Jacob’s heart was pounding, he was gasping for breath, then he felt something touch his shoulder. He looked over to see Abby waving her hand in front of his face."}, {"type": "sentence", "content": "“You okay?” she asked. She grabbed his hand and held it tight, looking him in the eyes as she spoke. “Let’s back away, it’s going to be all right.” He looked away from the bear and followed her lead. “That’s right, step by step.”"}, {"type": "sentence", "content": "“Do you think it saw us?” asked Jacob."}, {"type": "sentence", "content": "“It doesn’t matter,” she replied, her words a little more than a whisper. “We’re just going to head back to the cabin.”"}, {"type": "sentence", "content": "Jacob listened and kept pace with Abby as they made their way back. When they arrived they ushered Brandon and Jessica inside."}, {"type": "sentence", "content": "“Where’s the firewood?” asked Brandon."}, {"type": "sentence", "content": "“Get inside first,” replied Abby."}, {"type": "sentence", "content": "Jacob couldn’t help but pace back and forth once they were inside, until Abby again grabbed his hand and walked him over to the couch."}, {"type": "sentence", "content": "“You look like you’ve seen a ghost?” said Brandon. “You haven’t looked this bad since that time we went skydiving.”"}, {"type": "sentence", "content": "“We saw a bear,” said Abby. “We got out of there just fine, but how about we stay in for the night instead of doing a fire?”"}, {"type": "sentence", "content": "“Abby, I …” the words lingered in the back of Jacob’s throat. “You were … I — ”"}, {"type": "sentence", "content": "“I know,” replied Abby, cutting him off before he could form a sentence. “I’m just happy you trusted me.”"}], "topic": "fiction"}