{"title": "How to be a People-Affirming Leader", "data": [{"type": "subtitle", "content": "Be intentionally uncomfortable with your words!"}, {"type": "sentence", "content": "You probably know that phrase. It appears all over the internet, used in TED talks and it's on the front of bestselling books. But in the nitty-gritty of the mundane life of a leader, what does it really mean? How do you inspire someone? What’s the secret?"}, {"type": "sentence", "content": "One secret I would like to explain is to be intentionally awkward with your words."}, {"type": "sentence", "content": "Don’t pass up an opportunity to overload someone with praise. Adult or child — it doesn’t matter. Just praise them. Make them feel embarrassed with the words you speak. Make them feel special. Honoured. Validated. Use words that empower people. Build them up. Don’t limit yourself to words related to your company, business or environment, assume a vocabulary that cuts through someone’s outer facade and speaks to their inner sense of self-worth and self-belief. It might make you feel uncomfortable, nervous or slightly sweaty, but outstanding leaders see beyond their own."}, {"type": "sentence", "content": "You might never know the effect your words will have."}, {"type": "subtitle", "content": "A Lesson from the Classroom"}, {"type": "sentence", "content": "In the classroom, praise works 9 times out of 10. If there is a student who finds it difficult to engage or cooperate with the lesson, there’s a strong chance it’s because they have nothing to lose. Their education history of failures, ‘naughty’ behaviour and overwhelming negativity give them nothing to fight for. Their sense of self and self-worth tells them they can’t do it. It’s not worth it. They live in a deteriorating self-fulfilling prophecy cycle. Whatever they try, defeat is the most likely outcome. They have nothing to lose."}, {"type": "sentence", "content": "If you, as a teacher, find something of value in their existence, something worth praising, then hopefully they will too. It’s a risk. It involves discipline in biting your tongue during the challenging moments, in order to create an uplifting, invigorating atmosphere."}, {"type": "sentence", "content": "Don’t mistake this for a quick fix or easy win. It’s not. This takes time. This takes a stable relationship. It takes an intentionally uncomfortable use of words. As the teacher, I know that the particular students’ answer is not ‘excellent’ or ‘superb’ when compared with other students, but I use those words anyway. I don’t use them because that’s the standard for answering the question but because I want that student to feel superb on the inside. I want to raise their self-esteem to a level where they will engage with the work enough to truly excel."}, {"type": "subtitle", "content": "Find their Why"}, {"type": "sentence", "content": "In one of Simon Sinek infamous youtube videos, he uses the phrase ‘begin with your why’ to describe the way businesses need to operate. The same is true of students and school engagement. When they have nothing to go on, nothing to lose, they won’t engage. When their ‘why’ for a particular subject or education, in general, is empty, they don’t bite. It’s obvious. But give them a ‘why’ and eventually, they will. Teachers have the opportunity to transform a students’ ‘why’ so that they do engage. The opportunity to help a student see themselves differently, to give them a new narrative to live by. A positive, self-affirming narrative. A story that begins with a simple act of intentional, directed praise."}, {"type": "sentence", "content": "It may only be the simplest of things, a verbal answer to a question, a well-explained opinion or simply turning up on time with the correct equipment, but it’s a moment to praise. It’s a moment to use words that cut through the students’ facade to nestle in the depth of their being. The buried memory vault seldom opened because it’s reserved only for moments of affirmation and validation. Seldom used because those moments in the life of a preconceived ‘challenging’ student are rare, if ever. As such, it’s vital that say something. The art of being a successful teacher is to make use of any opportunity to validate the students."}, {"type": "sentence", "content": "Even if just for a moment."}, {"type": "subtitle", "content": "For Leaders Everywhere"}, {"type": "sentence", "content": "I don’t believe this approach to other people is limited to the classroom, it should be a way of life for any business, any manager, any parent or anyone."}, {"type": "sentence", "content": "If you're a leader in any situation and you want to see your team flourish, take the same approach. Take every opportunity you can to affirm your employees or team members. Praise them. It may be uncomfortable to use cheesy words with fellow adults (it’s somehow easier with students) but it works."}, {"type": "sentence", "content": "When we think about it, we all want to hear those words. We all want someone to say they’re proud of us; value our contribution, ideas or company. If you want to be a people-affirming leader, be the leader who raises the self-worth in all their employees. Praise them."}, {"type": "subtitle", "content": "If It’s Difficult, Then be Proactive"}, {"type": "sentence", "content": "For some of us, that may not come naturally, and for me, it didn’t come naturally to start with. So if that’s you, but you still aspire to be a people-affirming leader, prepare yourself."}, {"type": "sentence", "content": "Write down your praise."}, {"type": "sentence", "content": "Proactively write down what you want to say, and then when the time is right, you’re ready. If you’re in a meeting, have your notes in front of you on your laptop, phone or a notebook."}, {"type": "sentence", "content": "But be intentional. Know the difference between words directed at a team to words of a more personal, individual nature. Know your team, and know what works."}, {"type": "sentence", "content": "Don’t skimp on your words because you feel uncomfortable. Remember, the long-term impact of your words will outweigh your momentary sweaty palms."}, {"type": "sentence", "content": "Whether you’re a leader in a company, a leader in the classroom, a leader in your home or you just want to increase your capacity to affirm your friends, the same approach works everywhere."}, {"type": "sentence", "content": "We’re all human beings, we all want to hear words of affirmation, validation and appreciation. We crave it. The person you speak to may have never had someone say they are proud of them; it could be a life-changing moment for them. For that person, your words could spark the dawning of a new day in their life. A new way of seeing themselves. As someone of value. As someone important. As someone worth staying alive."}, {"type": "sentence", "content": "It’s uncomfortably simply."}, {"type": "subtitle", "content": "Mind Cafe’s Reset Your Mind: A Free 10-Day Email Course"}, {"type": "sentence", "content": "We’re offering a free gift to all of our new subscribers as a thank you for your continued support. When you sign up using this link, we’ll send you tips on how to boost mental clarity and focus every two days."}], "topic": "leadership"}