{"title": "How to start learning reinforcement learning (RL)", "data": [{"type": "subtitle", "content": "Learn to implement these tools before they become the industry standard."}, {"type": "sentence", "content": "Build and reflect. There’s a ton of resources for reinforcement learning out there, but they aren’t always easy to fold into your own project. Build your own project. Making the code your own is the difference between someone who knows of reinforcement learning and someone who knows how to with reinforcement learning."}, {"type": "sentence", "content": "This article shows how learning to be competent in RL is tractable, and it gives enough resources to build a complete knowledge."}, {"type": "sentence", "content": "I would say I am competent in robot learning (robotics + reinforcement learning). I had the privilege of being pushed to this in my Ph.D., but you can too. The themes are repeatable and effective."}, {"type": "subtitle", "content": "Learn by doing"}, {"type": "sentence", "content": "We learn new skills in computer science to make things. Taking ideas to code is where value is made (except for a few theoretical professors). The crux of this post is that you need to find your problem space."}, {"type": "sentence", "content": "There is a long list of resources to learn about RL theory at the end of this, but with how broadly applicable AI methods are — you have to choose where. This comes down to an overlay of three motives:"}, {"type": "sentence", "content": "Decide on a problem space for RL where you like what you’re doing, it’ll do something to help the world, and hopefully, other people will catch on and give you a bigger platform to make change."}, {"type": "image", "content": "https://miro.medium.com/max/1216/1*icYgMWNxjL5hoB9RLc8yZg.png"}, {"type": "sentence", "content": "What have I built? I work with robots. I want robots to do many simple tasks, all over the place. They can move our furniture, drive our cars, deliver our boxes, and more. All this should come within a decade. A decade out, this looks like learning low-level locomotion controllers. The core repository for learning robot dynamics and control is found here. (Most of the research is still on private before publication.)"}, {"type": "subtitle", "content": "Build fundamentals and depth with writing or reflection"}, {"type": "sentence", "content": "I’ve written about 20 posts on Medium, and it’s an amazing compliment to any education program. It’s time to reflect on what you built and how it fits into a bigger picture. It’s a time to make sure others can comprehend your results. A common weakness of the best graduate students I meet — an inability to clearly break down their ideas. As a senior graduate student, I am focused on making my work last and be reused after I finish my degree."}, {"type": "sentence", "content": "Research papers, blog posts, etc are all writing forms that act as permanent recreations of your mind and self. There’s little that lets individuals continue to be of use and interacted with after their career, but high quality writing may be the most accessible tool we have for now."}, {"type": "sentence", "content": "Posts I have written on RL to date. It’s a wonderful subject and there’s always more to explore."}, {"type": "subtitle", "content": "Learn PyTorch"}, {"type": "sentence", "content": "PyTorch is becoming dominant in the are of machine learning research, and because reinforcement learning is young, it’s mostly research. You can find the statistics here. PyTorch is very fluid and pythonic, so don’t worry about getting too bogged down in learning it, it can happen along the way."}, {"type": "subtitle", "content": "Conceptual tools"}, {"type": "subtitle", "content": "Courses"}, {"type": "sentence", "content": "Berkeley Deep RL course from Sergey Levine."}, {"type": "sentence", "content": "David Silver’s RL Lectures at UCL:"}, {"type": "subtitle", "content": "Books"}, {"type": "sentence", "content": "Sutton & Barto: Reinforcement Learning"}, {"type": "sentence", "content": "Russel: AI — A Modern Approach"}, {"type": "subtitle", "content": "Codebases"}, {"type": "subtitle", "content": "Tech Company Supported"}, {"type": "sentence", "content": "OpenAI Spinning Up: this is one of my favorites. It pairs a thorough theoretical exposition with coding tutorials. It’s also fairly up to date. A great tool for studying a new algorithm and how the code differs from its predecessor."}, {"type": "sentence", "content": "Deepmind’s Building blocks of RL in Tensorflow: A new tool I found. This could be really useful for building practical systems because it abstracts away parts of an RL agent. It gives callable python objects for things like q-learning of a state space."}, {"type": "subtitle", "content": "Research Repo’s"}, {"type": "sentence", "content": "There are some individuals out there making amazing tools for side projects. I have used rlkit, but it can be hard to differentiate between them. I recommend PyTorch for those getting started now, and some of those below use Tensorflow. That’s a huge distinguishing factor, but it is up to you to decide. Tensorflow could also be more applicable to you from experience in other areas of deploying machine learning systems."}, {"type": "subtitle", "content": "If you need an official certification"}, {"type": "sentence", "content": "There are courses taught by two of the biggest MOOCs: Coursera and Udacity. These can help when applying to jobs and getting screened at the first round for “relevant experience.” I definitely think the up to date material from UC Berkeley will give you a more exciting education, though."}, {"type": "sentence", "content": "Get after it!"}], "topic": "education"}