{"title": "You Don’t Shape Your Recommender System", "data": [{"type": "image", "content": "https://miro.medium.com/max/10944/0*WwsdrE1Ei_rfxG6H"}, {"type": "subtitle", "content": "Your recommender system shapes you."}, {"type": "sentence", "content": "A few years ago, before the widespread adoption of AI in our lives, two graduate students were working on an intelligent vacuum cleaner, the anecdote says. It was a simple little robot, roaming the dorm room floor and vacuuming whatever dirt it has stumbled upon. The training algorithm was simple: picking up dust and dirt was rewarded with a point, and the little robot was told to get as many points as possible."}, {"type": "sentence", "content": "Since every machine learning algorithm needs some time to train, the students turned it on in the morning before going to classes, letting it experiment and learn during the whole day. When they returned, everything was in disarray. Plants and pots knocked down, glasses shattered on the floor. What happened?"}, {"type": "sentence", "content": "It turned out that the robot did exactly what it supposed to do: maximizing the rewards by cleaning dust from the floor. However, it also discovered that by smashing tables and cabinets, it can knock things down. Once what was on the table were lying on the floor shattered, cleaning it up was awarded with points. Our little robot learned how to manipulate its environment to gain rewards. It had learned to hack the reward function."}, {"type": "sentence", "content": "You might ask, what does this have to do with us? Well, I have bad news. In our modern society, you are the dorm room and Facebook, Twitter, YouTube and other companies are the robots."}, {"type": "subtitle", "content": "The emotional choice"}, {"type": "sentence", "content": "Let’s conduct an experiment. Open your browser history and filter out all the YouTube videos you have watched in the past week. Categorize them in two groups: useful info (like a lecture on quantum mechanics) or garbage (like UNBELIEVABLE ! Top 10 Shocking Blind Auditions The Voice 2018). What are your numbers?"}, {"type": "sentence", "content": "Even though I am especially conscious about what I watch, I very often find myself watching garbage content just because it popped up in my recommendation feed. When I go looking for genuine and useful information on YouTube, I frequently drift away to entertaining content just because I instinctively click on things. I am “engaged” with the content."}, {"type": "image", "content": "https://miro.medium.com/max/8064/0*FFiyglfO1809cG-_"}, {"type": "sentence", "content": "Why is this the case? To understand this, we have to see where YouTube’s revenue comes from. You get to watch content for free, but you have to watch ads in turn as well. The more ads you watch, the more money they receive. Like the cleaning little robot, its recommendation algorithm has to maximize the reward function, which is user engagement in this case. But what does it do to you in order to achieve its results?"}, {"type": "sentence", "content": "To answer this question, let me present you with a choice. Either you watch a lecture about macroeconomics right now, or a video of cats doing funny things. If you are not being entirely conscious, this is an easy choice for your brain."}, {"type": "sentence", "content": "For evolutionary reasons, we unconsciously prefer easy rewards to those for which we have to actually work for. A clickbait content is like candy to our brains, and we are not trained to resist."}, {"type": "sentence", "content": "Unfortunately, this is the smaller problem."}, {"type": "subtitle", "content": "The YouTube radicalization pipeline"}, {"type": "sentence", "content": "Like our little cleaning robot from before, a recommendation algorithm also prefers shaping the environment. In this case, it slowly starts shifting user preferences towards content which can draw them in like a black hole, keeping them engaged for longer and longer periods. One particular type of such content is extreme far-right ideology and conspiracy theories. By eliciting very strong emotional reactions, these videos can trap users in a vicious cycle."}, {"type": "sentence", "content": "For a recommendation engine, the ultimate goal would be to slowly shift user preferences until they are radicalized and keep consuming what is shown to them. There is concrete scientific evidence of this: a recent paper studied millions of YouTube comments, showing how users slowly drift from mild to extreme radical content."}, {"type": "sentence", "content": "This presents problems not only the level of the individual, but on the level of society. When rationality goes out the window and all we have are visceral, emotional responses, cooperation is impossible. The fabric of society is gone under the blink of an eye."}, {"type": "subtitle", "content": "Blue Feed, Red Feed"}, {"type": "sentence", "content": "Although YouTube is a prime example of how users can be pushed to the far-right of the political spectrum, it is not the only player in the game. Social media also plays a huge role by maintaining intellectual bubbles. Once Facebook pinpointed your political preferences, it keeps presenting you posts which reinforce your world view instead of challenging it. Progress comes from discussion and disagreement, which is impossible if you are only presented with matching views."}, {"type": "image", "content": "https://miro.medium.com/max/1932/1*q3AFtaSnrdJkPua5hYTWEQ.png"}, {"type": "sentence", "content": "To demonstrate this, The Wall Street Journal had created two feeds, one showing liberal, the other showing conservative news sources. Although the feeds are archived and not updated as I write these lines, it is worth checking out Blue Feed, Red Feed."}, {"type": "subtitle", "content": "You are what you e̶a̶t̶ read"}, {"type": "sentence", "content": "The information you process throughout your life defines who you are. Just like what you eat gets processed by your body and builds you up eventually, the pieces of information you obtain puzzle together your personality and belief system up to some degree. It is our own responsibility to be mindful of the influences we subject ourselves."}], "topic": "social-media"}