{"title": "5 Micro-Decisions To Declutter Your Life", "data": [{"type": "subtitle", "content": "MINIMALISM"}, {"type": "subtitle", "content": "Habits that are only a slight shift from your norm"}, {"type": "sentence", "content": "When I first started my minimalism journey, I realised very quickly that a large part about it was making decisions."}, {"type": "sentence", "content": "These decisions were not limited to stuff, but everything associated with them."}, {"type": "sentence", "content": "Minimalism is about living your best life with less. Sure, it is uncomfortable to let go of anything, but it is a crucial step to unfold our best selves."}, {"type": "sentence", "content": "Unleashing our true creative potential is much more challenging in cluttered workspaces, messy homes and overflowing wardrobes."}, {"type": "sentence", "content": "Wonder how we go to clutter in the first place?"}, {"type": "sentence", "content": "These are not the big decisions of choosing a partner or buying a property. Micro-decisions that we make throughout the day have an under-recognised impact on our physical and mental clutter."}, {"type": "subtitle", "content": "1. Design a system for your used dishes"}, {"type": "sentence", "content": "Imagine you came across the perfect way to turn chocolate into divine, heavenly cupcakes."}, {"type": "sentence", "content": "Or a shockingly easy recipe to the most delicious, flavoursome eggs for your next breakfast."}, {"type": "sentence", "content": "Now imagine you rush enthusiastically to create those masterpieces in your kitchen and find a sink full of used dishes. You decide no recipe is worth the hassle and settle for your nearest bearable takeout."}, {"type": "sentence", "content": "On some level, no matter where you are in life, all of us find indescribable pleasure in home-made, wholesome meals. Cooking can be an excellent outlet for creativity, satisfaction and fulfilment."}, {"type": "sentence", "content": "Sure, not all of us have Michelin-starred skills, but the joy of food prepared with care is universal. Too often, however, cooking is considered simply a chore. We find it overwhelming to cook and then clean in a cluttered kitchen."}, {"type": "sentence", "content": "Action: As you go through your day using dishes either after your meal or while cooking, decide what you want to do with them straight away. They either get rinsed and cleaned or go into the dishwasher right away."}, {"type": "sentence", "content": "Putting away your dishes requires no more than 5 seconds of your time."}, {"type": "sentence", "content": "The upside? You will feel more inclined to develop your culinary self in a decluttered workspace."}, {"type": "sentence", "content": "The downside? None."}, {"type": "subtitle", "content": "2. Close your browser tabs when you finish with them"}, {"type": "sentence", "content": "Productivity and staying informed is the philosophy of our new age."}, {"type": "sentence", "content": "Day in, day out, we utilise any new convenience available to us to accelerate our hustle. We strive to keep up with the Trumps and the Kardashians."}, {"type": "sentence", "content": "After all, productivity is doing and knowing it all right?"}, {"type": "sentence", "content": "We know it’s not. Yet, we continue to clutter our screen with multiple avenues of information, growing distracted each time we lookup."}, {"type": "sentence", "content": "Many of us have a habit of keeping specific tabs open in our browsers permanently. For some, its the local news source, for others it’s social media. We covet the positive reinforcement of a new notification or the curiosity of news. If we’re not in the loop, we are missing out."}, {"type": "sentence", "content": "Staying informed is not wrong."}, {"type": "sentence", "content": "Trading constant stimulation and chatter for deep, uncluttered work is."}, {"type": "sentence", "content": "Action: Secluding your work to one or two tabs in your browser is the easiest way to keep your virtual desk organised. You wouldn’t have the newspaper or mail spattered around on your physical office. You would file them away, just like you can in your Favourites tab."}, {"type": "sentence", "content": "Clearing your screen clutter will give you the clean slate to learn, research and create, allowing you to focus on what’s important."}, {"type": "subtitle", "content": "3. Unsubscribe to unnecessary email regularly"}, {"type": "sentence", "content": "A cluttered inbox is a powerful counteraction to feeling our most productive self."}, {"type": "sentence", "content": "No matter how many things we check off our to-do list, Inbox (346) strikes a steadfast sense of mental clutter of not having done enough in our day."}, {"type": "sentence", "content": "Instead of feeling overwhelmed by unread email, which is most likely useless anyway, we need to reclaim our inboxes for what it is — personal, curated correspondence with people that add value to our lives."}, {"type": "sentence", "content": "I realised how far our personal information had travelled when I received emails about what companies are doing to fight the coronavirus. Instead of the usual forgettable subject lines of a sale/new product, the personal touch made for a successful clickbait."}, {"type": "sentence", "content": "Looking back, I overlooked marketing emails as all the same, but they were a constant source of my-inbox-mental-noise."}, {"type": "sentence", "content": "I didn’t care about the newest Sephora product. Yes — I once purchased something from them, but we don’t have an ongoing relationship, and I don’t need a new “must-have” every week."}, {"type": "sentence", "content": "It might seem small, but protecting your inbox from useless chaos gives you a sense of control. You take charge of an essential aspect of your daily digital consumption."}, {"type": "sentence", "content": "Action: Instead of putting off the unsubscribing to a time slot in your planner, use the same amount of time doing it right away. I no longer get much marketing email, but when I do, I am thrilled to let go and intentionally make space for something better, more relevant to come into my life."}, {"type": "subtitle", "content": "4. Pay with cash and donate your coins"}, {"type": "sentence", "content": "There is an inherently increased value in cash transactions. If you have to pay cash for the $5 for your barista-made morning coffee, you will be quick to consider a home-brew."}, {"type": "sentence", "content": "Why?"}, {"type": "sentence", "content": "It is the only money we have right now."}, {"type": "sentence", "content": "For most of us, it is a limited resource, not a bottomless well of readily available credit. Using credit to pay for everyday expenses defers our responsibility to pay by merely swiping future money. Paying in cash keeps our financial habits in check."}, {"type": "sentence", "content": "Being acutely aware of where your money goes also saves you trying to make sense of your monthly credit card bills. You remain within the cash budget you carry, developing an understanding of financial calm and control."}, {"type": "sentence", "content": "Except for big purchases, pay for everything else in cash."}, {"type": "sentence", "content": "Action: Have a clean wallet with the uniformity of cash and less plastic. Donate your coins to a good cause."}, {"type": "subtitle", "content": "5. Seek the right fit in your clothes"}, {"type": "sentence", "content": "The critical difference between clothes and human beings is the latter acknowledges life experiences and evolves in size and personality."}, {"type": "sentence", "content": "One of the biggest revelations through my minimalism journey has been my detachment from the present. Through clothes, I was comforted by my familiar past self and hopeful for a better tomorrow."}, {"type": "sentence", "content": "The truth is, when we hold on to clothes that no longer fit us or probably never will, we buy into a low-key, insidious contempt of our currently healthy, breathing, living bodies."}, {"type": "sentence", "content": "We are no longer the person in our high school sweatshirt."}, {"type": "sentence", "content": "We cannot stay gripped in the ultimate fantasy of fitting into the expensive jeans bought five years ago to make the investment worthwhile."}, {"type": "sentence", "content": "Action: Create a curated wardrobe of pieces that flatter your body and aligned with your personality. Choose classic and comfort over trends. Explore styles and palettes that make you feel your genuine, authentic self."}, {"type": "subtitle", "content": "Key takeaway"}, {"type": "sentence", "content": "The power to change yourself lies in your courage to make the seemingly trivial decisions in your life."}, {"type": "sentence", "content": "By making small yet positive deviations from your current habits and behaviour, you can instantly open up a profoundly less cluttered life."}, {"type": "sentence", "content": "Like what you read so far? Subscribe to my free newsletter here."}], "topic": "mindfulness"}