{"title": "Is Growth Right For You?", "data": [{"type": "sentence", "content": "As entrepreneurs, we have control over how we grow our companies so we can be successful on our own terms. And sometimes our business gets out of hand and we have to face our worst nightmare: failure."}, {"type": "subtitle", "content": "What is Growth?"}, {"type": "sentence", "content": "In business, growth basically means making a company more successful in some way: finding a new revenue stream, revamping the cost structure to minimize expenses and increase profit, or adding new people and knowledge to the team."}, {"type": "subtitle", "content": "Startup vs Small Business"}, {"type": "sentence", "content": "Our options for growth are usually tied to the type of business model we started with. There actually is a difference between a startup and a small business. A startup is technically a company that tries out a new business model."}, {"type": "sentence", "content": "Startups are trying to invent a better way of doing things that quickly disrupts the status quo once launched. RxBar, for example, wanted to change the way we made energy bars and has been able to scale from selling locally to internationally. On the other hand, a small business uses a tried-and-true business model and wants to be successful but doesn’t care about completely revolutionizing an industry."}, {"type": "sentence", "content": "These businesses can be ideas that already exist but with a new spin. Both startups and small businesses are created by entrepreneurs, and both are important to the world. So take a breath and reflect on what your values and goals are!"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*99Q8rqnBx5pslDad.png"}, {"type": "sentence", "content": "Once you’ve decided on what comes before “entrepreneur” on your name tag — “startup” or “small business,” we can talk growth speed. We usually picture entrepreneurs (both startup and small business people) trying to run what we call high-growth companies — a company that grows profits astronomically fast. A lot of high-growth examples come from the tech industry because these businesses don’t have a lot of expenses to get started."}, {"type": "sentence", "content": "They can do a lot with some computer equipment and talented human resources, so they can turn a profit pretty quickly. But many high-growth companies are actually in industries where there are a clear gap and a pressing need. Healthcare is a great example, with many healthcare apps being developed to help patients without them having to leave their homes."}, {"type": "sentence", "content": "It’s important to mention that high-growth entrepreneurship isn’t always a choice, either. Sometimes your value proposition just strikes a chord with customers, and you suddenly have more orders than you can handle. In that case, you might be forced to expand quickly just to keep up."}, {"type": "sentence", "content": "High-growth companies, while somewhat rare, can be a big deal for economies and jobs. But some entrepreneurs want to maintain careful control over their growth instead, and these businesses are just as important. For these types of companies, growth is often in terms of doing more with what they already have."}, {"type": "sentence", "content": "To increase sales, this could mean figuring out peak hours and focusing staff on those times. Or it could mean narrowing down communication channels and really focusing on bringing in more customers."}, {"type": "subtitle", "content": "How much growth to shoot for?"}, {"type": "sentence", "content": "The choice to shoot for high-growth or a more controlled path is up to you. Think about what success looks like to you and then Write. It. Down. You’ll have something to refer to as your business develops, and visualization helps make goals a reality."}, {"type": "sentence", "content": "To decide what kind of business model to follow and how much growth to shoot for, we have to consider different motivations."}, {"type": "sentence", "content": "Think about money."}, {"type": "sentence", "content": "We started a business because we wanted to change the world, but we also want to get paid to do it. Growing our business can make it more profitable, which means more money for us, our shareholders (maybe even our families and friends if we got starting funding from them), and other things we care about like repaying loans or supporting local charities."}, {"type": "sentence", "content": "Think about the employees."}, {"type": "sentence", "content": "Growth can mean hiring more people or improving the lives of current employees with better salaries or benefits. This could be the difference between employees working multiple part-time jobs to support themselves and being able to focus on our business. We need good people by our side, so making it intellectually and monetarily easy for them to stay goes a long way."}, {"type": "sentence", "content": "Think about leadership opportunities."}, {"type": "sentence", "content": "Just like we want to create new challenges for our employees, we can keep challenging ourselves as entrepreneurs. With growth comes new opportunities to lead teams, develop business strategies, and solve new problems, which is exciting!"}, {"type": "sentence", "content": "Think about the customers."}, {"type": "sentence", "content": "They’re important! Growth can mean giving existing customers more bang for their buck or expanding in order to solve pains or bring gains to entirely new customer segments."}, {"type": "sentence", "content": "And think about the competition."}, {"type": "sentence", "content": "We gotta believe that our business will be better than the competition! Growth can mean delivering more value and shaking up the status quo to stand out and become a market leader, not just another business operating in the world."}, {"type": "subtitle", "content": "Understanding the environment"}, {"type": "sentence", "content": "Then, once we’re motivated, it’s important to take stock of our surroundings, because the universe [ — or our customers — ] will probably send us a sign that our business is ready for growth. Is there too much work to do? If we’re booked until November of 2030, it’s a sign that people like what we’re doing and we could use some help. Are customers asking for more? If we’re flooded with requests for more products or longer hours, growth might be how we give the customers what they want. Or is everything just chugging along smoothly? Once we have regular, consistent profits and steady customer flow, it could be time to take on more."}, {"type": "sentence", "content": "One big red flag to be careful about growth is if an industry is dying or changing significantly. This doesn’t mean our business won’t be successful, though. We could have steady customers wanting portrait-taking and photo-printing in our small town filled with scrapbookers, but it still isn’t wise to rush to open a second location when every phone comes with a digital camera these days."}, {"type": "subtitle", "content": "Handling Failure"}, {"type": "sentence", "content": "Failure can be many things. The ultimate failure is being forced to shut down our business, but we could have small failures along the way: mismanaging money, not paying attention to the competition, spreading ourselves too thin, or not listening to customer feedback so people lose interest. All of these are realistic and tough."}, {"type": "sentence", "content": "For many of us, we work so hard because we’re afraid of failure. If we fail, we might let our families down, have to stop working on projects we care about or even lose everything we have."}, {"type": "image", "content": "https://miro.medium.com/max/4000/0*7nzgJ_rcQfxL-skI.png"}, {"type": "sentence", "content": "But entrepreneurs can also fail by pushing ourselves so hard we just can’t anymore. We’re burned out, which is basically work-related stress on steroids. Burnout is a kind of physical or emotional exhaustion that can make us feel like we’re not accomplishing anything or that we’ve lost some piece of who we are."}, {"type": "sentence", "content": "So being passionate about our work can push us higher, but it can also do bad things for our mental health. Instead of spiraling from a fear of failure, we can practice emotional self-monitoring and control. When we’re more aware of our feelings, we can just feel them and let them float by, instead of letting them completely control how we think and act."}, {"type": "sentence", "content": "And actively looking for weaknesses and problems and taking action can be a powerful way to reduce fear. Plus, the unknown can be the root of a lot of fears. So we can learn to increase our capabilities and skills (but we should also recognize that we’ll never know everything)."}, {"type": "sentence", "content": "And finally, seeking support is so important. There are mentors and experts out there who can help us decide whether the risk is worth it or not. Getting advice makes us feel less alone, and it can help us develop more self-awareness, take action, and learn."}, {"type": "subtitle", "content": "Framework for shutting down or Work on a new idea:"}, {"type": "sentence", "content": "When it looks like all hope is lost and you might have to close your business, ask yourself these four questions from the startup incubator Y-Combinator:"}, {"type": "sentence", "content": "One, do you have any ideas left to grow your startup?"}, {"type": "sentence", "content": "Two, can you drive that growth profitably?"}, {"type": "sentence", "content": "Three, you may have ideas, but do you want to work on the startup that results from that growth?"}, {"type": "sentence", "content": "And four, do you want to work with your co-founders on the startup that results from that growth?"}, {"type": "sentence", "content": "The answer to any of these questions could be “no.” That’s perfectly valid, and means you should probably accept the failure, take some time to recover and move onto your next adventure."}, {"type": "sentence", "content": "As Arianna Huffington says:"}], "topic": "startups"}