{"title": "Through My Own Eyes: Fizzy as a Force for Good in Sierra Leone", "data": [{"type": "sentence", "content": "Fizzy drinks — not usually associated with saving people or the planet. However, recently I had the opportunity to see how Karma Drinks’ promise of #everydrinkdoesgood is beyond just great marketing."}, {"type": "sentence", "content": "At the end of November, with six other members of the Karma Drinks team, I had the privilege of going to Sierra Leone, West Africa to meet our cola nut growers, experiencing for myself the impactful work the Karma Foundation is able to carry out when people like you choose their drinks."}, {"type": "sentence", "content": "The purpose of the trip was not only to see how Karma Drinks is helping around 2,000 people trade their way to independence, but also to better understand how tourists, like you, could one day in the future have a similar experience with our Sierra Leone based whānau."}, {"type": "sentence", "content": "I have lived and breathed Karma Drinks for over two years in my London based role as Marketing Manager. Prior to this I was at a large corporate, working alongside NGO partners to market sustainable living to consumers through the company’s many “brands with purpose”. It was exciting, fast paced, big budget, big impact work. However, something was always missing. While I knew some faces and stories, not once did I get to connect with, or meet one of our beneficiaries. They felt like numbers more than people."}, {"type": "sentence", "content": "With Karma Drinks it was always going to be different. We’re a small business, so by nature, things are more personal. Our Sierra Leone based team visit the eight villages we support, weekly. We know the names of the people. We know when there is a new baby or, to the contrary, when someone sadly passes away. We know when one of the school girls obtains a bursary."}, {"type": "sentence", "content": "So naturally, when the opportunity came to board a plane to Freetown, I was very humbled to finally meet the faces that make Karma Drinks the business it is."}, {"type": "sentence", "content": "Reflecting on my trip over the last couple of months has given me a lot of perspective about the work that the Karma Drinks team does. Our sales and marketing roles weren’t just any old jobs in any old organisation. Every single day our work of communications or sales, had a tangible impact. It also made me think that when it comes down to it, between Sierra Leone, the NZ and UK we aren’t too dissimilar at all. We all want the same things from life, but most things are just a bit easier to access in our part of the world — for example, water, healthcare, education, transport to work, getting ingredients for a family meal and even acquiring a new football to show off your village’s new football pitch. I know it is cliched, but the trip has had a lasting impact on me and has definitely made me think about the bubble we live in and what a tiny place we occupy in the world. So on a personal level, I found this trip to be fairly emotional and an experience that has changed the way I think about a lot of things."}, {"type": "sentence", "content": "Right, our trip begins… London Heathrow, Charles de Gaulle Paris, down to Freetown Lungi. A day that started at 3am on Saturday with the cheerful music from my phone’s alarm clock when I hauled myself out of bed. From there it was an early morning pick-up from my East London flat to head to Heathrow. After some lengthy delays in Paris our day finished about 24 hours later when we arrived at our accommodation at Family Kingdom in Lumley Beach, Freetown. After a day full of numerous taxis, buses, flights and a ferry, I left my colleagues, who were in search of a feed, and succumbed to the pull of a much needed snooze. While I slept, they ate fish and rice, drunk the local lager, Star Beer, and got caught in a heavy tropical downpour."}, {"type": "sentence", "content": "After 33 years, it was my first time in Africa, so I didn’t really know what to expect. I think of myself as a hardy, outdoorsy New Zealand gal up for most adventures, but put me in the African jungle and who knows what would happen? Prior to departing I thought of all the David Attenborough documentaries I’d seen over the years, full of creatures, big and small, with the ability to bite, poison or sting (more on that shortly). So, while I was excited to see, first-hand, the work of the Karma Foundation, there was also part of me that was incredibly anxious. Mum asking me on the phone from New Zealand “Is it safe there?” probably didn’t help my anxiety levels."}, {"type": "sentence", "content": "Our team was in Sierra Leone for a total of seven days, five of which were spent in Boma, which is in the south-east of the country, in the Gola Rainforest. A sometimes smooth, but mostly bumpy, dusty, hot five hour trip by four-wheel drive from Freetown. Oh and without aircon too."}, {"type": "sentence", "content": "So, how was it? Well, as predicted, it was muggy. With your pack on, walking 10 minutes in 37 degrees, coupled with the humidity of the jungle, you’ll quickly regret packing a grey marle cotton t-shirt with Gingerella on the front. At the end of our five jungle days together there were a few more smells wafting through the air. I assure you, this trip was one way to learn more about, and bond with, your colleagues. It was also full of unexpected adventure. I found myself in situations I couldn’t have ever dreamed of."}, {"type": "sentence", "content": "I discovered on night one in the jungle that if you think you’ve got ants in your pants then you probably do. This was a first night fail, arriving at our campsite in the dark and being completely disoriented, I embarked on an ill-fated search to find the open-air ‘toilet’ and ‘shower’. I was oblivious to the fact that, whilst momentarily stationary, I had in fact chosen to stand on a foot-wide stream of Driver Ants (known for their mandibles, mile-long armies and ability to stick like super-glue to any fabric or material). My Birkenstocks were suddenly squelching, and my body itchy from head-to-toe — again, another way to bond with your (more female) colleagues. This wasn’t our last encounter with ants, but I’ll save those stories for another time. You get the picture, day one in the jungle was off to a good start and I was learning fast. At least the locals at camp found my situation hilarious."}, {"type": "sentence", "content": "On the same night, the kids of Boma Village had invited us to their disco. The HUGE speakers were piled up in the Barri (community meeting house) and more were strapped onto the back of numerous village motorbikes. This obviously meant business. All of us would have normally been up for this, however we had arrived in the dark and the path 10 minutes into the village was a tad treacherous. With the added unknown of our first night in the jungle, we were slightly hesitant. We weren’t quite sure what nocturnal glaring eyes our torch light might meet. My up close and personal experience with ants was also very fresh. The rain was pouring down and there were bursts of lightning amongst rumbles of thunder. We decided it was a bit too much to attend our one and only African jungle disco. When we lay our tired exhausted sweaty bodies down for the evening I couldn’t help thinking that I might have been back at Glastonbury (sans wellies, but wishing I had them). The flashes of lightning were like the laser lights and the doof-doof-thump of the stack of Peavy speakers from far away provided the soundtrack. Apparently the party went until 5am. Some definite festival vibes coming from the heart of the jungle. I would say there were some good hangovers in the rainforest on Tuesday morning."}, {"type": "sentence", "content": "One of the highlights was trekking across numerous bridges made out of bamboo, which made me feel a bit like I was in an Indiana Jones movie. Also, were there crocodiles in this part of Sierra Leone? No one had told us, so I went with ‘no’. However the guessing game wasn’t fun, especially during my one and only river swim with team mates Luke and Cosmo. We took a plunge off a muddy river bank on our second morning at camp in Boma. When I subsequently asked our guides, Mediwa and Michael, they laughed and said ‘not in this part of Sierra Leone’. Phew!"}, {"type": "sentence", "content": "Then there were the dugout canoe journeys. The Karma Foundation had just funded the building of a new canoe. Given the use of canoes is a traditional way to get around African rivers, it was naturally incorporated into our adventure. We had three canoe trips in one day. The first started like what I imagine a Sunday punt in Cambridge to be like — pleasant, calm water, a new interesting experience. I was smiling."}, {"type": "sentence", "content": "That quickly changed. A delay to the end of the rainy season meant that the Moa River, which was usually a trickle in November, was a 500 metre wide, swollen, muddy tangle of tree roots and whirlpools. Even in calm water the canoes teased us with an uncertain wobble every time the paddle pulled us through the brown water. So what should have been a serene, quick punt was instead an exercise in tensing every possible muscle to stop the imminent threat of capsize. While I was certain that our two captains had done this hundreds of times, I could see that even on journey number one they were tiring from the physicality involved. Krio language was also a bit of a barrier — what were they saying to each other? Were they confident we’d get safely across? Also, what was the plan if we did tip out? I had no idea. I am a water baby, and even rowed competitively for five years, so am used to being in narrow boats that easily tip (only once for the record). Right here, right now I sure as hell did not want to swim. So I resorted to closing my eyes, taking deep breaths, and thinking about my swimming ability and how good things can come from uncomfortable situations. Needless to say, I was very pleased to put my shaky adrenaline-filled legs on the solid river bank 20 minutes later. We waited on this small bank for the rest of the team long enough to speculate what might have happened to them. Finally, as all but two of the team were across, with dusk setting in and with over an hour to the next village, Segbema, we made the call to move. Luke and Albert would be arriving shortly."}, {"type": "sentence", "content": "As we were approaching Segbema, I heard what I thought was the boom of thunder (there was at least one big downpour per day), but my suspicions proved to be wrong. Soon some young boys from the village greeted us excitedly on the trail, but then quickly ran away. As we neared the village, it seemed the whole community was there to greet us, smiling, singing, dancing and drumming. Tired, hungry (actually, make that hangry) and feeling like I’d spent the entire day doing bikram yoga (“is there a bucket of water I could tip over myself?” I had jokingly said to my colleague, Rachel), this warm reception suddenly made my eyes damp. This wasn’t the last time I was made to feel so incredibly lucky to be seeing and experiencing all of this for myself."}, {"type": "sentence", "content": "And what about Luke and Albert? Well it was now dark and we hadn’t seen them for a couple of hours. Again, a long time to speculate about the unknown. I certainly wouldn’t have wanted to be on these trails in the dark. Long story short — on their canoe trip, the branches used as quants had broken in the middle of the river. Without a spare they somehow pulled themselves back to the river bank with the shorter version and found another quant so they could manage the deeper parts of the water. They did it again, and it happened again. Luke and Albert had learnt that day that, when required, garden spades improvise nicely as paddles. We were thankful for the heroics of our experienced and now exhausted captains. We were also happy to be reunited as a team. Needless to say, the rum purchased in Paris during our airport connection slid down very well after dinner with many relieved laughs."}, {"type": "sentence", "content": "With all of this adventure, I had some of the best nights of sleep imaginable. We spent every night in the shell of a tent (it’s too hot for the fly) and under pre-built palm frond-laden structures to protect us from daily downpours. We’d get the most spectacular electrical storms late at night which I loved. And when it wasn’t raining we’d have the soothing hum of the jungle. Something that I’d pay for any day over the noisy sirens heard each night in my London flat. I don’t think ‘Digital Forest’ white noise on Spotify will ever cut it. And, yes, I’ve tried."}, {"type": "sentence", "content": "On our last day in the Gola Rainforest our group was also very lucky to visit Tiwai Island. Home to one of the world’s most concentrated and diverse primate populations. We quietly crept around the dense jungle and the towering termite mounds listening to Chimpanzees warning each other of our presence. We also watched monkeys tumble and flip."}, {"type": "sentence", "content": "Whilst the adventure was a real highlight, what made this trip so special was the warmth and friendliness we received from our extended whānau in Tiwai — they were incredibly welcoming and made us feel right at home. Usually embracing us or shaking our hands, at every single meeting in the Community Barris they referred to us as part of their family. They had prayed for our safe arrival and return to London, and they told us that we would be welcome in their communities forever."}, {"type": "sentence", "content": "In every village we listened to the community talk about the Karma Foundation’s newly established health fund and how the fact that their girls receiving education meant that there was now “more light in their future”. We met and spoke with some of our female entrepreneurs and learnt of their newfound successes. We met 20 year old Mohamed, who had been so inspired by the work of Karma Drinks that he decided to build his own school. He walks two hours every day from the village of Potaru to teach his 52 students. He’s off to get his formal teacher training with help from the Karma Foundation soon. I hope Mohamed knew that he had also inspired our whole team. If you want change, then make it happen. Lastly, there were the bridges that had been built. These were basic concrete structures which at first sight were no marvel of engineering. But for an isolated village during the rainy season, it doesn’t matter. Their girls can continue to go to school and the villages can obtain basic supplies from the nearby village. Life goes on."}, {"type": "sentence", "content": "The smiles and warmth of everyone we met will stick with me, but most of all Chief Hindowa’s. Getting to finally meet him was one of the highlights of my trip. In 2018 we shared his face and smile with the UK as part of our Black Santa campaign. I was pleased to see that our marketing had been authentic. This grin is the one he wears every minute of every day. I even showed him some big posters of his smiling face that had occupied 105 busy tube sites in London. To our team, he is somewhat famous, although I found his stardom is quite difficult to explain. His smile is infectious. As is his optimism and outlook. It is something that will stay with me forever. His wife, Chief Kahdi Bo, is a hugely inspirational female figure in the community she leads and also within our own business. She runs a very tight ship in Boma and was the only one allowed to cook for us. A total perfectionist. I have enormous respect for these two people. They are far away, but have taught me what to be grateful for and, particularly from Hindowa, how to wear your face every day. I hope we will meet again soon."}, {"type": "sentence", "content": "All of this started with a small business from little ol’ New Zealand — a business that has chosen to place purpose at its core and people ahead of profit. I am so lucky to have seen how the promise of “every drink does good” is transforming lives. Basic things we take for granted, like an education or access to healthcare. This business has inspired thousands of people to own their destinies. The eight communities aren’t told what to do by us, they work out what they need and then they are collectively responsible for delivering it. So, as much as you might think a lot of the grunt work happens in the UK and New Zealand, there is a lot happening in Sierra Leone too. Quite simply, we rely on each other to be successful. Karma Drinks wouldn’t be what it is today without our committed friends and cola nut growers in Sierra Leone."}, {"type": "sentence", "content": "I am biased, but Karma Drinks has been an amazing place to have been working over the last few years. From beautiful packaging design, to the delicious liquid that occupies its cans. And, most importantly, the “do gooding” part. “Every drink does good” is the promise that Karma Drinks makes. In 2019 it was a business priority to make sure it now occupies the back of every drink sold so you know exactly what “good” means. This promise is underpinned by the Karma Foundation, with the ongoing commitment to sourcing the best tasting, ethical ingredients, and the promise to eliminate all plastic from the supply chain. How many other products that you buy can put something as bold as that on the back of their packs?"}, {"type": "sentence", "content": "I have to mention my colleagues who I shared this trip with: Albert, Rachel, Luke, Cosmo, Nadia, Mark, and, on the ground in Sierra Leone, the very trusted Mediwa and Michael. Spending most weekdays together in London, we thought we knew each other pretty well. However, the Gola Rainforest provided a bonding environment like no other. Even when our tummies were dodgy we could still maintain smiles on our faces and usually see the humour in the situation. We also knew that there were colleagues back in the office who would have been equally as chuffed to have been sharing this adventure, the laughs and some palm wine at the end of a big day with this special group."}, {"type": "sentence", "content": "If you got this far, thanks for reading and letting me share some of this unique experience with you. This is really the beginning of my experience. There is a lot more I can tell you and I promise that despite the huge ants and numerous jokes about pythons, the African jungle doesn’t seem like such an intrepid place after all. Even after the dugout canoe day, I would go back to the Gola Rainforest in a heartbeat. And I would take you with me."}, {"type": "sentence", "content": "Thanks,"}, {"type": "sentence", "content": "Kathryn"}, {"type": "sentence", "content": "To learn more about Karma Drinks, visit their website, or follow them on Instagram, Facebook, Twitter or LinkedIn. Buy their delicious drinks in the UK and NZ (plus 25 other countries around the world) and spread the word that #everydrinkdoesgood, because as you have just read, it truly does."}, {"type": "sentence", "content": "Any questions, feel free to get in touch with me here."}], "topic": "travel"}