{"title": "“Cancel rent” won’t work", "data": [{"type": "subtitle", "content": "What’s the real solution?"}, {"type": "image", "content": "https://miro.medium.com/max/6144/0*MF5zl9gjq9_JM5Yx"}, {"type": "sentence", "content": "Back when I was practicing law full time, I would periodically receive calls from people looking for me to represent them for free. When I would explain to them that, like them, I could not work for free, they would inevitably exclaim “but you can afford it… Lawyers are rich.”"}, {"type": "sentence", "content": "To any practicing attorney or anyone familiar with the economics of law practice, that statement is absurd on its face. Most lawyers work very hard to achieve a comfortable, middle class life. There are those who reach the top 1%, but those are rare. The reality is that it can be a fulfilling profession that can support an attorney and his or her family comfortably."}, {"type": "sentence", "content": "But there is something particularly ironic about that statement. Even when lawyers do well financially, they achieve this success by representing clients who pay them. If clients don’t pay them, as many of mine didn’t, then they won’t be rich. In fact, they won’t even be able to pay their basic expenses."}, {"type": "sentence", "content": "Lawyers, of course, are frequently the butt of jokes. These wisecracks, however, mask a certain base resentment of the profession. People only hire an attorney when they are in trouble, so it seems as if the lawyer is profiting off of people’s misery. At the same time, lawyers seem to work to system to make money for their clients or get them off due to technicalities. Our reality is very different from doctors or firefighters who save lives. We make an easy target."}, {"type": "sentence", "content": "When I first told my then-teenaged kids about my decision to leave government to enter private practice, they asked me why? After all, people don’t like lawyers. Yes, I told them, but they like politicians less, my previous profession."}, {"type": "sentence", "content": "This post, though, is not intended to make you feel sorry for lawyers. The profession has been good to me, and I have no complaints. Nevertheless, this personal anecdote is intended to convey the fact that certain professions attract our ire and resentment much more than others do."}, {"type": "sentence", "content": "Compare the reputation of firefighters and police officers. People love their firefighters. They actually stand out in the street collecting charitable contributions. On the other hand, who doesn’t worry a little when they see a police car in their rear-view mirror. Even though in reality, their mandates are very similar, police officers deliver bad news, while firefighters help us in our time of need."}, {"type": "sentence", "content": "Another profession that receives our disdain is that of landlord. Just the word evokes negative connotations. These are people who will “lord” over us as a result of their ownership of the land. We think of them exactly once a month… when our rent is due. The only exception to that rule is when something is broken, at which point we curse their inevitably unsatisfactory response."}, {"type": "sentence", "content": "What’s more is that there are landlords who deserve our scorn. Our president and his father famously worked to exclude minority tenants from their developments, an all too common occurrence. There are slumlords, who profit off people unable to find otherwise affordable housing. Much of the older section of my city is blighted by landlords who refuse to keep their property up to a certain standard."}, {"type": "sentence", "content": "Despite this poor reputation, deserved or not, there is a certain economic reality landlords must face. On the one hand, tenants, having no ownership interest in the property, often fail to maintain it to the level it should be. They also will ditch out on paying rent when they decide to move. Evicting a tenant takes time, time during which the property is not producing income. Thus the income side of the equation is precarious at best."}, {"type": "sentence", "content": "On the other hand, landlords have hard expenses that cannot be deferred without losing the property. Primary among those expenses are the mortgage and property taxes. In most states, the property taxes are higher than you would pay on your own homestead because they are considered a commercial property. But this is not to minimize the additional expenses of maintenance, management fees, utilities, and the like. Those expenses don’t go away just because the tenant isn’t paying rent."}, {"type": "sentence", "content": "This crisis has been as much of a crisis for landlords as it has been for tenants. After all, when a tenant is unable to pay rent, the worst consequence they face is eviction. But most evictions are stopped during this crisis. At the same time, the mortgage companies aren’t giving the landlords a break. Even if they do defer payments, that only means they will pay more interest later on."}, {"type": "sentence", "content": "I know it’s hard to generate sympathy for landlords, but consider that they are caught in a vice right now with their income stream threatened while their expenses continue on. The reality is that they are some of our most threatened business-people in this crisis."}, {"type": "sentence", "content": "This reality is what makes the call by some populists on the left such as AOC or Representative Ilhan Omar (D-MN) so irresponsible. It’s easy for us to say cancel rent when it’s someone else’s ox that’s being gored. But all we’re doing in canceling rent is shifting the pain from one group of innocent people to another."}, {"type": "sentence", "content": "This is in no way to minimize the pain so many tenants are feeling. Their pain is a crisis that needs to be addressed. But the solution to that problem does not mean simply shifting the cost onto another group of individuals who can ill afford it. If we as a society decide that tenants need relief from rent payments, then we as a society should pay for it."}, {"type": "sentence", "content": "How do we do that? Through taxes and government spending, of course. The Constitution recognized that we cannot simply expect individuals to bear the burdens that society as a whole should bear. That is why it requires compensation before private property can be taken for public purposes. If we require landlords to forgo rent for the public good, then the public as a whole should pay for it, not just the landlords."}, {"type": "sentence", "content": "To give Ilhan Omar the benefit of the doubt, it is worth pointing out that the legislation she has sponsored only cancels rent for federally-funded properties. But recent protests and calls to cancel rent have not been limited to federal properties. All that refusing to pay rent will do is force landlords into bankruptcy, losing their property, with fewer homes available for rent as the ultimate result."}, {"type": "sentence", "content": "We progressives have been outraged by Trump’s irresponsible appeals to populist emotions. His anti-immigrant rhetoric is nothing short of racist, and it appeals to the base instinct of his political base (pun intended)."}, {"type": "sentence", "content": "But we claim to be different from him. We will not be able to make that claim if we simply target another group, no matter how deserving. In this time of crisis we must remember that we are all Americans. Instead of looking for someone to take our anger out on, we need to be coming together to find solutions that will help us as a community move forward in the long term."}], "topic": "economy"}