{"title": "Overcoming Doublethink within Trauma", "data": [{"type": "sentence", "content": "When one experiences trauma their sense of self, safety, and security are shattered. This lack of trust may lead to a defensive and pessimistic outlook that assumes danger and hostility will be everywhere."}, {"type": "sentence", "content": "But this ideology goes against our natural biological needs. As social creatures, we rely on collaborating and forming secure relationships as a method of survival."}, {"type": "image", "content": "https://miro.medium.com/max/5730/1*MHfuSKW7lxt_C019Hhf9dQ.jpeg"}, {"type": "sentence", "content": "When a traumatic event occurs, it is natural for victims to want to suppress the ordeal. But if the trauma remains unaddressed, the internalized pain will begin to exhibit itself through symptoms. Since the road to recovery can be a fluid process, many will realize that suppression and denial can only make matters worse. Thus, trauma survivors may encounter a paradoxical desire:"}, {"type": "sentence", "content": "at the same time"}, {"type": "sentence", "content": "Yet it is through this process of remembering one’s personal experience that truly aids in overcoming trauma."}, {"type": "sentence", "content": "Alternative Approach Towards Shame"}, {"type": "sentence", "content": "Feelings of shame are common within trauma victims but due to its nature, its presence will often feel deserved. The guilty will feel bad for something they have done, but the shamed will feel despicable for simply existing. To make matters worse, a self-perception skewed by shame can lead to self-isolation."}, {"type": "sentence", "content": "Common advice to improve self-perception is acknowledging our favorable traits. Yet that may not be enough to convince us that we are good people. There is an alternative approach that doesn’t focus on our positive attributes, but on the imperfection found in everyone else."}, {"type": "sentence", "content": "We need to recognize and reassure ourselves that all those who have lived before and after us, was and will be imperfect in their own way. We may be wrong or weird at times but that is entirely normal. By practicing this mentality, we may find an easier time accepting and sharing our flaws to those around us."}, {"type": "sentence", "content": "The Importance of Social Support"}, {"type": "sentence", "content": "It is never an easy task for victims to retell their traumatic experiences. But devoting time to coherently narrate your experience, will allow you to organize your thoughts and emotions. When practicing talk therapy, every time a survivor retells their experience he or she is forced to mentally relive the event. By repeating this process, it allows victims to become habituated with the negative emotions that come along with the memory."}, {"type": "sentence", "content": "According to Judith Herman, survivors can only overcome trauma once they have achieved two goals."}, {"type": "sentence", "content": "1. Being able to find contentment within daily life without the hindrance of trauma symptoms."}, {"type": "sentence", "content": "2. Being able to reform secure and trusting relationships with those around. With a strong support system, trauma survivors will have people in which they can rely on and confide in. Friendships can even help victims gain self-esteem by slowly rebuilding their sense of self."}, {"type": "sentence", "content": "Rebuilding Self-Esteem"}, {"type": "sentence", "content": "It is easy to assume that our strengths and achievements are what others like about us. But as we get close to someone, we start to reveal the uncomfortable truths of our true selves. By developing close relationships, we allow ourselves to practice vulnerability. Once we reach a certain level of comfort, we may begin to reveal personal stories and awkward habits. Sharing this kind of information can be dangerous though. If it’s revealed to the world, it may cause us great humiliation. But humiliation would only occur if the information was obtained by the wrong person. Within a trusting relationship, it is mutually acknowledged that something extremely valuable is being shared. Through gifting each other with our vulnerability, we are entrusting them with the key to our self-esteem."}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*YNW5eKkwG-4I3dTK-1X69g.jpeg"}, {"type": "sentence", "content": "Overcoming trauma is never easy but participating talk therapy and maintaining social support can immensely help in the road to recovery. The most effective way of overcoming trauma is by seeking a professional psychologist specialized in trauma."}, {"type": "sentence", "content": "It can feel extremely uncomfortable talking to a stranger about something so personal. But when you speak to someone who is unbiased, it allows you to see situations from different perspectives."}, {"type": "sentence", "content": "Overtime, retelling, and re-experiencing the event will become easier and easier. Until one day the negative emotions that accommodate the memory are no longer present. Through developing skills to express your narrative, the process of healing may begin."}], "topic": "mental-health"}