{"title": "My Teaching Epiphany", "data": [{"type": "sentence", "content": "The heart of education"}, {"type": "image", "content": "https://miro.medium.com/max/9678/0*cMlvbhJpNRh74mj5"}, {"type": "sentence", "content": "I’ve been an English Language teacher and Private Tutor for almost three years. I obtained a Certificate in TESOL (Teaching English to Speakers of Other Languages) in September 2017."}, {"type": "sentence", "content": "For the next year, I worked freelance full-time as a Private Tutor to primary and secondary school children as well as adults looking to improve their English all over Central London."}, {"type": "sentence", "content": "In July 2018, I worked at a summer school at the University of Greenwich teaching English as a Foreign Language to teenagers from Spain, Italy, Turkey, Morocco, Kazakhstan, and China in one of the hottest summers I’ve known in the UK (myself and the students seemed to melt into the floor more and more each day)."}, {"type": "sentence", "content": "Since September 2018, I’ve been working at a private language school in Ealing teaching English to adults from across the world as well as maintaining Private Tutoring on a part-time basis around London (currently all online because of the you-know-what situation)."}, {"type": "subtitle", "content": "The challenges"}, {"type": "sentence", "content": "I’m not going to lie, I find teaching difficult. Many times I’ve found myself frustrated, anxious, tired. To be honest, I’m amazed every day that I’m teaching at all."}, {"type": "sentence", "content": "Teaching was the last thing I wanted to do at school. As one of the painfully quiet ones trying desperately to blend into the background and disappear into the cracks in the walls, the idea of standing up and have everyone look at me was a living nightmare."}, {"type": "sentence", "content": "Yet, somehow, I fell into teaching after studying English Literature at university and found myself wondering what I should do with my life."}, {"type": "sentence", "content": "Slowly, I began to “be” rather than “observe” myself performing some other version of me. And it all started with an “epiphany”, something that opened my eyes to the heart of education and has kept me going since."}, {"type": "subtitle", "content": "A student’s epiphany"}, {"type": "sentence", "content": "In December 2017, I rang the doorbell to a flat in Stockwell, shielding myself against the bitter cold with a short grey coat, fraying at the bottom (I’m a bit of a Scrooge when it comes to buying new clothes)."}, {"type": "sentence", "content": "It was a friendly flat with a mum, dad and daughter. I helped the daughter with her English Language, English Literature and Maths GCSEs so she could pass and get into college to study catering."}, {"type": "sentence", "content": "For that day, I had chosen a classic of the GCSE English Literature curriculum to investigate with her: Percy Shelley’s Ozymandias."}, {"type": "sentence", "content": "I’d studied this poem myself when I was her age. My aim was to get her to practise analysing poetry for herself and understand what this poem is about."}, {"type": "sentence", "content": "We had an hour and I’d prepared three other poems so that we had plenty to look at in the time. In the end, we spent 50 minutes on Shelley’s poem as I probed her about its content and meaning."}, {"type": "sentence", "content": "She was struggling. We went around and around in circles with her not quite getting what the poem was about, and me trying to steer her back."}, {"type": "sentence", "content": "Eventually, after 50 minutes, her eyes lit up. “Oh! I get it! He’s talking about a statue!”"}, {"type": "sentence", "content": "To anyone who’s read Shelley’s poem, this may seem painfully obvious. Yet it wasn’t to her and that’s absolutely fine."}, {"type": "sentence", "content": "The way this revelation enlightened her and drove her to re-evaluate the poem and analyse its meaning melted my heart."}, {"type": "subtitle", "content": "My epiphany"}, {"type": "sentence", "content": "The most amazing thing was that I hadn’t told her anything. I’d simply asked the right questions to lead her to the answer. She had got there all by herself. So her joy was her own. She had understood the poem more deeply. She had unlocked it, not me."}, {"type": "sentence", "content": "I realised that this was a moment I’d remember. The moment I realised why what I was doing was worthwhile. On one level, my goal was to teach her more about poetry. Really, our one hour session and those that came before and after, were about giving her confidence in her own ability to do something she thought was beyond her capacity."}, {"type": "sentence", "content": "Teachers, tutors, educators, whatever they are or whatever they call themselves, bring out potential in others and widen their perspective on the world."}, {"type": "sentence", "content": "It’s a cliché to say that teachers learn just as much from their students as vice versa, but it’s absolutely true. I’m grateful to that lovely student for inspiring me and given me faith that what I’ve been doing is valuable."}, {"type": "sentence", "content": "For any teachers reading, I’d love to hear your own “lightbulb” moments. I also hope that mine, particularly at this difficult time, will help you to keep going when it’s tough and frustrating."}], "topic": "education"}