{"title": "How to Set Up and Track Goals in Google Analytics", "data": [{"type": "subtitle", "content": "Understanding if your marketing and content is driving the user behavior that you want"}, {"type": "sentence", "content": "This is my second article about Google Analytics. In the first article, I gave a beginner-friendly introduction to Google Analytics. I talked about how to navigate Google Analytics, how to find the most important reports, and how to interpret the data in those reports. If you’re interested, you can read that article here:"}, {"type": "sentence", "content": "Just like in the previous article, I’ll be using the Google Analytics Demo Account for all of the examples in this article. The Google Analytics Demo Account is a fully functional Google Analytics account that any Google user can access."}, {"type": "sentence", "content": "This means that you can follow the examples exactly as they appear in the article. It also means that you can experiment with Google Analytics before setting it up for your site."}, {"type": "sentence", "content": "You can access the Google Analytics Demo Account here."}, {"type": "subtitle", "content": "Goals in Google Analytics"}, {"type": "sentence", "content": "Getting traffic to your website is a great thing but it’s not the end goal of most websites."}, {"type": "sentence", "content": "It doesn’t matter if your website is a business or a blog, getting visitors to your site is only the first step."}, {"type": "sentence", "content": "After the visitor is on your site, you usually want them to take a specific action. This can be signing up to a mailing list, submitting a contact form, or downloading a discount coupon code."}, {"type": "sentence", "content": "The goal of the website is to convince a visitor to take a specific action. With Google Analytics, you can see how effective your website, marketing, and content is at getting visitors to take those actions."}, {"type": "sentence", "content": "To do this, you can define ‘goals’ in Google Analytics. Google will track how many visitors complete this goal and inform you about the conversion rate. With this information, you can begin to tweak your website, your content, and your marketing to improve your conversion rate."}, {"type": "subtitle", "content": "How to Set a Goal in Google Analytics"}, {"type": "sentence", "content": "Unfortunately, you can’t set goals in the Google Analytics Demo Account. For this part of the article, I’ll use the Google Analytics account for my website, Gone Foreign Project."}, {"type": "sentence", "content": "Goals are created and managed in the Admin screen of your Google Analytics account. You can access the Admin screen by clicking ‘Admin’ at the bottom of the navigation pane."}, {"type": "sentence", "content": "On the Admin screen, click on the ‘Goals’ button in the right-hand column:"}, {"type": "sentence", "content": "In the Goals Overview pane, click on the ‘New Goal’ button to start the process of creating a new goal:"}, {"type": "sentence", "content": "To create a goal, you have to complete a three-step wizard. In the first step, you can choose to use one of Google’s ready-made goal templates or to create a custom goal."}, {"type": "sentence", "content": "In this example, we’ll create a custom goal. Click the ‘Custom’ radio button (1) and then ‘Continue’ (2) to move onto the next step."}, {"type": "sentence", "content": "In the second step, you’ll assign a name for your goal and specify the type of goal you are setting up."}, {"type": "sentence", "content": "Let’s talk about the types of goals that are available quickly. There are four types of goals available:"}, {"type": "sentence", "content": "To keep the example simple, I’ll show you how to set up a Destination goal. We’ll track how many visitors view the Follow page of my website. This is the page where a visitor can sign up to my mailing list and is the page that I’m actively promoting on platforms like Medium and Pinterest."}, {"type": "sentence", "content": "So, my goal will be called ‘Visit Follow page’ (1) and the type is Destination (2). It’s important to give your goals a meaningful name so that you can distinguish which goal is which when you are tracking multiple goals on your website."}, {"type": "sentence", "content": "When you have filled in your goal’s name and type, click ‘Continue’ to move onto the final step (3)."}, {"type": "sentence", "content": "In the third step, you fill out the destination of your goal. You must fill out the name of the destination and not the whole URL."}, {"type": "sentence", "content": "Instead of using the URL of my subscribe page, I fill out the name of the page."}, {"type": "sentence", "content": "There are some extra configuration steps that you can take here like assigning a monetary value to each conversion but to keep the example simple, we’ll ignore those options for now."}, {"type": "sentence", "content": "When you have the destination for your goal-filled out, click Save to finalize your goal."}, {"type": "sentence", "content": "When your goal is saved, you will be re-directed to the Goal Overview screen. You should see your goal listed here and you should see that Google Analytics is actively recording this goal."}, {"type": "subtitle", "content": "Monitoring Conversions"}, {"type": "sentence", "content": "Google Analytics will start collecting data about your goals as soon as you configure them. After a short time, you can see the data that Google Analytics has collected."}, {"type": "sentence", "content": "I’ll switch back to the Google Analytics Demo Account for this part so that I don’t have to wait too long to finish the article."}, {"type": "sentence", "content": "To see how well your goals are converting, go to the Goals Overview report. In the navigation pane, click Conversions > Goals > Overview."}, {"type": "sentence", "content": "In this dashboard, you can see the most important information about your goal conversions."}, {"type": "sentence", "content": "The graph on top shows the number of conversions that occurred in the selected date range. In the detailed tiles, you can see useful information like your Goal Conversation Rate."}, {"type": "sentence", "content": "At the bottom of the screen, you can click on ‘Source/Medium’ to view your conversation rate per traffic source. This is really important information because it helps you to understand how well each traffic channel is working for you and how well your paid marketing campaigns are working."}, {"type": "subtitle", "content": "Wrap Up"}, {"type": "sentence", "content": "In this article, I showed you how to configure a simple goal (visitors viewing a specific page on your site) and how to monitor your conversions."}, {"type": "sentence", "content": "Getting visitors to a website is only half the battle. Once a visitor is on your site, you want to encourage them to take a specific action like visiting a page or submitting a form."}, {"type": "sentence", "content": "Google Analytics allows you easily to track goals to understand how effective your website, content, and marketing is at convincing visitors to do that action. By collecting and monitoring this data, you can start to optimize your content and your marketing."}], "topic": "marketing"}