{"title": "Avoiding expensive last-mile Data Science failures", "data": [{"type": "subtitle", "content": "A more tactile approach for making sure we solve a problem the customer cares about"}, {"type": "image", "content": "https://miro.medium.com/max/5980/1*c9WeGo2s7oqSf0QIFYEt7g.jpeg"}, {"type": "sentence", "content": "Whenever we read about success or failure in data science, the ‘last mile’ is often mentioned. And usually in the same breath as “this is when projects go to s***!”."}, {"type": "sentence", "content": "It’s that all-important step where you take insights obtained via analytics/machine learning and place them in the hands of the customer. You believe these insights can help them make better decisions … decisions that eventually lead to real business benefits."}, {"type": "sentence", "content": "Deep down, there’s a sliver of doubt. What if you’ve provided insights to a problem your customer doesn’t care enough about?"}, {"type": "subtitle", "content": "A trip down memory lane"}, {"type": "sentence", "content": "Back in first year civil engineering, our seen-it-all-before professor would throw new students a challenge. Two towns, separated by a fast-flowing river, and we need a bridge … a toothpick bridge."}, {"type": "sentence", "content": "“Any kind of toothpick bridge. Truss? Cantilever? Arch? You decide …”"}, {"type": "sentence", "content": "“Make assumptions!” he’d growl in response to the howls of protests at almost zero information. No google in those days!"}, {"type": "sentence", "content": "The models that students brought in the following week ranged from terrible to half-decent, boring to downright wacky. The professor, with a wry half-smile, would first ask “Do you guys trust any of these designs?”."}, {"type": "sentence", "content": "And then he’d pull out a steel ball bearing, place it at just the right spot and sure enough, one by one everyone’s structure would collapse."}, {"type": "image", "content": "https://miro.medium.com/max/768/1*NL8T6W3C0uvJPq6dqpiwew.png"}, {"type": "subtitle", "content": "Why don’t they trust us?"}, {"type": "sentence", "content": "From an engineer’s point of view, last-mile success is a structurally stable bridge. But civil engineering is also a mature discipline. It has well-defined processes that will get you to an output … unless things go very wrong."}, {"type": "sentence", "content": "Data science, for the most part, is probabilistic. Where predictions are concerned, we extract knowledge from data and then try desperately to make a more educated guess about the future."}, {"type": "sentence", "content": "We tend to say “Mr Customer, you’re likely to get a bridge — we just don’t know what kind and we don’t know how strong it’s going to be. But we think you should cross it because we’ve … done the work!”"}, {"type": "sentence", "content": "To many customers, it is a black box. Magic happens but what kind of alchemy? Is it sleight of hand? No one is certain."}, {"type": "sentence", "content": "And the unsaid question usually is “Do we trust that black box? And the people who front it?”."}, {"type": "subtitle", "content": "Trust and uncertainty in the problem statement"}, {"type": "sentence", "content": "That question of trust goes back to the beginning. A data science-type business problem, as the customer sees it, can take many forms and evolve over multiple iterations."}, {"type": "sentence", "content": "What the customer usually tells you is what they think they want at a particular point in time. But if they don’t know you, they might not quite tell you enough at first… or give you the context needed to understand the nature of the problem."}, {"type": "sentence", "content": "So realistically, that first version of the problem you hear is unlikely to be the problem you need to solve."}, {"type": "sentence", "content": "See how this one morphs for example."}, {"type": "sentence", "content": "Ultimately, every day we get to spend with our (internal or external) customer is one step closer to knowing what the real problem is."}, {"type": "sentence", "content": "Finding a way to get to that dirty underbelly as quickly and intimately as possible means the difficult task of always trying to imagine being in our customer’s shoes … and then asking questions of the supplier with the intent to feel viscerally."}, {"type": "sentence", "content": "And this is where storyboarding, with its ability to frame questions and answers in a way that invites dialogue, can come in handy for data science."}, {"type": "subtitle", "content": "What storyboarding means to us"}, {"type": "sentence", "content": "A few years ago, plagued by poor communications and outcomes, data science latched on to the concept of telling stories with data."}, {"type": "sentence", "content": "Having seen first-hand our audiences being overwhelmed by data-driven dialogue, we had to look for alternatives. And we found the WHY of using visuals and narratives as described by Brent Dykes in his “Essential data science skills” article simply too compelling to ignore."}, {"type": "sentence", "content": "It’s one thing carving out time to learn a new skill but how does one find motivation? For that, we went to the film industry … possibly the true masters of visual storytelling."}, {"type": "sentence", "content": "So we read Studio Binder’s guide to storyboarding and then went through its repository of movie favourites in storyboard form. And in all honesty, the thought of trying to wrangle a customer’s problem on a sketchpad first was a lot more inspiring!"}, {"type": "sentence", "content": "Of course, that still left us with how to effectively work data into a storyboard for an audience of C-levels, engineers, managers and others. Thankfully, we found Nancy Duarte and gobbled up her ideas on humanising data."}, {"type": "sentence", "content": "For us, storyboards have now become guideposts for the path we and our customers need to take."}, {"type": "subtitle", "content": "Five benefits of storyboarding in data science"}, {"type": "image", "content": "https://miro.medium.com/max/4324/1*78b7KbgPrnuX-bB8WOFx7A.png"}, {"type": "subtitle", "content": "1. Storyboarding helps you validate that there is a problem"}, {"type": "sentence", "content": "One of the early mistakes we made was starting our storyboarding process during data analysis. Too late … unless you’re confident you understand the problem as the customer sees it."}, {"type": "sentence", "content": "Now we start with the goal of making sure we can first see the problem via data, which isn’t always as easy as it sounds. But it gives us confidence that the problem is tangible."}, {"type": "subtitle", "content": "2. Storyboarding helps you reach common problem understanding with the customer"}, {"type": "sentence", "content": "By replaying the problem back to the customer in your words, they get to understand your process, and you get to understand theirs."}, {"type": "sentence", "content": "You also have the opportunity to refine the problem and the customer will likely sense that you’re genuinely trying to understand and acknowledge their pain."}, {"type": "subtitle", "content": "3. Storyboarding shows them that you are doing something"}, {"type": "sentence", "content": "Customers usually want to know that something is happening. A picture at a time, with a hint of progress, can do wonders."}, {"type": "sentence", "content": "More importantly, as they see what you’re doing, that black box becomes less of a black box."}, {"type": "subtitle", "content": "4. Storyboarding with early financials will give you a sense of how to get to a sound business case eventually"}, {"type": "sentence", "content": "We need to find out quickly what makes the customer tick, and preferably as far away from the finish line as possible."}, {"type": "sentence", "content": "Introducing cost estimates is a surefire way to get an early gauge of how bad the problem is, how much your customer cares about it and how off track you potentially are!"}, {"type": "subtitle", "content": "5. Storyboards can be tailored to reach different stakeholders"}, {"type": "sentence", "content": "Like horses for courses, the same storyboards may not necessarily work for different tiers of audience in your customer domain. And that’s why it’s critical to use tools that allow multiple storyboards off the same underlying data."}, {"type": "subtitle", "content": "How much energy does this all take?"}, {"type": "sentence", "content": "A lot."}, {"type": "sentence", "content": "Make no mistake, it is time consuming and exhausting. We’re in effect front-loading effort in the hope of more certain future gains. Clarifying the problem extensively never meant that all the other work of data cleaning, transformation, model building and machine learning application stops."}, {"type": "sentence", "content": "But it does give us the opportunity to self-correct before the last mile … without too much collateral damage."}, {"type": "sentence", "content": "And helps us build the all-important narrative and business case brick-by-brick with our customer."}, {"type": "subtitle", "content": "So maybe leave the insights for now and uncover the black box first"}, {"type": "sentence", "content": "The reality is, even if the business problem was defined adequately, any usable insight is unlikely to work if decision makers don’t believe the process of how we got there. And that usually happens if they aren’t part of the journey in the first place."}, {"type": "sentence", "content": "But if we participate in the customer’s version of the process, we give ourselves a chance. We might just end up spending enough time with them to allow trust and respect to naturally build up."}, {"type": "sentence", "content": "Of course, the quality of our work had better be decent and the numbers must work."}, {"type": "sentence", "content": "And then, they might just cross that bridge on your say-so …"}], "topic": "business"}