{"title": "I am the user; I am not the user", "data": [{"type": "subtitle", "content": "The dualistic mindset that can prevent catastrophic design decisions."}, {"type": "sentence", "content": "I don’t think I became a good designer until I became an empathetic designer. And yet, that’s not entirely accurate: how can I be truly empathetic with people I’ve never met, people I can only conjure in my mind?"}, {"type": "sentence", "content": "Empathy is defined as the ability to understand and share the feelings of other people. I’m designing products for millions of people. I can’t possibly understand them all. I can’t truly share their feelings. So what can I do?"}, {"type": "sentence", "content": "Over the years, I’ve adopted a dualistic approach to this problem. First, I imagine myself as the primary user. Then I acknowledge I am absolutely not the primary user, and go from there."}, {"type": "image", "content": "https://miro.medium.com/max/688/1*peBt6fuh-HYlsNly6bPtzg.png"}, {"type": "subtitle", "content": "I am the user"}, {"type": "sentence", "content": "When I begin designing a product or feature, I start by asking myself how I would feel if I were the end-user. “Do I like this? Would I use it? How does it make me feel?” I consider a negative response a warning sign: I might be going down the wrong path. A positive response tells me I might be headed in the right direction."}, {"type": "sentence", "content": "This isn’t empathy, exactly. It’s more akin to the veil of ignorance, which Mike Monteiro addresses in his book, Ruined by Design. In the way Monteiro applies it, we as designers should ask ourselves how we’d feel as an end-user of the system we’re designing. Does it feel fair or unfair? Does it feel ethical or shady? Transparent or misleading? Beneficial or useless? Easy or hard?"}, {"type": "sentence", "content": "A few months ago, I came across a product manager and designer brainstorming a sharing feature at one of our whiteboards. The way they were envisioning it, the sharer would enter a recipient’s email address into our system, thus creating a more direct, personalized experience. Having researched this idea in the past, I knew that users hated this kind of interaction; they worried about their friends and family getting spammed. Likewise, those who received the share were displeased their contact information had been handed over to a third party."}, {"type": "sentence", "content": "The problem wasn’t the intent: both the designer and product manager had their hearts in the right place. The problem was neither of them had asked themselves how they would feel if they were participants in this system. How would they feel if they were either the sharer or the recipient?"}, {"type": "sentence", "content": "Rather than tell them I knew from experience this was a bad idea, I simply asked them how they would feel as an end-user in this system. A little role-playing. After a moment’s thought, they both agreed it felt wrong, and they cited the reasons I’d discovered earlier. Bingo. When they envisioned themselves as actual users, the problems with the idea became apparent."}, {"type": "sentence", "content": "Wearing the shoes of the user exposes some ideas as so bad they need to die an instantaneous death, no further research needed. That’s the case with the sharing feature above. “If you did this to me, I would be quite unhappy.” That’s the kind of reaction that tells me I really shouldn’t pursue an idea much further. In this case, I am the user is a great mindset for killing truly bad ideas."}, {"type": "sentence", "content": "The gray area ideas are tricker, however; these are the ones that don’t appeal to me that much, but which aren’t outright wrong. The ones where I think, “Not my cup of tea, but maybe someone else would fancy it.”"}, {"type": "sentence", "content": "And then there are the ideas I really like, the ones I think are definitely worth pursuing. The ones where, as a user, I say to myself, “Yes, I’d love this.” But how do I know if others would feel the same? How can I be sure my feeling isn’t just a result of my bias toward my own ideas?"}, {"type": "sentence", "content": "In both cases—the gray area and the definite yes—I need to switch my mindset."}, {"type": "image", "content": "https://miro.medium.com/max/688/1*mMFyMEHHwiI2B0a6ufrXbg.png"}, {"type": "subtitle", "content": "I am not the user"}, {"type": "sentence", "content": "Hi there. It’s me, Michael. I’m soaked in 25 years of tech and design holy water. I come pre-loaded with all manner of opinions, biases and experiences. I’m an n of one."}, {"type": "sentence", "content": "Passing the first test—I am the user—only gets me so far. Now I need to learn from actual users. I need to shelve all my own opinions and feelings and find out how my idea does with others. But research takes time. It can be expensive. And anyway, I love my darling idea—I don’t want to fiddle around with other people and their annoyingly risky opinions!"}, {"type": "sentence", "content": "This is when I remind myself that the more I like an idea, the more likely I am to ignore its faults. The beloved idea is the riskiest idea. This is when I remind myself that I am not the user."}, {"type": "sentence", "content": "About eight months ago I was working on a complete redesign of the TED mobile app. I was feeling pretty proud of my handiwork. As a user, I liked it! I was convinced we were headed in the right direction."}, {"type": "sentence", "content": "However, when I shared the prototype with my wife, she started questioning some of my fundamental design decisions. I got nervous and defensive. We were on a tight deadline; I didn’t have time to re-think these things!"}, {"type": "sentence", "content": "That’s when I reminded myself, I am not the user. I used her feedback to quickly create an alternate prototype which I shared with several other people the very next day. Each and every one of them preferred the prototype that incorporated my wife’s feedback over my original design."}, {"type": "sentence", "content": "Mixed emotions time: I was psyched that I’d avoided a potentially catastrophic issue, but also worried about how my team would take the news that we had to make major structural revisions just a couple weeks before a planned launch."}, {"type": "sentence", "content": "Fortunately, my team loves making good products as much as they hate making bad ones. (And they’re not prone to violence.) We made the changes, and the app we ultimately launched was better because of the feedback I got from my wife and others. People who are very much not me."}, {"type": "sentence", "content": "When I was the user, it was rainbows and unicorns. But I’m only one user, and I’m biased. My assessment matters as a first step, but only a first step. The only way to truly know if what I’m designing will work for actual users is to talk with actual users."}, {"type": "subtitle", "content": "Egos, deadlines, and other enemies"}, {"type": "sentence", "content": "No one likes to be proven wrong. No one wants to risk missing a deadline because they made a mistake. No one wants to do a bunch of extra work that might challenge their expertise. But everyone wants to deliver great products that people want and love."}, {"type": "sentence", "content": "The solution isn’t to skip the research. The solution is to let go of our egos, to be willing to take the time to listen and revise, and to accept that it’s better to be wrong now than wrong later."}, {"type": "sentence", "content": "We can start by putting ourselves in the shoes of the people we’re designing for, and then go and talk to those people."}, {"type": "sentence", "content": "I am the user. I am not the user."}], "topic": "ux"}