{"title": "Defining Functions in Python", "data": [{"type": "subtitle", "content": "Defining Python Functions"}, {"type": "sentence", "content": "In computer science, functions provide a set of instructions for performing a specific task. Functions are an important part of software programs as they are at the heart of most applications we use today. In this post, we will discuss how to define different types of functions in python."}, {"type": "sentence", "content": "Let’s get started!"}, {"type": "subtitle", "content": "Defining a Simple Function"}, {"type": "sentence", "content": "To starts, let’s define a simple function. We use the ‘def’ keyword to define functions in python. Let’s define a function that prints a quote from Thomas Pynchon’s, Gravity’s Rainbow :"}, {"type": "sentence", "content": "Now, if we call our function it should display our quote:"}, {"type": "image", "content": "https://miro.medium.com/max/2624/1*kxvAFt9SHZxpTrWYyKfVjw.png"}, {"type": "sentence", "content": "If we’d like, we can have the function return the string using the return keyword:"}, {"type": "sentence", "content": "We can then store the function return value in a variable and print the stored values:"}, {"type": "image", "content": "https://miro.medium.com/max/2624/1*kxvAFt9SHZxpTrWYyKfVjw.png"}, {"type": "sentence", "content": "An even cleaner way to write our function would be to store the string in a variable within the function scope and return the variable:"}, {"type": "sentence", "content": "Let’s store the function return value in a variable and print the stored values:"}, {"type": "image", "content": "https://miro.medium.com/max/2624/1*kxvAFt9SHZxpTrWYyKfVjw.png"}, {"type": "subtitle", "content": "Defining a Function with Input"}, {"type": "sentence", "content": "Now, let’s discuss how to define functions with input. Let’s define a function that takes a string as input and returns the length of the string."}, {"type": "sentence", "content": "We can define a few variables storing quotes of different lengths. Let’s use a few quotes from William Gaddis’s The Recognitions:"}, {"type": "sentence", "content": "Let’s call our function with each of these quotes:"}, {"type": "image", "content": "https://miro.medium.com/max/124/1*2xwUUmy1ycvhOGvy0slYNw.png"}, {"type": "sentence", "content": "We can also perform various operations on our input string. Let’s define a function that combines our quotes into a single string. We can use the ‘join()’ method to combine a list of strings into a single string:"}, {"type": "sentence", "content": "If we print our function with our ‘quote_list’ as input we get the following result:"}, {"type": "sentence", "content": "We can also have multiple input values in our function. Let’s have our function take an input string that specifies the author name. In the scope of the function, let’s print the author’s name:"}, {"type": "sentence", "content": "Now, let’s call our function and print its return value:"}, {"type": "image", "content": "https://miro.medium.com/max/3960/1*te6eCEYoKS6Y4KbzAa7J8g.png"}, {"type": "subtitle", "content": "Returning Multiple Values"}, {"type": "sentence", "content": "It is also very straightforward to return multiple values in a function. Let’s define a function that takes a quote, a book title, an author name and the number of pages in the book. In our function we will create a data frame that contains columns for the quote, book titles, authors, and number of pages. The function will return the data frame and its length."}, {"type": "sentence", "content": "To start, let’s define a list of quotes, corresponding authors, book titles, and number of pages:"}, {"type": "sentence", "content": "Next let’s store each list in a dictionary with its appropriate key:"}, {"type": "sentence", "content": "Now, let’s pass the dictionary into the data frame constructor from the Pandas library:"}, {"type": "sentence", "content": "Let’s also relax the limit on the number of display columns using Pandas, and print the result:"}, {"type": "image", "content": "https://miro.medium.com/max/2156/1*QIF1Xs_e2KG9BJfRSIOMGw.png"}, {"type": "sentence", "content": "Now let’s wrap this code in a function. Let’s name our function ‘get_dataframe’. Our function will return the data frame and its length:"}, {"type": "sentence", "content": "Now let’s call our function with our lists and store the return values in two separate variables:"}, {"type": "image", "content": "https://miro.medium.com/max/2320/1*eW6Mqa6AaXHnCxMYjV7JHA.png"}, {"type": "sentence", "content": "We have freedom to choose which and the number of values we return in our function. Let’s also return the pandas series corresponding to the ‘quotes’ and ‘books’ columns:"}, {"type": "sentence", "content": "Now, let’s call our function again:"}, {"type": "sentence", "content": "And we can print books:"}, {"type": "image", "content": "https://miro.medium.com/max/698/1*_-KUQUhKIJ7i_XW5c_Kbiw.png"}, {"type": "sentence", "content": "And quotes:"}, {"type": "image", "content": "https://miro.medium.com/max/1540/1*QHodOEIfuBUijfego27H0Q.png"}, {"type": "sentence", "content": "I’ll stop here but feel free to play around with the code yourself."}, {"type": "subtitle", "content": "CONCLUSIONS"}, {"type": "sentence", "content": "To summarize, in this post we discussed how to define functions in python. First, we showed how to define a simple function that prints a string. corresponding to a book quote. Next, we discussed how to define a function that takes input values, manipulates the input, and return a value. Finally, we showed how to define a function that returns multiple values. I hope you found this post useful/interesting. The code in this post is available on GitHub. Thank you for reading!"}], "topic": "data-science"}