{"title": "Facebook told my followers I was spreading misinformation about government surveillance. I wasn’t.", "data": [{"type": "sentence", "content": "Calling for more censorship — or for Big Tech companies to become the arbiters of truth — will ultimately backfire. We need to address the problem of viral disinformation at its root."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*Mr_FPdVq2oowkEpHgD3Hnw.jpeg"}, {"type": "sentence", "content": "By Evan Greer, Deputy Director of Fight for the Future"}, {"type": "sentence", "content": "Okay I’ll admit it. I still use Facebook. When I logged on last night I saw something I had never seen before: a notification that read “Partly false information found in your post by independent fact checkers.” I was surprised, but figured maybe it was a glitch or related to some joke meme I had posted or something like that. I clicked it to learn more."}, {"type": "image", "content": "https://miro.medium.com/max/944/0*kdpB51ZTTRRupJot"}, {"type": "sentence", "content": "It turned out that “Independent fact-checkers” at USA TODAY had flagged a VICE article that I shared, and am quoted in, about the reauthorization of the Patriot Act and the ongoing fight around amendments to rein in mass government surveillance. This is an issue that my organization, Fight for the Future, has been working on for the better part of a decade. The post now contains a prominent flag shown to everyone who sees it, effectively censoring the original article and replacing it with a large link to the USA TODAY “fact checking” piece instead."}, {"type": "image", "content": "https://miro.medium.com/max/944/0*mpUhA43duYBYKzrL"}, {"type": "sentence", "content": "I clicked through to read why exactly they had decided the article was “partly false.” When it comes down to it, the “independent fact checker” at USA TODAY was quibbling about semantics. The VICE headline read, “Senate Votes to Allow FBI to Look At Your Web Browsing History Without A Warrant.” The article is referring to the Senate passing the USA Freedom Reauthorization Act, which reauthorizes several Patriot Act and Foreign Intelligence Surveillance Act (FISA) surveillance authorities — while failing to pass an amendment offered by Senators Wyden (D-OR) and Daines (R-MT). The amendment would have required the FBI to get a warrant before snooping on Internet activity like web browsing and search history. The headline is provocative, but it is 100% true. And the article itself elaborates and explains the nuance. The fact checker is essentially claiming that the post is misinformation because the Senate didn’t “vote to allow” — they just “didn’t vote to not allow.”"}, {"type": "sentence", "content": "Even if that were true, it would be a pretty tenuous justification for effectively censoring information on a platform used by billions of people. But it’s not true — the amendment was tacked on to the underlying bill, which reauthorizes FISA surveillance powers that are set to expire. So the Senators who voted to reauthorize Section 215, and voted against the amendment, absolutely did “vote to allow” warrantless government surveillance of Internet activity. The USA TODAY piece is significantly more “false” than the VICE piece."}, {"type": "sentence", "content": "It appears that the USA TODAY fact checker first discovered the VICE article via a viral post from the Facebook page “Being Libertarian.” The fact checker took issue with some of the specific language that that page used when sharing the article. But it appears that Facebook has applied the “partly false” flag not just to that page’s post, but to anyone who posts the same article."}, {"type": "sentence", "content": "The USA TODAY piece relies heavily on “an email exchange” with Stewart Baker, the former top lawyer for the National Security Agency and a staunch defender of mass government surveillance programs. They did not attempt to contact my organization Fight for the Future, or experts from the ACLU, Free Press, Demand Progress, or any of the dozens of other reputable civil society organizations who have issued public statements that closely mirror the article’s framing. It also does not appear that they attempted to contact Senators Wyden or Daines, VICE, or the journalist who wrote the piece. In the end, they claim that the article is “partly false” based on a fairly generous read of how the FISA court works and their best guess at how a reader might interpret the headline and article. Without due process or a meaningful way to appeal the decision, this “fact checker” became judge, jury, and executioner, killing the spread of an organically viral post about government surveillance at a time when activists are working around the clock to inform the public about an upcoming vote that impacts their most basic rights."}, {"type": "sentence", "content": "The outcry over the Senate vote had an impact, and the House is now expected to vote on a similar amendment in a matter of days. Facebook and their fact checking partner’s arbitrary decision to flag the VICE article as “misinformation” could have a significant impact on that vote."}, {"type": "image", "content": "https://miro.medium.com/max/1370/0*inBghcfw7LVa2DKz"}, {"type": "sentence", "content": "This is not some epic conspiracy. I’m sure the fact checker at USA TODAY did their best to research this complex topic and come to a determination they felt was fair. I doubt they’re secretly working for the surveillance state. Reporters will always bring their implicit biases to the ways they frame stories, which details they include and which ones they omit. In this case, clearly the VICE story was more sympathetic to civil liberties advocates working to limit government surveillance. The USA TODAY piece is more sympathetic to the government and intelligence agencies. Neither of them are “false,” and neither of them should be effectively censored by Facebook or buried by its non-transparent algorithm in the name of stopping disinformation. Facebook should not be putting its thumb on the scale, to say that one article is “more true” than the other, when such determinations can be incredibly subjective and have profound implications for the democratic process."}, {"type": "sentence", "content": "The spread of online hate and outright lies on platforms like Facebook is a real problem. But it’s not a problem that can be fixed with more censorship or by demanding that Big Tech companies become the arbiters of what is and isn’t true. Around the world, we’ve seen governments scrambling to stem the flow of “misinformation,” often by enacting policies that do more harm than good. Ethiopia’s “Hate Speech and Disinformation Prevention and Suppression Proclamation” has been decried by activists there as being abused to stifle free expression and freedom of the press. Similar legislation in Egypt has raised alarm bells for human rights groups. YouTube’s attempt to remove white nationalist videos from its platform resulted in automated censorship of anti-racist videos from groups like the Southern Poverty Law Center."}, {"type": "sentence", "content": "In the United States, progressive groups and lawmakers rightly concerned about the rise of far right online activity, and attempts by state actors to manipulate elections, have increasingly turned to calls for Internet censorship, deplatforming, and more aggressive moderation by companies like Twitter, YouTube, and Facebook. These calls are well intentioned but ultimately misguided. Empowering for-profit companies to become the referees of speech and determine what we are and are not allowed to debate solidifies the status quo, and largely benefits the powerful while silencing the oppressed. And in the midst of the COVID-19 crisis, this situation could easily get worse very quickly. Facebook has already admitted that it’s relying more on the use of artificial intelligence, and prioritizing the “removal of harmful content” over all else. Implied is that they are prioritizing removing “harmful” content over ensuring that their moderation systems don’t also remove legitimate content in the process. A software “bug” led Facebook to remove factual posts about COVID-19 from actual healthcare professionals, for example."}, {"type": "sentence", "content": "There is no silver bullet solution that will stop the spread of online misinformation without resulting in collateral damage and censorship of legitimate content and marginalized voices. Instead of calling for more aggressive moderation, we should address the problem at its root: Big Tech companies’ underlying business model of data harvesting, micro-targeting, and artificial algorithmic amplification maximized for engagement above all else. These inherent flaws have become societal crises as a tiny handful of companies have become so large that their policies become de facto law for the entire Internet, something that can only be addressed by either breaking them up or building decentralized alternatives."}, {"type": "sentence", "content": "The problem with Facebook is not that it’s a place where people can say what they want or share articles that may or may not be true. It’s that Facebook is not a town square — it’s a machine designed to make money by shoving content down the throats of people that Facebook thinks will engage with it, and thus generate advertising revenue, no matter what the cost. Politicians, pundits, racists, and scam artists have always lied in public. Facebook allows them to directly target those lies to the people most likely to believe them."}, {"type": "sentence", "content": "Facebook isn’t broken. It’s working exactly as intended. The product that Facebook has built is fundamentally incompatible with basic human rights and democracy -– and begging Mark Zuckerberg to take down things we don’t like won’t change that. Worse, if we fail to address the underlying problems and get caught in an endless game of partisan whack-a-mole or working the refs, we will continue to see more and more collateral damage, like with my post about the Patriot Act."}, {"type": "sentence", "content": "Facebook’s surveillance capitalist business model inadvertently helped prop up the US government’s surveillance state ahead of a crucial vote. It’s hard to imagine a better example of how urgent it is that we hold Big Tech companies accountable and fight for policies that limit their ability to manipulate and control public debate, rather than giving them more power in name of truth."}], "topic": "social-media"}