{"title": "It Took A Pandemic For Social Media To Get (Semi) Serious About Fake News. Will It Last?", "data": [{"type": "image", "content": "https://miro.medium.com/max/25000/1*GoJ3YGqbVKBjbB8lIOfEVw.jpeg"}, {"type": "sentence", "content": "First came the crisis. Then the conspiracies. On Facebook, YouTube and other platforms, posts began popping up and going viral: 5G causes COVID-19; drinking bleach can cure it; Bill Gates is behind it."}, {"type": "sentence", "content": "For me, this felt like a bad case of deja vu: another global news event, another flurry of opportunists using social media to spread misinformation at the worst possible time."}, {"type": "sentence", "content": "But, then, something happened, both unexpected and long overdue. In contrast to the slow, tepid responses to everything from Russian election interference to doctored videos, networks acted swiftly, if not always effectually."}, {"type": "sentence", "content": "False stories were hunted down and actively removed; others were slapped with warning labels or downgraded to limit reach. Facebook has gone so far as to send out alerts to users who may have crossed paths with misinformation about COVID-19. Users are rallying, as well. Prominent entrepreneur and Dragon’s Den Dragon Michele Romanow recently supported a #CheckThenShare campaign “to stop the spread of misinformation because sharing bad information can be deadly.”"}, {"type": "sentence", "content": "The results are far from perfect. But, in the face of a global pandemic, social networks are finally mustering the resolve and technical savvy to get a handle on fake news. For us, and for the networks themselves, it’s not a moment too soon. But will it last?"}, {"type": "subtitle", "content": "A social fall from grace"}, {"type": "sentence", "content": "Social media has followed the arc of so many new technologies. Initially, possibilities seemed endless. People everywhere found a new way to connect with friends and family. Businesses were able to reach customers directly. During the Arab Spring, my own platform was used by protestors in Egypt rallying against an oppressive regime."}, {"type": "sentence", "content": "But ads and invasive data collection took a toll. Trolls and cyberbullies showed up. Social platforms still offered useful ways for people and businesses to connect, but it grew harder to separate signal from noise. Then, Cambridge Analytica happened — the weaponization of social media by a foreign power during the 2016 U.S. Election, right under our noses."}, {"type": "sentence", "content": "In its wake, networks floundered in a sea of fake news, their own algorithms propagating an echo chamber of hate and misinformation. Growth slowed and backlash spread, as users by the millions deleted their accounts. Even in the face of political and popular pressure, platforms seemed ill-equipped, or disinclined, to make meaningful change. Years after Cambridge Analytica, patently fake and damaging videos — like the infamous Nancy Pelosi deepfake — could still circulate freely."}, {"type": "subtitle", "content": "A crisis and a return to roots"}, {"type": "sentence", "content": "Then came COVID-19. In the face of crisis, social media usage has surged once more. A study of 25,000 consumers across 30 markets showed engagement increasing 61% over normal usage rates. Messaging across Facebook, Instagram and WhatsApp has increased 50% in countries hardest hit by the virus. Twitter is seeing 23% more daily users than a year ago. When it matters most, people (even #DeleteFacebook diehards) are turning to social media for updates and connection."}, {"type": "sentence", "content": "Businesses, as well, have found renewed value. We’ve seen a 15–20% increase in posts from our 18 million users, as companies reach out to customers and employees. Moreover, how they use social media is changing. Our data shows marketing and ads have given way to direct engagement — one-on-one interaction with other people."}, {"type": "sentence", "content": "Whether it’s the mayor of Newark tackling questions on Facebook Live, TransLink highlighting the heroism of essential workers, or Make A Wish turning to Instagram to reach kids in need, businesses are prioritizing connection over conversions. You see this at the individual level, as well, as messages of support and solidarity overshadow selfies."}, {"type": "sentence", "content": "And, behind the scenes, platforms are beginning to rise to the occasion. The global threat, not to mention global soul-searching, occasioned by COVID-19 has seen social networks themselves assume an unusually activist stance in at least attempting to root out misleading content. Interventions that seemed unlikely or infeasible before are now commonplace."}, {"type": "sentence", "content": "After a live-stream alleging a link between 5G and COVID-19 went viral, YouTube immediately pulled the video, barring content contradicting WHO and health authorities. Facebook swiftly deleted two major anti-5G groups, whose 60,000-plus members called for destroying 5G masts. WhatsApp limited message forwarding to slow the casual spread of rumors."}, {"type": "sentence", "content": "These steps might not seem revolutionary, and plenty of misinformation still got out (and continues to circulate). But something is different this time. In a moment of crisis, the fall-out from fake news has grown too big — existential, in fact — for networks to ignore."}, {"type": "subtitle", "content": "What’s next for social media"}, {"type": "sentence", "content": "Admittedly, this is a unique moment. For people like me who live and breathe this stuff, the confluence of people using social media for good and networks rallying to support their efforts has been inspiring. Whether it will last remains unclear. As the immediate health crisis recedes, so too will the spotlight on social media and the urgency to get things right. Already, the solidarity of early days is splintering. But I’m hopeful this can mark a turning point in the reinvention of a transformative technology."}, {"type": "sentence", "content": "“We’ve always hoped that our digital tools would create connections, not conflict. We have a chance to make it happen,” observes New York Times’ columnist Kevin Roose. Let’s not waste that opportunity. For users, it’s worth remembering that any technology is only as good as the intentions of those using it. For networks, it’s time to fully embrace the responsibility that comes with your crown. Letting lies spread isn’t that different from spreading lies."}, {"type": "sentence", "content": "And for a vision of all social media truly can be — edifying, entertaining, even inspiring — look no further than … Steak-umm. That’s right. The frozen meat snack’s Twitter feed has become an unlikely beacon during the crisis, dispensing fact and fighting myth."}, {"type": "sentence", "content": "Well said, Steak-umm. And I’m glad to say this post went viral — for all the right reasons."}, {"type": "sentence", "content": "Like this post? Sign up for my newsletter for my take on the latest leadership, tech and business news, all with an optimistic twist."}], "topic": "social-media"}