{"title": "How to Avoid Draining Customers", "data": [{"type": "subtitle", "content": "And acquire better ones."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*AsK-F4AGSw-E9823"}, {"type": "sentence", "content": "Arguably, 80% of your clients are not worth the stress. The Pareto Law — by Vilfredo Pareto — says so. As a freelancer, a business, or an independent marketer, you can tell that some customers are simply difficult to handle. And most annoyingly, they bring in a significantly small proportion of your total revenue."}, {"type": "sentence", "content": "Other than the revenue proportion of the customer, there are several other reasons to avoid a customer that is not taking your business forward. The relationship between customers and businesses should be mutual — you solve their problems, and they help you grow. If this is not the case, then the relationship is probably not worth it."}, {"type": "sentence", "content": "Some customers drain your enthusiasm. As a freelance writer, I have come across clients with extreme expectations. Although working with people like this should make your skills get better, it is not so when they are seldom clear on their requirements and often abusive. In most cases, we go back and forth on supposed petty projects. At the end of the project, I had invested more time and energy than I’m being rewarded for."}, {"type": "sentence", "content": "I’m not saying these clients are awful. No, not at all. All I’m saying is that we weren’t good fits for each other, and I should have avoided them — and you should."}, {"type": "sentence", "content": "From my experience, I’ll briefly share how to avoid customers that are draining you and focusing on winning better-paying ones."}, {"type": "subtitle", "content": "Clear Communication Is Key"}, {"type": "sentence", "content": "For every collaboration, effective communication puts everyone on the same page. Without this, everyone would be working like a pack of lone wolves hunting at their accords. When dealing with a customer — either as a freelancer or a brand — you need to communicate honestly."}, {"type": "sentence", "content": "Redacted information makes it hard for your clients to create vivid expectations; thus, they could keep it unrealistically high. Make sure that you let them know what you are capable of doing and how they can help you serve them better. This way, they would know what to expect and ascertain if they are working with the right person or company."}, {"type": "sentence", "content": "This practice will help you avoid draining clients and acquire those that are really satiable by your services."}, {"type": "subtitle", "content": "Transparency is Crucial"}, {"type": "sentence", "content": "Sometimes, the demoralizing hassle you experience while dealing with clients could be your fault. A hard pill to swallow, huh?"}, {"type": "sentence", "content": "While working on a project, it’s necessary to allow the client to track your progress. You may be self-motivated and a self-starter that thinks she can fix things through and just leave the client with results. Well, it doesn’t always work that way. Most clients want to be involved in the progress of the project. They want to make modifications as you go and ensure that things are going smoothly."}, {"type": "sentence", "content": "When working on a medium to long term project — let’s say above six weeks — I provide regular weekly updates to the client. I give them a detailed report of how the week progressed, and I list my plans/schedule for the coming week. If I’m ghostwriting a book, I usually ask them to skim through the completed part and suggest modifications."}, {"type": "sentence", "content": "You may wonder why I don’t ask them to do these when I finish the book. Well, the back-and-forth movement with a bulky book is ten times more troubling than it would be on the shorter parts."}, {"type": "sentence", "content": "Whether they request it or not, make it a habit to keep them posted on the progress of their project. Be transparent about it. It’s theirs, not yours."}, {"type": "subtitle", "content": "Clearly Define Your Ideal Client"}, {"type": "sentence", "content": "No matter the industry, there is so much money to be made, and there are so many clients to serve. You might feel the urge to close every client that comes knocking at you. Don’t do it. Choose your clients and close wisely by clearly defining your ideal client."}, {"type": "sentence", "content": "To define your ideal client, you must identify the people that would really need your services. As a ghost soul lyricist, do not expect to work with Kendrick Lamar."}, {"type": "sentence", "content": "I’m surely going to write an entire article on how to clearly define your ideal clients without being unrealistic. You can follow me to stay posted."}, {"type": "sentence", "content": "Remember, I mentioned that it’s going to be brief."}, {"type": "sentence", "content": "You can also follow me on Twitter and Instagram to catch my frequent bursts of productivity and business nuggets."}, {"type": "subtitle", "content": "Three articles that would interest you"}], "topic": "freelancing"}