{"title": "Wanted: Resilient Business Models. 3 Tips to Create Them.", "data": [{"type": "subtitle", "content": "Abundant Future"}, {"type": "subtitle", "content": "Our economies are collapsing. Businesses ask for mass support from governments. But how can we create resilient business models ourselves?"}, {"type": "sentence", "content": "Our capitalist economies are like card houses. One by one they are collapsing now. No business is ever made for $ 0 turnover. And if you have large debts, like many of the big businesses do, you will not survive."}, {"type": "sentence", "content": "Yelling. Shouting. Screaming."}, {"type": "sentence", "content": "We need governments to save us."}, {"type": "sentence", "content": "And many governments do. They are too afraid of job loss. And a further collapse."}, {"type": "sentence", "content": "However, where does this savior money come from? We need vibrant private entrepreneurship to even consider governments having enough money to invest. Otherwise, it’s like a vicious circle."}, {"type": "sentence", "content": "Governments invest, they have to increase taxes next and who pays the bill? Or they print extra money and cause a hell of deflation. Which means higher prices for basic needs."}, {"type": "sentence", "content": "In the end, we are the ones who pay the bill. All of us. Poverty for many people, if not all people, can be the only outcome if we try to save existing capitalist structures like this."}, {"type": "sentence", "content": "Time for a mind shift."}, {"type": "sentence", "content": "Time to do it differently. To do it better."}, {"type": "sentence", "content": "Time to transition toward a vibrant economy with resilient businesses."}, {"type": "sentence", "content": "And this is where you come in, dear entrepreneurs. We can do it. We can create resilient business models for our startups. We can thrive and shine and be the changemakers the world needs so desperately."}, {"type": "sentence", "content": "What if we were to create bouncy, resilient business models that would adapt to circumstances and we’ll jump higher every time?"}, {"type": "sentence", "content": "I hear you ask: “How?”"}, {"type": "sentence", "content": "Here are 3 tips."}, {"type": "sentence", "content": "And for my fellow writer entrepreneurs, I’ve added some specific tips on how to apply these tips to a writing/storytelling business at the end of this story."}, {"type": "subtitle", "content": "1. Use Everything Available to Create New Value"}, {"type": "sentence", "content": "You have a product or a service you concentrate on. But if you open your view just a little more, you see there is more inside your business. What if you could create value with that more?"}, {"type": "sentence", "content": "Think about waste streams. What if you could design your waste streams in such a way that you (or someone else you collaborate with) would create new value with it? A new valuable product?"}, {"type": "sentence", "content": "What if you are a guacamole maker? A bakery could take the avocado seeds, grind them, mix them into other flours, and bake bread. What if you’re a beer brewer? Your waste stream of spent grains is very rich in proteins. A bakery could also bake bread with this rest stream."}, {"type": "sentence", "content": "Upcycling has the future. And why not use the proceeds of valuable waste in your model to make the business itself more resilient?"}, {"type": "sentence", "content": "But there’s more."}, {"type": "sentence", "content": "Think about extra value streams in your company by going backward in the chain instead of forward."}, {"type": "sentence", "content": "What if you want to make e.g. building materials or packaging from mycelium as explained in this article."}, {"type": "sentence", "content": "Look broader now. What if you would grow this mycelium on polluted soil? Someone would pay you for cleaning the soil with fungi and you’ll produce an awesome product."}, {"type": "sentence", "content": "The fungi will take care of the pollutants and transform them so that you can create wonderful healthy buildings with them. And why not collaborate with a university to do research on this topic?"}, {"type": "sentence", "content": "How awesome would your business be if you would create healthy buildings out of polluted soil like this?"}, {"type": "sentence", "content": "Now, look a little broader still. What if you would share the knowledge that comes out of your enterprise in a fun and exciting way? In this story, I tell you how to gain income streams by connecting with CSR-driven companies while storytelling."}, {"type": "subtitle", "content": "2. Identify Stranded Assets"}, {"type": "sentence", "content": "Okay, so now we have trained ourselves to look broader in our own supply chains."}, {"type": "sentence", "content": "The next step is that we look broader in our environment and identify stranded assets that can be used to strengthen our business models economically."}, {"type": "sentence", "content": "What are stranded assets?"}, {"type": "sentence", "content": "In our current business jargon, it’s often limited to assets (things of value) on your own balance sheets. However, we can use the term much broader when we go on a hunt for them."}, {"type": "sentence", "content": "Stranded assets can e.g. be empty buildings or production factories."}, {"type": "sentence", "content": "Blue City in Rotterdam has included the stranded asset of an empty tropical swimming pool in their business model."}, {"type": "sentence", "content": "Novamont in Italy included the closed factory of an oil refinery in its business model to built the most healthy, world-changing biochemical factory ever."}, {"type": "sentence", "content": "But we can think even broader toward stranded assets. Our health in the Western world is definitely a stranded asset."}, {"type": "sentence", "content": "If we look at who has pain from such a stranded asset, we can also find the companies that want to pay for systemic solutions."}, {"type": "sentence", "content": "Health insurance companies perhaps?"}, {"type": "sentence", "content": "What if e.g. a hospital would start investing in healthy natural ventilation in buildings so that viruses would not spread as easily?"}, {"type": "sentence", "content": "And what if universities joined forces to measure and conclude about healthy living, working, and learning in our buildings? And what if a sensor-making company would be added to measure the circumstances positive or negative for viruses."}, {"type": "sentence", "content": "I see a whole consortium coming into existence!"}, {"type": "sentence", "content": "Why not have the health insurance companies come on board? And invest in real systemic solutions instead of vaccines. Vaccines will prove useless in the long run anyway as soon as the next virus comes along…"}, {"type": "sentence", "content": "Whoah, now I’m going too fast for many of my readers. I know, I know…"}, {"type": "sentence", "content": "Slow down and have a look at stranded assets in a more simple way."}, {"type": "sentence", "content": "We can look at ecosystem services to add to our business models. And think carefully who has pain from these stranded assets."}, {"type": "image", "content": "https://miro.medium.com/max/2604/1*nzT9ZUHS9y2p6rKluPN_vw.jpeg"}, {"type": "sentence", "content": "I’ll give you an example."}, {"type": "sentence", "content": "In my country, the Netherlands, we have a lot of problems from the oak caterpillar. The shed their hairs and this causes skin and respiratory problems."}, {"type": "sentence", "content": "So, one sensor/data company I know joined forces with a team of professional gardeners to solve this stranded asset (long term solution) for municipalities."}, {"type": "sentence", "content": "Increasing biodiversity, measuring results, increasing visibility with storytelling, and social media. Great project. And linked to an actual, perceived problem."}, {"type": "subtitle", "content": "3. Collaborate"}, {"type": "sentence", "content": "We can change our mindset from scarcity to abundance. From competition to collaboration. From maximizing profit to optimizing value. And I mean all kinds of value for life. For living. Creating healthy soil, air, and water has never been more urgent, so why not create them in the process?"}, {"type": "sentence", "content": "In the past, businesses thought they should collaborate with the same kind of companies to achieve industrial scale and lower prices."}, {"type": "sentence", "content": "Modern 21st-century companies choose their partners on mindset. They share the same values. And they complement each other to achieve synergy in their business models. And then they choose if they want to scale or not."}, {"type": "sentence", "content": "The great thing about synergy business models is that scale is not necessary to make them work. Multiplier effects are achieved by adding value upon value upon value."}, {"type": "sentence", "content": "Often, the collaborating businesses have the same target groups, so their branding will build upon each other and make sense."}, {"type": "sentence", "content": "And they use their creativity to find blue oceans together. Get away from the red oceans, as explained in the book Blue Ocean Strategy."}, {"type": "sentence", "content": "We can also change our thoughts about cost and price thinking. If we use synergy in our business models, healthy food e.g. would not need to cost more. It could be cheap because we create so much more with one healthy product. And that could unleash a whole new society of healthy people."}, {"type": "sentence", "content": "Talk about value creation…"}, {"type": "sentence", "content": "In this film, it’s explained."}, {"type": "subtitle", "content": "Two Great Challenges of Our Time"}, {"type": "sentence", "content": "We have two great challenges of our time. We need to build resilient business models and we need to start living within planetary boundaries."}, {"type": "sentence", "content": "And if we combine the great business thinking by Chan Kim and Renée Mauborgne (Blue Ocean Strategy) with the synergy business models of Gunter Pauli (Blue Economy), we might achieve both."}, {"type": "sentence", "content": "A few more questions for us all to consider:"}, {"type": "sentence", "content": "If the answer is yes to most of these questions, we’re on the right track. Let’s find some great partners, unleash our creativity, unleash the multiplier effect, and go for it."}, {"type": "subtitle", "content": "Opportunities for Writers"}, {"type": "sentence", "content": "On Medium, many start-ups are writers. So how can my tips help the writers among us? Well, that’s easy."}, {"type": "sentence", "content": "We can build our own Right Livelihoods."}, {"type": "sentence", "content": "Use everything available and create value with it. We, writers, can look into our lives, identify our passions, and create value with those. Some of us will combine writing with illustrations, art, film, physical products, podcasts, gardening, childcare, food, music, etc."}, {"type": "sentence", "content": "Or we can combine the writing with collaborating in projects that share the same mission, as I do. The opportunities are endless when we start to see them. And then we have to make fierce choices to stay sane."}, {"type": "sentence", "content": "Identify stranded assets. Look around us and brainstorm with ourselves (and others) which stranded assets can offer us inspiration. There are so many in our shattered world."}, {"type": "sentence", "content": "Choose one or more that touch our hearts. Let’s write about them in inspiring, activating ways. The more visible we become, the more our income streams will start to flow."}, {"type": "sentence", "content": "My only client is GAIA and she looks after me in return by sending a variety of projects my way. Some provide income streams, others provide great value without money. I love them all."}, {"type": "sentence", "content": "Collaborate. When we start to follow a path that makes our hearts sing, we’ll meet great people. Other entrepreneurs. Or wannabe entrepreneurs. Or existing companies. Or investors."}, {"type": "sentence", "content": "As said, nowadays we choose our partners on shared values. So, let’s start collaborating with others. Experiment. Create value together. And share proceeds fairly."}, {"type": "sentence", "content": "Happy entrepreneurship. Happy transitioning."}, {"type": "sentence", "content": "And if you want to connect, you can find me on LinkedIn, Facebook, Twitter, and Instagram. Or somewhere collaborating with my many entrepreneurial friends…"}, {"type": "sentence", "content": "Escape Pod, BEAM, inc, Thomas Guy Lovett, Kathryn A. LeRoy, Ph.D., Russ donda, Dr Mehmet Yildiz, Sylvia Love Johnson, Erik P.M. Vermeulen, Niklas Göke. I would love to hear your perspective on this approach to create value in startups and perhaps add some snippets of wisdom for our readers in the comments."}, {"type": "sentence", "content": "Thank you, Mike, for adding your wise energy to my words on entrepreneurship."}, {"type": "subtitle", "content": "Further reading"}], "topic": "business"}