{"title": "Freelancing for Fiverr Has Me Doing This Writing Thing All Wrong", "data": [{"type": "subtitle", "content": "Here’s how to better focus your writing efforts"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*fc9qjOSHLGNkt-YxNFiT7A.jpeg"}, {"type": "sentence", "content": "Don’t get me wrong, freelance writing is opening doors for me and padding my Paypal account, but last night in one of my semi-Olympic tossing and turning routines (that my mind prefers rather than sleep) — it hit me — I am doing this all wrong."}, {"type": "sentence", "content": "And likely, so are you."}, {"type": "subtitle", "content": "Writing for money"}, {"type": "sentence", "content": "I’m not going to sugar coat this. I am writing to earn money. Do I love it? Yes. Do I want to do it without the money? Yes, but maybe not so much. So, before you launch into a “write for the art of it lecture,” you’ll have to take my word for it. I will always write. But, I’d also like to be compensated for my efforts and help provide for my family with my gifts and talents. I don’t think that is too lofty a goal."}, {"type": "subtitle", "content": "Upwork"}, {"type": "sentence", "content": "I started with Upwork. It was a bit like throwing spaghetti at a wall since I was a first time freelancer. I tried for a few months and gave up without a single job under my belt. I moved on to Fiverr."}, {"type": "subtitle", "content": "Fiverr"}, {"type": "sentence", "content": "In a little over 4 months I’ve made a little over $1000.00 working for Fiverr. And yes, I am peeling away some clients from there and writing regularly for them, but I feel a bit chained."}, {"type": "sentence", "content": "If you don’t answer a Fiverr message quick enough they “ding” you. (Why do so many first time clients message me between midnight and 4 a.m.? Not that I’m sleeping or anything, but still!) I find it intrusive that I cannot answer my messages there, in my own time."}, {"type": "subtitle", "content": "But this is all wrong"}, {"type": "sentence", "content": "My goal is to create steady income. Freelancing is a shiny object in the field of writing. It looks good, reflects a brighter future, but in the end has its drawbacks like anything else."}, {"type": "sentence", "content": "Let’s unpack some of the issues with freelancing (especially from freelancing sites such as Fiverr and Upwork)."}, {"type": "subtitle", "content": "Here’s why it’s the wrong approach"}, {"type": "sentence", "content": "Writing for Fiverr is a great start. You can bring in some money there and build something rather steady. But if all your eggs are in that basket, so to speak, you’ll find yourself a slave to the work. If you diversify your efforts and create more saleable options, you’ll be moving in a more lucrative direction."}, {"type": "subtitle", "content": "Here’s how to turn it around"}, {"type": "sentence", "content": "First of all, it’s time to start writing to your strengths, not to order."}, {"type": "sentence", "content": "Clients will order the material they need for their blogs and websites. You research their topic, their ideas, and create the content they have ordered. The articles can be very research-heavy since you may not be especially versed in their fields of interest. You learn a lot and this may be a plus for you, but I find this constant chasing of information to be time consuming and a bit labor intensive."}, {"type": "sentence", "content": "Write to your strengths. Take a serious, honest look at your body of work as a whole. What are your personal interests? Where are your strengths?"}, {"type": "sentence", "content": "The goal is for you to have material to sell, rather than create material that has been ordered. This puts you in the driver’s seat."}, {"type": "subtitle", "content": "Something to sell"}, {"type": "subtitle", "content": "Pitching"}, {"type": "sentence", "content": "From your list of potential clients you can research submission requirements and what they like to print. When you have completed an article, search your client list for where this piece may be a good fit and submit your work to them. (Then — patience.) Keep a record of what articles you have submitted and where; keep writing and submitting."}, {"type": "sentence", "content": "Build your portfolio of work and your resume of publication."}, {"type": "subtitle", "content": "eBooks"}, {"type": "sentence", "content": "Some of your material can be put into a saleable collection or can be expanded into an eBook. While writing for clients is a one time sale or repeating orders, an eBook is one thing written one time and sold many times. It makes sense that you can earn more money this way (over time) and have more time for your writing."}, {"type": "subtitle", "content": "Subscriptions"}, {"type": "sentence", "content": "If you have consistent content with a consistent audience, subscription services may work for you. A paid Substack newsletter or Patreon subscription may work for you but keep in mind the content must be provided on a regular basis. You’ll need a clear vision for this path so you know your target subscription audience and how to provide what they want to see from you."}, {"type": "subtitle", "content": "Monetizing a blog"}, {"type": "sentence", "content": "Consider an overhaul on that dusty blog and get focused on monetizing. (Getting started: 8 Easy Tips for Reviving Your Sleepy Blog) Affiliate links can be a steady trickle of income, depending on your blog traffic and engagement."}, {"type": "subtitle", "content": "Courses"}, {"type": "sentence", "content": "If you have salable and teachable information that best serves as mentoring courses or educational courses, then design a course that can be sold online. This, again, is something you put in work extensively a head of time, then sell to an open-ended number of clients. This option may require you to invest a little in equipment and materials but the outcome has the potential for earning well."}, {"type": "sentence", "content": "The point here is to do a lot less creating for others and focus more on creating content that people will want and then searching for the highest potential earnings for that material. Also, creating a product you can sell multiple times (like books or courses) is working smarter."}, {"type": "subtitle", "content": "The take-away"}, {"type": "sentence", "content": "Will I keep writing for Fiverr? And for clients? Absolutely. But this freelancing thing has me seriously considering how I spend my writing time — and ways to put myself, my talents, and my own creativity back in the driver’s seat. I hope you will find ways to maximize on the monetization of your efforts — so you can continue to make creativity the center of your work."}, {"type": "sentence", "content": "Don’t let the hamster wheel of client orders derail you from your own personal writing goals. Your time is truly valuable, and you should be paid fairly for that time. If that means you have to turn down a freelance job or two to free up the time to write an eBook or to write an article to sell to an online magazine — so be it. This is your work. You can and should be selective with the jobs you take on, be selective about where you place your work, and expect fair compensation."}, {"type": "sentence", "content": "Finding fair compensation for your specific talents and niche is the key."}, {"type": "subtitle", "content": "For further reading:"}, {"type": "sentence", "content": "Some Freelancing Advice by Medium writer Felicia C. Sullivan"}, {"type": "sentence", "content": "The Complete Guide to Uploading a Marketable Book on Amazon KDP"}, {"type": "sentence", "content": "Advice on Growing blog traffic by Medium writer Chris Craft"}, {"type": "sentence", "content": "8 Easy Tips for Reviving Your Sleepy Blog"}, {"type": "sentence", "content": "Christina M. Ward is a poet, novelist, and freelance writer from North Carolina. She often writes on productivity, well-living, and is a creative writing mentor. You can keep in touch by following her on social media."}], "topic": "freelancing"}