{"title": "Polemics in Marketing — It Works, But It’s Not Worth It", "data": [{"type": "subtitle", "content": "4 examples from Too Hot To Handle to H&M"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*pCubX4dquFoc4mkq"}, {"type": "sentence", "content": "A lot of people say that advertising, good or bad, is still advertising, and some people don't know the limits creating campaigns that leave much to talk about. Marketing has many ways to be effective, but when we talk about controversy, you probably stop to think about whether it’s worth it. Is it really effective?"}, {"type": "sentence", "content": "To answer this question, we are going to analyze companies and people who decided to use this type of marketing."}, {"type": "subtitle", "content": "H&M and Racism"}, {"type": "image", "content": "https://miro.medium.com/max/4000/0*SkW4j3-smmugOR_u.jpg"}, {"type": "sentence", "content": "In 2018, the clothing brand launched a new clothing line in which they placed a black boy as a model in a sweatshirt with the phrase “Coolest monkey in the jungle.” This campaign was a trending topic on Twitter and Instagram, in which they described the campaign as racist and demanded that it be withdrawn. Celebrities like Lebron James and The Weeknd participated in it."}, {"type": "sentence", "content": "In this case, the controversial campaign they used was negative for the brand. They even had to withdraw the advertising for their brand and issue apologies."}, {"type": "subtitle", "content": "Adidas and Arvida"}, {"type": "sentence", "content": "Adidas used the model Arvida to launch new sneakers of its brand in September 2017. Something eye-catching about this advertising is that the model didn’t shave her legs for the photo. The publicity soon generated a lot of nonconformity comments. The company did not withdraw advertising because its intention was to show a new concept of femininity, which does not follow stereotypes."}, {"type": "sentence", "content": "The number of likes in that photoshoot increased by 35,000 compared to her other photographs. The model currently has 230,000 followers."}, {"type": "subtitle", "content": "Coca-Cola vs. Pepsi"}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*hujeszQONF2EtInD"}, {"type": "sentence", "content": "Coca-Cola and Pepsi have always maintained a great rivalry that over the years has generated all kinds of battles and confrontations with the publicity that have never gone unnoticed. They have made all kinds of ads, from Pepsi using the figure of Santa Claus, a character who has become an icon of Coca-cola, to the White Bear. There was also the Halloween ad where both used the same photo, but with different slogans."}, {"type": "sentence", "content": "In this case, the advertising has been quite good for both brands. It is believed that they have even agreed to create them since it reaches a large number of people."}, {"type": "subtitle", "content": "Controversy to Generate Fame"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*8O5W2y2TWh5YvFsP"}, {"type": "sentence", "content": "Probably at this point, you would think that those companies made a big impact because they were already recognized. But it is proven that even in the world of entertainment, some actors create more fame than others for the number of scandals they create for the public."}, {"type": "sentence", "content": "For example, in the new Netflix series “Too Hot to Handle,” although around 10 people participated in the reality show, Francesca Farago reached a higher number of followers than her partners, due to the controversy caused in the reality show. She confirms at the beginning of the show that she had around 300,000 followers on Instagram, but that blew up a lot after the show."}, {"type": "image", "content": "https://miro.medium.com/max/2384/1*JBaqQZTCb3cycXzh1yPgTA.png"}, {"type": "sentence", "content": "Other examples are the careers of Miley Cyrus, whose highest point was when she completely changed her look, and the Kardashians, who have a successful reality show because of the controversy that their family creates for the cameras."}, {"type": "sentence", "content": "Polemic in the marketing works, but have in mind two fundamental aspects: being clear about the message that we are trying to transmit and generating the expectation that we believe is good for who we want to reach. We have to be careful with the messages that we are going to send when we create those types of campaigns because otherwise, it could be worse for the company."}, {"type": "sentence", "content": "Personally I do not recommend creating controversy to reach a high audience, although it is proven that it works. It will not necessarily be good for what people think of our brand. There are a lot of success cases without the need to use that type of marketing."}], "topic": "social-media"}