{"title": "Told You", "data": [{"type": "subtitle", "content": "Trigger warning: child sexual assault"}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*1qRQGqGGRZWlHdsUumpaHA.jpeg"}, {"type": "sentence", "content": "Today I went to Rite Aid. And I know this doesn’t sound particularly triumphant, but give me a couple paragraphs. I’m a Rite Aid frequent flyer due to my insatiable appetite for candy corn year-round (if anyone says it is seasonal, they are dead ass lying to you and they are not a good friend) and because I have a collection of mental illnesses that require refill after refill after refill. Rite Aid is legit one of my happy places. Everyone who works there is super friendly. From the sales associate who trained his pet birds to say “bye bitch!” when he leaves for work, to Mike the Pharmacist who is an all-around good guy. There have been a few times when my psychiatrist didn’t send in a new script for my medication and since bipolar waits for no one, I’ve teetered on the brink of a brain collapse. But luckily in these situations Mike will spot me a few antipsychotics until everything is sorted out. Again, solid dude. Once I proposed we market a Snickers bar stuffed with klonopin, and while he did say no, there was definitely a pause. I also really like Rite Aid’s collection of lawn ornaments. I can’t tell you how many times I wanted to walk out of there carting a sparkly gnome that also glows in the dark. But, where was I? Oh! Yeah, I’m brave."}, {"type": "sentence", "content": "Since COVID — 19 has been plaguing the world I’ve been playing my part. I stay at home lying on a canopy bed made of toilet paper. I know all hugging has been suspended until further notice so I just walk around with my arms wiiiide open without touching anyone. I wash my hands down to the bone so I have delightful skeleton fingers, perfect for holding candy corn. When I walk my dogs and someone is coming my way I haul ass to the other side of the street, and yeah, I think that’s everything. Upstanding citizen over here! If you’re curious why I didn’t list my mask protocol, it’s because I don’t wear one."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*Pv0JJMklsM46RoJZK24jiw.jpeg"}, {"type": "sentence", "content": "Don’t turn on me! I had you captivated with my wit and charm and that whole Snickers thing and now I feel like I’m losing you. I have a good reason why I don’t mask up. I don’t leave the house. I started out pledging my love and loyalty to Rite Aid because I love errands. Walking down aisles, checking things out, smiling and head nodding at my fellow shoppers because we’re having the thrill of a lifetime ambling around the produce section. Errands make me feel productive and purposeful and when it comes to an outing, I quickly volunteer, which is fine with my husband who would rather play online poker than fight a soccer mom for the last bunch of cotton candy grapes (that’s a real thing and they are delicious and definitely worth fighting for). But much to my dismay and heartbreak I’ve been staying home. Quarantining my errand dreams. And unfortunately, I have a really good reason why I’m staying at home and why my mask is lying listless by the front door."}, {"type": "sentence", "content": "When I was a kid I was molested by a neighbor. I’m not getting into the details because this is my trauma, this is my story, and I don’t owe anyone anything. I survived and here I am. But I’m here with my PTSD. I’m here with nightmares. I’m here with flashbacks. I’m here with panic attacks. Recovery is not linear, so some days, weeks, months are symptom free, but there are triggers everywhere — some that I can’t avoid — like a pandemic that requires wearing a mask."}, {"type": "sentence", "content": "I had forgotten what it felt like to be gagged. To be suffocated under the strain of his cigarette stained fingers. To be trapped, stuck, caught, whatever you want to call it. I remember the fear, I remember crying, but I forgot what it physically felt like when he would stretch his hand over my mouth so I wouldn’t cry too loudly. I couldn’t see, I couldn’t breathe. I forgot what it was like to be imprisoned in your own body. Masks trigger my pain and transport me to another time. Of being a kid again. His fingers were a mask to keep me limp and obedient. A feeling and an aspect of fear that lay dormant for a while, now viscerally haunting me again. You see a surgical mask, a bandana, a custom mask from Etsy, a mask made by a crafty friend or loved one, but I can’t shake the feeling of his heavy hand wrapped around my face."}, {"type": "sentence", "content": "The first time I put a mask on I had a panic attack. I thought it would be uncomfortable and definitely didn’t think it would be so fucking terrifying. My panic attack blurred into a flashback and all of a sudden I had to run back inside my house. My breathing was choppy and I ripped the mask off my face. My husband was sitting on the couch and ran to me as I sunk to the floor, hugging my knees, crying my eyes out, and trying to be as small and invisible as possible. I clunked my head against our door and wondered how I could take control of the memories, the feelings, and live in this masked world."}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*ZDL6yGLtBRHfyEjW7nDQhA.jpeg"}, {"type": "sentence", "content": "Let there be therapy! As a good friend once told me, therapy is exercise for the soul, so I’ve basically been an American Ninja Warrior since high school. My calves are pretty impressive. Haha, not really, but I am very self-aware after all of this hard work. As I chatted with my therapist via FaceTime, I told her I didn’t know what to do. How the anxiety of these feelings coupled with these memories were stalking me, threatening to take over my life. Cue my wise therapist/American Ninja Warrior coach. My therapist recommended trying on the mask for small intervals. Just so I could get used to it. Build tolerance to my mask induced PTSD. So I started wearing it in the safety of my own home. When my chest tightened, when my breathing sped up, when the panic started, I would take off the mask and sit on the couch. Pet my dogs. Hug my husband. Look at sloth videos. It sucked, but I wanted to own this. I missed going to Rite Aid. I missed my routine. I didn’t want the memory of him to limit my life, to constrict my freedom. Because I am free and I’ve always been a fighter even when I have to wear a mask."}, {"type": "sentence", "content": "Today I went to Rite Aid. This doesn’t sound particularly triumphant, but it is. I drove down the street with my purple mask in my bag. I parked my car. I hooked the elastic bands over my ears. I looked in the mirror at my eyes peeking above the cloth. There were no fingers. There was no force. No pain. Just a mask to keep me and everyone else safe. I was still free. I’m not going to lie; it was really hard. But I did it. I walked in, grabbed a gallon of milk and a Cadbury egg, paid the cashier and left. No one stopped me. My fear didn’t stop me. My PTSD didn’t stop me."}, {"type": "sentence", "content": "Told you I was brave."}], "topic": "mental-health"}