{"title": "Why as a designer, you should participate in competitions", "data": [{"type": "subtitle", "content": "Here’s one important reason."}, {"type": "sentence", "content": "Growing up, I’ve always subconsciously avoided competitions. I’ve received “awards” here and there throughout school, but they were usually prizes that I didn’t even know I’d entered."}, {"type": "sentence", "content": "Such as — “the most awkward penguin in the high school class of 2005.”"}, {"type": "sentence", "content": "Why is that? Because I hate doing fake projects, I told myself. After many years of (almost overdoing) architectural school and grad school, I’m hungry to make things that real people use rather than hypothetical, conceptual projects. It isn’t good for my psyche. But deep down, I know those were excuses. A sizable part of the equation is my ego’s fear of losing. I’m afraid that after putting in all that effort, I’ll come out of it with nothing. I mean, what are the chances of winning?"}, {"type": "sentence", "content": "When my friend messaged me, asking if I wanted to participate in Adobe’s Creative Jam with her, I quite frankly dreaded it. However, my thoughts brought me to the high school students that I design for at my current job. I make a living now by designing a college counseling platform that actively encourages kids to engage in competitions — hackathons, business pitch competitions, athletic matches — should they wish to reach the heights of their potential and be recognized for their craft."}, {"type": "sentence", "content": "I thought, well, OK — if there’s some truth in that — if competitions are indeed valuable to personal growth, maybe I should give it a go and experience them. At the very least, it will help me empathize better with my users."}, {"type": "sentence", "content": "The intensity of the long-weekend designathon did not disappoint. The 72-hour competition was hard work, no doubt. On top of that, the Chan Zuckerberg Initiative issued a pretty tricky prompt, which I was initially intimidated by. We spent the first day almost chasing our tails, and the rest of it staying up late. I don’t remember feeling this stressed and exhausted since architectural school, and it made my work feel like a vacation. My eyes remain fatigued from too much screen time even now as I write this."}, {"type": "sentence", "content": "But in the end, our work started to fall into place, and we made it through to the top 10 finalist teams."}, {"type": "image", "content": "https://miro.medium.com/max/1000/1*fUzIiBgZSPNIJeEZvUex6A.gif"}, {"type": "sentence", "content": "So, coming out of this experience, if I am to sum it up, there’s one critical reason you, too, as a UX/UI designer, should participate in competitions."}, {"type": "sentence", "content": "To level up your skill."}, {"type": "sentence", "content": "There is no other better way to find out where your bottlenecks are than by competing, where your work is assessed purely on criteria that are limited to one single discipline."}, {"type": "sentence", "content": "Speaking for myself, I started my UX journey with a solo capstone project in a remote UX bootcamp last year (Springboard). While I did take the time to build as strong a foundation as I could during those few short months, bootcamps by nature teaches you only the fundamentals, which means that after you graduate, you still have to find your means to challenge yourself and advance yourself to the next level."}, {"type": "sentence", "content": "But, it’s a problem if you don’t know what that “next level” looks like."}, {"type": "sentence", "content": "For almost a year, I have been working as a solo designer in an early-stage startup. While I love the fact that I am learning something new every day, I face a shortage of opportunities to learn by watching over the shoulders of the pros. It was difficult to get professional design critique at work; the only form of feedback I get is from users — which, while it is revelating, is not quite the same and serves completely different purposes. But in a competition, you are pressed to bring your A-game, and suddenly you confront yourself with the question — what does A-game mean?"}, {"type": "sentence", "content": "As the finalists of the competition, not only were we able to hear the judges’ feedback, we were also able to watch other top teams’ presentations with heightened attention. There’s something about the fact that we all faced the same prompt that made learning a lot faster and easier than just looking at dribbble shots at a distance: you’re able to observe how other teams handled similar challenges and by making different decisions. Since I don’t have a strong visual design background, I got to examine how the visuals, animations, and interactions were executed at the pro-level."}, {"type": "sentence", "content": "In the span of a 2-hour presentation ceremony, I found myself going from worrying about not winning, to being glad we didn’t win. We’ve established ourselves as serious contenders, recognized for what we brought to the game, and at the same time, had the privilege of being inspired by more experienced players."}, {"type": "sentence", "content": "Immediately after, I went back to work as a better designer. I now generate more sketch options before deciding on a solution. I am more attentive to every mark I put down. I give more consideration to animations and transitions. I question if design speed correlates to engineering speed."}, {"type": "sentence", "content": "Even though it’s only been 72 hours, it was a quick vitamin boost to my skills. Intense, but was it worth it? Absolutely."}], "topic": "ux"}