{"title": "Long Bois and the Melon: A World of Warcraft Tale", "data": [{"type": "sentence", "content": "It all started with a melon. Not just any old melon, but a Primitive Watermelon. I purchased the fruit from a vendor hidden in an underground cave in middle-of-nowhere Nazmir. I do not recall how or why I arrived at this location while leveling my mage, only that my visit resulted in me purchasing a seemingly ordinary melon with the intention of feeding it to my newfound love, the brutosaur."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*hSwgkWrZY-Qz-EnalG4ZrQ.jpeg"}, {"type": "sentence", "content": "“While inedible to most creatures, the brutosaur species of Nazmir greatly enjoys this fruit.” That was the description on the label. The melon had a use effect indicating that it could in fact be fed to a nearby brutosaur. Imagine my disappointment after the first brutosaur I found rejected this supposedly beloved meal."}, {"type": "sentence", "content": "I tried to remain in good spirits while my whimsy was stolen from me by some seedy vendor gourd that no nearby brutosaur wanted to eat. Refusing to give up, I moved the melon to the bag containing my hearthstones, potions, and various preciouses I picked up in prior expansions that I could not part with despite them amounting to vendor trash. Like my melon."}, {"type": "sentence", "content": "In months that followed, I attempted to feed this anticlimactic plump of sadness to every brutosaur that I could find within the boundaries of Nazmir and Zuldazar. A simple search on Wowhead.com would have solved all my problems for me, but where is the fun in that?"}, {"type": "sentence", "content": "Everywhere. The fun in that is everywhere. At least that was the point I arrived at after swearing I had found every brutosaur in the game and every single one of them spurned this stupid striped ball of failure. I bought it off a blind troll in a swamp cave. I do not know what I was expecting."}, {"type": "sentence", "content": "It was time to give up the hunt. I found the watermelon online and learned that my flop of a gourd was one of three foods needed to complete the “Eating Out of the Palm of My Tiny Hand” achievement."}, {"type": "sentence", "content": "“Feed brutosaurs their favorite food in Zandalar,” reads the achievement’s description. Their what? Their favorite?"}, {"type": "sentence", "content": "I tried to give this melon to brutosaurs large and small, grazing and mating, in the swamp and in the jungle. I carried the weight of rotting fruit around for months, begging anything with an elongated neck to take it."}, {"type": "sentence", "content": "Obviously, the game was broken. How in Azeroth did I manage to miss the largest brutosaur in Nazmir?"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*_79kLKkKiXfuCzE4RXOCQQ.jpeg"}, {"type": "sentence", "content": "There he or she was, as tall as the treetops, standing statuesque in one of the wide open and entirely visible areas of the swamp, not at all blending in with his or her environment and leaving me with no viable excuse for missing him or her."}, {"type": "sentence", "content": "The elusive, giant, bright white creature that I definitely should not have missed took the rage-melon without quarrel. We sat together for a time after that. Goramor, as I have learned to call him or her, quietly ate the melon while I took screenshots. After a nice chat about the lies we are told, we parted ways. I flew off to purchase a memory melon from the devious cave troll. Goramor chugged another invisibility potion. That is the only explanation for my troubles that makes sense."}, {"type": "sentence", "content": "My love of brutosaurs did not stop with my search for Goramor. I had seen the gnomes seated on saddles of these majestic creatures, and I had given many of these pocket auctioneers my herbs to sale. I was fully aware of the famous Long Boi before my adventures in Nazmir. That was one brutosaur I did not miss."}, {"type": "sentence", "content": "There are a lot of players out there saving every copper they earn so that they can purchase Long Boi before Shadowlands becomes available and the tortollan-toting dinosaur vanishes from the vendor, making it a rare and even more expensive sight on the Black Market. From one brutosaur hugger to another, I wish you all the best in your endeavor. The more players that obtain the mount, the more brutosaurs I will get to see (or overlook entirely — as I have proven capable of doing) in the oddest of places. I am looking at you, vulpera shaman at the mailbox in Suramar."}, {"type": "sentence", "content": "This particular Long Boi mount will never be mine and I am okay with that. It is the brutosaur I want and the brutosaur I hope to see in expansions to come, sans auctioneer."}, {"type": "sentence", "content": "But no matter what the future of brutosaurs brings, I will always have my memory melon; my rotting fruit of deception weighing down my bags, reminding me that trolls cannot be trusted, teasing me about my lack of skill points in perception, and encouraging me to have adventures."}], "topic": "gaming"}