{"title": "A basic overview of Distributions in Statistics.", "data": [{"type": "subtitle", "content": "Topics covered"}, {"type": "subtitle", "content": "What is a distribution?"}, {"type": "sentence", "content": "Lets say you are given a task to order t-shirts for an event in your college. But how do you estimate how many t-shirts of different sizes you need to order without asking each student."}, {"type": "sentence", "content": "You take the help of a distribution curve. Just by looking at a distribution curve you can assume what % of t-shirts need to be Medium, small or XL?"}, {"type": "image", "content": "https://miro.medium.com/max/882/1*pdsaVvvDExtIqQtKXaV0Yw.jpeg"}, {"type": "sentence", "content": "In the above picture the , x-axis represents height and y-axis represents frequency, more precisely density. Meaning, the number of people clustered around a particular height. The height of the curve depends on the density. More the density , higher the peak."}, {"type": "sentence", "content": "Note : Do not focus on the y-axis for now. Only focus on the shape of the curve and the x-axis"}, {"type": "sentence", "content": "With this concept, now you can easily assume that most number of students lie between 169–185 cm height and would require medium t-shirts (assuming the t-shirt size based on height)."}, {"type": "sentence", "content": "The above plot is called a Probability Density Function or PDF."}, {"type": "sentence", "content": "However , it still doesn’t solve the question of how much % of the t-shirts need to be medium or small or XL."}, {"type": "sentence", "content": "For that estimate we can use a plot called Commutative Density Function or CDF. PDF tells us about the number of students with a particular height. CDF tells us about the number of students with height equal to or less than a particular height."}, {"type": "image", "content": "https://miro.medium.com/max/2304/1*kqbpwzxDp5y6Hz8mccUQ9w.png"}, {"type": "sentence", "content": "Looking at this curve and using the previous concept you can assume, 0.75 or 75% of students are shorter than 200 cm. With this now you can easily calculate the different % of t-shirts you need to order."}, {"type": "subtitle", "content": "Symmetric and Asymmetric Distributions"}, {"type": "sentence", "content": "A symmetric distribution is a type of distribution where the left side of the distribution mirrors the right side. The above PDF plot was a symmetric distribution."}, {"type": "sentence", "content": "As you must have guessed , asymmetric distribution is the opposite. Asymmetric distribution is also known as skewed distribution"}, {"type": "sentence", "content": "A left-skewed distribution or a negatively skewed distribution is a kind of distribution which has large extreme values left to the mean. Our height curve would have been left skewed if we had extremely short people in our class. But not as extreme tall students."}, {"type": "sentence", "content": "A right-skewed distribution or a positively skewed distribution is a kind of distribution which has large extreme values right to the mean. Our height curve would have been right skewed if we had extremely tall people in our class. But not as extreme short students."}, {"type": "image", "content": "https://miro.medium.com/max/872/0*OB8lif2p5fdOoZAt"}, {"type": "subtitle", "content": "Kurtosis"}, {"type": "sentence", "content": "Kurtosis basically gives an idea about how far the extreme values go on both ends. For example, If we have extremely short people in our class , approximately till which extreme their height goes. And vice versa for tall students."}, {"type": "sentence", "content": "Using the concept of kurtosis , investors calculate the risk of an investments by approximating what are the occasional extreme profits or losses they can gain or suffer if they invest. It is called kurtosis risk."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*hSKSChgsYt2C3o-pxEyERA.png"}, {"type": "subtitle", "content": "Normal Distributions"}, {"type": "sentence", "content": "Normal distribution is one of the many types of distribution. In this article , we will only discuss normal distributions as our goal is to understand distribution not it’s types."}, {"type": "sentence", "content": "Normal Distribution or Gaussian Distribution is the most common distribution that is seen in natures. Such as human height / weight etc. That’s why it’s called normal. It is a symmetric distribution where most of the values are clustered around the mean."}, {"type": "sentence", "content": "In this distribution mean = mode = median."}, {"type": "sentence", "content": "Normal distribution is denoted by : X ~N(x , s²)"}, {"type": "sentence", "content": "Where x is our mean and s² is our variance. If you know that your data set is normally distributed, just by looking its mean and variance you can assume the nature of the curve"}, {"type": "sentence", "content": "The area under a distribution curve is its density. And the total density is always equal to 1 or 100%. So if you increase the variance of a curve i.e. make it wider, to compensate for the area, the curve will get shorter / height will decrease."}, {"type": "subtitle", "content": "Standard Normal Distribution"}, {"type": "sentence", "content": "Standard normal distribution is a normal distribution where mean = 0 and variance is =1 . (The red curve)"}, {"type": "sentence", "content": "N(0,1) is called standard normal variate."}, {"type": "subtitle", "content": "Standardization"}, {"type": "sentence", "content": "Converting a normal distribution to a standard normal distribution is called standardization. To convert a distribution into a standard normal distribution , we standardize each data point using the following formula."}, {"type": "image", "content": "https://miro.medium.com/max/660/1*qXXqcZXhSTgw9tVhx7zNNw.gif"}, {"type": "subtitle", "content": "But why do we bother standardizing?"}, {"type": "sentence", "content": "Lets understand this with an example. Suppose student A scores 85 marks in Maths . And student B scores 70 in English. How do you know who performed better?"}, {"type": "sentence", "content": "We cant just compare marks because both marks are from different subjects , with different difficulty level , hence different scale. The average score in Maths might be higher than english or their variance may differ."}, {"type": "sentence", "content": "In cases like this, we can standardize both of the marks/data points i.e. bring them to the same scale and then compare."}, {"type": "subtitle", "content": "68–95–99.7 rule in Normal Distribution"}, {"type": "sentence", "content": "The 68–95–99.7 rule states that ,in a normal distribution 68% of the data fall under +1std to -1std , 95% of the data fall under +2std to -2std and 99.7% data fall under +3std to -3std."}, {"type": "image", "content": "https://miro.medium.com/max/1350/1*HHWJ-lQ8VJGBPkpWtWT7Hg.png"}, {"type": "sentence", "content": "Using this , you can now estimate what is the approximate height of 68% of the students and what kind of t-shirts they need."}, {"type": "subtitle", "content": "Kernel Density Estimation"}, {"type": "sentence", "content": "Kernel density estimation is used to smooth out a histogram. This technique is used to convert a histogram into a distribution curve . It replaces each sample point with a Gaussian-shaped (Bell shaped) Kernel, then obtains the resulting estimate for the density by adding up these Gaussians."}, {"type": "image", "content": "https://miro.medium.com/max/1720/1*7UXVj9Cf1xj4VMKOKA8N_g.png"}, {"type": "subtitle", "content": "Bandwidth of a kernel"}, {"type": "sentence", "content": "Bandwidth of the gaussian kernel is the width of the gaussian kernel that we take for KDE. The more the bandwidth the smoother the curve. As the bandwidth decreases the PDF curves become more and more jagged."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*FpBOduq94rNpyLfg"}, {"type": "sentence", "content": "For a better understanding on this , I highly suggest to visit https://mathisonian.github.io/kde/"}, {"type": "subtitle", "content": "Q-Q Plots or Quantile plots"}, {"type": "sentence", "content": "Now that you know how useful distributions are , how do you know to which category of distribution your data points belong to as there are many types of distributions in statistics with their own rules. We use a very simple concept called Q-Q Plots."}, {"type": "sentence", "content": "A Q-Q Plot is basically a scatter plot , plotted between two data sets."}, {"type": "image", "content": "https://miro.medium.com/max/1608/1*j582TC8ebYBLvi-SJfqFiw.png"}, {"type": "sentence", "content": "Lets decompose the above pic. Suppose we have a set of data points and we want to check if that data is normally distributed or not. First step is to sort the data and compute percentiles."}, {"type": "sentence", "content": "1 percentile represents the data point greater than 1% of the data set, 25th percentile represent the data point greater than 25% of the data set and so on."}, {"type": "sentence", "content": "Now that you have calculated the percentiles of your data from 1 to 100. You can create a data set with standard normal distribution using numpy whose mean = 0 and standard deviation =1."}, {"type": "sentence", "content": "This line of code creates a 1000 data points that are normally distributed."}, {"type": "sentence", "content": "Now all you have to is plot a scatter plot between these two datasets. If almost all the points in the scatter plot lie on top of a line. Then both the datasets belong to the same distribution (Here normal distribution). Similarly you can use this technique with other distributions as well."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*aJH8F8LCYPrqH5Pv5RGuDQ.png"}, {"type": "subtitle", "content": "References"}, {"type": "sentence", "content": "https://mathisonian.github.io/kde/"}, {"type": "sentence", "content": "https://www.appliedaicourse.com/lecture/11/applied-machine-learning-online-course/2840/introduction-to-probability-and-statistics/2/module-2-data-science-exploratory-data-analysis-and-data-visualization"}], "topic": "data-science"}