{"title": "Bringing music to the deaf by designing a new feature in Apple Music", "data": [{"type": "sentence", "content": "My process of designing a feature that translates music into visuals for the deaf and hard of hearing"}, {"type": "sentence", "content": "In my last year studying digital design at FIT, I got an assignment to design anything under one condition: it had to be digital. Any creative knows that more freedom equals difficulty."}, {"type": "sentence", "content": "And so I was frustrated scrolling through the world of the Internet for an interesting topic that I also cared about, until I watched this:"}, {"type": "sentence", "content": "This video features Amber Galloway Gallego, an American Sign Language(ASL) interpreter, who translates all the elements of a song (lyrics, instruments, beats, and most importantly, the feel) into ASL. Each ASL music interpreter does so differently, making the music-listening experience more fun and visceral for the deaf and hard of hearing."}, {"type": "sentence", "content": "After the video ended, I googled right away and found out that there are 466 million people in the world with a disabling hearing loss. Instantly, I had a problem and an insight."}, {"type": "sentence", "content": "But I didn’t know where to begin. I didn’t personally know anyone who is deaf or hard of hearing nor had I ever met one in my life. All I knew was that I wanted to design something that would translate songs into visuals but had a limited time frame and resources. So I started with what I could learn online."}, {"type": "sentence", "content": "I’d like to walk you through my story in three parts which are:"}, {"type": "subtitle", "content": "1. Research"}, {"type": "subtitle", "content": "Competitor Analysis"}, {"type": "sentence", "content": "One of my goals for this project was to influence the daily music-listening experience of my target audience. I hoped to make the experience more fun and less discriminative so that people immerse themselves whenever they want to, wherever they are. To achieve this, it was imperative that I design for mobile; so I first checked what’s currently out there."}, {"type": "sentence", "content": "There is an overflowing number of music apps. But for the deaf community? Only a few exist. I was disappointed in this noninclusive reality and became more assertive about the need of a solution. I believed that the apps that already exist have room for improvement in both experience and visual design."}, {"type": "sentence", "content": "Additionally, I learned that some apps can examine your hearing ability by playing tones that range from low to high and asking you to press the button whenever you hear the tone. By providing detailed results about both ears, they inform the users about their own hearing ability. This inspired me to incorporate a similar function into my solution."}, {"type": "subtitle", "content": "User Research"}, {"type": "sentence", "content": "To verify that visuals actually help people understand the context of music, I conducted a survey, asking people if they think they’ll feel more connected to music if they visually saw it. I asked 25 people and:"}, {"type": "sentence", "content": "However, there were two big problems with my survey that made the results unreliable and unrepresentative of my target audience:"}, {"type": "sentence", "content": "I had to find a way to talk to my actual target audience. I visited one of the ASL schools here in New York with a hope to talk to the students but I needed to go through some steps (i.e. talk to the principal, the teachers, etc.)."}, {"type": "sentence", "content": "Although I’d have loved to, the time I had for this project didn’t allow me to. That’s why I looked for a different resource that I had access to all the time (maybe too much access)."}, {"type": "sentence", "content": "I turned around to Instagram to interview my target audience."}, {"type": "subtitle", "content": "Interviews"}, {"type": "sentence", "content": "Using hashtags like #deaf and #deafcommunity, I found people who were deaf, hard of hearing or ASL music interpreters. I reached out to them through Direct Message to ask questions and found insights that basically led my project."}, {"type": "sentence", "content": "A few examples of the DM interviews:"}, {"type": "sentence", "content": "<Interview Highlights>"}, {"type": "sentence", "content": "Christopher | Hard of hearing"}, {"type": "sentence", "content": "Without the DM interviews, it would have been impossible for me to learn about the following 6 insights, which emerged most frequently throughout my research:"}, {"type": "subtitle", "content": "The Solution."}, {"type": "sentence", "content": "Introducing the Apple Music Visualizer, a new feature in Apple Music (that I wish Apple actually built) that translates music into visuals for the deaf and hard of hearing. Let me walk you through my design process."}, {"type": "subtitle", "content": "2. Design"}, {"type": "subtitle", "content": "Userflow"}, {"type": "sentence", "content": "Now that I had an understanding of my target audience, I could dive into userflows and really put myself into their shoes."}, {"type": "sentence", "content": "Apple already has its own system for accessibility. With a simple addition to the hearing section under Accessibility, users can easily enable Apple Music Visualizer."}, {"type": "image", "content": "https://miro.medium.com/max/4828/0*8EMjEONuL04sYslJ.png"}, {"type": "sentence", "content": "Apple Music primarily has 5 sections — Library, For You, Browse, Radio, and Search. The ‘For You’ has recommendations and your recent playlists; the hearing ability test lives inside this section."}, {"type": "sentence", "content": "After the user takes the test, the original ‘For You’ features return. Users can also change the visualizer settings if they’d like to, under ‘Visualizer Settings’."}, {"type": "image", "content": "https://miro.medium.com/max/3168/0*IXY_WiXrA4eWkoCx.png"}, {"type": "subtitle", "content": "Wireframes"}, {"type": "subtitle", "content": "3. Finally, the Features"}, {"type": "sentence", "content": "Following Apple’s official design principles and paying closer attention not to distract the original system, I designed the four main features."}, {"type": "sentence", "content": "During the DM interviews, I was shocked to learn that not everyone who is deaf and hard of hearing knows how to sign. It totally makes sense because it’s up to you to learn a whole new language- but I was surprised at my own ignorance. That’s why I added an option to ‘Watch the Lyrics,’ especially for those who aren’t familiar with ASL."}, {"type": "subtitle", "content": "Watch the case study to better understand:"}, {"type": "subtitle", "content": "Looking Back."}, {"type": "sentence", "content": "The biggest challenge I faced was thinking about improvements without making it too different. Because why should they be, right?"}, {"type": "sentence", "content": "I wore different hats while working on this project over the course of 3 months. What seemed to be just another design project turned out to be the most exciting and memorable one for me, changing my perspective towards UX/UI design and guiding me further into this industry."}, {"type": "sentence", "content": "Fun fact: when I got back to my interviewees with the completed project, they told me that they wish they had something like this. Some even thought it was actually a real feature Apple Music has launched."}, {"type": "sentence", "content": "I so wish this kind of feature could come to life. And I hope my small act of designing inspires others to consider accessibility and inclusiveness in their daily designer lives, too."}, {"type": "sentence", "content": "Thanks for reading!"}], "topic": "ux"}