{"title": "Finding Flow: Neurotechnology in the Era of Social Distancing and Remote Work", "data": [{"type": "image", "content": "https://miro.medium.com/max/1600/0*Ch-6pX0qDDEkn6ZT"}, {"type": "sentence", "content": "Some people can work anywhere. Sitting next to chatty coworkers or peers? Not a problem. Working in an office building right next to a busy railroad station? Bring it on."}, {"type": "sentence", "content": "But for most people, the environment and the surroundings have a significant impact on how focused they are on the task at hand and how efficient their work session ends up being. Environmental cues play a huge role in productivity. That’s why some students can only work on their chemistry problem set on the silent floor of a library, or why some authors can only overcome writer’s block at their local coffee shop."}, {"type": "sentence", "content": "With the COVID-19 pandemic sweeping the entire world and uprooting all sense of normalcy, many people find themselves having to adjust to completely new environments in the name of social distancing. While it is important to note, however, that during unprecedented times of a global health crisis, productivity should not take priority over physical and mental health, the reality is that many workers and students are being placed in situations where they must fulfill deadlines while forcibly adapting to unfamiliar work surroundings. The problem? These new work environments are often much more distracting than the office building or university library that we are used to."}, {"type": "sentence", "content": "Here is where neurotechnology comes in. When most people hear the word “neurotechnology” or think of brain-computer interfaces, they often jump to the image of using their brain to control machines. But what about devices that can control your environment according to your brain signals? That’s exactly what productivity-focused neurotechnology companies aim to create: novel devices and wearables that enhance human focus and productivity in any environment, especially relevant in suboptimal situations where we are quarantined in our homes."}, {"type": "sentence", "content": "Examples of Workplace Productivity Neurotechnology"}, {"type": "sentence", "content": "Here’s the idea: by tracking your focus and productivity across different environmental factors such as time of day, location, or what music you’re listening to, you can glean valuable insight into the conditions that help you work best. In these tumultuous times, you may have not had the time to find a new routine that works for you. These tools can help you speed up the process of creating the most efficient work schedule and environment, based on the most personalized information possible (literally from your own brain!). Many companies are taking this one step further by providing real-time feedback on your focus while you work, giving recommendations to increase productivity, such as when to take a break or have some exercise, and even adjusting your working conditions by doing things like playing music to boost alertness"}, {"type": "sentence", "content": "Most of these technologies utilize some sort of wearable EEG device, such as headbands or earbuds, to track brain waves as you work, and monitor independent conditions such as the time of day automatically, while still having the option to tag other environmental conditions such as location manually. One example of this wearable technology is Project X’s FocusBuds; these wireless earbuds track our brain activity in real-time with tiny EEG biosensors, alert when focus levels drop, and then gently guide our brains back into peak focus."}, {"type": "sentence", "content": "How do FocusBuds work?"}, {"type": "sentence", "content": "FocusBuds utilize the power of EEG neurofeedback to train human brains to improve the ability to focus, block out distractions, and enter and stay in a “flow state” more effortlessly."}, {"type": "sentence", "content": "A “flow state” is best imagined as “being in the zone.” or the feeling that you get when you experience “runner’s high.” In the 1960s, psychologist Mihály Csíkszentmihályi first formally coined the term “flow state” as an “optimal state of consciousness where we feel our best and perform our best.” Using fMRI and EEG data, researchers can track whether a person is in this state through brainwave function and neurochemistry. In flow, our brains shift away from the fast-moving beta waves that dominate our normal waking states of consciousness, towards slower alpha waves and theta waves, that are commonly associated with a day-dream, calm state. This shift from hyperactivity to hypoactivity improves our ability to concentrate. Neurochemically, being in a “flow state” is associated with the release of pleasure- and performance-inducing neurotransmitters including dopamine, anandamide, norepinephrine, endorphins, and serotonin."}, {"type": "sentence", "content": "With embedded EEG biosensors, FocusBuds tracks brain activity in real-time and monitors the patterns of your brain activity to determine your focus levels. When the device detects that you are distracted, it sends an auditory signal that alerts you about your drop in focus levels, prompting you to return to a concentrated state of mind."}, {"type": "sentence", "content": "It is through these signals, noise-canceling features, and wireless capabilities that FocusBuds bring you to a “flow state.” But that isn’t even the best part of these earbuds. By incorporating neurofeedback therapy and operant conditioning, the device essentially trains your brain — allowing the productivity-enhancing impacts to last even after you take off the earbuds."}, {"type": "sentence", "content": "Broadly, neurofeedback therapy provides users with information about their physiological and neurological states and uses visual or auditory signals to retrain the brain as users learn to regulate and improve brain function. This process of retraining the brain is rooted in operant conditioning which is a learning model structured around rewards and punishments for behavior; behavior followed by positive consequences are more likely to be repeated than behavior followed by negative consequences."}, {"type": "sentence", "content": "Neurofeedback therapy is commonly used to treat neurological and mental health disorders such as ADHD and PTSD. During a neurofeedback therapy session, a patient may be given a movie to watch while EEG sensors monitor brain waves. When the patient’s brain waves are functioning at an optimal, focused state, the movie plays smoothly. But when the patient is distracted, and their brain waves are not functioning at the optimal state, the movie pauses. In this example, a smoothly playing movie is the reward while a movie on pause is the punishment. Over time, as neural pathways are formed and reinforced, the patient’s brain changes functionally and structurally — a concept known as neuroplasticity — to function more optimally."}, {"type": "sentence", "content": "With FocusBuds, the “punishment” is the auditory signal indicating a drop in focus while the “reward” is the absence of that signal. The continual use of FocusBuds and their signaling feature trains the user’s brain to more easily enter a “flow state” of productivity."}, {"type": "sentence", "content": "Project X is not the only company that is furthering the neurotechnology productivity industry."}, {"type": "sentence", "content": "Emotiv also uses EEG technology in the form of a headset, and promises stress and focus management recommendations by detecting different cognitive states like engagement, excitement, and relaxation in response to daily activities. Melomind, another headset product by the French company myBrain, uses similar technology, but with a focus on stress reduction and relaxation with their EEG-based relaxation training program."}, {"type": "sentence", "content": "Drawbacks"}, {"type": "sentence", "content": "The technology behind these products not only show potential in promoting individual productivity, but could also be utilized by employers to optimize the productivity of their workers overall. However, with this prospect comes some privacy concerns with the direction that this technology could take. Is it giving employers too much personal information to literally give them a glance inside your brain? And are there ethical issues raised if recruiters start using this type of productivity tracking to pick potential employees?"}, {"type": "sentence", "content": "The idea of getting ruled out for a job because your brain waves didn’t meet the boss’s standards seems almost dystopian. But in today’s oversaturated and highly competitive job-hunting climate, it almost seems like a natural next step to what’s already happening. Recruiters already use tech-based shortcuts to weed out weaker candidates — think online coding tests, self-recorded video interviews, timed written responses to case studies. These screenings aren’t just intended to gauge skill, they also implicitly assess a candidate’s ability to maintain focus and efficiency under pressure. Throwing a form of technology into the mix that can explicitly accomplish this could make EEG productivity measuring software a popular choice for many recruiters, once the technology is reliable enough and mass-produced."}, {"type": "sentence", "content": "On top of the huge breach of privacy this would comprise of (which many candidates would likely endure out of desperation), the ethical implications are huge. Of course, mapping interpreted EEG signals onto subjective human concepts like ‘focus’ and ‘productivity’ is nowhere near foolproof — not to mention, everyone’s brain is unique, and one person’s brain waves when working at high efficiency may look very different from another’s. This doesn’t really pose an issue for the highly personalized use this technology is currently marketed for, since you’re just comparing yourself against yourself. But what happens when an employer’s standard for their ideal candidate leaves no room for individual quirks and differences? The thing is, recruiters weeding through hundreds or thousands of applicants have the luxury not to care about the many qualified candidates they’re leaving out. As long as the applicants who do meet the standard are as qualified as the test indicates, they’re happy. The many candidates whose results don’t conform to the standard are left in the dust and not given the opportunity to improve their efficiency over time as they get used to the job. And if this practice becomes commonplace, huge groups of qualified workers will be consistently disadvantaged for something they simply cannot control: how their brain waves look on a screen."}, {"type": "sentence", "content": "Conclusion"}, {"type": "sentence", "content": "While the ethical concerns and drawbacks are important factors to consider when implementing these devices on a widespread scale, the benefits of these productivity-focused neuro-wearables are clear. The ability to focus and be productive is influenced by a plethora of personal factors and external factors. And the world of technology is finally recognizing the importance of personalization in devices — thus leveraging the power of neurological signals to make that a reality. By building machines to integrate inputs from the user and the user’s environment, neurotechnology is moving the tech industry away from the idea that one size fits all."}, {"type": "sentence", "content": "When social-distancing transforms your kitchen table into your desk and your bedroom into your office, these performance-enhancing neuro wearables can help ensure that you are able to productively work in these atypical circumstances. And even beyond this global health crisis, the widespread, upward trends in remote work demonstrate the growing need for devices that stop environmental stimuli from hindering your work — bringing you and your brain back in control."}, {"type": "sentence", "content": "Written by UC Berkeley students Josephine Tai and Melody Sifry, and edited by Jandy Le. Josephine is studying Molecular and Cell Biology, Melody is studying Cognitive Science, and Jandy is studying Integrative Biology."}], "topic": "neuroscience"}