{"title": "It’s Over! How to Know When a Piece of Art is Finished.", "data": [{"type": "image", "content": "https://miro.medium.com/max/5314/1*C9Hh33yPAx9dWy_rKcnNww.jpeg"}, {"type": "sentence", "content": "Chances are if you’ve ever made a painting you’ve asked yourself “Is this finished? Or should I keep working on it?. New artists can spend hours adding extra details to their paintings, doing and undoing, and running the risk of ruining their painting completely."}, {"type": "sentence", "content": "So how can you know, assuredly, that your painting is finished?"}, {"type": "sentence", "content": "In our Evolve school in New Jersey, the students often come to teachers and ask, “Can you look at this? I think my painting is done”. These questions always receive the answer, “You think it is done, or you know it?” and end with the student going back to their easel to fix the issues they can clearly see within their work."}, {"type": "sentence", "content": "As an artist, you are the only person who can decide if your painting is finished or not. An experienced teacher can certainly help to guide you, but ultimately, you have to make that decision."}, {"type": "sentence", "content": "So here are a few ways for you to be able to complete a painting with confidence that it is truly finished."}, {"type": "image", "content": "https://miro.medium.com/max/4398/1*TVNsbjCQRpc7AbpuyjMFYQ.jpeg"}, {"type": "subtitle", "content": "Know How to Look for Mistakes"}, {"type": "sentence", "content": "At Evolve, we utilize a certain standard to figure out whether or not a painting is finished. First, the student looks at their own work, scanning to see if they can find anything out of place."}, {"type": "sentence", "content": "Then, they ask themselves, “Do I know how to fix this issue?” If they answer yes, then they fix the problem, which improves the painting and moves it along closer to the end goal of excellence."}, {"type": "sentence", "content": "If they answer “no”, this means they can see issues but do not know how to fix them. And in that case, they have finished the painting."}, {"type": "sentence", "content": "If a student cannot see a problem with their painting, then nothing needs correction from their perspective. An experienced teacher will see hundreds of issues with any student’s painting. But, great teachers know what to point out and what is above the students' comprehension at that point."}, {"type": "sentence", "content": "So if a student looks at a painting and cannot find anything wrong, or they do find something wrong, but do not yet know how to fix it on their own, then they can call the painting finished."}, {"type": "image", "content": "https://miro.medium.com/max/1874/1*oiD22HRetpe15HQ1zSb4fA.jpeg"}, {"type": "subtitle", "content": "Have a System for Painting"}, {"type": "sentence", "content": "Having a process and a system for painting is essential to being able to finish a piece. Professional artists all have systems and processes to making the paintings that help them determine when they are content with the piece."}, {"type": "sentence", "content": "At Evolve, our students start with simple, grayscale paintings and are given checklists for each painting. This enables them to physically check a box by each part of the painting to make sure they have taken care of that section to the best of their ability."}, {"type": "sentence", "content": "By having a process and a clear way of doing things, beginner artists can follow a proven process that gets them a good result. This enables them to be confident in their finished paintings."}, {"type": "sentence", "content": "If you don’t have a process or a system to make your art and you are struggling to fix mistakes and finish pieces, then you may consider exploring programs that teach this very sort of system."}, {"type": "sentence", "content": "Having a plan, a clear idea of what you want the painting to look like, and how you are going to get to that point is essential for beginners as they seek to complete a painting and know that they have given it every chance possible."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*6sBpIzvFF7-QSNzx6biabQ.jpeg"}, {"type": "subtitle", "content": "Hold Yourself to High Standards"}, {"type": "sentence", "content": "In order for beginners to develop the skills of finishing paintings confidently, they need to learn how to hold themselves to a high standard."}, {"type": "sentence", "content": "As an artist, if you can see something in your work that needs correction, then it is your job to fix it. A teacher does not need to stand over your shoulder and proof your quality control. Quality control sits in the hands of the artist. Once you have received the correct education, you need to demand excellence from yourself in order to continue to grow."}, {"type": "sentence", "content": "This then becomes a habit, whether you do it for three or thirty years. And approaching your work each day like this will result in art that steadily improves over time."}, {"type": "image", "content": "https://miro.medium.com/max/3624/1*0Dx9nVOfLhz7NMaiFfuhKQ.jpeg"}, {"type": "sentence", "content": "Artists must be responsible for their own work. This will help them to know when a painting is finished."}, {"type": "sentence", "content": "The goal is to move the painting forward to a finished place, not to make a lateral move where the painting does not improve. If you cannot see a clear way to improve the painting, then the painting is done. Eventually, you will learn and these issues will resolve, but getting into the trenches without knowing what to do can prove disastrous for a painting."}, {"type": "sentence", "content": "If you want to learn more about how to create systems for your art, head over to Evolve Artist."}], "topic": "education"}