{"title": "How to Create the Ultimate Discord Server", "data": [{"type": "subtitle", "content": "18 of the best bots to take your server to the next level"}, {"type": "sentence", "content": "Discord is increasingly being used across a wide range of contexts. Communities of all kinds have built servers and created their own spaces. More and more, Discord Bots are becoming a powerful way to customize and tailor your Discord experience in a way that best suits your audience or team. In this piece, I’m going to run through 18 of the very best bots that I personally recommend. But before diving in, I’d be remiss if I didn’t mention Discord Bot Studio, a tool I made that lets you make your own custom Discord bots without coding."}, {"type": "sentence", "content": "Okay, now, let’s get to the list!"}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "subtitle", "content": "Mee6"}, {"type": "sentence", "content": "Mee6 being at the top of this list will probably come as no surprise. Mee6 lets you add custom commands, an xp leveling system, a moderation system, and alerts for YouTube, Twitch, and Reddit to your server. It’s a tried and true favorite in the Discord Bot scene."}, {"type": "subtitle", "content": "Dyno Bot"}, {"type": "sentence", "content": "Dyno, like Mee6, is another bot that can almost do it all. Dyno offers a web dashboard, moderation, custom commands, music capabilities, auto mod, and more. Dyno bot has been added to over 800,000 servers at this point, and it’s not hard to see why."}, {"type": "subtitle", "content": "Octave (formerly Gnar)"}, {"type": "sentence", "content": "Octave is a fully-featured music bot that is great for any server that is looking to add music controls. Octave lets you play music in Discord through Spotify or YouTube. Octave is also open source, so you can expect it to be well maintained for the foreseeable future."}, {"type": "subtitle", "content": "Pokécord"}, {"type": "sentence", "content": "Pokecord is a great way to add some fun to your Discord server. This bot lets your server members catch, collect, and trade Pokémon, much like you would in the real Pokémon games. Wild Pokémon appear periodically in chat, and the quickest to act are able to catch them. This incentivizes server members to be online in your server as much as possible."}, {"type": "subtitle", "content": "Dank Memer"}, {"type": "sentence", "content": "Dank memer is a meme and currency bot that will add a little variety to your server. There are plenty of fun commands to explore, and even a few small minigames built in. This bot also handles image manipulation, which can be useful for cooking up your own memes."}, {"type": "subtitle", "content": "Mudae"}, {"type": "sentence", "content": "This bot is a bit more eccentric than those listed above. It lets you claim, customize, and battle with over 40,000 anime characters. This can add more incentive for server members to stay active, much like Pokécord. There are also some small games this bot offers."}, {"type": "subtitle", "content": "Groovy Bot"}, {"type": "sentence", "content": "If you’re not a fan of Octave, you can instead opt for Groovy bot to add some music control to your server. Much like Octave, Groovy lets you play and queue songs in your Discord server. There are also some cool features like bass-boosting and vaporwave sound effects, but those are only accessible if you opt for the premium version of Groovy."}, {"type": "subtitle", "content": "Apex Predator"}, {"type": "sentence", "content": "This bot quite simply lets you check your stats for Apex Legends. This is a great option if you run a server with a lot of Apex players."}, {"type": "subtitle", "content": "Rythm Bot"}, {"type": "sentence", "content": "Rythm bot is another good choice if you are looking to add a music bot to your Discord server. Their site claims that it’s being used on 8 million Discord servers, which is absolutely insane if true. Rythm lets you play and search for music, similar to other music bots listed above. It also is able to fetch the lyrics for a song, which is a very nice feature to have. It’s a very solid music bot, and has all the features you would expect for queueing, shuffling, etc."}, {"type": "subtitle", "content": "YAGPDB"}, {"type": "sentence", "content": "YAGPDB, Yet Another General Purpose Discord Bot, is another great option if you are looking for an all-around bot. This bot includes many features that are standard for this style of bot- custom commands, role assignment, auto moderation, and server stats. There are also more options you can access if you choose to buy the premium version."}, {"type": "subtitle", "content": "Carl Bot"}, {"type": "sentence", "content": "Carl bot is yet another solid general purpose bot. Carl bot’s notable features include custom commands, reaction roles, extensive logging information, and a suggestion system. I think the defining feature of Carl bot is the user engagement features that it offers. This includes things like keeping track of user post counts, and star boards. These things allow you to keep server members engaged."}, {"type": "subtitle", "content": "Cafe"}, {"type": "sentence", "content": "Cafe bot is a little more niche than the previously mentioned bots. This one adds an infinitely-incremental game to your server, much like the “Cookie Clicker” style games. This game is more in depth than you might expect, and it’s a fun little addition to any Discord server."}, {"type": "subtitle", "content": "UnbelievaBoat"}, {"type": "sentence", "content": "This bot allows you to add a functional economy system to your server, which has become a very in-demand feature of late. Members can earn money in the economy system by being active in the server, or using certain commands. This is good for keeping members engaged. UnbelievaBoat also includes fun games like blackjack, roulette, and a slot machine."}, {"type": "subtitle", "content": "GiveawayBot"}, {"type": "sentence", "content": "This bot may not be useful for everyone, but if you’re looking to host a giveaway in your Discord server, this is a great option. This bot lets you create custom giveaways which your server’s members can automatically join when they choose to."}, {"type": "subtitle", "content": "ServerStats"}, {"type": "sentence", "content": "From the bot developer: “This bot can show you all members, members, bots, channels, roles, emojis, boosts and connected. It can also show a goal and welcome channel with joined and left messages. This all will (by default) be shown under a category with channels and the channel names will be changed. You can also customize the text that is displayed in front end behind the number.” This one is great if you are looking to see meta information about your server very easily."}, {"type": "subtitle", "content": "PatchBot"}, {"type": "sentence", "content": "PatchBot is a cool little bot that lets you see patch notes for your favorite games, as they are released. This is perfect if you run a server dedicated to a certain (or multiple) video games. It includes popular titles like Fortnite, League of Legends, PUBG, and more."}, {"type": "subtitle", "content": "Streamcord"}, {"type": "sentence", "content": "From the developer: “View details and stats from your favorite streamers on Twitch. Get current view and stream status, current game, and a preview of the stream."}, {"type": "sentence", "content": "See the most popular games and streams on Twitch with just one command. You’ll also see the amount of channels streaming and total current views for the game."}, {"type": "sentence", "content": "Search Twitch’s wide selection of clips recorded by tons of users. Search by trending, a certain game, or a Twitch streamer.”"}, {"type": "sentence", "content": "This is a great option if you want to keep tabs on your favorite streamers, or if you are a streamer yourself. It’s definitely worth checking out."}, {"type": "subtitle", "content": "Trivia"}, {"type": "sentence", "content": "“TriviaBot brings multiplayer trivia games to your Discord server! With over 3,000 questions and 24 categories, TriviaBot offers endless trivia fun.”"}, {"type": "image", "content": "https://miro.medium.com/max/2844/1*1T9lANVFTnc-QIMucSn1Sg.jpeg"}, {"type": "sentence", "content": "Hopefully you’ve enjoyed this list and found a few new bots you might not have known about previously. Please let me know if you found anything interesting, or will be adding any of these to your severs!"}], "topic": "gaming"}