{"title": "Maybe You Don’t Need to be Doing More Right Now", "data": [{"type": "subtitle", "content": "Focus on your internal voice, not external pressure"}, {"type": "sentence", "content": "We’ve been placed in an interesting position with the current state of global affairs having us locked into whichever four walls we live in. At first, this felt like something of a vacation — especially for those who have recently graduated (hello), students still in school or anyone with some extra free time due to the pandemic."}, {"type": "sentence", "content": "At the start, this newfound freedom was fun, enjoyable, and allowed us to get to those pesky projects or tasks we never quite had the time for. But as this period of isolation has dragged on, our stimulation with these seemingly ‘fun’ tasks has begun to wear out. As a result, we’re on social media more, reading more online, consuming more, and so much of our creative thinking time is being overrun by what someone else is saying to us through our screen. And as self-improvement gurus are swooping in with advice as to how we can ‘make the most of quarantine’, we begin to plant seeds of self-doubt in our own psyche telling us we are not doing enough."}, {"type": "subtitle", "content": "Why We Feel Inadequate"}, {"type": "sentence", "content": "This feeling of inadequacy is not helped by conversations with friends which start with, “so what have you been working on in quarantine?” rooted in the underlying assumption that we should have something to show for this time. Nor is it lightened by posts online where people are going on about new projects they’re working on or secret start-ups they’re building, books they’re writing or podcasts they’re starting. While all of this progress is fantastic and should be celebrated, the steady stream of it constantly penetrating into our lives can paralyze us into inaction. The acute awareness of others’ coping methods and creative projects puts our mind in a state where our perception of ourselves is warped with comparison, and we’re overthinking our lives instead of just living them. Thus, in a time where we could be doing anything, we feel too lost and overwhelmed to do anything at all."}, {"type": "subtitle", "content": "The Paradox of Doing Nothing"}, {"type": "sentence", "content": "Doing nothing is perfectly OK — as long as it is coming from you and not from self-doubt or anxiety imposed on you by your environment or the content you’re consuming. Wanting time ‘off’ to rest and recuperate during this time is perfectly valid. Perhaps you just finished a tough, gruelling degree and want some time to do your own thing for awhile (hello again), or maybe you just like the feeling of waking up in the morning and doing as your heart pleases with no real routine in place."}, {"type": "sentence", "content": "After all, when else will we be able to do that? But when the sense of days going by without anything happening makes you anxious because of what you see other people doing, that’s when you need to make a change. And not necessarily to what you’re doing, but to how you’re perceiving it."}, {"type": "sentence", "content": "This pandemic wasn’t put in our lives so that we could attack all the goals and ideas we’ve been procrastinating. If you feel a sudden surge of inspiration to do just that — fantastic, follow it. Conversely, if you feel that this time is a welcome period to recuperate and take a break from whatever was leading up to it — also fantastic, follow that feeling. Some days you may wake up and feel an urge to create or do something ‘productive’, and sometimes, you’re not going to feel that urge at all. And while I believe routine is healthy, I also think trusting our intuition and not forcing ourselves to do something that’s meant to be enjoyable is too."}, {"type": "subtitle", "content": "Be Authentic First"}, {"type": "sentence", "content": "If you want to create authentically, you can’t be creating just because you saw someone post their journalling session today and feel guilty you haven’t done anything of the sort yet. Creativity needs to be real. Potent. Genuine. Authentic. And it cannot be any of those things if it is purely your external environment which is telling you that you need to create something."}, {"type": "sentence", "content": "It needs to come from you. The reason you see people crushing it and producing things which are inspiring and awesome is because that motivation and desire to create came from them. The people trying to achieve that same sense of accomplishment by forcing themselves to be productive are much less likely to produce work which will yield the same result."}, {"type": "sentence", "content": "The days we try to corner ourselves into getting things done are not the days we actually get things done — especially when it comes to creativity. Those aren’t the days that our ideas flow onto a page and into reality. Instead, authentically creative days require an internal pull, a feeling extending beyond what we see other people doing — a sensation that can only arise from being genuinely in touch with yourself."}, {"type": "subtitle", "content": "Create Space to Find Your Creativity"}, {"type": "sentence", "content": "Ironically, to tap into your creativity and find out what it is that you truly want to spend your time doing, you might need to take some time off. Instead of trying to force it, try out a few days with no plans, no structure, no routine — to see what you, independent of any influence, feel the desire to do."}, {"type": "sentence", "content": "When we stop reacting to the external pushes of our environment, the toxic comparison of social media and the productivity articles popping up on our feeds, we begin to hear our internal voice."}, {"type": "sentence", "content": "Because as lovely and inspiring as those quotes on Instagram might be, they’re not going to be the thing which leads you to how you want to spend your time — you are. And to find out what that’s going to be, you need to create the space to let your own creativity emerge."}, {"type": "sentence", "content": "I send out a weekly newsletter with my latest Medium article and the most interesting things I’ve stumbled upon that week. Sign up here ❤"}], "topic": "productivity"}