{"title": "Why Defining Your Values Will Help You Build a Sustainable Freelance Writing Business", "data": [{"type": "sentence", "content": "Now that you’re your own boss, you need to knowing what you care about at work"}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*6xrClxuztkm7Vv0ZVmD6fA.jpeg"}, {"type": "sentence", "content": "I first tried freelancing in 2015. I was so burned out by my journalism job that I needed an escape, fast. I had no prospects but I needed to get out for my mental health, so I quit and decided that freelancing seemed like a great route toward freedom."}, {"type": "sentence", "content": "I wasn’t wrong; freelancing is a great route toward freedom. But during my first try as a freelancer, I couldn’t make the lifestyle work. My husband was between jobs and our state-sponsored health insurance was incredibly expensive. I wasn’t making enough to support my husband and me, let alone cover the costs of health insurance. I also didn’t know how to navigate my schedule now that I was on my own, so I ended up taking on work I didn’t love and working crazy hard for a few weeks before I crashed. In other words, I was trying to apply the strategy I knew from my former full time jobs: Work hard, get noticed, and eventually the work will become more interesting and lucrative as I make my way up the career ladder."}, {"type": "sentence", "content": "The thing is, freelancing doesn’t really work like that, so it didn’t work for me during round one, either. Instead of sticking with it, I got a full time job again. But the thing was, I loved the freedom of time associated with being a freelancer. While I hacked away at my salaried editor job, I realized that I kind of missed it. So when I got laid off from that job, I had a decision to make: I could look for more full time jobs, but I could also try to go back to freelancing."}, {"type": "sentence", "content": "Although it took a while to make a decision, I knew in my heart of hearts that I wanted to freelance. But I was nervous, so I felt like I couldn’t make the jump! After all, it hadn’t worked before, and I didn’t think people would take me seriously. Fast forward to a very good appointment with my very smart therapist, where she encouraged me to create a business plan for myself."}, {"type": "sentence", "content": "“What if you could create your dream job?” she asked me."}, {"type": "sentence", "content": "In the end, the was right. Making a plan helped me feel like I could make freelance journalism my career, not just my side hustle."}, {"type": "sentence", "content": "Surprisingly, the first step in building a business that worked for me involved doing something I hadn’t thought to do before: I needed to figure out what I valued."}, {"type": "sentence", "content": "Values are the things you care about; for example, think of a job you’ve had that you really loved. What was it about that job that made it so great? Was it your co-workers? The daily routine? A short commute? The work itself? Do you like work that’s detail-oriented, or do you thrive at strategic thinking and looking at the big picture? Do you love working alone, or do you need to be around people? Is mentorship important to you, or do you want to make your own way? Do you like to build things or maintain them?"}, {"type": "sentence", "content": "Determining what you care about at work can help you figure out how to build a freelance business that feeds your soul and keeps you grounded, which I believe helps you continue on this oft-challenging career path over the long haul. When you’re your own boss, you make the rules — but you have to actually make rules when you start, rather than running on default!"}, {"type": "sentence", "content": "So, based on my therapist’s recommendations, I took some time to think about my values. I determined that one of the things I love most is flexibility; I love freedom of time. I don’t like being tied to other people’s schedules, and I am happiest when I can work when the mood strikes. Sometimes that means working late at night. Other times I work best early in the morning. Sometimes I want to spend the day hiking and the evening working. For me, a flexible schedule feels like an absolute treat. When I get to “play hooky,” I feel like I’ve won the lottery and I’m able to keep up my enthusiasm and drive to succeed on my own."}, {"type": "sentence", "content": "I also determined that I value creative challenge, which means I enjoy working on projects that challenge me and offer variety. The constant management of a freelance business fits well with my need for challenge; thinking intentionally about my set-up and work-life balance keeps my brain happy."}, {"type": "sentence", "content": "What does that look like on a daily basis? Because I need flexibility, I rarely take on clients who require that I be online at any given time. I don’t take client emails on Fridays, either. I also carefully analyze my client list and assignment line-up at the end of each month, to make sure the creative balance is working for me. Some of my other priorities — like community, or connecting with people in the workplace — have led me to join a co-working space, launch a podcast with another freelancer, and create a business coaching program for freelancers."}, {"type": "sentence", "content": "In the end, my therapist was right: Determining my values up front helped me build a business I could lean on. For the past two years, I’ve been working for myself and loving it. I make six figures each year, work with clients I love, and have the freedom to travel and spend time outside. This past year, my business helped me fund a 16-week maternity leave with my new baby. In other words, as my values changed, I was able to shift my business to help me live the life I actually wanted to live. But without this intentional thinking (and constant reassessing), I would have functioned on autopilot. I likely would have burned out and gotten frustrated, just like my first try at freelancing."}, {"type": "sentence", "content": "If you like what you’re reading in this post, check out my new podcast about running a freelance business, The Writers’ Co-op."}], "topic": "freelancing"}