{"title": "How I Organise My Life With Notion", "data": [{"type": "subtitle", "content": "A beginners guide to the only productivity tool you need."}, {"type": "image", "content": "https://miro.medium.com/max/2356/1*HxEfkjznhaxahaPO8rBxvA.png"}, {"type": "sentence", "content": "It has been thirteen months since I first stumbled across Notion, the all-in-one planning application that has become my (almost) sole productivity tool."}, {"type": "sentence", "content": "I use Notion to take notes, manage tasks and keep track of both short and long-term goals. The only other productivity tools I use are the basic reminders app on my phone, Google Keep for jotting down short notes, Google Calendar and Pages/Word on my laptop."}, {"type": "sentence", "content": "Unsurprisingly, Notion has become incredibly popular over the last couple of years, attracting the likes of Steve Huffman, co-founder and CEO of Reddit."}, {"type": "sentence", "content": "Notion has a huge array of different ‘page’ layouts, each of which can be used for a different purpose, such as managing a team, planning a blog post or taking notes in a lecture. In this piece, I share a few of my favourite Notion page layouts for those who are new to the platform, including a brief explanation of how I set each of them up."}, {"type": "sentence", "content": "Hopefully, the ideas I share here will be helpful both for those who are new to the tool and for long-time Notion users who are searching for more potential uses of the tool."}, {"type": "subtitle", "content": "1 — Planning My Week"}, {"type": "sentence", "content": "My ‘Weekly Plan’ is the epicentre of my Notion setup and the pivot around which much of my life revolves."}, {"type": "image", "content": "https://miro.medium.com/max/4512/1*xNsRaxXt2r-vmBHJh5YtDg.png"}, {"type": "sentence", "content": "To create this page, I have made use of one of Notion’s standard page templates, which can be found under the ‘add a page’ option within the main sidebar."}, {"type": "sentence", "content": "Formatting my Weekly Plan such that the weekend is lumped together allows all of my tasks to be viewed clearly when viewing Notion on my phone. I found that separating out Saturday and Sunday was, for me, both unnecessary and frustrating, as certain words were cut-off or haphazardly divided in half."}, {"type": "sentence", "content": "To create each task, hover over the plus (+) sign to the left of each text box, bringing up a selection of ‘block’ options. From this menu, select the ‘To-do list’ option, which inserts a square checkbox and a text box. Simply type your desired activity into this textbox to create a new task."}, {"type": "sentence", "content": "New tasks can be easily created by copying and pasting previous tasks or simply pressing ‘enter’ after each checkbox/task."}, {"type": "sentence", "content": "I categorise my tasks using a colour-coding system, using red for work, green for exercise and so on. I prefer to change the colour of the background rather than the text when colour-coding tasks as I think this makes tasks stand out a little more clearly."}, {"type": "sentence", "content": "To change the background colour, first select a task by highlighting it (i.e. dragging across with a mouse or double-tapping on a mobile device). Then, select the ‘text colour’ button (which generally appears as a capitalised ‘A’) and scroll down to the bottom of the drop-down list. Here, you should find a range of different background colours from which to choose."}, {"type": "sentence", "content": "Once tasks have been completed, press or click on the checkbox square to cross them off your to-do list. At the end of each week, you can place all of your completed tasks into the ‘Archive’ by selecting, dragging and then dropping them onto the grey filing cabinet icon."}, {"type": "sentence", "content": "The Archive, which is already built into the Weekly Plan template, allows you to store all of your completed tasks so you can view them at a later date. I find this useful for two reasons. Firstly, being able to see all of my completed tasks is a great source of motivation, demonstrating that my hard work is paying off and providing encouragement to continue checking tasks off my list."}, {"type": "sentence", "content": "Secondly, having all of my completed tasks stored in one place allows me to easily copy and paste tasks back into my Weekly Plan as required, without needing to create new tasks. This might only save several seconds, but it can be a useful timesaver nevertheless."}, {"type": "subtitle", "content": "2 — Managing My Goals"}, {"type": "sentence", "content": "Another way I use Notion is to record my progress with both short and long term goals."}, {"type": "image", "content": "https://miro.medium.com/max/4448/1*fYdzFwlKChmJZ-NZHoATMA.png"}, {"type": "sentence", "content": "As with my Weekly Plan, the ‘Goals’ page is another of Notion’s pre-prepared templates that can be chosen from the main sidebar. This page is intended to allow users to clearly set out and track the progress of a handful of overarching goals. I find this page set up to be useful in focussing my attention on a streamlined set of objectives and use it to guide the tasks I set myself within my Weekly Plan."}, {"type": "sentence", "content": "As the Goals page is a pre-prepared template, columns for goals that I have completed (i.e. ‘Done’), are in progress (i.e. ‘Doing’) or plan on doing (i.e. ‘To Do) already set up. This makes the task of adding new goals quick and easy."}, {"type": "sentence", "content": "New goals can be added by pressing/clicking the + symbol and typing your intended goal. Double-clicking a task that has already been created will cause a new page to pop up. This page can be used to add a status (‘To Do’, ‘Doing’ or ‘Done’) to the goal and to tag a goal (e.g. ‘Work’ or ‘Life’)."}, {"type": "sentence", "content": "I try to limit the number of goals that are in progress at one time as this helps me to focus my attention and avoid getting sidetracked by the unnecessary distraction of numerous ‘side goals’. I also try to keep a balance between work/life/health here, something I achieve by ‘tagging’ and colour-coding each goal, e.g. ‘Fitness’ (as demonstrated in my above Weekly Plan set up guide)."}, {"type": "subtitle", "content": "3 — Tracking My Habits"}, {"type": "sentence", "content": "One of my favourite uses of Notion is to track positive habits such as drinking enough water, practising a language or going for a run."}, {"type": "image", "content": "https://miro.medium.com/max/3364/1*Ovd4M5sjumjzaOMemEtYKg.png"}, {"type": "sentence", "content": "The Habit Tracker template can be selected from the main sidebar, under ‘Personal’ templates. The template already includes columns for each habit, as well as checkboxes and days of the week (down the left-hand column)."}, {"type": "sentence", "content": "The nature of each habit can be changed by replacing the name of one of the default habits (e.g. ‘Meditate’) to a habit of your choice (e.g. ‘8 Hours Sleep’). More habits can be added by selecting and duplicating a pre-existing column (achieved by dragging across a column and then copy and pasting) or by inserting a new column using the ‘+’ sign towards the top-right of the page."}, {"type": "image", "content": "https://miro.medium.com/max/1864/1*NsFd7fPzIu4MTBtX-MQHVg.png"}, {"type": "sentence", "content": "The days of the week (i.e. Sunday-Saturday) should already appear on the template but a starting point may need to be selected manually. This can be done by selecting the textbox labelled ‘Date’ and picking the appropriate start date from the calendar that appears (as a pop-up)."}, {"type": "sentence", "content": "Once habits and dates have been inserted into the template, you can easily mark a habit as completed each day by selecting the corresponding checkbox, turning it blue with a white tick."}, {"type": "sentence", "content": "These are just a few simple uses for Notion that help me to organise my life effectively. I also use Notion to take notes, track the books, tv shows and films I watch and manage projects, among other things. Please let me know if you found this piece helpful as I am considering sharing some more advanced Notion page layouts (as well as a few tips and tricks) in a later article."}, {"type": "image", "content": "https://miro.medium.com/max/4148/1*d4v60A0yB7s9zHvzT_mOdA.png"}, {"type": "sentence", "content": "In the meantime, you can find a gallery of more Notion page setups here and a breakdown of how productivity guru Thomas Frank uses Notion here."}, {"type": "subtitle", "content": "References"}, {"type": "subtitle", "content": "My newsletter"}], "topic": "productivity"}