{"title": "We Can Go Interstellar by the End of the Century", "data": [{"type": "subtitle", "content": "Breakthrough Starshot: An Introduction"}, {"type": "subtitle", "content": "All that’s needed is to invent a gigawatt laser, and a way to power it."}, {"type": "image", "content": "https://miro.medium.com/max/9184/0*CRBOiGkPQxGNI_-I"}, {"type": "sentence", "content": "A scene like that may not be limited to the realm of science fiction for much longer. If all goes well for Israeli-Russian entrepreneur Yuri Milner, the human race could be receiving pictures from another solar system, Alpha Centauri, by the end of the next century, elevating our species from interplanetary explorers to interstellar ones."}, {"type": "subtitle", "content": "A Very Difficult Journey"}, {"type": "sentence", "content": "To get to Alpha Centauri is a real challenge. At 4.37 light years away it may not seem far, but in fact it’s equivalent to the combined distance of 30% of the world’s population taking a flight from London to Sydney¹ (that’s a cumulative time of over 5 million years!). So to get there and do any meaningful research within a human lifespan, we need to send a probe that travels very fast."}, {"type": "image", "content": "https://miro.medium.com/max/5120/0*ygo7u_sSz1cXcErG.jpg"}, {"type": "subtitle", "content": "The Problem With Chemical Rockets"}, {"type": "sentence", "content": "Spacecraft of today escape Earth’s gravity using chemical-based propulsion, and can achieve speeds of up to² ~23 km/s. This is done by burning fuel, and using the thrust of the exhaust gases to provide an acceleration. The problem with this method is that to achieve greater acceleration (and thus a greater final speed) a larger thrust is needed. And to gain a larger thrust, we need more efficient engines that in turn require more fuel."}, {"type": "sentence", "content": "Unfortunately for interstellar travellers, this process of adding more fuel cannot go on indefinitely. By increasing the fuel reserves at launch, more mass is added, which in turn reduces the acceleration attainable for a given thrust. Because of the low efficiencies (up to 35%) of chemical-based rockets, we will eventually reach a limit where adding more fuel doesn’t increase the final speed, but instead reduces it. This is where Breakthrough Starshot and the solar sail comes in."}, {"type": "subtitle", "content": "What is Breakthrough Starshot?"}, {"type": "sentence", "content": "In 2016 Yuri Milner (along with support from Stephen Hawking and Mark Zuckerberg) founded Breakthrough Starshot, a company dedicated to sending a spacecraft to Alpha Centauri in just 20 years. This would require tremendous velocities of between 15–20% the speed of light which, as we saw above, cannot be obtained with conventional methods of propulsion. So how is the project going to succeed?"}, {"type": "sentence", "content": "Breakthrough Starshot uses a novel piece of engineering called a ‘light sail’, allowing craft to be propelled by the power of an array of lasers. The main body of the probe is only a few centimetres across³, housing processors, antennae and cameras. However this equipment is set at the heart of a four-by-four-metre sail — the source of propulsion."}, {"type": "sentence", "content": "Currently, it seems we don’t have the engineering or technology able to create such craft, but it is hoped that it isn’t far beyond our reach. Research into ‘smart’ materials such as graphene could supercharge development into an ultra-light, ultra-strong sail and the evolution of handheld computing could give us smaller, lighter and more powerful processors."}, {"type": "sentence", "content": "That’s all well and good, but you may be thinking “How can light propel a spacecraft faster than a rocket?” The answer (seemingly as-always) is thanks to Einstein."}, {"type": "subtitle", "content": "Light, E=mc² and Relativistic Momentum"}, {"type": "sentence", "content": "Everyone knows about Einstein’s E=mc². But what most people don’t know is that it actually derives from a more complex equation (see below) which for finding out how a light sail works, is much more useful."}, {"type": "image", "content": "https://miro.medium.com/max/1466/1*LMeguTAE7_ljwmnwvg990Q@2x.png"}, {"type": "sentence", "content": "From classical mechanics, we know that if two mass-bearing objects collide, they will transfer momentum and energy. This could result in a slower object gaining speed from collision with a faster one. But with our light sail, we have a collision involving something mass-less, light."}, {"type": "sentence", "content": "But Einstein showed us photons (quanta, or packets, of light) were only mass-less when at rest. By taking the equation above, and substituting a rest-mass of zero, we get the following:"}, {"type": "image", "content": "https://miro.medium.com/max/504/1*1dEsLBOo00G9kilQ7Gtglw@2x.png"}, {"type": "sentence", "content": "Interestingly, if we then apply the Planck-Einstein relation, we can arrive at a much more useful formula that relates not the energy of a photon to its momentum, but wavelength:"}, {"type": "image", "content": "https://miro.medium.com/max/564/1*3_1CtevAvx15WttAxoSBug@2x.png"}, {"type": "sentence", "content": "Now we’ve shown that light can behave as a particle with mass, it is easier to understand how a collision between our sail and many photons could dramatically propel and accelerate it to 20% the speed of light. Breakthrough Starshot plans to use a ‘phased array’ of lasers to generate enough photons with enough energy to provide the force required."}, {"type": "image", "content": "https://miro.medium.com/max/742/0*vILL1lbpXtAyTXFi.gif"}, {"type": "sentence", "content": "A phased array is simply a collection of much smaller, less-powerful lasers that operate at specific timing and orientation offsets, so as to create the cumulative effect of one high-powered laser. The best estimates for the specification of such an array are in the gigawatt range, with hopes to scale-up to 100 gigawatt capabilities."}, {"type": "subtitle", "content": "So Will We Get There?"}, {"type": "sentence", "content": "I truly hope so. The achievement of visiting another solar system would be a great success for the human race. Not only would it show we have significantly advanced our technology since the space-race of the 20th Century, but it would give us great insight into the viability of mankind off-world. After all, the first step to putting men on the moon was sending an unmanned probe. Thanks to the imagination and foresight of physicists like Yuri Milner and Stephen Hawking we are a step closer to achieving what used to be inconceivable. In the words of Carl Sagan, the famous astrophysicist:"}, {"type": "sentence", "content": "[1] Assuming a flight path of ~17000 km, a world population of ~7.6 billion and a flight time of ~20 hours."}, {"type": "sentence", "content": "[2] One of our fastest long-range spacecraft, the New Horizons probe, reached these speeds on its nine-year journey to Pluto."}, {"type": "sentence", "content": "[3] In contrast, the Voyager probes were around the length of a bus (including booms)."}], "topic": "science"}