{"title": "Practical Productivity Hacks To Work From Home Smarter", "data": [{"type": "subtitle", "content": "Why you should take a nappuccino and other simple productivity hacks."}, {"type": "sentence", "content": "I am a Software Developer. I have been working from home for years. You see, teleworking is one of the perks that come with the job. But conjointly with a crowded house, impromptu home-school, a multitude of distractions and competing demands where both my husband and I are trying to be effective, I had to pull out my best productivity hacks to keep being impactful."}, {"type": "sentence", "content": "Here is how I work from home smarter…"}, {"type": "image", "content": "https://miro.medium.com/max/1264/1*EBqndr60_0cGbWuuWNOS4Q.png"}, {"type": "subtitle", "content": "➊: Take a… Nappuccino"}, {"type": "sentence", "content": "Yes — this is exactly what it sounds like! I first came across the term when I attended a workshop in the City of London where Daniel Pink was promoting his new book, “When: The Scientific Secrets of Perfect Timing”. I thought to give it a ‘‘shot’’ and it was a.m.a.z.i.n.g! Here is how it goes:"}, {"type": "sentence", "content": "When you feel a bit drowsy (normally after lunch) drink a cup of coffee, put your alarm for 25 minutes and take a nap. When the alarm goes off is when the caffeine takes effect and helps you wake up feeling clear-headed; it “resets” your biological clock and improves your cognitive performance. It sounds counter-productive, right? It is not! You will really feel more alert afterward!"}, {"type": "sentence", "content": "☕️ You can download the full guide here!"}, {"type": "subtitle", "content": "➋: Technology to the Rescue"}, {"type": "sentence", "content": "There are lots of productivity apps out there… Occasionally, well-crafted applications change the way we work. The ones below have literally transformed my working life:"}, {"type": "sentence", "content": "— Time Management Insights: Tracking the time you spend on various activities is essential. Clockify is primarily a work hours tracker that helps you monitor the time you spend on projects and collects data that shows how productive you are."}, {"type": "sentence", "content": "— Organised Desktop: I normally have a few tabs open on my browser over a few windows. Along with Outlook, WebEx, Excel (and the list goes on) my desktop becomes too busy, too quick. To keep my workspace organised, my two favourite apps are HazeOver and Magnet. HazeOver automatically highlights the front window by fading out all the background ones. Magnet neatly aligns multiple viewable windows into tiles. They’re both worth every penny, but they are so inexpensive anyway!"}, {"type": "sentence", "content": "— Path of Least Resistance: Every time you fight off a temptation, you spend some willpower points. Simply put: actively resisting the urge to eat a chocolate bar is harder than not having the chocolate at all. So instead of fighting off temptations, you remove them from your surroundings altogether; no temptations, no willpower wasted. I use Timewarp, a Chrome extension which lets you set up different redirections in case you visit an unproductive website during work. You can get redirected to a more productive site, be shown a motivational quote, or be reminded of the time you have spent on it."}, {"type": "sentence", "content": "— Media Blocking: What really puts me off when I browse the internet is Ads. Aside from being intrusive and creepy, they clutter the screen, reduce network performance, and deflect my attention, big time. Ghostery does a pretty good job eliminating them. When Ads blocking is not enough, I use Text Mode which removes any visuals in a page (pictures, videos, etc) and lets me focus on what is important: the text!"}, {"type": "subtitle", "content": "➌: Manage Distractions"}, {"type": "sentence", "content": "Background noise is a very subjective topic, some people prefer absolute silence to concentrate, while others find silence an impediment to their productivity and love a bit of ambient noise. Here are my coping techniques:"}, {"type": "sentence", "content": "— Minimise at Source: My husband and I have different tolerance to noise, so we have created a home office etiquette: we share our schedules in the morning and we let each other know when we are not to be disturbed. This way the noise is minimised at the source 80% of the time. For the remaining 20%, if only there was a simple solution…"}, {"type": "sentence", "content": "— Noise Cancellation: Noise cancelling headphones attempt to fight sound with sound, blocking unwanted sounds with waveforms that are “equal and opposite. Do splash the cash getting a decent pair, and you will not regret it! I have these Sony ones — great quality and very comfortable to wear, even for long periods of time!"}, {"type": "sentence", "content": "— Noise Masking: When the noise cannot be stopped at the source, or cancelled with the headphones, I resort to masking it with other, less distracting sounds. While this is a sub-optimal solution, it is far better than suffering the stress and distraction of pretending to ignore it. These are the tools I live by:"}, {"type": "sentence", "content": "It is not necessarily the distraction itself that is the real issue, but the post-distraction period — distractions derail your mental progress for up to 20+ minutes afterward. Even if you only get distracted a few times a day, the amount of time you lose as you struggle to get back into your happy work place is significant!"}, {"type": "subtitle", "content": "➍: Bring Deadlines Forward"}, {"type": "sentence", "content": "Aristotle coined the phrase, ‘Nature abhors a vacuum’, but fast forward 2000 years, take a look at Parkinson’s Law: work expands to fill the time available for its completion. If you have a week to do a task, you will take a week to complete it. If you have two hours, you will find a way to do it in two hours. Your productivity will soar if you know a deadline is looming. You will come up with ways to simplify it and get it done within the given timeframe."}, {"type": "sentence", "content": "So what I do is bring my deadlines into the nearer future. This gives me a healthy sense of urgency to deliver, which thankfully also frees up time to work on other things. It is a win-win situation."}, {"type": "subtitle", "content": "➎: Find Your Peak"}, {"type": "sentence", "content": "Not all work is equal. Different types of work require different levels of energetic output. You need to uncover what time during the day you are the most productive and effective in, so you tailor your schedule to capitalise on it."}, {"type": "sentence", "content": "Morning, afternoon, evening, or night."}, {"type": "sentence", "content": "I have always been a night owl, but I recently noticed that I make quite a lot of progress early in the AM, before my colleagues come online or my family wakes up. So I make sure I clear my morning diary to power through on the most critical work: anything that involves problem solving and deep thinking. When my energy and engagement levels drop, I prefer to do admin or routine tasks, check emails, have meetings, etc. My creativity kicks back in later in the evening when the house is quiet. This is when I reach a flow state."}, {"type": "sentence", "content": "Whatever works for you, make sure you do not fight your natural energy highs and lows, but work with them!"}, {"type": "subtitle", "content": "Home Sweet … Work!"}, {"type": "sentence", "content": "The right methodology can make your day, every day. The trick is to be smart and intentional about what you need to achieve! I hope these tips have inspired you to supercharge your success when working from home!"}, {"type": "sentence", "content": "Thanks for reading!"}, {"type": "subtitle", "content": "Mind Cafe’s Reset Your Mind: A Free 10-Day Email Course"}, {"type": "sentence", "content": "We’re offering a free gift to all of our new subscribers as a thank you for your continued support. When you sign up using this link, we’ll send you tips on how to boost mental clarity and focus every two days."}], "topic": "productivity"}