{"title": "Reimagining government post crisis — building foundations for lasting change", "data": [{"type": "image", "content": "https://miro.medium.com/max/9796/0*il89PGPAUGuTfrtN"}, {"type": "sentence", "content": "A few weeks ago, I published an article on reimagining government post crisis. Drawing on Adrian Brown’s Manifesto for Better Government, I set out a vision for a shift from “the service paradigm” to “the enablement paradigm”, underpinned by a version of government which: values the importance of relationships; shares power; thinks in systems; leads with humility; and prioritises learning."}, {"type": "sentence", "content": "Donella Meadows defines a paradigm as follows: “The shared idea in the minds of society, the great big unstated assumptions — unstated because unnecessary to state; everyone already knows them — constitute that society’s paradigm, or deepest set of beliefs about how the world works.”"}, {"type": "sentence", "content": "What this definition makes clear is that paradigm shift happens slowly. It is complex. It takes years of shaping and refining ideas, building coalitions of supporters and change agents, and chipping away at the dominant paradigm. It is — as we are now all so used to hearing — a marathon, not a sprint."}, {"type": "sentence", "content": "While paradigm shift is ultimately what we at the Centre for Public Impact (a BCG Foundation) are aiming for, it’s important to recognise that there are other kinds of change that are less dramatic, but also very significant. These are changes which don’t necessarily shift systems, but change everyday practices and processes and which, in doing so, can contribute to more systemic shifts."}, {"type": "subtitle", "content": "Different kinds of change"}, {"type": "sentence", "content": "There are numerous ways to describe these different kinds of change. In a recent article on change in complexity, Luke Craven explains that the word “change” has two roots: one which associates change with transformation; the other which associates change with modification. Kate Wolfenden describes the difference between “systems optimisation” and “systems change” and argues that both are important. Perhaps most famously, Bill Sharpe’s Three Horizons Framework describes three possible kinds of change:"}, {"type": "image", "content": "https://miro.medium.com/max/1540/0*L-NU64ghRjhH7_qj"}, {"type": "sentence", "content": "While my first article set out a vision for the enablement paradigm predicated on transformational change, this article focuses on the less systemic, but nevertheless significant changes taking place in a COVID context."}, {"type": "sentence", "content": "Drawing inspiration from Eddie Copeland’s blog on how local government might build a positive legacy after COVID, I have created a table which captures some of the second-horizon changes we’re witnessing across the five elements of “the enablement paradigm”, and offers some ideas around the legacy these changes might create."}, {"type": "sentence", "content": "However, we cannot assume that these changes will continue as legacies. Change doesn’t always stick. For this reason, we need to be thinking about how to encourage positive changes to endure (and, similarly, how to encourage less desirable changes to recede)."}, {"type": "sentence", "content": "There is an enormous literature on the concept of change, much of which I will no doubt have missed, or perhaps gotten wrong. But, based on my own observations and reading, I offer ten mechanisms which appear to work together to contribute to making changes more permanent:"}, {"type": "sentence", "content": "For each change observed in the table below, I highlight which mechanisms might contribute to making the change stick."}, {"type": "sentence", "content": "I should also note, though, that change goes beyond “mechanisms”. As Abe Greenspoon and I explain in this article on change-washing, “real, genuine change takes individual and group dedication at local levels. It requires occasional insurgency, habitual reflection and constant learning. In other words, teams need to become evolutionary entities that deeply practise new ways of working and are constantly changing.”"}, {"type": "sentence", "content": "Teams, individuals and organisations need to be carving out space for reflection and learning in order to recognise the changes they wish to preserve, identify the mechanisms that might support a permanent change, and define what role they will play in the process of embedding positive changes (and winding back those that are seen to be less desirable). There are some great tools emerging to support this kind of process, such as this discovery and learning tool by Collaborate."}, {"type": "subtitle", "content": "Enablement in action (an Australian story)"}, {"type": "sentence", "content": "The table below sets out changes observed which align with the five elements of the enablement paradigm. It is a consciously “glass half full” list, focusing on positive, rather than negative changes. We all need some good stories to focus on at the moment!"}, {"type": "sentence", "content": "All of the examples are Australian, drawing on insights shared by Senior Officials through the podcast Work with Purpose, as well as conversations with my own networks."}, {"type": "sentence", "content": "These changes, although seemingly low-key, are actually quite profound. COVID has achieved in a matter of months changes which people in Government have been attempting for years."}, {"type": "sentence", "content": "Peter Woolcott AO has observed that, “crisis is delivering on the vision for One-APS in a way that’s never been seen before”, while Andrew Metcalfe AO has noted that he is observing a stronger set of relationships between public service and the rest of the economy emerging as a result of COVID."}, {"type": "sentence", "content": "Finally, Scott Morrison MP has said, “I can’t recall a time in my public life or in public policy where there has been so much [co-operating and engagement] occurring… and I think that’s creating some good habits, good habits that I would hope we would be able to continue in a non-Covid crisis environment.”"}, {"type": "subtitle", "content": "From little things big things grow"}, {"type": "sentence", "content": "The table above makes clear that there are simple, yet significant, changes taking place right now. For those working in and around government who are excited about these developments, now is the time to not only identify the positive changes, but to also think about what role we might play as individuals, teams, organisations, and agencies, in supporting these changes to evolve into ongoing legacies."}, {"type": "sentence", "content": "And while the changes outlined in the table are more “systems optimisation” style changes than true “systems change”, the two are related. Circling back to the Three Horizons framework, Bill Sharpe describes two forms of H2 changes:"}, {"type": "sentence", "content": "As we think about change in the context of COVID, we need to be thinking about how to embed those H2 changes that we want to see stick; not only because want them to endure as discrete changes, but also because they collectively play a role in paving the way for a reimagining of government that is fit to serve us well post-crisis, and beyond."}], "topic": "leadership"}