{"title": "Product over network — Strava’s strategy explained", "data": [{"type": "image", "content": "https://miro.medium.com/max/1478/1*j1J8iotpvjMpsVJqU4VwjA.png"}, {"type": "sentence", "content": "A few days ago, I, like many other athletes across the world, received an interesting note from the founders of Strava notifying us of some changes they were going to make. It wasn’t really clear what was happening until a few paragraphs down when the TLDR became clear — Strava is losing money, many key free features are now going to be only available if you pay, this will help them make money and survive. The main feature that was taken away from free users is the leaderboard for segments, you can no longer compare your performance to others cycling/running the same routes unless you pay. The internet blew up as athletes debated the merits and demerits (most of the feedback…) of the change."}, {"type": "sentence", "content": "In the message, Strava communicated that it was redirecting its strategy to focus entirely on features for paid subscribers. Overall, it was a decent positive spin to the message even if it understandably left most people with a sour taste in their mouth."}, {"type": "sentence", "content": "From a pure numbers perspective, Strava has done a fantastic job scaling users with limited resources."}, {"type": "image", "content": "https://miro.medium.com/max/3960/0*tHangYHtq-PSbT0b.png"}, {"type": "subtitle", "content": "A true freemium social network?"}, {"type": "sentence", "content": "Although displeasure was the theme of the news, I would argue that this move was overall a strong business decision. Strava is taking a markedly different approach from other social networks by doubling-down on monetizing power users through subscriptions as opposed to monetizing through advertisements and taking advantage of the willingness to pay of the B2B side. Facebook is all about ads, LinkedIn is about recruiters (with some ads and user revenue), Strava is all about the paid user experience."}, {"type": "sentence", "content": "In their monetization approach, Strava is less like other social networks, but more like The New York Times or Dropbox, both of which place their monetization emphasis on paid subscriptions. In its choice of monetization model, Strava has implicitly made a point that the value of its product lies more in its features as opposed to the network effects."}, {"type": "sentence", "content": "Strava is more-or-less an advertisement-free experience, for both free and paid users, which makes it quite compelling from a UX perspective. It’s clean and crisp, unlike Mapmyrun which has is a cesspool of ads."}, {"type": "image", "content": "https://miro.medium.com/max/2090/1*vHC1rdsW-cP1csGAeAhYcw.png"}, {"type": "sentence", "content": "Strava does offer businesses some advertising capability through its Strava Business program, but it is really a platform for brands to create pages and build engagement, not a brazen play to push shoes and gear through a frenzy of banner/feed ads."}, {"type": "sentence", "content": "Could Strava have instead increased advertisements in a streamlined manner to stem its losses vs. their current choice of taking away free features? Perhaps — but that’s a discussion for another day. Today we’ll focus on evaluating the financial impact of their recent move."}, {"type": "subtitle", "content": "Baseline Modeling"}, {"type": "sentence", "content": "To understand the impact on profitability, we will construct a back-of-envelope financial model to see what happens to profits under varying scenarios of increases in paid subscribers. For the purposes of this exercise, we will consider only the subscription revenue stream — this is probably oversimplification but our goal isn’t to get exact estimates, just an understanding of the thought process behind the business decision."}, {"type": "sentence", "content": "Strava does not publicly share information on the number of active users, the number of paid subscribers, or cost data related to its P&L. Mark Slovenia has a pretty good (albeit dated) statistical estimate of the user KPIs that we can borrow. We can use these estimates and apply them to today’s user numbers."}, {"type": "image", "content": "https://miro.medium.com/max/758/1*z9KeqZLmE83RXigqBVc8XQ.png"}, {"type": "sentence", "content": "To estimate Strava’s annual revenue from subscriptions, we multiply the # of subscriptions by $59.99/year. to get roughly $70M in subscription revenue."}, {"type": "sentence", "content": "For cost data, we can take a look at the cost of revenue and user counts of publicly traded social networks such as Facebook and Snap to estimate cost per user for Strava. This cost includes the compute and storage costs with delivering the service as well as labor associated with it. This is a bit tricky to model as SNAP only provides DAU counts while Facebook provides both DAU and MAU while our Strava number is an estimate of 24 days active use, to simplify we’ll just assume that our 24-day active user estimate is comparable to a DAU (big leap of faith here, I know). Snap has a COR/user of about $4.11 and Facebook is $7.65 — let’s say Strava is about in the middle of that at $6."}, {"type": "sentence", "content": "For fixed costs, let’s assume that employee costs are the main cost and that 75% of them are not non-operating (so not included in cost of revenue) and that a fully loaded cost of an employee is $175k for a total cost of around $30M."}, {"type": "image", "content": "https://miro.medium.com/max/952/1*AeUyjHCbwod_QW4IG46LNg.png"}, {"type": "sentence", "content": "Plugging in all these numbers you get a net loss of about $3.7M/year. This is probably on the low side of things but I think it’s a reasonable gut check and can’t be that much higher than that (up to $10M?) given that they’ve only raised $41M and their last check was a Series E in 2017 of ~$13M. It’s still a relatively tame number compared to the losses racked up by startups such as Doordash and Lyft that are heavy on customer acquisition and operational investment."}, {"type": "sentence", "content": "Our model excludes potentially large items such as marketing and real estate costs, but we’re leaving them out to simplify the thought process."}, {"type": "subtitle", "content": "Paid Conversion Balancing Act"}, {"type": "sentence", "content": "The obvious goal of taking away free features and making them paid is the hope that a percentage of people who weren’t paying before will pony up the $60/year because they realize that the features they lost and the additional benefits of a subscription is worth it. But how many will convert? To better understand this, let’s try and segment Strava’s users."}, {"type": "sentence", "content": "We can roughly segment Strava’s customers into three segments."}, {"type": "sentence", "content": "Estimates of each segment size can be found below. I assumed that roughly 1/3 of athletes paid and backed out all other numbers from there using the data referenced in the previous sections."}, {"type": "image", "content": "https://miro.medium.com/max/756/1*I9b1LT9OWo0GKUf0jpXjWA.png"}, {"type": "sentence", "content": "Strava probably realized #1) it was very unlikely to turn lapsed and casual users into paid athletes and #2) a lot of athletes were not paying and there was an opportunity to convert them into paid users. We will do some modeling later on to estimate the financial impact of increasing the % of paid users."}, {"type": "sentence", "content": "Will Strava athletes convert? $60/year is $5 a month or as Strava likes to put it, a bag of granola a month which isn’t much especially for the upscale cycling/running cohort that can drop $$$ on gear/races/lattes/etc if you look at it from that perspective. If you compare it to your Netflix subscription then maybe the bang-for-buck isn’t quite as impressive given the time on the platform. For Strava though — it is a significant amount of money given that it is recurring revenue if the product sticks."}, {"type": "sentence", "content": "Let’s also take at one of the biggest potential risks of taking away free features in hopes of pushing people towards paid which is what if the non-paying athletes simply decide to leave the platform? If they do, this also would impact the already paying athletes and may cause them to churn as a lot of the positive network effects they pay for are a result of the community of athletes they compete with."}, {"type": "sentence", "content": "This is a big risk, but I think the likelihood of it happening are quite low given that Strava is a significantly better app among multiple dimensions than any of its competitors. Athletes simply do not have a great BATNA (a better alternative to a negotiated agreement)."}, {"type": "subtitle", "content": "Lagging Competition"}, {"type": "sentence", "content": "Strava’s competition can be bucketed into two main groups. Hardware-centric competitors (Garmin, Apple, Fitbit, etc.) and brand-centric (UA Connected Fitness, Asics Runkeeper, Nike Run Club). All of these have significant flaws that make them much inferior to Strava."}, {"type": "sentence", "content": "For the hardware-centric, the software is tied to a specific device. They typically have very robust and capable apps as their engineering is strong but their network growth and strategy are inherently limited by device sales which are the primary source of revenue."}, {"type": "sentence", "content": "For the brand-centric, this is where it gets a bit weird. Most of these applications (outside of Nike) were originally software companies but were acquired by a footwear/apparel brand. UnderArmour seems to have gone on a large random tech acquisition spree and their platform has now become a confusing array of apps of varying quality. Brands might have figured that acquiring apps would help them build a community around their brand, but it is an inherently limiting approach for network building as true athlete communities transcend an individual brand. Moreover, the software quality offered by these players is in my opinion, very mediocre."}, {"type": "sentence", "content": "The chart below is a quick analysis of the different competitors in the space."}, {"type": "image", "content": "https://miro.medium.com/max/1654/1*RhKajb-mqo8Vrd8CEOyRVw.png"}, {"type": "sentence", "content": "Strava’s “moat” is tall as it is multiple pillars to stand on. The product (UX/UI, features) is strong, it is platform agnostic (works with Garmin/Fitbit/Apple/Peloton/you name it), has a large developer ecosystem of integrated apps (~44k), tracks all activities (Run? Bike? Golf?), and as a result, its network is much bigger than any competitors. All of these combined make me think it’s very unlikely you’ll see many athletes leave the platform given the myriad of benefits Strava offers."}, {"type": "subtitle", "content": "Computing Cost Savings?"}, {"type": "sentence", "content": "One of the points in Strava’s email to users that was particularly interesting to me was the following “a few of our free features that are especially complex and expensive to maintain, like segment leaderboards, will become subscription features”."}, {"type": "sentence", "content": "I’m not very familiar with the details of computing costs, but I’m wondering how much money Strava is estimating they’ll save by restricting these features to paid users and if it was part of their calculus for this business decision. I’m skeptical about this claim but will work into the model regardless and assume the strategy targeted both revenue and cost upside."}, {"type": "subtitle", "content": "Putting It All Together"}, {"type": "sentence", "content": "We can now put together a sensitivity analysis with both paid subscriptions increases and cost savings to gauge the impact on the profitability of the change."}, {"type": "sentence", "content": "The needle moves fast and is very sensitive especially for paid conversions, even a small increase from the current 2.3% paid to 2.5% and turns a $3M loss into profit. The pure margins on a paid subscription are very high — they just have to subsidize the free users."}, {"type": "sentence", "content": "If Strava’s bet pays off, they’ll be able to profit and most likely invest that profit into building out more impressive paid features to drive conversion and retention upwards. From the tone of their email, it seems like this is the direction they are headed and taking a big bet on product vs. network in this move. Will it work out? Time will tell."}, {"type": "sentence", "content": "Personally, I’m currently signed up for the free trial of premium and I think I’m going to keep it :)"}], "topic": "business"}