{"title": "Down and Out on the French Riviera", "data": [{"type": "subtitle", "content": "Meditation, mindfulness, and the importance of place."}, {"type": "subtitle", "content": "I started meditating in France."}, {"type": "sentence", "content": "Every morning, I would step out onto the huge balcony, carpeted with fake green grass. The Southern sun would already be hot and strong, even in winter. The retractable awning hummed as I lowered it, settling myself into the rented wicker furniture to close my eyes and focus on my breath."}, {"type": "sentence", "content": "It was a great place for it. The sun and the sky were always perfect, as though each gorgeous day was a repeat of the last. From our balcony, you could glimpse the sea, a lively azure shimmer between apartment buildings. It was the kind of outdoor space people dream of, beloved of exhibitionist couples on those mind-numbing house-hunting shows."}, {"type": "sentence", "content": "And it certainly beat the inside of the cramped apartment I shared with my wife and our cat. The small space was made even smaller by the French penchant for keeping the toilet in a separate room from the rest of the bathroom."}, {"type": "sentence", "content": "A Bitcoin minor I had christened Anton roared in the living room, jettisoning hot air through a dryer hose as it slowly turned electricity into money. Too slowly. We were next to broke. Supporting ourselves on cryptocurrency and online gambling and knowing there was no future in either."}, {"type": "sentence", "content": "That was why I started meditating in the first place."}, {"type": "subtitle", "content": "Breathing occupies a strange place in the physical processes that keep us alive."}, {"type": "sentence", "content": "Neither totally involuntary nor completely voluntary. Just reading about it now probably has you consciously inhaling and exhaling as though your life depends on it. But try to stop it, and eventually, your body will take back control. An expensive toy you can’t be trusted with. No wonder we can’t control our hearts at all."}, {"type": "sentence", "content": "When you focus on your breathing, it feels as though you’re sucking air in. As though your gaping greedy mouth is tearing off a scrap of that bright Southern sky to swallow whole."}, {"type": "sentence", "content": "That isn’t true at all. When we breathe, we expand our chests, pushing out our creaking ribs to open ourselves up. The pressure drops. And then the universe happily rushes in."}, {"type": "subtitle", "content": "The French Riviera is famous."}, {"type": "sentence", "content": "We lived as paupers in paradise, hustling in our tiny apartment a few steps from the port when megayachts sat like misplaced icebergs on the glassy water. All the money in the world flows through here, rolling like a gentle wave from oligarch to floozy, from junkie to dealer, from tourist to translator, and back again."}, {"type": "sentence", "content": "On my nightly walks along the waterfront, I would pass the hotel where Scott and Zelda stayed, clinking glasses and Charlestoning their way toward tragedy."}, {"type": "sentence", "content": "And the delicate evenings were exquisite. Over the low murmur of the city, the solid thunk of petanque balls echoed. Even in winter, it was generally warm enough to sit outside, and the few sidewalk cafés that stayed open buzzed with life."}, {"type": "sentence", "content": "No need to envy the wineglasses and plats du jour; the same view was mine for free. The bright blue gulf collected every scrap of sunlight and shot it back toward the city in a thousand rippling wavelets so that the last light of the day danced under the distant blue mountains with night rolling slowly down their flanks."}, {"type": "sentence", "content": "This kind of beauty can change your mindset. You find yourself looking more kindly on the world. Everything is quiet and calm, even the sea that sleeps at the edge of town."}, {"type": "sentence", "content": "When the inch-long thorn of a cactus draws blood from your finger, you know it’s your fault for touching it. You can’t stay mad at it when it bears the names of young lovers carved into its broad round limbs."}, {"type": "sentence", "content": "There’s nothing magical about breathing, apart from the fact that it keeps you alive. The only reason meditation is built on awareness of breathing is because it’s something you take with you wherever you go."}, {"type": "sentence", "content": "The gentle rhythm of your expanding and collapsing chest. The soft sigh of breath like a tiny internal ocean. The constant exchange of gases that forms one of many interfaces between the universe and you."}, {"type": "subtitle", "content": "The place shouldn’t matter."}, {"type": "sentence", "content": "You will be who you are in the south of France, just as you will be on a frozen lake in Alberta or an industrial estate outside Leeds. The TV couples like to fantasize entire new lives for themselves, drinking their coffee on the balcony every morning as though they ever have that kind of time."}, {"type": "sentence", "content": "Meditation doesn’t require a special type of chair or a certain room or a particular kind of music or a vagina-scented candle. Nor does creativity. I’ve always insisted on having a room to write in that I don’t contaminate with the dirty business of making money, but some of my best writing has been done on trains or planes or on park benches far away from whatever dingy corner I’ve carved out for myself."}, {"type": "sentence", "content": "The place shouldn’t matter. But if I really believed it didn’t, I would never travel again. You can learn all you need to know about the world through Google if all you’re interested in is facts."}, {"type": "sentence", "content": "What we crave is the lived experience of a place, the totality that only comes from being there. It’s not the sound of the waves or the smell of the eucalyptus or the warmth of the sun on your skin. It’s all of those things, and it’s the combination of them in unique and specific ratios that makes a place what it is."}, {"type": "sentence", "content": "No photo, no video, no virtual reality can replicate that. It’s the world rushing into you, through you, overwhelming you until you forget yourself and become another part of It."}, {"type": "sentence", "content": "Meditation can get you there, to the bright burning point where you start to forget that you exist and become free. So can art. So can travel. But the best method of all, I learned on my sunny balcony in the south of France, is a combination of all three."}, {"type": "subtitle", "content": "A thought-bright neuron buried in your brain is as much a part of you as an ingrown toenail."}, {"type": "sentence", "content": "The world is like that too. Every paradise has its shadow. Every heaven suggests a hell. But often when we travel, it’s the hell we bring with us that is most to be feared."}, {"type": "sentence", "content": "Every living thing needs to feed. There’s nothing more natural than that. In humans, it’s been abstracted into the quest for money, but the impulse is the same. It’s a cliché to say there’s more to life than money; we all know that. But when you don’t have enough, it’s hard to think of anything else."}, {"type": "sentence", "content": "On the balcony in the sunshine, I inhaled and exhaled hot air along with Anton. And slowly, breath by breath, I learned how to forget how poor we were. How much we needed. How much there was to fear."}, {"type": "sentence", "content": "With embarrassing slowness, I began to relax into the bright burning experience that lay all around me. The life I had always wanted and had forgotten to enjoy once it arrived."}, {"type": "sentence", "content": "And all along the route I followed on my evening walks, the sea said the same thing. There is no tomorrow to worry about, it whispered as it saturated the sand, swirling like light around the bright base of the deactivated outdoor showers. There is only today."}, {"type": "image", "content": "https://miro.medium.com/max/300/1*bIGNYQiK3AOJQC177DxeOg.png"}, {"type": "sentence", "content": "This story is published in Writers on the Run. If you’re interested in submitting your travel stories please visit our submission guidelines."}], "topic": "travel"}