{"title": "The Curious Case of Chuck E. Cheese — AKA Pasqually’s Pizza and Wings", "data": [{"type": "subtitle", "content": "Rebranding as business survival or guerrilla marketing?"}, {"type": "image", "content": "https://miro.medium.com/max/9856/0*MST4VDa7HPGM6G0p"}, {"type": "sentence", "content": "Chuck E. Cheese is a venerable chain of family entertainment/restaurants that has been a staple of kids’ birthday parties for decades."}, {"type": "sentence", "content": "My childhood memories are littered with birthday parties at Chuck E. Cheese — a wonderland filled with videogames, jungle gyms, and ball pits, as well as pizza."}, {"type": "sentence", "content": "It was essentially a non-alcoholic, child-friendly version of Dave and Busters."}, {"type": "sentence", "content": "I loved it. I hadn’t thought about it in years."}, {"type": "sentence", "content": "And yet, Chuck E. Cheese was trending on Twitter on Monday morning after certain users discovered the chain had re-branded itself on delivery app GrubHub, in order to win more business for its takeout pizza and other junk food."}, {"type": "sentence", "content": "It was now…"}, {"type": "subtitle", "content": "Pasqually’s Pizza and Wings"}, {"type": "sentence", "content": "Obviously, this revelation was tailor-made for Twitter."}, {"type": "sentence", "content": "Folks were quick to criticize Chuck E. Cheese for effectively attempting to catfish unsuspecting customers into ordering its sub-par food."}, {"type": "sentence", "content": "It turns out this charade had been going on for at least a month."}, {"type": "sentence", "content": "The story of Pasqually’s broke on Reddit back in April and was the subject of a brilliantly snarky write-up in Food & Wine."}, {"type": "sentence", "content": "The new name has a connection to the original brand as well — Pasqually P. Pieplate is the name of the fictional (human) chef and friend to Chuck E. Cheese, the titular cartoon mouse."}, {"type": "sentence", "content": "Better still, when the writer for Food & Wine reached out to Chuck E. Cheese for comment, a spokesperson played off the new name as the legitimate launch of a sister brand, saying:"}, {"type": "sentence", "content": "“… It is a different pizza that features a thicker crust and extra sauce, giving consumers a more flavorful, more premium pizza experience. While Pasqually’s Pizza & Wings recipes are currently only available for delivery, select items might be added to the Chuck E. Cheese menu in the future.”"}, {"type": "sentence", "content": "Whether this was a legitimate attempt to re-brand as a viable take-out restaurant or just a brilliant piece of guerrilla marketing, Chuck E. Cheese achieved remarkable marketing lift from the stunt and did the impossible — it got people talking about them again."}, {"type": "sentence", "content": "Either way, Chuck E. Cheese himself should be careful, as the cat’s now out of the bag."}, {"type": "subtitle", "content": "Payless Or Palessi?"}, {"type": "sentence", "content": "This is not the first time in recent years that a major discount brand has launched a fake, higher-end sister brand."}, {"type": "sentence", "content": "Payless ShoeSource made headlines in November 2018 when it opened a fake luxury store in Los Angeles called Palessi. They then invited 60 fashion influencers to the store’s soft launch, granting them exclusive early access to the luxury shoes — priced as high as $600+ a pair."}, {"type": "sentence", "content": "In reality, every one of the items on sale retailed at Payless for $19.99 — $39.99."}, {"type": "sentence", "content": "The fashion influencers were duped — and many were even quoted on camera raving about the quality of their newly-bought wares — before being informed that they had just spent hundreds of dollars apiece on common (and far cheaper) Payless items."}, {"type": "sentence", "content": "PR firm DCX Growth Accelerator masterminded the Palessi campaign, which included not just the storefront in the high-end mall, but also the creation of a website for the fake luxury brand."}, {"type": "sentence", "content": "In this case, the stunt was short-lived, as the Payless team informed the influencers that they had just been duped before they left the premises (and, refunding their money, naturally)."}, {"type": "sentence", "content": "But as a marketing stunt? It was both brilliant and effective."}, {"type": "sentence", "content": "The story of Palessi was covered in outlets including ABC News, CBS News, The Washington Post, Elle, AdWeek, Vox, and many more — and just in time for the holiday season."}, {"type": "sentence", "content": "While this was a clear win for the brand in the short term, it did not save the company."}, {"type": "sentence", "content": "In February 2019, the brand confirmed it would close its stores — by July 2019, all 2,100+ locations in the U.S. and Puerto Rico were gone."}, {"type": "subtitle", "content": "Ice Tea Distributor Or Bitcoin Speculator?"}, {"type": "sentence", "content": "A third example of successful marketing via a re-brand came in 2017 when Long Island Ice Tea Corp. changed its name to Long Blockchain Corp."}, {"type": "sentence", "content": "The was the height of the blockchain bubble — when Bitcoin was trading at more than $19,000."}, {"type": "sentence", "content": "The day Long Island Ice Tea Corp. announced its name change, its share price shot up 500% in pre-market trading. In addition to changing its name (and website URL), the company claimed that this was a true strategic pivot."}, {"type": "sentence", "content": "Long Blockchain said that it would continue to sell non-alcoholic ice teas and lemonades as a subsidiary, but its primary focus would be on partnering with companies involved in blockchain technology."}, {"type": "sentence", "content": "The claim was short-lived."}, {"type": "sentence", "content": "Less than two months later, Long Blockchain admitted it was not close to closing any blockchain-related partnerships, and its stock price had fallen 50% from the heights it had achieved the day it simply announced the name change."}, {"type": "sentence", "content": "And by last summer, the FBI was investigating the company on charges that the name change and “strategic pivot” was simply a charade to mask a complex insider trading scheme."}, {"type": "subtitle", "content": "Lessons"}, {"type": "sentence", "content": "The first critical step in marketing is simply building customer awareness — to get people to not only recognize — but also talk about — your brand."}, {"type": "sentence", "content": "And building awareness is more challenging than ever in this age of declining attention spans, and the increasing influence of social media, influencers, and pure information overload."}, {"type": "sentence", "content": "It’s truly difficult to break through the noise."}, {"type": "sentence", "content": "But two of the three stories above illustrate that the re-brand campaigns were born of desperation rather than creativity — these were not just brilliant marketing campaigns, they were also the last gasps of struggling brands."}, {"type": "sentence", "content": "Truly brilliant marketing requires creativity, but not in a way that either ignores or alienates your core customer base."}, {"type": "sentence", "content": "And if the business fundamentals aren’t sound, to begin with, no amount of clever marketing will save you."}], "topic": "business"}