{"title": "Can the Jersey Shore Survive a Pandemic Summer Without Overseas Workers?", "data": [{"type": "subtitle", "content": "A lack of Summer Work Travel participants could be a major blow to beach town economies"}, {"type": "sentence", "content": "Stitched together by lacy causeways and humpbacked bridges, the islands along the southern coast of New Jersey tend to be bubbles hardened over generations of summer migration — same faces, same places, year after year. Going down the Shore can be a healing tonic, one many are extra-thirsty for following months of anxiety and uncertainty surrounding Covid-19. But visitors may find a different place waiting for them at their exit off the last 30 miles of the Garden State Parkway this summer because the novel coronavirus has imperiled the Summer Work Travel Program, the reliable source of labor that keeps the Shore’s economy turning."}, {"type": "sentence", "content": "The SWT program started in 1961 as a division of the State Department’s J-1 visa and brings tens of thousands of overseas college students into the country each year. The students fill seasonal jobs, with a period of free time at the end of the summer built in for traveling around the U.S. Many different countries participate, but as the Jersey Shore goes, students mostly travel from Balkan and former Soviet nations. The J-1s are so woven into the fabric of the Shore community that it would be more surprising to hear “Rainbow or chocolate jimmies?” at the Kohr Bros.’ soft-serve stands in an American accent instead of a Bulgarian one."}, {"type": "sentence", "content": "As with all J-1 programs, SWT falls under the jurisdiction of the State Department’s Bureau of Educational and Cultural Affairs, but because it’s funded by private-sector sponsors, it’s not subject to the lockdown of the other of the federally funded ECA programs instituted on March 12. However, “EAC strongly recommends that all [Exchange Visitor Programs] sponsors follow ECA COVID-19 guidance, including postponing program start dates for 60 days after March 12, 2020,” according to a U.S. Department of State official. As of May 12, the stay has been extended, and “all ECA funded in-person programs will remain paused until further notice,” according to the State Department’s website."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*H-l9XJzQGq8wvnvmJLyq0w.jpeg"}, {"type": "sentence", "content": "Despite the president threatening to jettison the SWT program as part of the stream-of-consciousness immigration strategy that marked the infancy of his administration, the program remained relatively stable between 2016 and 2018. “It’s withstood that because there is a heavy lobby for this in Washington,” said Joe Bogle, owner of the Fudge Kitchen, the iconic Shore confectionary with locations in Cape May, Wildwood, Stone Harbor, and Ocean City. “Trump has J-1s working for him,” or at least he did at his Chicago hotel in 2016. His resorts and golf clubs also sponsor foreign workers every year through the more tightly regulated H-2B visa program."}, {"type": "sentence", "content": "Bogle sat on a bench in front of the flagship Fudge Kitchen on Cape May’s idyllic Washington Street Mall, while his nephew, Kyle, whipped fudge in a copper kettle inside the shop. He calls the Summer Work Travel program “one of the best things we’ve ever done” and has been sponsoring J-1 students every summer since the 1980s. “As much as I would like to see them, we need everybody to be safe and healthy. That has to be a priority.”"}, {"type": "sentence", "content": "Still, Bogle is sober about the potential financial impact. Fudge Kitchen has been operating with a skeleton crew and subsisting on online orders and curbside pick-up since Easter, “but we won’t be able to survive without [the J-1s] if this ever ramps back up.”"}, {"type": "sentence", "content": "He swept an arm to encompass the desolate pedestrian boulevard stretching between Our Lady Star of the Sea and luxurious Congress Hall hotel, both of which were closed, along with all the shops in between. Under normal circumstances, “This would be packed,” Bogle said. Day and weekend tourism has been nonexistent this spring, and while some second homeowners decamped to the beach early in the pandemic (to some locals’ ire) others waited out the controversy, pushing their typical home reopenings (and discretionary spending) from March and April to May and beyond. Add to that the many questions — Are the beaches open? Can I book an Airbnb? — with answers that shift like a riptide, and the cumulative effect has been an unseasonable chilling of the Shore’s economy just as Memorial Day weekend nears. The uncertainty surrounding the J-1s’ arrivals is the kick when Shore businesses are already down."}, {"type": "sentence", "content": "Lori Lane, manager of Two Mile Landing, a sprawling seafood juggernaut on the causeway between Wildwood Crest and Cape May, sent out 45 J-1 sponsorships this year. “Of those, four students were able to get their visas before the [American] embassies shut down in their respective countries.”"}, {"type": "sentence", "content": "Even if business at the Shore is lighter than normal this summer, restaurants like Two Mile can’t staff up appropriately without the overseas workers it counts on every year. “You can interview till you’re blue in the face, but you’re not gonna have 40 bussers apply,” Lane said. “Especially in Cape May County, we have such a small pool, it’s laughable to think we can hire [entirely from the local population].”"}, {"type": "sentence", "content": "The number of SWT participants in the 13 coastal New Jersey towns from Cape May to Atlantic City has fluctuated year over year between 2016 and 2019, but the differentials haven’t represented major swings: down 5.3 percent from 2016 to 2017; down 3.2 percent from 2017 to 2018; up 13.3 percent from 2018 to 2019, according to statistics shared by the State Department. When summer 2020 is over and the data emerge, the decline will likely resemble the first drop on the Great White wooden roller coaster on the Wildwood boardwalk."}, {"type": "sentence", "content": "“It’s going to be financially devastating, but it’s also sad for the students to lose this opportunity,” Lane said. “It’s an admirable thing to watch these students from all over the world become a community.”"}, {"type": "sentence", "content": "For now, June 15 seems like the earliest date J-1s could arrive in Cape May County, but there are a dozen other unpredictable factors that could lengthen the delay, from restricted air service to university schedules. Some of Lane’s J-1s are now in school through July, when she’ll be up to her eyeballs in Orange Crushes and all-you-can-eat crabs. Then multiply each factor by 20, because, “You’re not talking about one country; you’re talking about a ton of countries,” she said. “And then the president needs to let them come.”"}, {"type": "sentence", "content": "There’s a flipside to consider, as well: Even if a path is cleared for students, they may not feel safe traveling to the U.S., where Covid-19 cases and deaths continue to climb as the White House has served up a sundae of deflection and disorganization with conspiracy sauce and a hydroxychloroquine cherry on top. While J-1 workers scoop an awful lot of ice cream at the Jersey Shore, that’s one dessert America is capable of building all by itself."}], "topic": "business"}