{"title": "How Are You Managing Your Lack of Grief?", "data": [{"type": "subtitle", "content": "Nearly 100,000 Americans have died from COVID-19. Why doesn’t it feel like it?"}, {"type": "sentence", "content": "We’ve all seen the daily news briefings from our mayors, governors and the White House. We’ve all seen the tragic tweets about spouses, parents and friends succumbing to the illness. We’re all probably at most two degrees away from someone who has been diagnosed with COVID-19."}, {"type": "sentence", "content": "This is merely 1,000 victims — their lifetimes summed up by their city of residence and four-to-six-word epitaphs. There are 100 more front pages to be filled with the names of the dead. It is a tribute that is at once both stirring and sobering, especially when you realize that almost none of these people or their families were allowed the luxury of a proper funeral."}, {"type": "sentence", "content": "So why is that a school shooting or a terrorist attack or a fatal accident — which usually impacts only a fraction of the people who have been affected by COVID-19 — gets so much more tangible sympathy and grief from the public at large and has such a personal effect on me?"}, {"type": "sentence", "content": "Perhaps I am only speaking for myself (I doubt it), but I believe the astronomical number of casualties combined with the weird, solitudinous state of sheltering in place for the last couple months has given COVID-19 the psychological feel of a sad movie, not a real event that is plunging so many of our fellow humans into authentic, unassuageable grief."}, {"type": "sentence", "content": "More often than not, I feel a social distance from the reality of the pandemic."}, {"type": "sentence", "content": "It’s easy to jabber over the fence with your neighbor about the inconvenience of it all, as we sit in our comfortable homes with our healthy families."}, {"type": "sentence", "content": "It’s natural to pine for the bygone days of concerts and movie theaters and sitting down to eat at an actual restaurant."}, {"type": "sentence", "content": "It’s fun to post and reshare the clever corona-inspired memes of the day."}, {"type": "sentence", "content": "It’s therapeutic to partake in the latest viral “challenge” that is helping to pass the time and offer some semblance of social — albeit digital — interaction."}, {"type": "sentence", "content": "But then the front page of the New York Times hits your feed."}, {"type": "sentence", "content": "Suddenly all of the above seems so selfish and insignificant when you realize that you could just as easily be finding four-to-six words to sum up the love of your life. Or maybe someone you love could be summing up yours."}, {"type": "sentence", "content": "People are dying. People’s mothers are dying."}, {"type": "sentence", "content": "Yesterday — before I even saw this New York Times edition — one of my former journalism students shared a terse, stoic Facebook post reporting the COVID-19-related death of her mother. She was 64 and immunocompromised because she had rheumatoid arthritis. Her family spent Mother’s Day watching her via videocall while she labored unconscious on a ventilator."}, {"type": "sentence", "content": "I will gladly wear a mask to protect my mother and yours. Please pay me the same courtesy."}, {"type": "sentence", "content": "As the memes have so aptly shown us, 2020 has canceled all of our plans. Tragedy abounds in big and small ways — from canceled vacations, graduations and weddings to lost jobs, mental health issues and an incomprehensible number of deaths."}, {"type": "sentence", "content": "I’m not saying you shouldn’t be sad about the big and small ways the pandemic has changed your life or your plans, I’m just saying that we need to take a moment to fathom the extent to which human lives have been lost in this battle and actually grieve for them."}, {"type": "sentence", "content": "Let the enormity of the tragedy become personal for you in a way that perhaps it thankfully has not previously."}, {"type": "sentence", "content": "Stop searching for the big answers that you can’t control and start doing the easy things that you know you can. Start acting in ways that will protect those you love as well as those you’ve never met, even if it means your glasses will steam up from your mask in the grocery store or your kids can’t hang out with their friends on a beautiful day in May."}, {"type": "sentence", "content": "Stay home. Wash your hands. Wear a mask."}, {"type": "sentence", "content": "Pray for the dead. Pray for the living. Donate to charity. Call your Mom."}, {"type": "sentence", "content": "Keep on living, and help keep others alive."}], "topic": "mental-health"}