{"title": "Party Like It’s 1939?", "data": [{"type": "sentence", "content": "It is difficult to remember that our present circumstances, however we characterize them, are influenced by our past circumstances, or our remembrance of them. So, it is with the looming double crises that now face the United States and, by extension, humanity: a physical threat to U.S. lives, and an economic crisis rivaling that of the 1930s."}, {"type": "image", "content": "https://miro.medium.com/max/5736/1*bM4HksT9yBmoAxkqPI19Ug.jpeg"}, {"type": "sentence", "content": "Recall that one of the greatest disasters to befall the world in the 20th century was the hijacking of a prosperous, industrious, sophisticated state by the National Socialist Workers’ Party, led by an unstable megalomaniac named Adolf Hitler. Most Americans are crudely familiar with a history which goes something like this: ‘Once upon a time there was a crazy dictator named Hitler, who took over Germany and led the country to a war that the United States won, with some help from the Soviet Union and Britain. During the war, Hitler tried to kill all the Jews, succeeded in killing six million of them in gas chambers before the war ended, and afterward, Hitler committed suicide.’"}, {"type": "sentence", "content": "Note that this cartoon-history of World War II in Europe is matched by an equally cartoonish history of what we now call the Pacific War: ‘On a Sunday morning in December of 1941, the evil Japanese launched a sneak attack against the U.S. 7th Fleet at Pearl Harbor, killing thousands of sailors and sinking several U.S. battleships. The next day the U.S. declared war on Japan and after a stunning victory at the Battle of Midway in June of 1942, the U.S. Marines and U.S. bombers pushed the “Japs” back to the main islands of Japan and unleashed two atomic bombs on Hiroshima and Nagasaki, thus ending the war in August of 1945.’"}, {"type": "sentence", "content": "More educated readers will recognize both the truths in each account, and the glaring mischaracterizations and omissions as well, but the point is that if this is the extent of most voting Americans’ understanding of how and why WWII was started, fought, and ended, current events and public reaction to these become less puzzling."}, {"type": "sentence", "content": "For example, by 1930, Weimar Germany — then in the grips of the Great Depression which had its proximate start in the United States — was a multi-party state that rapidly polarized into Communist and Fascist parties. The Communists aimed at a revolution which would eliminate income inequality, redistribute income, and give German workers unprecedented welfare benefits; the Fascists promised to redress Germany’s ‘humiliation’ from World War I (to make Germany great again), re-establish law and order, and purge Germany of undesirables, including Jews and foreigners of color."}, {"type": "sentence", "content": "Sadly, a comparison of today’s politics and the political economy of the 1930s becomes a fascinating déjà vu experience. All the elements that sped the world toward world war are here today, as they were then. Two critical differences? First, in the 1930s the polarization of polities into far Left and far Right followed the Great Depression and did not precede it. Second, that polarization did not happen in mature democracies."}, {"type": "sentence", "content": "History is, of course, profoundly political, so one educated person’s understanding of it will differ from another’s even when each is presented with the same basic set of facts. For example, one version of recent history goes like this: ‘In 2008, after decades of attempting to reform U.S. politics by reducing regulation of industry and taxes on the wealthy, Republicans in the U.S. caused a massive global economic crisis due to unregulated speculation in the U.S. housing market. Dated and creaking safety valves that had been instituted to prevent another Great Depression were engaged; and these succeeded in preventing the recession from becoming a global depression, but the most striking feature of the recession was that neither those responsible for it, nor the debunked economic theories which underpinned the policies that led to it, were held accountable. On the contrary, the new ‘liberal’ administration of Barack Obama was left to attempt a costly and difficult recovery as its first task in office. The recalcitrance and mendacity of the Republic Party of the time led to a strategy of ‘just say no’ to any ‘liberal’ legislation. This led to gridlock, which in turn created an environment in which centrist or conservative voters began to yearn for a strong executive who could break the impasse in party politics. This yearning for an authority figure to help us out of our problems then created circumstances favorable to the election of a U.S. strongman, who would by definition have to be a candidate on the political Right.’"}, {"type": "sentence", "content": "But we needn’t accept this version of history as correct in order to predict what may happen next in 2020."}, {"type": "sentence", "content": "First, the economic crisis which we’re experiencing now will intensify public demand for a strongman, and may result in the re-election of Donald J. Trump, an arguably unstable narcissistic megalomaniac, at the helm of the most prosperous and militarily powerful state on the planet. Second, the blame for our economic crisis will not land on those most responsible: Xi Xinping of China, whose authoritarian regime allowed the novel Coronavirus to escape Wuhan and lied about it; and Donald J. Trump, whose administration both gutted U.S. capacity to respond to a pandemic threat two years ago, and whose colossally incompetent response to the arrival of the virus on U.S. shores made it impossible to contain. Instead, blame will be lain, with the help of Fox News, on ‘libdems’ or ‘demrats’ (read: Obama, liberals, socialists, and communists), foreigners (see: Trump’s initial insistence on referring to COVID-19 as the “Chinese virus”), and immigrants writ-large."}, {"type": "sentence", "content": "Unlike the 1930s, the U.S. is already politically polarized well before the great depression we’re now sliding into. The ability of responsible journalists, or leaders in local, state, and federal government to elucidate the causes and consequences of the pandemic are severely hamstrung by social media, which directly and systematically misleads; either by design (think of Russia’s fantastically successful interventions in British and U.S. politics in 2016), or by flooding us with so much information that we cannot decide what to pay attention to or whether what we are seeing or reading is real. Fox News is a fascinating case in point: in a normal crisis, its relentless editorial messaging (the Right is always right) masked as journalism is harmful, yes, but in a pandemic, it’s lethal — most particularly to its own core constituency, which by-and-large trends demographically older, less educated and more rural."}, {"type": "sentence", "content": "Coming full circle, we see the strong possibility that overlain with a pandemic, an economic crisis, originating in the United States, causes a global economic depression, further polarizing the polities of democratic states into far Left and far Right parties. Checks and balances fail in an environment where everyone yearns for a strong leader to get us past a current crisis, and the political Right begins declaring ‘temporary’ and ‘emergency measures.’ Elections get delayed or suspended until the crisis passes, but ultimately it never passes; especially because, ‘since foreigners both within and beyond our borders are to blame’, we ‘must’ use our military to defend the country by attacking these culprits. Because war distracts from domestic corruption and incompetence, and because, like Nazi Germany, we’ve so over-invested in military power, war becomes ‘necessary;’ and because so many other countries — some already authoritarian (e.g. Russia and Turkey) and some only recently so in Hungary — have the same idea at the same time, we end up on the brink of another world war that we might survive (though probably not), but which no one can win."}, {"type": "sentence", "content": "So, if history has anything to teach us, hang onto your hats because it looks like we’re about to party like it’s 1939!"}], "topic": "economy"}