{"title": "Why I Was Happy To Receive A Bipolar Diagnosis", "data": [{"type": "image", "content": "https://miro.medium.com/max/11610/0*V-fca3IxSRBot9BY"}, {"type": "sentence", "content": "It takes an average of 7–10 years for a person suffering with bipolar to receive an accurate diagnosis. Typically this is because depressive symptoms show up before manic ones, and unfortunately, depression in bipolar is not responsive to the same types of antidepressants and treatments that are used to treat unipolar (or typical) depression."}, {"type": "sentence", "content": "I’m not sure where I fall along that spectrum, but after having been in treatment for mental health problems for the past 6.5 years, and having experienced symptoms of depression for around 15 years or so, I finally received a diagnosis of bipolar disorder."}, {"type": "sentence", "content": "I’d been depressed and experienced anxiety on and off since I was about 11 years old, possibly even longer before that, but I never sought treatment for it until after my mom was diagnosed with a terminal illness when I was 19 and my mental health symptoms became too difficult to handle. None of the antidepressants I was prescribed seemed to have any effect, and I tried many over the span of about 3–4 years."}, {"type": "sentence", "content": "When I finally experienced mania, at the age of 24, I had no idea I was manic, because I had never experienced it before. I thought I was just finally happy for the first time. The mania lasted about two years until I finally realized that something was wrong — that it wasn’t normal to feel so high-flying, that I’d gotten into a terrible amount of debt, that I had destroyed relationships, I experienced sexual repercussions, and that I’d essentially made a fool of myself."}, {"type": "sentence", "content": "Maybe it was a good thing that I experienced the manic episode, because it was only after that that I finally received an accurate diagnosis — bipolar 1."}, {"type": "sentence", "content": "If I’d been given this diagnosis at any other point in my journey, I might have experienced feelings of hopelessness, shame, or anger, due to the stigma of bipolar disorder. But because I’d had so many false diagnoses in the past that only kept me away from receiving the help I needed, which contributed to the belief that my mental illness was weakness or character flaw rather than a real condition, it brought me a lot of peace to finally receive this diagnosis."}, {"type": "sentence", "content": "I’ve experienced a lot of trauma in my life and because of the inadequate mental health treatment I’ve received, I’ve had to take a lot of the burden upon myself. It seems that trauma and bad situations beget even more of that. People start to judge you and stay away from you and you become isolated in your illness. You attract people who might prey upon your weakness rather than actually getting you the right help that you need."}, {"type": "sentence", "content": "Having this diagnosis allows me to believe, perhaps naively— only time will tell — that there is some hope for me to get better."}], "topic": "mental-health"}