{"title": "Transitioning to Hope", "data": [{"type": "subtitle", "content": "Mental Health | Sadness | Language"}, {"type": "subtitle", "content": "an exploration of words"}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*C21Kq9e1datP2xSi9td7BA.jpeg"}, {"type": "sentence", "content": "Sadness is a deep well that fills with a cloying liquid that both fills you up and drags you down at the same time."}, {"type": "sentence", "content": "Spiritual anguish is a strong emotion best described in Russian as Toska. It is a deep longing, when there is nothing to yearn for, a dull ache in the soul."}, {"type": "sentence", "content": "It is a heaviness that numbs your limbs and makes you lie on the floor in the middle of the day, with nothing in your mind but the weight of your body and the cool tile floor."}, {"type": "sentence", "content": "When you lie there and listen to the world continuing on around you, the question of value, your value, rises to the surface. If you weren’t here would anyone be at all concerned. Sure, there would be some inconvenience for some, they would have to shift their needs to another person who might be willing to fulfill them. They might miss the reassurance of your voice when they call out, but they could always find another one to fill your vacant spot."}, {"type": "sentence", "content": "If I let myself spiral down into this sadness right now, it is deeper than anything I have felt in a long time and it is both familiar and not familiar at the same time."}, {"type": "sentence", "content": "Germans say lebensmude when they are tired of life, when they feel the depression of not caring. They also say mutterseelinallein when they speak of the serious loneliness where your mother’s soul has left you — literally."}, {"type": "sentence", "content": "For years I mourned the death of my marriage, the death of the happily ever after, the Pollyanna life that I envisioned for my boys. I mourned the loss of a partner that I could share their lives with and mine, having no one to share the day to day details — the happy and the sad, the ridiculous and the ironic. Instead, I kept them to myself, savoring them in isolation."}, {"type": "sentence", "content": "There is sadness in knowing that you have very few friends and in knowing that you are considering cutting ties to new friends — or people you thought were friends, but maybe not."}, {"type": "sentence", "content": "Mono No Aware is Japanese for sadness that comes from the passing of time and how transient our life is. Literally, it is the ‘pathos of things’. They say Natsukashii to describe a melancholy longing for the past which is an evocative remembrance of pain in a softer way."}, {"type": "subtitle", "content": "Sorrow is a word that tastes like blood."}, {"type": "sentence", "content": "It has a sacred heart with vines entwined around it and the vines have thorns that impale the heart like the nails that were used in the Middle Ages to pin a man’s hands and feet to a wooden plank. It is a wonder that we know about this practice from so long ago, but there was the written word and one man’s death caught the imagination of many, so the story was passed down through the ages. It carries deepest sorrow in its telling."}, {"type": "sentence", "content": "Koev halev is a Hebrew word for the empath, whose heart is easily hurt by someone else’s suffering."}, {"type": "sentence", "content": "The blues carries a keening, a wailing that is heard echoing from the mountaintops."}, {"type": "subtitle", "content": "This wailing is often connected to the women of the tribe."}, {"type": "sentence", "content": "The women were the ones to carry the pain of mourning in their bodies and they were often punished for that talent. That wailing is recreated in another way as music and the mournful notes are brought by brass and winds with voices that the men could use to make this connection to the sorrow."}, {"type": "sentence", "content": "There is a certain quality to someone who is perpetually in sorrow, despondent and unhappy, for they are the siren that sits on the rock and sings to the sailors lost, the horn that wails a tune in an echo to the broken hearts and the howl of wolves in the moonlight in the starkness of the northern lights."}, {"type": "sentence", "content": "The French word Tristesse invokes a prettiness that seems too light for sadness. In Italy they say Tristezza which is similar. I breathe deeply and ponder how the romance languages echo ancient roots of Rome."}, {"type": "sentence", "content": "I realize I am connecting to a line of lost souls that endured despite the ache they felt."}, {"type": "sentence", "content": "Saudade is how the Portuguese describe the shift between loss and hope."}, {"type": "sentence", "content": "A fellow writer Misa speaks Portuguese and she explained Saudade as meaning someone or something you had in the past that you lost. The word ‘longing’ is close, but not quite the same ."}, {"type": "subtitle", "content": "I push myself up off the floor and put the kettle on."}, {"type": "sentence", "content": "Sweet warm tea has healing properties and I feel a softening as the sadness lifts."}, {"type": "sentence", "content": "—"}, {"type": "sentence", "content": "Tree is a writer for the ILLUMINATION publication on Medium. Follow her on Twitter and Facebook."}, {"type": "sentence", "content": "With gratitude*"}], "topic": "mindfulness"}