{"title": "‘Fortnite’ Is Jira for Children", "data": [{"type": "subtitle", "content": "Welcome to the ‘enterprisification’ of games"}, {"type": "image", "content": "https://miro.medium.com/max/9796/0*C3rGdc0EOZ7IR5Pj"}, {"type": "sentence", "content": "On Wednesdays, I play Fortnite. It’s me (Dr_Trout), RobotHowells, TwoShots, and SigmoidFiend. There’s a story behind each gamertag. “It’s Robot, like Robert. But Robot because it’s a video game,” Rob says, “which I guess is like a robot.” SigmoidFiend receives a lot of praise for her tag. “Actually,” she says, sheepishly, “Xbox Live just kind of suggested it to me.” Still, we declare it an excellent choice. TwoShots tells us his comes from that time he accidentally played the sound of a gun twice when doing backstage effects for a play. Mine is a name I used as a child that I’ve hung onto for sentimental reasons. We all refer to our gamertags with the self-conscious awkwardness of adults in their thirties."}, {"type": "sentence", "content": "For those not familiar, Fortnite is an online video game where you shoot people until there’s no one left to shoot. We call these sorts of games “battle royales” after the 2000 Japanese film in which a group of schoolchildren are forced to fight to the death. Despite these gruesome origins, Fortnite is light and cartoony, populated with characters like a humanoid banana, a giant gingerbread man, and a weight-lifting cat called Meowscles."}, {"type": "sentence", "content": "At the start of each game, 100 players parachute down to an island and compete to be the final survivor. Meanwhile, a circle surrounds the players and gradually closes in, forcing everyone together for a final showdown. You can think of it as a sort of digital version of The Hunger Games."}, {"type": "sentence", "content": "Fortnite is free to play. Epic, the developers, make money by selling dance moves, loading screens, and characters. These purchases are entirely for show and confer no benefits to players. In an era of pay-to-win loot boxes, where the richest and luckiest spend their way to success by buying the best equipment (rather like the real world), Fortnite is refreshingly different. An innocent island where you can floss dance, fish for rusty cans, and shoot each other in the head with heavy-duty sniper rifles."}, {"type": "sentence", "content": "I should say at this point that we are not very good at Fortnite. When we start today, TwoShots lands on a pylon without any way to get down and has no choice but to jump to his death. Later, I find myself mysteriously taking damage. RobotHowells comes to help and starts taking damage too. “Simon, you’re standing in some spinning helicopter blades,” he says as we both collapse to our death, chopped to pieces by the blades I didn’t notice. On another occasion, rather than shooting people, RobotHowells and SigmoidFiend spend five minutes trying to high-five each other."}, {"type": "sentence", "content": "I can’t blame us too much. Fortnite is a game for young people. “As millennials creep into their 30s, they’re only now just seeing the ravages of time take their toll,” Steve Rousseau says in Vice. “They’re just not that good at video games anymore.” Occasionally on Fortnite, people you don’t know join your squad with microphones on. You can hear them shouting over the game as they headshot someone from the other side of the map. They sound so young. They probably haven’t even gotten to long division yet at school."}, {"type": "sentence", "content": "You don’t have to come in first to succeed in Fortnite. In fact, there is surprisingly little benefit to winning. When you log on, you’re presented with a list of tasks, some new, some leftover from previous games. By completing the tasks, you earn XP, and by gaining XP you unlock things: dance moves, new characters, and so on."}, {"type": "sentence", "content": "Today, I need to kill three people with an SMG. This is my least favorite weapon, a pea-shooter of a gun that makes a little putt-putt noise like a lawnmower backfiring. It does a similar amount of damage. “Also, we need to visit Greasy Graves,” I say."}, {"type": "sentence", "content": "None of us know where Greasy Graves is, so we Google it. RobotHowells finds an article from Forbes about its location. Forbes: the business magazine. “I guess let’s find out what top CEOs are saying about Greasy Graves,” he jokes."}, {"type": "sentence", "content": "After a week off, RobotHowells comes back and groans at the tasks that have built up. “Oh god, I have such a backlog,” he says. And indeed, it’s like returning to work after a holiday and facing the unread emails. Fortnite generates tasks like a relentless scrum manager. As our lockdown days blur into one long stream, I’m finding my work and free time merging. The only difference is whether I’m ticking off tasks in Trello or in Fortnite. Replying to client emails by day, searching ammo boxes at Holly Hedges by night. Both while sitting at the same desk on the same computer. Even the differences in appearance between Fortnite, Trello, and Jira are cosmetic at best. Maybe Forbes is the right place for Fortnite tips after all."}, {"type": "sentence", "content": "The tasks aren’t difficult per se: open chests at Steamy Stacks, land at Frenzy Farm, eat an apple. But they feel like busywork, more important to tick off than because of any intrinsic value, as if you were a cog in a corporate machine allocated tasks by an unseen being for unfathomable reasons. “Why do we have to go to Slurpy Swamp?” TwoShots asks the first time he plays. “Because I say so,” is all Fortnite offers in return. Fortnite lets you change the daily assignment to something else; switching one task for another equally arbitrary one. It doesn’t care whether you open chests at Lazy Lake or get kills with an assault rifle — as long as you do one. While the alliterative names of Pleasant Park and Misty Meadows sound like they belong in Winnie-the-Pooh, the world of Fortnite is more Kafka than A.A. Milne."}, {"type": "sentence", "content": "When you get behind, tasks build up, a never-ending cavalcade of pointless work to fill your free time. And as with work, the tasks don’t go away if you don’t do them. They sit there until your next game, taunting you. I still need to do my SMG kills in the same way I still need to reply to that annoying email from Angela."}, {"type": "sentence", "content": "At first I thought the similarity between Trello and Fortnite was simply an amusing quirk. But when you realize that the Fortnite development team themselves use Trello to track their work, it feels like too much of a coincidence. At the very least, Trello could have subconsciously influenced Epic’s design of Fortnite. Or maybe it’s more overt: “Let the players have a taste of their own medicine,” you can imagine a product manager thinking, “after wading through endless reports of bugs and requests for new features. See how they like it.”"}, {"type": "sentence", "content": "For the next mission, we need to open five chests at Sweaty Sands. “I never go to Sweaty Sands because it sounds gross,” SigmoidFiend says. Grudgingly, we work our way through the chests, just to tick off the action."}, {"type": "sentence", "content": "RobotHowells has had to stop playing, but the three of us go on without him. I change game modes and find myself in Fortnite’s settings screens, scrolling through pages of oblique configuration. As you dig into Fortnite, it feels less like a game and more like an enterprise application, with single sign-on, task management, two-factor authentication, pages of configuration options, and gigabytes of updates downloading on a weekly basis. You can even chat over audio as you do in Skype or Slack. As we shelter in place, Fortnite’s servers have provided a reliable way to communicate with colleagues (unlike, say, Microsoft Teams that went down under the load when the lockdown started). A new Party Royale mode even ditches any shooting, moving Epic one step closer to the inevitable end state: Fortnite for enterprise."}, {"type": "sentence", "content": "We speak of the gamification of software, but I can’t help wondering whether there is an equal and opposite “enterprisification” of games. There is no tutorial or learning mode for Fortnite, and loading it for the first time can be an intimidating deluge of information for new players. It’s like opening Salesforce or Oracle E-Business Suite, each new version more complex with newly added features. Like Salesforce, your best bet is to find webinar-style videos on YouTube. Or, I guess, Forbes. If anything, Slack onboards players more like a video game than Fortnite does."}, {"type": "sentence", "content": "Perhaps our work is becoming more like Fortnite as well. Stack Overflow awards you little badges for answering questions. Slack presents a happy emoji when you read all the messages. And I can’t help noticing reviews of Trello describe it as “simple and kind of enjoyable.” Depending on where you live, it’s not even out of question for people to be walking around with actual guns like the characters in Fortnite. Jean Baudrillard would probably have some things to say about all of this."}, {"type": "sentence", "content": "Fortnite is not the only work-like game. In Animal Crossing, the parsimonious Tom Nook demands mortgage payments against a background of tasks, some of which need repeating daily: talk to neighbors, check the recycling, stop in at the Nook Stop. The Financial Times, slightly less earnestly than Forbes, ran a front page story about Tom Nook cutting interest rates and forcing players into riskier asset classes, such as turnips. “Island recession incoming,” wrote a player on Reddit."}, {"type": "sentence", "content": "I don’t know what to think about pseudo-work-like video games. Sure, some video games always required players to grind, the term for video game work that offers no pleasure. And similarly, pretty much all games feature tasks. But usually the tasks result in a sense of achievement at the very least, and they don’t mount up in long lists to work through. Now we have Job Simulator, a game where you sit in a fake office or shop and pretend to work, transferring calls and sharing photos at the watercooler."}, {"type": "sentence", "content": "As far back as 2008, video game designer Dan Cook joked about an enterprise version of Super Mario, featuring the same mechanics as the game but with business justifications and cost code handling."}, {"type": "sentence", "content": "Cook’s conclusion was that games are fun because they contain “exploratory learning”: You’re given a goal but aren’t told how to reach it and delight from figuring it out on your own. Rather than seeing what Forbes says on the matter."}, {"type": "sentence", "content": "We’ve replaced the intrinsic pleasure of gaming for its own sake with the extrinsic pleasure of doing it for a reward. Rather than being an idyll after all, the Fortnite islands are just as much of a capitalist nightmare as everywhere else, where no one is prepared to open five ammo boxes unless they get paid in dance moves."}, {"type": "sentence", "content": "Back on the island, I have finally completed my three SMG kills, and we have opened our five chests at the disgusting Sweaty Sands. “Good work, everyone,” I say as we shut down."}, {"type": "sentence", "content": "Before signing off, as with work, I have a look to see what is on my to-do list for the coming week. Along with all the tasks I have yet to finish are two new ones, replacing the ones we’ve completed: Eliminate seven players with an SMG and open eight chests at Sweaty Sands. That email to Angela is starting to look quite appealing."}], "topic": "gaming"}