{"title": "3 Lessons I Learned While Solo in the City of Love", "data": [{"type": "image", "content": "https://miro.medium.com/max/8000/1*l5iz6PmzZivk3hPjIkcmpw.jpeg"}, {"type": "sentence", "content": "It was August. I had just finished my freshman year of college, gotten dumped, and spent a lazy summer alternately optimistic and plummeting into depression. I longed to travel, but none of my friends could commit: lack of time, money, and interest all stood in the way. But I was desperate, hungry for escape and experience."}, {"type": "sentence", "content": "I planned the thing, saved up, and hopped on a flight alone. When deciding where to go, I figured, where else?"}, {"type": "sentence", "content": "I arrived, apprehensive but hopeful, in Paris."}, {"type": "sentence", "content": "The next week would teach me more than I knew was possible from a single trip. Some of these lessons include: don’t trust the clipboard women, ask for tap water or you’ll pay extra for bottled, and avoid restaurants in the tourist areas."}, {"type": "sentence", "content": "Of course, there are a few more substantial lessons I learned, too. Here are the main ones."}, {"type": "subtitle", "content": "1. Don’t blame all of humanity for a few rotten souls"}, {"type": "sentence", "content": "While in Paris, I got ripped off. Kicked out by my Couchsurfing host for not attending a grimy club with him and his friends. I was nearly sexually assaulted — twice. Catcalled I-don’t-even-know-how-many times. I saw the most extreme disparity between poverty and wealth I’d seen so far: an entire homeless family, including the cat, dog and kids, crowded on a blanket on the luxurious Rue de Rivoli. Everyone — the tourists, the businessmen, the stick-women with their shopping bags — ignored them."}, {"type": "sentence", "content": "On the other side, I shared bread and cheese with strangers. Chatted for hours with outgoing French bartenders. Met people from all over the world in bars, museums and Uber Pools. Attended a party on the seine where I knew no one but was welcomed immediately. Befriended an older Brazilian man waiting in line at the Catacombs. We talked through the whole tour, and had lunch together after (the vibe never strayed from strictly platonic; and trust me, I was on guard at that point in my trip)."}, {"type": "sentence", "content": "People can be shit. They can also be fantastic. Be smart, but stay open."}, {"type": "subtitle", "content": "2. There is immense comfort in being (and traveling) alone"}, {"type": "sentence", "content": "I always liked being by myself, but traveling alone felt incredibly strange. I was by myself in the most romantic city in the world. It was exciting, sure, but I felt anxious, like I should’ve been experiencing all this with others."}, {"type": "sentence", "content": "At first, I was constantly seeking social interaction. I made some friends and explored parts of the city with them. It was nice, but didn’t bring the comfort I had hoped for."}, {"type": "sentence", "content": "Once I ditched the idea that Paris was best explored with a partner or with friends, I realized how much I loved exploring by myself. There was no feeling like. Paris has an electric energy, like something is always going on, and if you aren’t there you could miss it. Turns out, it was easier to tap into that energy by myself than with another person."}, {"type": "sentence", "content": "I began each day excited at the thought that I could just be in Paris. I could walk for hours and not answer to anybody, or feel pressured to change my plans. It was the first taste of true freedom I’d ever had."}, {"type": "sentence", "content": "But when I wanted to experience something with others, I could. That was, and still is, my favorite thing about traveling alone: you get to choose when to involve others in your experience."}, {"type": "sentence", "content": "Solo travel can be remarkably personal and mindful. Or, you can use it to push yourself and work on breaking out of your shell. Or, like me, a bit of both."}, {"type": "subtitle", "content": "3. Expectations, like rules, are made to be broken"}, {"type": "sentence", "content": "This is a beautiful thing, and I’ll tell you why."}, {"type": "sentence", "content": "Everyone thinks of Paris as this stately, romantic mecca. Glittering and lovely and pleasant. I thought this, too."}, {"type": "sentence", "content": "Then I got there, and was faced with the truth. The city first showed me itself in the form of (I’m not kidding) an actual mime squatting by banks of the Seine, taking a shit."}, {"type": "sentence", "content": "Throughout my trip, I discovered that Paris is dirty, loud, and impossibly crowded. It smells like piss and sewage and sweat. People can be quite rude, but that can happen anywhere. I just wasn’t used to it after spending most of my 20 years in the same small town."}, {"type": "sentence", "content": "Paris took my expectations and shattered them on grimy concrete. Many times I stared at the pieces and was faced with a choice:"}, {"type": "sentence", "content": "I could let this broken expectation bring me down, and accept that I would despise Paris forever because it wasn’t the way I thought it should be. Or I could accept. I could nod and tell the city: okay, then show me."}, {"type": "sentence", "content": "So that’s what I did. I wiped my expectations and replaced them with curiosity, let Paris imprint itself on the blank slate of my mind. Then, I was able to see the city a bit more as it really is — Proud, historic, subversive, magnificent, modern, endlessly charming, full of artists and rejects and activists, people who are passionate about many things, truly and completely, especially the city where they live. It was special, but not in the way everyone thought."}, {"type": "sentence", "content": "Paris is no perfect destination. Some try to make it so. But I prefer to let the city reveal more of itself each time I visit. Isn’t that more fun, anyway?"}, {"type": "sentence", "content": "This first trip was proof that by letting life happen instead of trying to force everything to fit into our own stubborn molds, we become active participants in our lives: constantly thinking, absorbing, reacting. I didn’t have to do much of that in my fairly simple life before I began solo traveling, but in Paris I became a student. Because of the lessons, I decided to make sure that each trip from then on was not just a holiday, but an experience, too."}], "topic": "travel"}