{"title": "Companies Are Trying to Plan for 2 Different Futures Right Now", "data": [{"type": "subtitle", "content": "Off Brand"}, {"type": "subtitle", "content": "And it’s impossible"}, {"type": "sentence", "content": "Companies spend a lot of time and effort on gauging the future. That’s how they make decisions, and explain those decisions to investors. But as the full, cataclysmic implications of the coronavirus pandemic set in, scores of public companies across all sectors of the economy — from United Airlines to The Gap to Twitter to Shopify to Abbott to ConocoPhillips — rescinded the revenue and earnings “guidance” they usually offer Wall Street. Rather than offer a new outlook, many have withdrawn from projections altogether — conceding, in effect, “We have absolutely no idea what’s going to happen; your guess is as good as ours.”"}, {"type": "sentence", "content": "It wasn’t just public companies. The same thing was happening within businesses at every level of the economy. From your hair salon or local bar to Silicon Valley tech firms to startups around the country, small businesses to mass chains, all were confronted with real-time decision-making. Some laid-off workers, some scrambled for loans or other financial relief; many took actions (like closing offices) that felt temporary at the time, but feel less so now."}, {"type": "sentence", "content": "We’re now confronting the highly complicated process of “reopening.” It’s very different — and it turns out that it’s even harder than the decision to retrench, retreat, and shut down. Shutting down was a painful decision, but it became an escapable one. Reopening is harder because the murky future that seized up the economy isn’t settling into some new vision of what’s next. Instead, business is confronted by two visions of what’s next, each completely different from the other — and requiring a more or less immediate response."}, {"type": "sentence", "content": "In one near-term vision, we are beginning to turn a corner. The virus won’t disappear, but we are figuring out (Sweden-style?) how to manage it without a complete lockdown. Living in a new normal where businesses can serve as long as there’s enough plexiglass and six-foot overlays, where everyone is used to masks and waiting in well-spaced lines. The economy can get back to business, with companies avoiding further layoffs and hopefully reversing some of the damage that has occurred. Reopening has begun across Asia and Europe, and now in parts of the U.S. This crisis is not over, but there’s hope. We can begin to imagine how it someday ends."}, {"type": "sentence", "content": "The other near-term vision is the exact opposite. Not only is this crisis not over, but rushing into lifting lockdown restrictions is going to make it much, much worse. A vicious second wave will arrive in the fall, and the current steps toward reopening will only exacerbate it. After a few months of false security has made us lower our guards, the effects will be devastating — both in economic damage and lost lives. We may have to lock down again (China-style?). Under this vision, the most prudent move for many business owners is to hang back, conserve cash, cut costs (and employees), and white-knuckle it until a vaccine emerges, next year at the earliest."}, {"type": "sentence", "content": "Clearly, it’s close to impossible to act on both these futures at once. As a rule, it’s tough to lean in and hang back at the same time."}, {"type": "sentence", "content": "And making that decision about which vision to believe in is just the first step. In the absence of a national master plan for how this all plays out, and official guidance varying by state and even municipality (nightclubs are allowed to open in Oklahoma, and tattoo parlors in Georgia, but not hair salons in California) businesses are left facing a slew of decisions about not just when to open, but how. Which locations should remain idle for now (and maybe forever)? Should the home office stay closed? Should you break that lease? Should customers be required to wear masks? What’s the best way to enforce social distancing? How many furloughed workers should be brought back? Should more workers be laid off? Should you raise more money? Should you lay off workers and raise money? The questions vary by the type of business, but the answers start with sorting out which future you believe in."}, {"type": "sentence", "content": "But maybe there’s some comfort in recalling that there wasn’t much of an official master plan at the start of the crisis either. The watershed decision that changed the national dialogue was, of all things, the NBA shutting down a game that was about to start, and its season, on March 11. California issued the first statewide stay-at-home order on March 19 — but by then vast numbers of Americans across most states had been staying home for days, according to an analysis by FiveThirtyEight."}, {"type": "sentence", "content": "What we’re in for next is a more slow-moving version of that same ad-hoc process, as businesses start to make choices, and customer attitudes evolve and adjust. And maybe we’re learning that the comforting feeling that the future was relatively predictable and even manageable was always an illusion. Right now, it just happens to be obvious that this illusion has been shattered. We don’t know which short-term future is coming. We only know that it is coming, and that there is only one way to confront it: one gut-wrenching decision at a time."}], "topic": "economy"}