{"title": "Untangling the Neuroscience of Free Will", "data": [{"type": "subtitle", "content": "Sometimes just having a conscious belief in free will can make a difference…"}, {"type": "sentence", "content": "Free will is the belief that one’s actions and thoughts arise from, and are controlled by, a conscious self. However, some scientists believe that free will is a biological illusion (Crick, 1994; Wegner, 2004). According to Francis Crick:"}, {"type": "sentence", "content": "Regardless of whether or not free will exists, having a conscious belief in free will may have significant effects on an individual’s perceptions (Aarts & van der Bos, 2011), and these beliefs may increase pro-social behaviors (Baumeister, 2009; Schooler, 2008). Although the concept of free will appears be a cultural universal (Sarkissian et al., 2010) the ways in which people will personally perceive and understand free will is not. How, then, do we measure a subjective, personal experience such as free will? What is the neuroscience underlying this phenomenon? This is the hard problem posed by free will (not to be confused with ‘the hard problem of consciousness’ as described by David Chalmers)."}, {"type": "image", "content": "https://miro.medium.com/max/10348/1*pEwTaidPvoKGPTuXzuQ13g.jpeg"}, {"type": "subtitle", "content": "Brain activity precedes awareness"}, {"type": "sentence", "content": "The electrical activity of the cortex can be measured through the scalp using electroencephalogram, or EEG, recordings. EEG recordings indicate that cortical activity begins approximately 850 ms prior to the initiation of a voluntary movement (Deecke, Scheid, & Kornhuber, 1969). The burst of activity prior to a consciously willed action is called a readiness potential (RP)."}, {"type": "sentence", "content": "Spurred by the discovery of the RP, Benjamin Libet led a series of experiments that, for the first time, applied the scientific method to the hard problem posed by free will (Libet, Wright, & Gleason, 1982; Libet, Gleason, Wright, & Pearl, 1983)."}, {"type": "sentence", "content": "Libet, Wright, and Gleason first broke voluntary movement into two categories: “preplanned” and “spontaneous” (1982). They found that RP occur in three forms, or types. Movements that are either self-paced, pre-set, or involve pre-planning appear to be type I RP, which are characterized by an inclined “ramp-like” form and begin approximately 1050 ms prior to the onset of an action. Spontaneous actions are associated with the more “dome-like” type II RP, and these begin, on average, 575 ms prior to the action onset. The third type of RP begins about 240 ms before the action. These also appear to be associated with spontaneous movements, however the researchers noted that these, “type III RP virtually never appeared,” (Libet, Wright, & Gleason, 1982)."}, {"type": "image", "content": "https://miro.medium.com/max/1028/1*K-u7ggWZaKBHU5kOCrIKvQ.png"}, {"type": "sentence", "content": "These data demonstrate that cerebral activity precedes a voluntary action. Furthermore, there are differences between spontaneous and pre-planned/pre-set actions (Libet, Wright, & Gleason, 1982). Had this study included a larger sample, the researchers may have observed more of the type III RP and been able to determine how they relate to spontaneous actions. However, this experiment pushed these researchers further; they next aimed to determine how readiness potentials relate to the conscious intention of performing an action (Libet, Gleason, Wright, & Pearl, 1983)."}, {"type": "sentence", "content": "Libet and colleagues found that readiness potentials also precede the onset of the awareness of the “want” to move (Libet, Gleason, Wright, & Pearl, 1983). EEGs detected cerebral activity up to several hundred ms prior to this conscious awareness. Again, all three types of RP were observed, but type II RP were the most prevalent and associated with a “spontaneous” desire to move. These type II RP preceded conscious awareness by approximately 350ms. According to Libet, Gleason, Wright, and Pearl:"}, {"type": "sentence", "content": "In other words, decisions occur unconsciously (Libet, Gleason, Wright & Pearl, 1983)."}, {"type": "sentence", "content": "Later research demonstrated that RP are generated bilaterally by the supplementary motor area (SMA) prior to a movement. Furthermore, near the end of a RP, cerebral activity begins to shift toward one hemisphere. This shift is called the lateralized readiness potential (LRP). These LRP indicate that the decision to perform a specific movement, such as which hand is going to perform a key press, occurs prior to the awareness onset (Eimer & Haggard, 1998). While these studies indicate that decisions are made by unconscious processes that precede awareness, it was still unclear where these unconscious decisions begin."}, {"type": "subtitle", "content": "Neurobiology of unconscious decisions"}, {"type": "sentence", "content": "In order to understand these processes, researchers sought to identify which brain regions are activated during an unconscious decision. One region that plays a critical role is the parietal cortex (Sirigu et al., 2004; Soon, Brass, Heinze, & Haynes, 2008). Functional magnetic resonance imaging (fMRI) techniques also detected cortical activity in other areas of the brain, such as the frontopolar BA10 region (Soon, Brass, Heinze, & Haynes, 2008)."}, {"type": "image", "content": "https://miro.medium.com/max/3744/1*CzDj3joku_VPUt6dtZFqIg.jpeg"}, {"type": "sentence", "content": "A significant role for the parietal cortex was demonstrated in a sample of patients with parietal lesions (Sirigu et al., 2004). Following the study design of Libet et al. (1983), participants were instructed to initiate a voluntary movement and then report either the onset of the action or the awareness of the intention to move. They found that participants with lesions to the parietal cortex could accurately judge the onset of their movement, but not the awareness of the decision."}, {"type": "sentence", "content": "EEG recordings also indicate that, when participants with parietal lesions were required to recall the onset of awareness, the RP was nearly diminished entirely. Taken together, these data indicate that the parietal cortex plays a role in the unconscious elaboration and development of a voluntary act (Sirigu et al., 2004)."}, {"type": "sentence", "content": "In a notable fMRI study, participants were instructed to decide between pressing a “left” or “right” button (Soon, Brass, Heinze, & Haynes, 2008). This study found that two brain regions, the frontopolar cortex (particularly the BA10 region) and the parietal cortex, underlie the unconscious decision to press a button. They observed that the predictive signaling from the BA10 region can begin up to 10 s prior to the movement."}, {"type": "sentence", "content": "Further analysis of this early cortical activation allowed the researchers to make accurate predictions up to 5 s before a movement. These data indicate a potential pathway for an unconscious will, which originates in the in BA10 region and can be influenced by the parietal cortex before entering the SMA and finally into conscious awareness and action."}, {"type": "sentence", "content": "Moreover, these data suggest that cortical activity begins much earlier than previously thought (Soon, Brass, Heinze, & Haynes, 2008). Replications of these extremely early RP are necessary, however, before such a claim can be made. At any rate, more recent research has indeed demonstrated that robust RP occur in the absence of movement, and the RP is unlikely a reflection of preconscious motor planning or preparation (Alexander et al., 2016)."}, {"type": "subtitle", "content": "Strong and weak free beliefs"}, {"type": "sentence", "content": "Regardless of how or where decisions occur, beliefs in free will exist, and these beliefs can influence perceptions (Aarts & van der Bos, 2011). Self-reported free will beliefs measured by The Free Will and Determinism scale (Paulhaus & Carey, 2011; Paulhaus & Margesson, 1994) allowed participants to be categorized as having either “strong” or “weak” free will beliefs. The aim of this study was to determine how people with strong and weak free will beliefs differ in response to intentional binding and unconscious priming."}, {"type": "sentence", "content": "Intentional binding is the pairing of an action and outcome, and when an action and outcome appear to occur close together in time, this creates a sense of agency, or causation. Unconscious priming, on the other hand, involves subliminally presenting the outcome prior to the actual observed outcome (Aarts & van der Bos, 2011)."}, {"type": "sentence", "content": "In one test, which the researchers classified as a “trial of agency,” a tone always followed a key press made by the participant. When asked to judge the tone’s onset, the largest mean error in judgment was observed in those with strong free will beliefs. This indicates that strong beliefs in free will correspond to a greater focus on action outcomes."}, {"type": "sentence", "content": "Building on this correlation between strong free will beliefs and perception of self-agency, the researchers next asked participants whether they believed the “stop” location of a black tile was either the one they set in motion or the tile that the computer started. In half of these trials, the ‘stop’ location of the black stop square was subliminally presented. This subliminal priming only increased the sense of self-agency in those people with strong free will belief (Aarts and van der Bos, 2011). This does raise the question: to what degree are people with strong free will beliefs susceptible to subliminal priming?"}, {"type": "sentence", "content": "Aarts and van der Bos hypothesize that differences between strong and weak free will beliefs may be related to how predictive signaling is processed. Furthermore, these predictive signals may be reliant on the parietal-frontal circuitry in the cortex (2011)."}, {"type": "sentence", "content": "This predictive role for the parietal cortex is indeed supported by previous research (Sirigu et al., 2004; Soon, Brass, Heinze, & Haynes, 2008). The researchers further postulate a link between faulty predictive signals in the parietal cortex, false delusions of control, and schizophrenia (Blakemore, Wolpert, & Frith, 2002). Overall, this study demonstrates that people with strong free will beliefs respond more strongly to intentional binding and subliminal priming than those with weak free will beliefs (Aarts & van der Bos, 2011)."}, {"type": "subtitle", "content": "Pro-social benefits of free will beliefs"}, {"type": "sentence", "content": "Some people are concerned that modern science will negatively impact society by decreasing the importance of personal responsibility and increasing impulsive behavior (Baumeister, Masicampo, & DeWall, 2009; Vohs & Schooler, 2008). Some studies indicate that the presentation of anti-free will or deterministic messages may increase both active and passive forms of cheating (Vohs & Schooler, 2008). Further research on helpfulness and aggression indicate additional pro-social benefits of free will beliefs (Baumeister, Masicampo, & DeWall, 2009)."}, {"type": "sentence", "content": "An increase in passive cheating occurred, in one study, following the presentation of statements that emphasized the role of biology and genetics rather than free will (Vohs & Schooler, 2008). In this experiment, participants were given a set of math problems and told that that a key press before each question would prevent a “glitch” in the computer from showing them the correct answer. They observed that subjects exposed to the anti-free will statements chose not to press the key more than those exposed to neutral statements. Participants also completed the Free Will and Determinism questionnaire (Paulhaus & Carey, 2010; Paulhaus & Margesson, 1994). Not surprisingly, prior exposure to anti-free will statements was correlated with weaker free will beliefs (Vohs & Schooler, 2008)."}, {"type": "sentence", "content": "In order to conclude that the effect they observed in the first experiment was not a result of passivity, these researchers next measured active cheating behavior. Participants again answered a set of problems and, in some conditions, instructed to score their own test and award themselves accordingly. Those participants who read deterministic statements such as, “Ultimately, we are biological computers-designed by evolution, built through genetics, and programmed by the environment,” rewarded themselves with more money compared to people exposed to free will and neutral statements. However, in order to allow the participants to remain anonymous, the data is only reported as the average of the groups. In such a design, just one or two outliers could drive any significant observations. As they could not determine if any outliers existed, this makes these data somewhat open to interpretation. It is also possible that presenting strong statements against free will can cause bias (Vohs & Schooler, 2008)."}, {"type": "sentence", "content": "Other research sought to expand the work done by Vohs and Schooler (2008) by investigating how free will beliefs relate to helpfulness and aggression (Baumeister, Masicampo, & DeWall, 2009). Participants in the first experiment read statements emphasizing a disbelief in free well (determinism) and completed a questionnaire to assess their willingness to help others. Compared to participants who read free will statements or neutral statements, people in the determinism condition were the least willing to engage in helpful behaviors. In the next experiment, rather than priming participants with anti-free will statements, a short questionnaire (Paulhaus & Carey, 2010; Paulhaus & Margesson, 1994) was completed to assess pre-existing beliefs in free will prior to a test of willingness to help a stranger (by volunteering their time). In this model, weak free will beliefs predicted a lower number of hours subjects were willing to volunteer. Data also trended towards a correlation between weak free will beliefs and willingness to volunteer any hours. However, 71% of all participants chose not to volunteer at all (Baumeister, Masicampo, & DeWall, 2009)."}, {"type": "sentence", "content": "Weak free will beliefs may be correlated with aggression. Again, participants were presented with differing free will statements. In the subsequent test for aggression, subjects were placed in a situation in which they prepared a tray of food for another person with the assistance of a “taste preference form” (Baumeister, Masicampo, & DeWall, 2009). This form indicated that the person has a clear and strong dislike of spicy food; therefore, aggression was quantified as the amount of a hot salsa used. Although the amount of salsa given to someone they believe dislikes hot food is not the most sensitive measure of aggression, those in the deterministic condition used significantly more salsa than the subjects in the free will condition."}, {"type": "sentence", "content": "The combined data of the aforementioned studies indicate the regardless of whether or not free will exists, there appear to be societal benefits to free will beliefs. However, in these study designs, bias could still be a problem by presenting statements about will prior to testing (Baumeister, Masicampo, & DeWall, 2009; Vohs & Schooler, 2008)."}, {"type": "image", "content": "https://miro.medium.com/max/3346/1*RYTUZx4l0BthlVSil9mabw.jpeg"}, {"type": "subtitle", "content": "Conclusions"}, {"type": "sentence", "content": "The discovery of readiness potentials in pre-motor processing resulted in the study of this cerebral activity in relation to awareness and conscious will (Deecke, Scheid, & Kornhuber, 1969; Kornhuber & Deecke, 1965; Libet, Wright, & Gleason, 1982; Libet, Gleason, Wright, & Pearl, 1983). Functional MRI data later indicated that unconscious decisions may originate in BA10 region and are influenced by signaling from the parietal cortex (Sirigu et al., 2004; Soon, Brass, Heinze, & Haynes, 2008). One could say that we have an unconscious will. However, there is no data that suggest unconscious decisions cannot be “free” nor can we state that all decisions begin in the unconscious. Furthermore, regardless of whether or not free will exists, there are pro-social benefits of free will beliefs (Baumeister, Masicampo, & DeWall, 2009; Vohs & Schooler, 2008)."}, {"type": "sentence", "content": "Maybe the question of how we measure a subjective, personal experience such as free will isn’t a hard problem — maybe it’s just the wrong one. A better question is: what can we do with our current understandings to solve a real problem such as schizophrenia? Faulty predictive signals in the parietal cortex, false delusions of control, and schizophrenia appear to be linked (Aarts & van der Bos, 2011; Blakemore, Wolpert, & Frith, 2002). It stands to reason then that the parietal cortex is a suitable target for drugs aimed at the treatment of schizophrenia, even if, “As Lewis Carroll’s Alice might have phrased it: ‘You’re nothing but a pack of neurons,’” (Crick, 1994)."}, {"type": "subtitle", "content": "References"}, {"type": "sentence", "content": "Aarts, H., van den Bos, K. (2011). On the Foundations of Beliefs in Free Will: Intentional Binding and Unconscious Priming in Self Agency. Psychological Science, 24(4), 532–537."}, {"type": "sentence", "content": "Alexander, P., Schlegel, A., Sinnott-Armstrong, W., Roskies, A. L., Wheatley, T., Tse, P. U. (2016). Readiness potentials driven by non-motoric processes. Consciousness and cognition, 39, 38–47."}, {"type": "sentence", "content": "Baumeister, R. F., Masicampom E. J., DeWall, C. N. (2009). Prosocial Benefits of Feeling Free: Disbelief in Free Will Increases Aggression and Reduces Helpfulness. Personality and Social Psychology Bulletin, 35(260)."}, {"type": "sentence", "content": "Blakemore, S. J., Wolpert, D. M., Frith, C. (2002). Abnormalities in the awareness of action. Trends in Cognitive Sciences, 6(6)."}, {"type": "sentence", "content": "Deecke, L., Scheid, P., Kornhuber H. (1969). Distribution of readiness potential, pre-motion positivity, and motor potential of the human cerebral cortex preceding voluntary finger movements. Experimental Brain Research, 7(2), 158–168."}, {"type": "sentence", "content": "Haggard, P., & Eimer, M. (1999). On the relation between brain potentials and the awareness of voluntary moments. Exp Brain Res, 126, 128–133."}, {"type": "sentence", "content": "Kornhuber, H., Deecke, L. (1965). Hirnpotentialanderungen bei Willkiirbewegungen und passive Bewegungen des Menschen: Bereitschaftspotential und reafferente Potentiale. Pfliigers ArchivfurGesamte Physiologie, 284, 1 -17."}, {"type": "sentence", "content": "Libet, B., Gleason, C. A, Wright, E. W., Pearl, D. K. (1983). Time of Conscious Intentions to Act in Relation to Onset of Cerebral Activity (Readiness Potential). Brain, 106, 623–642."}, {"type": "sentence", "content": "Libet, B., Wright, E. W., Gleason, C. A. (1982). Readiness-Potentials Preceding Unrestricted ‘Spontaneous’ vs Pre-Planned Voluntary Acts. Electroencephalography and clinical Neurophysiology, 54, 322–335."}, {"type": "sentence", "content": "Paulhaus D., Carey, J. (2011). The FAD–Plus: Measuring Lay Beliefs Regarding Free Will and Related Constructs. Journal of Personality Assessment, 93(1), 96–104."}, {"type": "sentence", "content": "Paulhaus, D. L., Margesson, A. (1994). Free Will and Determinism (FAD) scale. Unpublished manuscript, University of British Columbia, Vancouver, British Columbia, Canada."}, {"type": "sentence", "content": "Sarkissian H., Chatterjee, A., De Brigard, F., Knobe, J., Nichols, S., Sirker S. (2010). Is Belief in Free Will a Cultural Universal? Mind & Language, 25(3), 346–358."}, {"type": "sentence", "content": "Sirigu, A., Daprati, E., Ciancia, S., Giraux P., Nighognossian, N., Posada, A., Haggard, P. (2004). Altered awareness of voluntary action after damage to the parietal cortex. Nature Neuroscience, 7(1)."}, {"type": "sentence", "content": "Soon, C. H., Brass, M., Heinze, H. J., Haynes, J. D. (2008). Unconscious determinants of free decisions in the human brain. Nature Neuroscience, 11(5)."}, {"type": "sentence", "content": "Vohs, K., Schooler, J. (2008). The Value of Believing in Free Will: Encouraging a Belief in Determinism Increases Cheating. Psychological Science, 19(49)."}, {"type": "sentence", "content": "Wegner, D. M. (2004). Précis of The illusion of conscious will. Behavioral and Brain Sciences, 27, 649–659."}], "topic": "neuroscience"}