{"title": "I Went Searching for the Sacred Feminine", "data": [{"type": "subtitle", "content": "Planet Soul"}, {"type": "subtitle", "content": "The divine lives inside of us all. We just have to look for it."}, {"type": "image", "content": "https://miro.medium.com/max/7608/0*zlrmKhlZIGy5ysJA"}, {"type": "sentence", "content": "Ever since I learned of the existence of a female form of God, I’ve dreamed of taking a pilgrimage to places where evidence of her had been found."}, {"type": "sentence", "content": "I imagined what it might feel like to stand in the presence of the 35,000-year-old Woman of Willendorf or to roam the land in the Dordogne region of France where the 25,000-year-old carving of the Venus of Laussel was discovered. Both of these, along with hundreds of other Paleolithic-era figurines, were found in areas spanning from southwestern France all the way to Siberia."}, {"type": "sentence", "content": "Virtually every figurine that’s been found from this time period is female, and many archeologists believe them to be some of the earliest indications of our ancestors’ spiritual practices. In other words, we were quite likely a culture that honored the feminine as sacred long before our male gods came roaring onto the scene."}, {"type": "sentence", "content": "In my imaginings, I contemplated what the air smelled like in these places. I wondered, too, about the intentions of our ancestors who created these artifacts, and if those dreams and ideas were somehow captured and held within these pieces of stone or the land itself."}, {"type": "image", "content": "https://miro.medium.com/max/12032/1*KWH73vjuyW7ZvUjJdoPymg.jpeg"}, {"type": "sentence", "content": "Three years ago, my dream became a reality. My husband and I, along with our two small children, spent a summer traveling throughout Europe, visiting historical sites connected to ancient Goddess worship. The trip was amazing. I saw the ancient limestone cliffs and cave dwellings of the Dordogne. I saw beautiful Goddess artifacts from the Minoan culture in the Heraklion Museum of Archeology on the island of Crete. I spent a quiet afternoon in the Chalice Well and Gardens in Glastonbury, England, a popular pilgrimage spot for modern Goddess seekers. In Switzerland, I visited the Black Madonna of Einsiedeln, one of many statues of a dark-skinned Virgin Mary thought to have connections to an ancient Earth Mother."}, {"type": "sentence", "content": "It was the trip of a lifetime. But after two months on the road, I learned an important lesson: The Sacred Feminine is not confined to a particular statue or artifact. Yes, visiting official sites connected to her was life-changing, but so was the entire trip."}, {"type": "sentence", "content": "Watching my kids splash in the Libyan Sea off the southern coast of Crete, hearing the gentle clanking of cowbells ringing through the Swiss Alps, taking in the rolling green hills of the English countryside as they slid past my car window: I was reminded again and again that she is always with us. I began to understand that, as amazing as it was, I didn’t really need to take an international trip to find her."}, {"type": "image", "content": "https://miro.medium.com/max/4896/1*HTV7QX3IKACgG7RcEWRegQ.jpeg"}, {"type": "sentence", "content": "My exploration of ancient Goddess cultures through books has taught me the same lesson. In prepatriarchal spiritual traditions, our ancestors didn’t necessarily view our creator as something that exists apart from ourselves. Instead, divinity was very much alive and well in everything that exists within our world. And that includes each of us—just as we are."}, {"type": "sentence", "content": "We are not so much made in the image of the divine as we are a living expression of the divine in human form."}, {"type": "sentence", "content": "Before I took my trip, I thought of the Sacred Feminine as a beautiful spiritual idea lost to, or at least obscured by, history—in part because of the rise of dominant patriarchal religions. It hadn’t occurred to me that I should be looking within myself to find her."}, {"type": "sentence", "content": "After all, how many of us really think of ourselves as sacred? There’s a good reason we don’t. We are thoroughly immersed in a culture that doesn’t place value on ordinary lives and experiences, and this is especially true of women."}, {"type": "sentence", "content": "If the Sacred Feminine lives within all things, including us, then perhaps the best way to connect with divinity is by undertaking an inner pilgrimage to recover our own sacred nature. For me, that’s meant being willing to seek out and reclaim the lost parts of myself that I’ve tried to reject or deny. And, honestly, coordinating two months of travel logistics in foreign countries with small children is an easier task."}, {"type": "sentence", "content": "As women, we’re exceptionally good at slicing ourselves up and discarding the pieces that don’t meet the standards imposed by a culture that does not value us as our complete and messy selves. I could be speaking literally here — plastic surgery is an $8 billion industry, with women electing to receive the majority of procedures — but I’m also speaking figuratively. What are the pieces of yourself that you’ve discarded from your own life?"}, {"type": "sentence", "content": "There are so many pieces of me I’ve tried to throw away that I’ve almost lost count. There’s the part whose rage was legendary in my family, even at a young age. Or the part that once wore tiny skirts, sported an always-exposed navel ring, and loved attracting the attention of men, especially older ones. There’s the part of me that is often exhausted by the needs of my children, and the part that is dying to let my freak flag fly as high and freely as it can— and the fear, still, over what others will think."}, {"type": "sentence", "content": "At one point or another I’ve discarded all these pieces of me, trying to forget about their existence, convinced that I cannot be good or smart or a responsible mother if I hold on to them. But who gets to decide which parts of us are sacred and which are not?"}, {"type": "sentence", "content": "In The Myth of the Goddess, Anne Baring and Jules Cashford note that our Paleolithic ancestors were deeply connected to the cycles of the moon. They suggest that the fourth phase, the new moon and darkness, is in fact where all life is gestated and where the new moon is “reborn” each month. This darkness — that of the Sacred Mother who gives birth to all — transcends duality. It contains everything: the light and the dark, the beautiful and the ugly, the living and the dead."}, {"type": "sentence", "content": "For our Paleolithic ancestors, “Everything that existed, including themselves, was an expression of the Mother Goddess,” write Baring and Cashford. And all of it was sacred. Every single part."}, {"type": "sentence", "content": "Maybe the most important sacred journey we can take, then, begins right here, and requires that we look no further than ourselves. To imagine the Sacred Feminine as an integral part of our world, we must experience a full awakening of ourselves as sacred. We must learn to treat the individual parts of ourselves as holy, especially those we’ve denied most often. We must make pilgrimages to each, dusting them off, understanding the memories that accompany them and why we discarded them in the first place."}, {"type": "sentence", "content": "This is not easy work. It will not be simple, and it will not be swift. But if we’re willing to taken on the task, our lives become pilgrimages of their own."}, {"type": "sentence", "content": "Maybe, over time, we can approach these parts of ourselves with reverence and wonder and gratitude. And each time we reclaim a piece of ourselves, each time we love it not despite its flaws but precisely because of its imperfections, its aching humanity, we breathe more life into a great awakening of our entire selves as sacred, exactly where and as we are."}], "topic": "travel"}