{"title": "The Trial of Nathan Drake", "data": [{"type": "subtitle", "content": "A Lead Game Designer from Ubisoft Paris helps us understand how a character who murders hundreds can still claim hero status"}, {"type": "sentence", "content": "In the 2010s, Naughty Dog became a studio universally recognised for its expertise in crafting outstanding linear story-driven games. The Last of Us is among the top titles of the decade, and Uncharted remains a flagship PlayStation franchise. Its charming central character, Nathan Drake, has quickly become a beloved video game hero with his funny lines and generally likeable personality."}, {"type": "image", "content": "https://miro.medium.com/max/1000/1*2cU3uNb-0VgM6Damw9jnig.png"}, {"type": "sentence", "content": "There is something odd about him though: that is, his natural tendency to mercilessly slaughter the people who stand between him and his illegal treasure hunting activities. Well, actually, we are the odd ones here: how can we play these games, see what we see and still not view Nate as the blood-thirsty psychopathic mass-murderer he is?"}, {"type": "sentence", "content": "Let’s start by having a look at the first chapter of Uncharted: Drake’s Fortune, the very first time we’re introduced to the character (you can watch it on YouTube here, it lasts about 7 minutes)."}, {"type": "sentence", "content": "Nathan is on a boat with Elena Fisher, a journalist who accompanies him to do a documentary on his treasure-hunting expedition when he sees pirates in the distance. Since they’re not supposed to be here and he doesn’t really like going to jail, he informs his partner that they shouldn’t be calling authorities and handle the matter themselves. She doesn’t seem too happy about it but accepts the suggestion pretty fast nonetheless."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*etwmeVw5YfvPG_fGsKIGog.gif"}, {"type": "sentence", "content": "They don’t panic despite the serious, life-threatening situation and manage to kill all the pirates themselves before jumping out of the ship moments before it blows up. Nate’s old friend Victor Sullivan comes to the rescue with his seaplane and they crack several jokes about the whole situation, setting the tone for the whole game (and series): nothing to take too seriously here."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*Pr4FlYHhHDU95V_xkZ7_wQ.gif"}, {"type": "sentence", "content": "The shooting gameplay is one of the core pillars of Uncharted; you kill a lot of (realistic-looking) people throughout the series, yet this is never acknowledged in the story. Nathan Drake isn’t an antihero, nobody views his acts as morally wrong, not even the player."}, {"type": "sentence", "content": "When such gap exists between the story you’re told via cinematics and dialogue (Nate is a cool dude) and the story you’re experiencing through gameplay (Nate kills a lot of people), we call this “ludonarrative dissonance”, a term coined by creative director Clint Hocking (Splinter Cell: Chaos Theory, Far Cry 2, Watch Dogs Legion)."}, {"type": "sentence", "content": "This concept has often been leveraged to criticise Naughty Dog’s productions; this is how Neil Druckmann responded in an interview with magazine Rolling Stone, days after the release of Uncharted 4:"}, {"type": "image", "content": "https://miro.medium.com/max/800/1*91PS-ohG6DnBaW3tf1iUBQ.jpeg"}, {"type": "sentence", "content": "I love this statement, I do fully agree with it, yet the questions remain."}, {"type": "sentence", "content": "How can we be so keen to accept unacceptable behaviours for some fictional characters? Gaming is an interactive medium and it seems to amplify the issue: how can we separate so easily what we do (and therefore see) when we’re in control from what we’re told when we don’t?"}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "sentence", "content": "I started to think a lot about this issue and how to get around it when I was working on Watch Dogs 2."}, {"type": "sentence", "content": "The game starts as white-hat hacker Marcus Halloway is unfairly framed as a criminal by an Orwellian algorithm due to vague circumstantial pieces of evidence. Scandalised, he decides to clear his file and join the group Dedsec to fight against this evil oppressive system. Marcus has access to a wide range of tools to help in his missions, among which drones, hacking gadgets, a taser, and…lots of guns and explosives."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*UCFzMWivshBN19FkRXTQ9Q.gif"}, {"type": "sentence", "content": "Let’s quickly dispense with the argument “you can finish the whole game without killing anyone, therefore it’s your decision”: yes you can, no that doesn’t make any difference to me. You can respect traffic regulations in GTA too. The creator has control over his experience, he’s the one who designed the game rules with incentives and directives to do some things and not do others."}, {"type": "sentence", "content": "Given any game system, players will optimise the fun out of it. If the use of violence is a fun thing to do, then the ludonarrative dissonance problem is on the game, not the lack of role-playing from the player. Killing people is indeed exciting in this game; you can be creative and visual are super satisfying."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*c-e_dNz1wK0wQL0UdWzu_g.gif"}, {"type": "sentence", "content": "As part of my job, I read all the reviews once the game has launched. A lot of journalists raised the issue that the game is too violent and killing feels wrong, yet still liked the characters and tone. Even with all this fire and blood, Watch Dogs 2 manages to keep a light-hearted mood; the opposite of the dark vigilante theme of its predecessor. Being the good guy who fights against invasive technology yet loves to spy on normal people in the street didn’t seem to break the immersion for anyone though."}, {"type": "sentence", "content": "The tipping point of this delicate balance happens at the end of the first act when you encounter ‘bad guy’, Dusan Nemic, CEO of the company behind the ctOS system. In this dialogue, he mentions how he doesn’t care about the collateral damage; that this is the necessary evil for the greater good. I thought this would bring a moral dilemma to the story, deepening the character through the usual narrative conflict ‘we’re not so different after all’. It doesn’t. Marcus is just upset and still thinks he’s the beyond reproach good guy."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*BjPSVvBWhNDulU4SI2AyMw.jpeg"}, {"type": "sentence", "content": "This scene detracts from the immersion a lot (at least for me): the gameplay remains very enjoyable but the story not so much. You can accept a certain amount of disparity between the story and the gameplay, but if that gulf becomes too wide, you’re likely to choose one side and ignore the other. Our brain hates contradictions and works actively towards eliminating or avoiding those cognitive dissonances."}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "sentence", "content": "Whenever you start watching or reading any work of fiction, you unconsciously avoid thinking critically of the surreal nature of its components, you tend to accept these elements for the sake of enjoyment. This concept is known as “willing suspension of disbelief”. What you do instead is to accept the rules of the universe and characters you’re presented with and then evaluate the events you’re presented through this lens."}, {"type": "sentence", "content": "That’s how you can start watching Game of Thrones and enjoy it without thinking “dragons do not exist, this is absurd”, but when you are presented with illogical character development or event, that can (seriously) harm your appreciation. There is a hidden contract between the creator and the spectator to accept almost anything, as long as coherence is maintained."}, {"type": "sentence", "content": "One recent breach of this ‘contract’ that comes to my mind is in Captain America: Civil War when the super heroes see footage from other previous Marvel movies and get lectured about their side damages. As a spectator, I felt directly addressed: “So, you loved it when your heroes kick the bad guys in the cool action scenes we’ve made for you, but did you notice how much destruction occurs in the process? You shouldn’t enjoy this, people died.”"}, {"type": "sentence", "content": "It feels unfair. Marvel, I trusted you to entertain me and now you criticise me for being entertained. I can accept alternative views of a situation — it’s an interesting way to deliver additional perspective actually — but it needs to be there from the start (like in The Boys for instance)."}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "sentence", "content": "When you start playing any game, you don’t just accept the suspension of disbelief, but you also come to accept the rules of the interactive components and that they can sometimes diverge from the narrative itself. Let me coin a term myself and call this concept the “suspension of divergence”."}, {"type": "sentence", "content": "Suspension of divergence is how you accept that, although characters display real-life human traits and live in a world resembling ours, the gameplay obeys different rules and its own logic which prevails over real-life logic."}, {"type": "sentence", "content": "You accept such incoherent rules as long as they make the experience more fun and entertaining. In a lot of games, you respawn when you die yet you don’t need any explanation about the immortality of your character and his magical ability to come back to life. It doesn’t break your immersion in the story because you know it’s simply more fun this way."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*gFjdHBDskKZBnGpY5lXA9g.gif"}, {"type": "sentence", "content": "However, one thing that can harm your enjoyment is trying to reconcile what shouldn’t be. Imagine if NPCs were acknowledging your death and respawn, or worse, lecturing you about it (“hey, you don’t get to complain, you’re immortal unlike the rest of us”)."}, {"type": "sentence", "content": "Players have naturally drawn a line between the gameplay and the story; a convenience for all parties involved. The game needs to respect this tacit contract and avoid violating it, or it will break the suspension of divergence and draw attention towards the ludonarrative dissonance."}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "sentence", "content": "Respecting this only rule isn’t enough to prevent ludonarrative dissonance but it’s a necessary condition. There is a limit to the number of divergence players can accept before questioning the coherence of the experience. Can the limit be quantified? Probably not; everyone focuses their attention on different aspects and are more or less nitpicky."}, {"type": "sentence", "content": "Immersion isn’t binary and there isn’t an exhaustive checklist of do’s and don’ts. What you can do as a game creator though, is to avoid the major dissonances and infuse your experience with enough details so that put together, it will create an overall sense of immersion and coherence. This is where games like Uncharted 4 score points and Watch Dogs 2 doesn’t."}, {"type": "sentence", "content": "In Uncharted 4 for instance, there is a clear narrative separation between the main antagonists and the standard grunts. The PMC soldiers are vaguely defined, don’t have names, never once speak in cinematics, they have zero personalities. This is the opposite for the two main villains and I believe this is the reason Naughty Dog chose to make you interact with them only through melee combat: shooting at them would have introduced dissonance."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*ScONTFGKPM2Oo7ozbf-l3w.jpeg"}, {"type": "sentence", "content": "Dehumanisation is a tactic used by lots of games but Watch Dogs does the opposite: there are efforts made to portray these people as more realistic (for example, via our use of the little ID cards that pop up when you point at them). Even without the profiler, you’re confronted with security guards and policemen in most missions: there is an obvious clash between the logic of the setting (‘these people are doing real-life jobs’) and the logic of the gameplay (‘I might kill them to facilitate the completion of my mission’)."}, {"type": "image", "content": "https://miro.medium.com/max/2720/1*rbmqb7wrKSK4ITWjVwnCIw.jpeg"}, {"type": "sentence", "content": "Another fundamental difference between both games is the gameplay approach. In Uncharted 4, Nathan Drake is constantly reacting to unexpected encounters with the PMC. He only carries a handgun (and pick-up weapons on bodies) and it’s made clear from the first combat situations (in Panama, Italy, and Scotland) that they’ll shoot without mercy. We could argue that Nathan is always in self-defense."}, {"type": "sentence", "content": "Meanwhile, in Watch Dogs 2, like in most other Ubisoft open-world titles, you get full control of how you approach an area, the tools you bring, how you recon, plan and execute your own strategy. This difference suddenly makes Marcus appear more like a psychopathic cold-killer."}, {"type": "sentence", "content": "But still, in both games you end up shooting people in the heads, at least if you decide to or don’t manage to take them down silently. There is a ludonarrative dissonance in both, even if it’s not the same scale. How can they still both make us accept this conflicting violence?"}, {"type": "image", "content": "https://miro.medium.com/max/300/1*hOzmMDoEhkdTljiOYI1afw.png"}, {"type": "sentence", "content": "From the same Rolling Stone interview, Neil Druckmann proposed an answer to this question:"}, {"type": "sentence", "content": "When you view things this way, the first scene of Uncharted: Drake’s Fortune I made fun of earlier makes sense: in this universe, although closely resembling ours, being shot at without hesitation and having to kill pirates in self-defense is a perfectly reasonable thing to do, nothing to get too worried about. The dialogue accompanying this scene efficiently conveys the fact that this reality, the reality of Uncharted, is a stylisation of ours."}, {"type": "sentence", "content": "Even if the visuals and everything else looks realistic, this isn’t our world. You don’t need to eliminate all ludonarrative dissonance. As long as the reality of your game universe does not diverge too much from the reality of your narration, and as long as each one is coherent with itself, it should make for a pretty entertaining experience."}, {"type": "image", "content": "https://miro.medium.com/max/2444/1*g2avirFHIf2gQYc7VyD7lQ.png"}], "topic": "ux"}