{"title": "Living with Two Brains — Life Without Your Corpus Callosum", "data": [{"type": "sentence", "content": "Let’s start with an activity."}, {"type": "sentence", "content": "Close your eyes. Using your left hand, grab your coffee mug, phone, pen, or whatever is on the desk near you. If you need to fumble around a bit, that’s fine. Now that you’ve grabbed it, let go and fumble about until you find something else. Imagine it. Feel its length, curves, and sides. Now, say it’s name."}, {"type": "sentence", "content": "Then open your eyes."}, {"type": "sentence", "content": "Go ahead, give it a shot."}, {"type": "sentence", "content": "Pretty easy, right? Assuming you didn’t have a pair of open scissors nearby and cut your hand (and if you did, sorry!), that was an unbelievably simple exercise. For you. Because you have a corpus callosum. If you didn’t, most of it would go just fine, until you tried to say the name. Then, you wouldn’t be able to speak."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*eCfzPCENG5xag0q9fonVPQ.png"}, {"type": "sentence", "content": "Millions of interactions and cell-to-cell signals occur between you picking up a mug and saying its name. Nervous input zooms up your left arm and into your spinal cord. This flies to your brain, crossing over to the right side of your cerebral cortex, where you can imagine the shapes, curves, and size and come up with an idea of what the object is. Along the way, electrical signals from every receptor in your hand pass through three different neurons, and terminate in your primary sensory cortex, on the upper right side of your brain. This is the simple part. Next, these signals are passed to memory circuits, through modulating relays, and into deep hippocampal regions as your brain searches for other objects that have felt similar. Eventually, it settles on a mug and gives you the image in your head. This process is called stereognosis, and your brain goes through it anytime you touch something you can’t see. It searches through millions of patterns to identify that one that matches with the object you’re holding."}, {"type": "sentence", "content": "All of this can happen on just one side of the brain, the right side if you used your left arm. But to say the name of the object aloud, one more connection has to happen. The neurons that identified the object on the right need to zap their information over to the left, the speaking center of your brain. On their way to this so-called Wernicke’s area, they have to pass through an incredible dense, jumbled, and essential structure, the structure that connects left hemisphere to right. Your corpus callosum and its 300 million axons carry this identification across to the left side of your brain, dropping it off in your speech center so that can craft the word “mug” and shoot it back out to your motor centers and eventually your jaw, pharynx, diaphragm, and tongue. But in millions of people, this can’t happen. They live without a corpus callosum, and with a condition called Split-Brain."}, {"type": "image", "content": "https://miro.medium.com/max/1100/1*KL6-azKSK3u5Ixer3MqzXg.png"}, {"type": "subtitle", "content": "Your Two Brains"}, {"type": "sentence", "content": "Most brain functions are localized to a specific area of your cortex. Some of these are colateralized (or, on both sides) but many are unilateral. The right side of the brain does one thing and the left another. The power of speech is one unilateral power, it’s all located just behind your left temple, in Wernicke’s area. Motion and sensation are also unilateral. The left side of your brain controls the right side of the body and the right side takes the left. Vision, hearing, and the sense of smell are unilateral as well. Each visual, auditory, and olfactory field are picked up on just one side. To date, we don’t know of too many other abilities that are completely unilateral. And none of this is the pop psychology “left-brained vs. right-brained,” that’s almost complete bunk, this is localization of function, not ability."}, {"type": "sentence", "content": "This unilateralization means that people with Split-Brain are working with two sets of sensory input all the time. It also means they have two sets of motor output, giving them some special abilities. Through practice, people with Split-Brain are able to draw a different image with each hand at the same time. If you’re not impressed, give it a try, it’s next to impossible for you and I. Each side of their body can handle different, complex motor tasks because each side of their brain can send messages independently. Our brains keep our sides in sync, but their brains aren’t able to do that."}, {"type": "image", "content": "https://miro.medium.com/max/3390/1*IHiObHuPdKp0BO_U6rFgtA.jpeg"}, {"type": "sentence", "content": "Because of this loss of communication, weird things can happen in the somatosensory system. We’ll cover two of those categories of oddity, touch and smell. Because of this split, odors entering your right nostril couldn’t be communicated to the left side of your brain. If you smelt something on the right side, you couldn’t say its name, since it can’t be communicated to your vocal center on the left. You could recognize it, but some of those molecules would have to enter your left nostril before you could say its name aloud. For touch, this deficiency is flipped. If you picked up something in your left hand, without seeing it, you wouldn’t be able to give its name. Left sensory fibers cross to the right side of the brain, the area that doesn’t have access to vocal centers. Again, you could recognize it, but vocalization would be off limits."}, {"type": "sentence", "content": "The consequences of this split aren’t limited to the ability to speak. Many other parts of normal function would be lost or modified as well. Probably the most famous example of split-brain was Joe, the one-named (for anonymity) star of an Alan Alda Scientific American special from 2002. He had his corpus callosum removed to treat epileptic seizures and was left with split-brain instead. Overall, he lives a fairly normal life, and has been used for much of the split-brain research done in the U.S. over the last few decades. On the special, the physician uses his insight into the unilateralization of the mind to show a special ability of Joe’s. The video below is a better descriptor than words could be, but I’ll describe it as well, below the frame."}, {"type": "sentence", "content": "Joe is presented with the work of Giuseppe Archimboldo, a renaissance Italian painter most famous for painting fruit and vegetables that have been arranged to appear like human faces. When these images are presented to the left side of Joe’s brain, he sees fruit and vegetable platters. But when they’re presented to the left, he sees faces. Because of the unilateral nature of facial identification, he can only spot the face if it’s presented to the correct part of his brain. When both parts of his brain get a look at the image, he’s able to see both the fruit and the face, just like you and I."}, {"type": "sentence", "content": "Unlike most of the lives presented in this series, life without your corpus callosum is remarkably livable. There don’t appear to be too many side effects to losing this portion of your brain, though it will change how you think about and perceive the world. That’s why it’s a fairly common treatment for certain types of epileptic seizures. Removing the callosum stops seizure signals from traveling across the hemispheres, helping tamp them down and improve the sufferer’s quality of life. If you lost your corpus callosum today, you’d definitely notice, and so would those around you. But eventually, you’d adapt to it and live the rest of your life with two, very unique, brains."}], "topic": "neuroscience"}