{"title": "Watson Assistant Search Skill: Taking Virtual Assistant to the next level", "data": [{"type": "sentence", "content": "As the world reacts to the Covid-19 coronavirus pandemic, call centers of hospitals, government agencies, and other organizations are overwhelmed with the number of calls to find out repeated common information. Everyone wants personal interaction to get information from authentic sources. Remote working and collaboration tools have become essential systems, with new demands placed on networks and data center infrastructure. In this situation, virtual assistants are playing vital roles to share the load from human agents and subject matter experts so that they can focus on real business tasks in hand. As a result, the usage of IBM Watson Assistant to implement these virtual assistants is increased by 60%. The Dialog skill and Search skill of the IBM Watson Assistant are essential components in these implementations. The next couple of sections of this article will provide you with information on how the Search skill of Watson Assistant is enabling virtual assistants or bots to rise up to the next level of human interaction."}, {"type": "sentence", "content": "What is Search Skill?"}, {"type": "sentence", "content": "When Watson Assistant doesn’t have an explicit solution to a problem, it routes the user’s question to a search skill to find an answer from across your disparate sources of self-service content. The search skill interacts with the IBM Watson™ Discovery service to extract this information from a configured data collection. For example, a remote worker is asking questions such as, “How to setup a VPN?” or, “What are the steps to access a shared network drive?” Answers to these questions sometimes require a document which describes a number of steps."}, {"type": "sentence", "content": "The following diagram illustrates another example to show end-to-end integration flow of search skill between Watson Assistant and Watson Discovery:"}, {"type": "image", "content": "https://miro.medium.com/max/1872/1*bYTdRFIRtDbl3gZN7pzolQ.png"}, {"type": "sentence", "content": "When you need Search Skill?"}, {"type": "sentence", "content": "How to Trigger Search Skill?"}, {"type": "sentence", "content": "Search Skill can be triggered in the following ways:"}, {"type": "sentence", "content": "How to Configure Search Skill?"}, {"type": "sentence", "content": "For configuring Search skill, you can follow the detail video to configure search skill:"}, {"type": "sentence", "content": "How to optimize the Search?"}, {"type": "sentence", "content": "Most of the time, discovery service is returning the desirable documents to the search skill. However, there are ways you can improve or optimize the search results in Watson Discovery Services:"}], "topic": "artificial-intelligence"}