{"title": "Why Selfies Rarely Win", "data": [{"type": "subtitle", "content": "The battle over selfies rages on, but this time science weighs in"}, {"type": "image", "content": "https://miro.medium.com/max/11074/0*-QoOzIT8_Rb-SM6F"}, {"type": "sentence", "content": "Whether scrolling through photos on Instagram or swiping through matches on Coffee Meets Bagel, we’ve all seen them before: selfies. While most of us situate the photos neatly at the butt of jokes, we can’t seem to escape them. Here, I aim to explain the science behind their typically distasteful nature. It’s likely not what you think."}, {"type": "sentence", "content": "While clearly not all selfies are bad, many are notoriously awkward things: When we see them, we can’t help but balk. Some have grown so ubiquitous — like the “duck face” and “mirror pic” — that they’ve earned their own little nicknames. Our focus will be the more general selfie, one you might take with friends or a selfie stick."}, {"type": "sentence", "content": "The reason these photos rarely win our adoration stretches back millions of years and involves ancient responses that evolved to help us distinguish between friend and foe. To understand how, we have to start with a man named Mr. Duchenne."}, {"type": "sentence", "content": "Mr. Duchenne"}, {"type": "sentence", "content": "In the mid-19th century, a French anatomist by the name of G.B. Duchenne gave us the first clue as to why we might not like the selfie. He did this with electrodes."}, {"type": "sentence", "content": "What Duchenne wanted was to understand which muscles of the face were involved in facial expression. To do this, he applied small electric shocks to the faces of a few of his patients. These shocks would trigger the activation of whichever muscle they touched, allowing Duchenne to disentangle the specific fibers behind each expression."}, {"type": "sentence", "content": "After a tedious (and often painful) series of shocks, Duchenne noticed a crucial difference between two types of expressions — the genuine smile and the fake. Genuine smiles, as it turns out, activate a combination of muscles: the zygomaticus major, which pulls the corners of the mouth into a grin, and the orbicularis oculi, which crinkle the skin around the eyes into a pair of crow’s feet. The fake smile only uses the former."}, {"type": "sentence", "content": "Here’s how Duchenne phrased it:"}, {"type": "sentence", "content": "To reiterate, Duchenne found that smiles of “frank joy” recruit muscles of the orbicularis oculi, whereas smiles generated on command only use the muscles of the mouth. This telltale sign would later earn the title “Duchenne display” by renowned psychologist Paul Ekman. It would also offer the first clue as to why we might not like the selfie."}, {"type": "sentence", "content": "Genuine vs. Fake"}, {"type": "sentence", "content": "Whether real or fake, the signal for the smile comes from deep within the brainstem — a vital stalk of flesh that connects the brain to the spinal cord. More specifically, it comes from the facial nerve (also known as “cranial nerve VII”). This bundle of cells communicates with the muscles of the face to give us every expression from joy to malaise."}, {"type": "sentence", "content": "When we smile on command, the signal to the facial nerve comes from the motor cortex — a part of the brain that stimulates “voluntary” movement. If we want to reach out and type, for instance, we use this voluntary system: The motor cortex sends a signal to the spine, which in turn sends a signal to the fingers to get them typing."}, {"type": "sentence", "content": "When we show a genuine smile, one that flows spontaneously from emotions like happiness, the signal instead follows an involuntary pathway. This pathway begins in the parts of the brain that process emotion, including the amygdala, hypothalamus, and basal ganglia. When these areas get provoked into action by something funny or sentimental, they send their signals through this involuntary pathway to activate the zygomaticus major and orbicularis oculi. The result is that trademark Duchenne display."}, {"type": "sentence", "content": "This anatomical dichotomy would serve as the bedrock over which our future understanding of selfies would be built: Some show smiles that come involuntarily from the “sweet emotions of the soul,” while others show smiles produced voluntarily. This difference, when paired with an understanding of why facial expressions evolved, would yield the next step toward our understanding of the selfie."}, {"type": "sentence", "content": "Expression"}, {"type": "sentence", "content": "Facial expressions evolved as a way to help us communicate our emotions. This trend intensified throughout mammalian evolution, reaching a zenith of sorts in Homo sapiens. Primates, for instance, have significantly more cerebral tissue dedicated to the muscles of the lips and mouth than other mammals like cats, dogs, and elephants. This increased control enabled us the flexibility needed to start emoting with our faces."}, {"type": "sentence", "content": "The usefulness of facial expression as a communicatory tool is easy to see. Human babies, for instance, can use the facial expressions of their caregivers to assess whether a given area is safe or not. If the caregiver frowns, furrowing their corrugator muscle into a foreboding brow, the infant will shrink from the scene. If the caregiver instead shows a smile, the infant will feel more inclined to approach."}, {"type": "sentence", "content": "The same properties hold for a panoply of emotions. If we feel disgusted, those nearby will see the disgust on our face and know to avoid whatever disgusted us. If they see us angry, they will know to either stay away or engage. And so it goes for sadness, joy, and every other emotion — each evoking its own specific response in the person who sees it."}, {"type": "sentence", "content": "Over time, it became imperative for our ancestral primate brethren to distinguish between the real and fake versions of these different expressions. As one researcher put it, the ability to distinguish between real and fake would help us “avoid exploitation by socially skilled individuals.” We don’t want to get cheated by someone faking their sadness or fear. The same is true of smiles."}, {"type": "sentence", "content": "Trust"}, {"type": "sentence", "content": "Like with other facial expressions, the smile evolved to express certain underlying emotions. For many smiles, these emotions are oriented around trust."}, {"type": "sentence", "content": "In study after study, researchers have shown that experiments involving trust tend to evoke a formidable number of genuine smiles. And, when they do, the smiler is typically considered more generous, competent, and trustworthy (even more hirable for a job) — all traits you might ascribe to a trusted friend. When we see a fake smile, we don’t feel the same affinities."}, {"type": "sentence", "content": "This relationship is thought to have developed from an earlier expression used in primates called the silent-bared teeth response. This response is often shown by subordinates to signal to those higher on the food chain that they want to cooperate: “No, let’s not fight; instead, let’s share a banana.” This cooperative quality is thought to have transferred to us: You smile at a joke or endearing gesture and people think you’re more cooperative and trustworthy."}, {"type": "sentence", "content": "Voluntary smiles don’t do this. Rather, they suggest you’re the type of person that feigns trustworthiness. This brings us to the final piece of the selfie puzzle."}, {"type": "sentence", "content": "Mimic"}, {"type": "sentence", "content": "To distinguish between real and fake smiles, our brain evolved a relatively simple mechanism of lie detection. This mechanism largely relies on facial mimicry."}, {"type": "sentence", "content": "When we see an expression we perceive as genuine, our face responds by subtly mimicking its muscle activity. We can measure this response with the electromyogram, a machine that detects even the slightest facial movement (even those undetectable to the human eye). When we see a disingenuous expression, however, the machine detects nothing — our face is barren and unresponsive."}, {"type": "sentence", "content": "The smiles we tend to mimic the most are those that show the Duchenne display. This makes sense, given that for most people these smiles are difficult to fake: They come involuntarily from parts of the brain that process emotion. When we see them we assume the smile is genuine, mimic its muscle activity, and feel more trust for the smiler."}, {"type": "sentence", "content": "When we see a voluntary smile, however, the expression inspires no mimicry: We don’t find it genuine and feel no increased trust for the smiler. In some ways, our brain thinks they’re a huckster and a fraud. And so, instead of that list of positives we attach to the genuine smiler, the person gets the opposite: we find them less generous, less competent, and less trustworthy. We’re even less likely to hire them for that job."}, {"type": "sentence", "content": "Because of this, most selfies don’t produce a flattering smile. Rather, they broadcast an expression bankrupt of emotion that hints at a subtle form of chicanery. While a handful of selfie-takers might be able to game this system and artificially produce a genuine smile — creating a selfie we actually like — most of us cannot. You might want to keep this in mind the next time you reach for that selfie stick."}], "topic": "neuroscience"}