{"title": "The Psychology Behind a Pandemic", "data": [{"type": "subtitle", "content": "Using Maslow’s Hierarchy of Needs to predict user motivations throughout the life-cycle of COVID-19 (so far)."}, {"type": "sentence", "content": "If you’re in the field of UX Research, it’s more than likely that you’ve heard of a chap called Abraham Maslow — an American psychologist who theorised that people are motivated by a hierarchy of needs and drew up a framework that outlines them."}, {"type": "sentence", "content": "For those not in the know, take a look at the picture below:"}, {"type": "sentence", "content": "Maslow suggested our most basic need is to survive (I need food to eat, I need sleep, I need water to drink), and that this will be the primary motivation of our behavior. Only upon fulfilling that level of need does our motivation turn to the level above it, Safety. Again, once we’ve satisfied that need, we move onto the next level, and so on."}, {"type": "sentence", "content": "As a researcher, it’s key to understand this theory and how it reflects with people using your products and services."}, {"type": "subtitle", "content": "March 2020, Pre-Lock Down — Physiological Needs Motivate the Population."}, {"type": "sentence", "content": "In the lead up to the lockdown announcement of the United Kingdom due to COVID-19, the UK was almost in a state of anxiety."}, {"type": "image", "content": "https://miro.medium.com/max/5552/0*mgY5s78Bawb96dTp"}, {"type": "sentence", "content": "Panic buying set in, hand sanitiser was like gold dust, shopping centers introduced a ‘maximum of 2 per item’ policy on certain foods and a ‘one in, one out’ rule was set up to control the flow of consumers into the supermarkets. People were motivated by that very core need of ensuring they had enough food to survive the worst."}, {"type": "sentence", "content": "Maslow’s first stage of hierarchical needs is Physiological. “Will I have enough food to survive?” The behavior shown in March this year suggests some of the population were driven by that very biological motivation of having the basic means to endure."}, {"type": "subtitle", "content": "March 23rd, UK Lockdown"}, {"type": "sentence", "content": "On March 23rd, 2020, the UK Prime Minister Boris Johnson announced that the UK will be going into full lockdown and that the public must:"}, {"type": "sentence", "content": "For myself, this meant new routines, new ways of working, and finding new ways to ensure I’m still engaging with my users in this unprecedented time, all from the comfort of my own home…comfort, that’s the key here."}, {"type": "sentence", "content": "Being locked in the house started to fulfill stage two of Maslow’s hierarchy — Safety — something I would only recognise when running a study at the start of April, that we shall now discuss."}, {"type": "subtitle", "content": "April 2020, UK Lockdown — Safety Needs Motivate the Population"}, {"type": "sentence", "content": "At the beginning of April, the company I work for, like many other digital businesses, drafted up some FAQ’s that would sit on our website to ensure we answered any questions or concerns our customers may have regarding COVID-19. Being unsure as to whether these FAQs would answer the right questions, I took to UserZoom (a UX research tool that allows you to run studies remotely) to run some research and to ask the people…"}, {"type": "sentence", "content": "I won’t go into the full findings of the report, as that is not the point of this article however, one question I asked is very important and is the reason I’m writing this:"}, {"type": "sentence", "content": "Below is a word cloud based on feedback provided by participants that took the survey."}, {"type": "sentence", "content": "As you can see from the word cloud, the majority of people are concerned for their families with other themes around health being prominent."}, {"type": "image", "content": "https://miro.medium.com/max/2440/1*4qc5UrdsNA3vSPi_rJ599w.png"}, {"type": "sentence", "content": "Being locked in at home, for many, Stage 2 of Maslow’s hierarchy is being fulfilled. People feel safe and secure in their homes knowing that they wouldn’t come into contact with others potentially carrying the virus, however, concerns start to arise about families and their health evidencing that Stage 3 of Maslow’s hierarchy — Love and Belonging — is beginning to be the main motivation of the UK’s population."}, {"type": "subtitle", "content": "May 2020, UK Lockdown — Love and Belonging Needs Motivate the Population"}, {"type": "sentence", "content": "Knowing that over time the user needs change, it’s important to ask the same questions regularly and benchmark the answers against the responses. With the timeline of the pandemic moving on and with whispers that lockdown restrictions may be relaxed, early May was a perfect time to re-run the same study."}, {"type": "image", "content": "https://miro.medium.com/max/2452/1*rwfI-VTxLYHFx427fGLiGQ.png"}, {"type": "sentence", "content": "The word cloud this time shows some differences."}, {"type": "sentence", "content": "For the first time, we’re starting to see concerns about the state of the economy and also the word ‘job’ creeping in. Yes, the main concerns are still about health and family however, the questions around the financial impact this is going to have on the country and ourselves are beginning to surface."}, {"type": "sentence", "content": "This is a clear sign that, for the UK at least, our current motivational needs are sat in either Stage 2 or 3 (Safety and/or Belonging), dependent on our individual situations. Some fear the economy will be unstable and worry about the impact this will have on our lives showing the need for stability and job security. This, in turn, leads to the protection of our family’s and those close to us as we yearn for that love and belonging not just with our families but between colleagues and teammates."}, {"type": "subtitle", "content": "Serving our Customers"}, {"type": "sentence", "content": "Currently being in stage 2/3 of Maslow’s hierarchy, now is the time as businesses to push the “We’re here for you” message and to truly be there for your customer. Financial and economic concerns are high, so place your “Here’s some money back” or “Call us to discuss finance plans” notifications to prominent areas of your websites."}, {"type": "sentence", "content": "Stay in contact with them, let them know you aren’t going anywhere and that you’ll get through together. If you offer a service they need, now it is more important than ever to let your customers know you aren’t going bankrupt and you can still service their needs if you can."}, {"type": "sentence", "content": "Give them that helping hand they are desperate for. Quench that thirst for safety and belonging and you’ll find a customer who is more likely to stay true when all this is over."}, {"type": "subtitle", "content": "Stage 4 and the Future"}, {"type": "sentence", "content": "I can’t say when we’ll start seeing Stage 4 — Esteem — start to come into play. It could be days? Months? Years? Esteem is all about personal achievement, reputation, and the need for others to respect you. My colleague, Ian Batterbee raised a point that maybe now signs are starting to show with people baking more than ever, Tik Tok is trending more since being in lockdown and people are trying new things to gain ‘status’ from others."}, {"type": "sentence", "content": "For me, it’s about monitoring the situation on a regular basis with continuous research. With lockdown restrictions relaxed, the UK could see a regression to the progress we’ve already made. If ‘the curve’ starts to go back up, does general behavior start declining back down the hierarchy? Will we see another wave of panic buyers? Or will the optimist in me be right in hoping that things are starting to change for the better?"}, {"type": "sentence", "content": "I guess only time will tell…"}, {"type": "sentence", "content": "All this of course is just my take on a particular psychological theory and how it could be interpreted in the current COVID-19 climate. This article is an attempt to get some thoughts down and to maybe start a conversation around what other people think of it."}, {"type": "sentence", "content": "Please feel free to feedback, share your thoughts, and start a discussion."}, {"type": "sentence", "content": "Thank you"}, {"type": "sentence", "content": "Paul"}], "topic": "ux"}