{"title": "How to Reach Your Fullest Potential by Turning Your Assistant Into a Rockstar", "data": [{"type": "subtitle", "content": "Leadership"}, {"type": "subtitle", "content": "Unlock the untapped potential of your EA by changing their role to engagement manager instead"}, {"type": "image", "content": "https://miro.medium.com/max/4618/1*F7HumKDxEK2iXSKu9iPBIQ.jpeg"}, {"type": "sentence", "content": "After coaching hundreds of executives and assistants, I know that a great executive assistant (EA) has the potential to become more than a service provider; they can become an amazing partner who truly is capable of anticipating your next move; someone who enables you to reach your fullest potential as a leader and consistently contributes to the success of your company at the highest level — but only if that relationship is built right."}, {"type": "sentence", "content": "The decision to work with an EA is a pivotal moment, but the journey there often isn’t easy. It’s a story we’ve heard many times that usually looks something like this: It starts with a core team, led by a scrappy DIY-type CEO determined to become an exceptional leader and build something great."}, {"type": "sentence", "content": "But as the company becomes more successful, the pressures and responsibilities on the CEO mount, often causing them to feel increasingly less productive despite working longer hours."}, {"type": "sentence", "content": "It starts to feel like too much of their time is spent on tactical, low-impact aspects of being an executive—such as combating a constantly-overcapacity inbox, booking seemingly-endless meetings, or arranging nebulous travel details."}, {"type": "sentence", "content": "Unfortunately, this often comes at the expense of their direct reports’ needs, resulting in a CEO who feels like a bottleneck. As their backlog grows and increasingly-important responsibilities fall through the cracks, they begin to feel like they’re failing their team and undermining everything they’ve worked so hard to achieve."}, {"type": "sentence", "content": "This overwhelming reality often forces the leader to come face-to-face with the fact that the velocity of their team is limited by their velocity as CEO. They realize something has to change and look for ways to increase their throughput."}, {"type": "sentence", "content": "One of the most immediate solutions? Hiring an executive assistant."}, {"type": "sentence", "content": "In a perfect world, that hire would fix everything. That’s rarely the case because many people begin the EA/exec relationship with one of two restricting approaches:"}, {"type": "sentence", "content": "Both approaches often lead to disappointment, but it doesn’t have to be that way."}, {"type": "sentence", "content": "Whether you’ve been working with your EA for three months or three years—or even if you’re just thinking about taking the plunge—it’s my hope these five changes will help you take things to the next level."}, {"type": "subtitle", "content": "1. Climb Out of the Tradition Trap"}, {"type": "sentence", "content": "Most EAs have the potential to free up massive amounts of time, maximize productivity, and, most importantly, to enable you to reach your fullest potential as a leader, but too many execs never reach that level because they fall into what I call the “Tradition Trap.”"}, {"type": "sentence", "content": "As described above, many leaders subscribe to an outdated, uninspired, “traditional” vision for the role of an executive assistant. Ultimately, they settle for a glorified office admin: someone who manages travel, books meetings, and takes care of general administrative tasks."}, {"type": "sentence", "content": "As a result, they might describe their assistant as “helpful,” but not “game-changing.” They’re missing out. If you’ve invested in an EA, you’re probably sitting on a treasure trove of untapped potential. Why settle for anything less than game-changing?"}, {"type": "sentence", "content": "At my company, Mindmaven, we believe “game-changing” should be the standard. But for that to happen, a new approach and mindset are required from both EAs and execs. To that end, we created a new role we call an “engagement manager” (or EM). An engagement manager is a hybrid between a skilled EA and chief of staff, whose primary responsibility is empowering you to reach your fullest potential as a leader."}, {"type": "sentence", "content": "At the end of the day, if someone hires an assistant simply to “save time” or “be more productive,” they’re thinking too small. Working with an EM is about much more than saving 2-3 hours a day; it’s about becoming the leader that your team—and your company—deserves."}, {"type": "sentence", "content": "Although increased productivity is a natural part of that process, it shouldn’t be the end goal. Nearly every aspect of your role—from how you manage your inbox to the way you lead your team—has the opportunity to be transformed by an engagement manager. Here are a few examples."}, {"type": "subtitle", "content": "Clearing the bottleneck"}, {"type": "sentence", "content": "An EM can improve your velocity and throughput by tracking your commitments, structuring your day around your most important priorities, and ensuring you follow through on near-100% of your responsibilities faster than ever. For example, imagine …"}, {"type": "subtitle", "content": "Owning the inbox"}, {"type": "sentence", "content": "With the right skills, permissions, and calibration, an engagement manager can reduce the time you spend on email by 40-60%. How? By prioritizing your inbox into three categories before you even see it:"}, {"type": "image", "content": "https://miro.medium.com/max/1920/1*QRRAHxRZgDdHFnNrX3jIng.jpeg"}, {"type": "sentence", "content": "That alone can save hours each week, but it’s just the beginning: An EM can also empower you to deliver more meaningful email experiences by proactively identifying future interactions."}, {"type": "sentence", "content": "For example, imagine your EM sees an email in your inbox mentioning a former colleague's upcoming cross-country move. Three months later — without prompting from you — an email (written by your EM) shows up in your Drafts folder asking about the move and even recommending a few places they could take their family to celebrate settling in."}, {"type": "sentence", "content": "The best part? All you need to do to deliver this experience is to click “Send.”"}, {"type": "subtitle", "content": "Supercharging your team"}, {"type": "sentence", "content": "An EM can help you build stronger relationships with your team — often boosting morale and lowering attrition as a result — by enabling you to deliver higher-quality interactions across the company at deeper, more personal levels."}, {"type": "sentence", "content": "For example, imagine having a meaningful conversation with a team member and, two weeks later, a ready-to-send email shows up in your drafts folder (produced by your EM) sharing what you appreciated about the interaction and expressing (specifically and genuinely) how much you value their unique contributions to the company culture."}, {"type": "sentence", "content": "Hopefully, you can see the value in those examples. The point I want to drive home is that if you’re serious about becoming the type of leader your team needs, those tactics (and many others like them) aren’t just luxuries; they’re necessities. From that perspective, I believe working with an EM is one of the most important decisions you’ll make as an executive."}, {"type": "subtitle", "content": "2. Let Go of the Guilt Trip (and Stop “Splitting the Difference” with Your Team)"}, {"type": "sentence", "content": "Guilt is the silent saboteur of the exec/EA partnership, and often causes executives to put off hiring an assistant for too long with thoughts like, “It’s not fair that I get an assistant while the rest of the team struggles.”"}, {"type": "sentence", "content": "Even post-hire, guilt can continue to sabotage the partnership with suboptimal decisions, like sharing a single assistant between multiple executives or splitting their assistant’s focus between various roles (such as EA and office administrator)."}, {"type": "sentence", "content": "While the intentions are good, the results are often underwhelming because the leverage an EM can offer decreases exponentially for each additional executive they support. Ultimately, letting guilt guide decisions often leads to two things:"}, {"type": "sentence", "content": "The more divided an EM’s attention is, the less meaningful their impact on the things that matter most (such as helping you reach your fullest potential). We’ve yet to see someone achieve full leverage with a shared assistant. In our experience, the best results come from a single EM supporting a single executive."}, {"type": "sentence", "content": "Great assistants want to make an impact. Don’t set them up to fail. If guilt’s compromising your partnership with your EM, view it from a different perspective:"}, {"type": "sentence", "content": "Working 1:1 with a dedicated assistant isn’t about taking more than you deserve, it’s about empowering you to give your team the time, energy, and focus they deserve. In other words, working with an EM isn’t a privilege of leadership; it’s a duty to your team — treat it that way."}, {"type": "subtitle", "content": "3. Extinguish Trial-by-Fire (and Fast-Track Leverage)"}, {"type": "sentence", "content": "The costs associated with hiring an EM aren’t just limited to the salary or initial onboarding period. It’s important to also factor in the time and energy necessary to reach game-changing levels — and too often, execs underestimate how intensive that process can be."}, {"type": "sentence", "content": "Even an experienced EA has to climb a steep learning curve before they can become a fully-leveraged EM. The game-changing capabilities of engagement managers are the result of highly-personalized coaching and, too often, we see executives operate out of the sub-optimal mindset that because their EM’s primary responsibility is supporting their needs, they’re the only person who can properly onboard their assistant."}, {"type": "sentence", "content": "If that sounds like you, I’d challenge you to answer two questions honestly:"}, {"type": "subtitle", "content": "Are you really the best person to coach your EM?"}, {"type": "sentence", "content": "Great EMs aren’t hired, they’re coached into becoming great. But when execs coach engagement managers alone, they’re in danger of a) falling into the Tradition Trap and leaving value on the table, and b) training in the same inefficiencies they’re looking to eliminate."}, {"type": "sentence", "content": "While execs shouldn’t be totally removed from the onboarding process, their time is better spent on high-level calibration (like teaching their EM to draft emails in their voice or help plan meaningful date nights with their partner), not basic fundamentals (like learning to color-code a calendar or track action items)."}, {"type": "subtitle", "content": "Do you really have the time to invest in coaching an EM?"}, {"type": "sentence", "content": "As mentioned above, it’s easy to underestimate exactly how much time and energy it takes to onboard an assistant. Too often, I see execs try to take it on only to wind up overwhelmed as they attempt to balance this alongside their other responsibilities."}, {"type": "sentence", "content": "This usually ends with a frustrated exec settling for “good enough” because they don’t have the time needed to reach breakthrough levels with their EM. The problem with “good enough” is that it runs counter to the reason many execs hire an EA in the first place: contributing to the success of their team at the highest level."}, {"type": "sentence", "content": "One of the best ways to overcome those limitations is by bringing in a proven advisor to coach your EM on the skills they need to support you. Remember, working with an EM isn’t just about freeing up time; it’s about reaching your fullest potential as a leader, and that’s a path most effectively traveled with a coach who’s seen and done it before."}, {"type": "subtitle", "content": "4. Recognize the Biggest Limiting Factor (is You)"}, {"type": "sentence", "content": "If you resonated with the Limited Dreamer approach above, this one’s especially important: one of the easiest mistakes an exec can make is assuming they already “know it all” because they’ve worked with an EA before, or will “figure it out as they go.” The truth is the executive often needs even more coaching than the assistant."}, {"type": "sentence", "content": "Working with an EM requires fundamental shifts in the way an executive operates, and those changes often don’t come naturally. You could hire the most qualified, high-caliber EA possible… but if you don’t know how best to work with them, you’ll miss out on massive value. For example, do you know how to…"}, {"type": "sentence", "content": "All that’s just scratching the surface. If you’re serious about maximizing your partnership with your assistant, working with a coach is one of the best ways to reach that level as quickly (and painlessly) as possible."}, {"type": "subtitle", "content": "#5: Give Your EA a Day-One Promotion"}, {"type": "sentence", "content": "Execs with a limited vision for the role of an EA undercut the success of that relationship from day one. One of the primary reasons this happens is that people still view EAs as mere service providers. In contrast, the execs I’ve seen achieve the most success with their assistants view them as partners, rather than just “assistants.”"}, {"type": "sentence", "content": "For these execs, this hire meant founding a new two-person team (the exec and the EM) with a single goal: empowering the executive to contribute to the success of their team at the highest level. This mindset shift is critical for the success of the relationship, and leads to three benefits:"}, {"type": "subtitle", "content": "The “extra mile” as the new standard"}, {"type": "sentence", "content": "An EM who feels like a valued partner, not just a service provider, looks for opportunities to go above-and-beyond."}, {"type": "sentence", "content": "For example, your EM might hear about a recent intern-turned-engineer who pulled an all-nighter to restore server stability, and do three things:"}, {"type": "sentence", "content": "A service provider might be so disconnected from the team they don’t even hear about the event — or, if they do, think something like that goes beyond their responsibilities. A partner, on the other hand, is constantly looking for opportunities to go the extra mile."}, {"type": "subtitle", "content": "Support through (inevitable) hard times"}, {"type": "sentence", "content": "As an exec, it’s easy to feel a sense of isolation that can negatively impact your ability to lead your company. An EM partnership can relieve some of that pressure by giving you the confidence you have someone in your corner, who can lighten some of the burdens that come with leadership."}, {"type": "sentence", "content": "After all, if your EM has full access to your inbox and calendar, they know your business and it’s challenges like no one else. That insight allows them to empathize with you on a level few others can, enabling them to become the one person in your company you can openly share your concerns and doubts with (since they probably already know them)."}, {"type": "sentence", "content": "For example, imagine having to break the news to the team that a major VP of Marketing candidate fell through last-minute. In the heat of the moment, that sense of isolation may start to set in."}, {"type": "sentence", "content": "With an EM, you could safely vent the frustrations you might not be able to share with the rest of the team and — most importantly — brainstorm actionable next steps and plan how to share the news."}, {"type": "subtitle", "content": "Limitless scalability"}, {"type": "sentence", "content": "Hiring an EM means founding a new two-person team, but there’s no reason that team can’t grow. It’s not uncommon to see an exec hire an EM, get “addicted” to the benefits, then hire another to create even more powerful results."}, {"type": "sentence", "content": "For example, after a year or two, your EM may become such an integral part of the company that they’re more chief of staff than assistant. At this point, it may not make sense for them to continue managing your calendar or shadowing your inbox."}, {"type": "sentence", "content": "Instead, you may assign them higher-impact directives (such as helping with the recruiting process for a Head of Growth or organizing and prioritizing executive KPIs), then have them hire a junior EM for calendar management, email drafting, and meeting debrief processing."}, {"type": "sentence", "content": "Think of your EM as an invaluable partner in one of your company’s most important teams — someone who plays an integral role in enabling you to be the leader your organization needs to reach its fullest potential."}, {"type": "sentence", "content": "Anything less and you may be selling yourself, your EM, and your team short."}], "topic": "leadership"}