{"title": "Your Very Detailed Guide to Safely Staying in a Rental House", "data": [{"type": "subtitle", "content": "What to know, what to disinfect, and whether it’s okay to swim in the pool"}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*IQrfD0AtunedTmJfusc4OQ.png"}, {"type": "sentence", "content": "With travelers clearly still wary of hotels — in April, bookings were down by a staggering 85% compared to last year — many are instead considering (or already planning) a stay in a home rental property this summer."}, {"type": "sentence", "content": "Eleanor Murray, ScD, assistant professor of epidemiology at Boston University’s School of Public Health, agrees that a rental house can be a good way to take a vacation in the next few months. Unlike hotels where you will naturally come into contact with more people (cleaning staff, other guests, and so on), she says staying in a place where it’s just you and your chosen unit could be safer. “When you get there you can make sure everything is sanitized to a level that you’re comfortable with, and then it would be just like your house,” she says."}, {"type": "sentence", "content": "Still, there are a few issues you’ll need to navigate to ensure a safe stay. Here’s what to know."}, {"type": "subtitle", "content": "How home-sharing companies are responding to Covid-19"}, {"type": "sentence", "content": "Last month, Airbnb announced plans to launch an “Enhanced Cleaning Initiative” in May (it’s not up yet, but an Airbnb spokesperson confirms it’s on track to launch this month). The new protocol offers hosts Covid-19–specific cleaning guidelines informed by the CDC and other health experts like Vivek Murthy, MD, the former surgeon general of the United States. Hosts will receive training on important cleaning and sanitation practices, like how to properly use personal protective equipment while cleaning a home (like wearing a mask and gloves) and what disinfectants are EPA-compliant. The initiative will also require hosts to leave a 24-hour window between bookings to minimize the risk of airborne particles in the space."}, {"type": "sentence", "content": "If a host does not commit to completing the training for the heightened cleaning protocol, they can still opt in to something called “Booking Buffer,” which includes a 72-hour vacancy period between guest stays. Hosts can also opt out of participating in either of these new precautions, so be aware that neither of these are mandatory. Check the listing page to be sure."}, {"type": "sentence", "content": "Vrbo has released updated cleaning guidelines for hosts. While there does not appear to be any formal sort of certificate program hosts can complete like Airbnb’s new initiative, Vrbo hosts can add information like what disinfectants are being used at the property, booking buffer policies, and contactless-check-in options to their property descriptions."}, {"type": "sentence", "content": "If you’re booking a home on Airbnb, Vrbo, or another home-sharing website and you do not see a clear indication on the listing about what cleaning and sanitation measures are being taken, it is safest to contact the host ahead of time to ask for specifics."}, {"type": "subtitle", "content": "Determining your guest list"}, {"type": "sentence", "content": "Deciding exactly who and how many people should join you at a summer rental house will be trickier this year given that more people means more risk. The public health experts I spoke to didn’t have a definitive group size that they would consider to be safe. Instead, they say it’s more about how big the rental house is, gauging how well you know the other guests, and deciding how much you trust them."}, {"type": "sentence", "content": "“If you’re a few days into your vacation and someone gets a fever, there should be enough space in the house to put that person in their own room with their own bathroom so that they don’t infect anyone else,” says Murray. “If you have too many people in the house for that to be possible, then you have too many people. Ideally, you want a bedroom per person and at least two bathrooms.”"}, {"type": "sentence", "content": "Marissa Levine, MD, the director of the Center for Leadership in Public Health Practice at the University of Southern Florida, says this isn’t the summer to be cohabitating with friends of friends or people who you don’t know all that well. “Are these family members who have been tracking their potential exposure to the virus or are these strangers? These things matter. This is going to be a time where erring on the side of caution is a smart thing to do.”"}, {"type": "sentence", "content": "Another important factor to consider is what sort of transportation guests will require in order to get there. Murray says the ideal situation is that all guests going to the house spend 14 days before the trip being as quarantined as possible at home before driving straight to the rental house without making any stops along the way."}, {"type": "sentence", "content": "“If you need to do a lot of potential exposure to get to your vacation destination [for example, flying there] then you want to be treating the vacation as one where it’s just you and your family or household alone,” Murray says."}, {"type": "sentence", "content": "Finally, when staying in such close quarters with extended family or friends, multiple experts urge travelers to remember that it’s important to remain vigilant about sanitation precautions. “People tend to take huge precautions when they are face-to-face with strangers, say someone who is renting a home to you or a gas station attendant,” says Kumi Smith, PhD, an assistant professor of epidemiology and community health at the University of Minnesota. “But from what we know, viruses like this mostly spread among people who know each other because that’s who we let our guard down with the most. If you’re going to socialize with friends, just be aware that there is a possibility that one of you might infect the other, and understand what that would mean. As friends, think through not only how to avoid it, but also what will you do in the event that someone does get sick? Thinking that through will help everyone understand what precautions and what risks they’re willing to take before they move ahead.”"}, {"type": "subtitle", "content": "Should you sanitize your rental?"}, {"type": "sentence", "content": "How much cleaning and sanitizing you do upon arrival depends largely on how much you trust what cleaning measures the host says they’re taking and what your initial observations are about the cleanliness of the place. If you’re staying in an Airbnb that has committed to the “Enhanced Cleaning Initiative” there’s still no official inspection being done. You will have to trust that the hosts are really doing everything they say they are."}, {"type": "sentence", "content": "It’s a good idea to bring along some EPA-approved disinfectants to wipe down high-touch surfaces throughout your stay, but you don’t necessarily need to black-light the place. “Be a detective,” says Jack Caravanos, DrPh, a clinical professor of environmental public health sciences at NYU. “Does it smell like it’s been cleaned? Look for dust. Look for evidence that it’s been sanitized. If it smells good and I see that there are bottles of hand sanitizer, then I would feel good about how sanitized it is.”"}, {"type": "sentence", "content": "“Something I would do is have a disinfectant spray and spray all commonly touched surfaces — tabletops, side tables, chairs, handles, things like that,” says Smith. “The other places are places we don’t always think about: light switches, knobs on doors, phones, and TV remotes.”"}, {"type": "sentence", "content": "Bedding is another big thing that will ultimately come down to personal judgment. Does it look clean? Do you trust that the host has gone above and beyond to sanitize it properly? Airbnb’s current cleaning guidelines asks hosts to wear gloves while handling linens and recommends washing everything (bed sheets, mattress covers, hand and bath towels, kitchen towels, and blankets) on the highest heat setting possible. It also asks hosts to avoid shaking laundry to help decrease the spread of germs. If you still feel uneasy about using bedding in a rental house, it can’t hurt to bring your own set along (or re-wash what’s there, if the house has a washer and dryer)."}, {"type": "subtitle", "content": "Some specifics to consider during your stay"}, {"type": "sentence", "content": "If you’re in a home rental with people outside of your usual unit, it’s not a bad idea to open up the windows in the house as much as possible to increase air flow and minimize risk. However, if you do want to turn the air conditioner on, that shouldn’t be a major cause for concern."}, {"type": "sentence", "content": "“There’s no risk from the AC itself,” says Caravanos. “Air conditioning units are not reservoirs.” By that he means there is no water supply in the unit where pathogens can live. “Don’t think that when you turn it on it will blow out residual particles waiting to infect,” he says."}, {"type": "sentence", "content": "Caravanos says the only potential concern associated with using an AC unit is that lower temperatures provide better conditions for any existing virus particles. “Chilling a rental house will theoretically mean the virus can live longer on cloth or plastic or counters. That’s all theoretical though because if you disinfect surfaces the survivability of the virus doesn’t matter.”"}, {"type": "sentence", "content": "If your rental has a pool or Jacuzzi, Caravanos also says it’s nothing to worry about. “Covid-19 is very susceptible to disinfectants and will not survive in these environments. All EPA disinfectants, ozone, UVC, chlorine, and ammonium easily kill and inactivate the virus,” he says. Regular and proper maintenance of a pool should be enough. Even saltwater pools get Caravanos’ okay."}, {"type": "subtitle", "content": "After you get home"}, {"type": "sentence", "content": "If you’re traveling with people in your household, Murray says there’s no reason to do any kind of additional quarantine when you return home. But “If you have to fly to the rental home or if you have to drive for a couple of days and you’re staying in hotels, those are places where you could have gotten infected and it gets a little bit more complicated,” says Murray. If extensive travel is needed to get to and from or you were at the house with people outside of your usual unit you may want to quarantine at home as much as possible for 14 days after your trip to be safe."}, {"type": "sentence", "content": "As always, it’s best to avoid coming into close contact with anyone in an at-risk group or any elderly relatives, but Smith says it’s particularly important not to do so for two weeks after the trip in case you did pick something up. She also advises that the people who stayed in the house keep in touch after the trip about how they’re feeling. “If anyone feels symptomatic afterward it’s really important to tell everyone else,” Smith says."}], "topic": "travel"}