{"title": "15 Innovative Business Ideas You Can Launch From Home Today", "data": [{"type": "subtitle", "content": "There’s never been a better time to start your own business."}, {"type": "sentence", "content": "More people are working from home than ever, which means you have got the flexibility to get your day job done quickly and work on starting and building your own business as a side hustle."}, {"type": "sentence", "content": "We’re going to explore 15 useful and practical ideas that you can actually start today. This isn’t a generic list of “Start a blog” or “Do consulting”. These are specific business ideas with steps and tips to help you get started."}, {"type": "sentence", "content": "I’m sharing them with you because I don’t have the time to make them all happen. And I want to see them happen. If you do start one — I’ll help you!"}, {"type": "sentence", "content": "Starting your own business is one of the most exciting journeys you can embark on. The learning curve is steep, but there’s no better decision you can make if you want to learn about the business world, and yourself."}, {"type": "sentence", "content": "It might be hard work, but the truth is, starting your own business has never been easier. Because of the tools that are available, the barrier to entry is so low."}, {"type": "sentence", "content": "For some people though, the trick is finding the right business idea. Is it innovative enough? How do I know if it will work? These are all valid questions."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*tqMA3ySVutTTWXaE.jpg"}, {"type": "sentence", "content": "In this guide, we’re going to go through 15 innovative business ideas that you can launch from the comfort of your home today. Each idea will have the following attached to it:"}, {"type": "sentence", "content": "You’ll know you’ve come across the right idea when you stop and think “Oh, I know a bit about that industry” or “That sounds exciting!”."}, {"type": "sentence", "content": "Here’s a summary of what we’re going to be getting into in this post:"}, {"type": "sentence", "content": "Ready to explore some business ideas? Let’s dive in!"}, {"type": "image", "content": "https://miro.medium.com/proxy/0*1djDpca3KChdgrQz.jpg"}, {"type": "subtitle", "content": "Business Idea #1: Write a “How to Make Bread” eBook"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: Basic writing, basic photography."}, {"type": "sentence", "content": "Key to Success: Solid outreach."}, {"type": "sentence", "content": "Revenue Model: Sales of eBook and Affiliate marketing"}, {"type": "sentence", "content": "As more people start working from home, they are discovering their kitchens. During the period of coronavirus, there has been a huge spike in interest for homemade bread."}, {"type": "sentence", "content": "Check out the search trends for the keywords: “homemade bread” below. Crazy!"}, {"type": "image", "content": "https://miro.medium.com/max/1898/0*vCRER84shUX3A3HT.jpeg"}, {"type": "sentence", "content": "Some other keywords which have seen a huge rise include:"}, {"type": "sentence", "content": "So, the interest is there. How do you capitalize on it?"}, {"type": "sentence", "content": "Provide useful information to newbies. I can hear you saying, “But I know nothing about bread”. It really doesn’t matter."}, {"type": "sentence", "content": "Take an afternoon to watch some YouTube videos on how to bake bread. Spend a week watching content on it in your free time and then on the weekend bake some yourself (take lots of photos of the process). Share your journey on social media — especially the fails."}, {"type": "sentence", "content": "Soon, you’ll know more than the average Joe. Put that information down into an eBook and sell it on Gumroad."}, {"type": "sentence", "content": "The key to success here is doing something slightly out of the ordinary that catches the reader’s attention. Find a niche within bread baking and hone in on it. Maybe it’s bread baking with a basic kitchen. Maybe it’s bread baking for absolute beginners."}, {"type": "sentence", "content": "Another key to success here is to use your personal network to get this out into the world."}, {"type": "sentence", "content": "I wrote an extended guide to building a $10 000 USD per month business by selling an eBook on my last Signal."}, {"type": "subtitle", "content": "Business Idea #2: Start A Comedy Podcast"}, {"type": "sentence", "content": "Difficulty Level: 3/5‍"}, {"type": "sentence", "content": "Main Main Skills Required: Humor/Natural charisma"}, {"type": "sentence", "content": "Key to Success: Authenticity"}, {"type": "sentence", "content": "Revenue Model: Advertising"}, {"type": "sentence", "content": "People are consuming more media than ever. Podcasts are the in thing. They’re convenient, easy to consume during breaks, and if they’re good — you can’t get enough of them."}, {"type": "sentence", "content": "During a difficult period of stress and hardship, people turn to comedy for relief."}, {"type": "sentence", "content": "If you’re a naturally funny person, you may be able to pull of a podcast that people want to listen to."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*t135A2bfJY2TGC5Q.jpeg"}, {"type": "sentence", "content": "It’s expected that podcast ad revenue will exceed $1 billion by 2021. That doesn’t even account for the large number of podcasts or podcast services which charge a subscription fee or work on a freemium model. The podcast industry is a great place to make some income through a side hustle."}, {"type": "image", "content": "https://miro.medium.com/max/940/0*D3F77VcjcRuv63k1.png"}, {"type": "sentence", "content": "I’ve been following the topic for a few months and have collected tips from all over the web. Here are some of them:"}, {"type": "sentence", "content": "Tip #1: Be authentic. Don’t try be something you’re not. People want to feel like they’re experiencing a real version of you. The more authentic you are the better. Let your quirks come out, you’d be surprised how it sets you apart."}, {"type": "sentence", "content": "Tip #2: Keep ’em short. People don’t want more than an hour. Edit well so each episode is good from start to finish."}, {"type": "sentence", "content": "Tip #3: Find some podcasts that you like. Listen to them critically. Write down what they do well and what you enjoy about them. Read comments and reviews on Reddit. Use to make yours great."}, {"type": "sentence", "content": "Tip #4: Use an external mic. People care about sound quality. Don’t spend too much cash initially. A pair of earphones or headphones works great, just don’t use your computer speaker. Once you’ve got a bit of a following you can splurge on a proper mic."}, {"type": "sentence", "content": "Tip #5: Plan your guests. Plan out your publishing schedule and have a plan of accepted guests for at least 5 episodes in advance at all times. Focus on great guests in the beginning."}, {"type": "sentence", "content": "Tip #6: Find someone to co-host if possible. When you have two personalities behind the mic, there is double the chance that someone will like the podcast. Pick someone you know well so there is a natural synergy. You should both be interested in the topics being discussed and your thinking and performance should compliment each other. The right partner can make or break the show!"}, {"type": "sentence", "content": "If you don’t want to go with comedy — true crime is another very popular genre."}, {"type": "sentence", "content": "I’m busy with a complete resource for starting a podcast. You can find that here. ‍"}, {"type": "subtitle", "content": "Business Idea #3: Create a Fitness Blog"}, {"type": "sentence", "content": "Difficulty Level: 3/5‍"}, {"type": "sentence", "content": "Main Skills Required: Some knowledge of a fitness niche, writing skills, basic web design skills"}, {"type": "sentence", "content": "Key to Success: Results"}, {"type": "sentence", "content": "Revenue Model: Course/Community Sales, eBook sales, Consulting sales."}, {"type": "sentence", "content": "When there’s not much else to do, people are turning to exercise. It’s a way for everyone to also stay sane and get some endorphins going."}, {"type": "sentence", "content": "As people have been forced to exercise more from home, they’ve realized the benefits of a quick and easy home workout."}, {"type": "image", "content": "https://miro.medium.com/max/2728/0*mgpEpScc2pTaTHqb.jpeg"}, {"type": "sentence", "content": "I’m a runner. This is how I’d approach it:"}, {"type": "sentence", "content": "The key to success here is being able to demonstrate that whatever you’re teaching can give results. The main reason people are working out is to lose weight and stay fit and healthy. If you can demonstrate that whatever you’re teaching works — you’re going to build a loyal following."}, {"type": "sentence", "content": "Host your content on a quick and easy Wordpress blog. Don’t spend too much time worrying about the details of that. Start with the content first, then you can spend a bit of time making it look pretty."}, {"type": "subtitle", "content": "Business Idea #4: Write a Work From Home eBook"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: Writing, little bit of tech knowledge."}, {"type": "sentence", "content": "Key to Success: Manual sales outreach."}, {"type": "sentence", "content": "Revenue Model: eBook sales."}, {"type": "sentence", "content": "Chances are, if you are reading this — you’ve got the tech knowledge to make this happen."}, {"type": "sentence", "content": "Remote work is going to be a part of our lives from now on. Google has come out and said it expects the majority of its employees to work from home until 2021."}, {"type": "sentence", "content": "What this means is that there are a lot of workers who are going to be working from home who are not tech-enabled."}, {"type": "sentence", "content": "As a person who has grown up with technology around me, I take for granted the ability to quickly learn and adopt new hardware and software programmes. For some, it’s not that easy."}, {"type": "sentence", "content": "Watching my dad’s workforce transition to a work from home environment has been an eye opening experience. The truth is, the majority of people who are older than 40 (and some below that age too) are going to have difficulty moving to working from their home."}, {"type": "sentence", "content": "Write an eBook which gives practical tools and tips for remote workers. Here are some things I’d include:"}, {"type": "sentence", "content": "Gumroad is a great place to sell the eBook. You can create an easy landing page and drive traffic there with ads or organically."}, {"type": "sentence", "content": "When you’re done, email 10 companies and attach the book to the email (for free). Ask them to distribute to their employees in exchange for their feedback and a punt. Use their feedback to make it better and include testimonials on your landing page."}, {"type": "subtitle", "content": "Business Idea #5: Do Online Consulting for Businesses Converting to Remote Work"}, {"type": "sentence", "content": "Difficulty Level: 1/5‍"}, {"type": "sentence", "content": "Main Skills Required: Communication. Minimal tech knowledge."}, {"type": "sentence", "content": "Key to Success: Speaking to business owners fears, agitate the need."}, {"type": "sentence", "content": "Revenue Model: Either per hour billing or once off transition fee."}, {"type": "sentence", "content": "Business owners are facing an unprecedented transition in the way they do business. Most have been forced to set their employee’s up for remote work."}, {"type": "image", "content": "https://miro.medium.com/max/2728/0*Toleqn1SXTIRuM-m.jpeg"}, {"type": "sentence", "content": "That comes with a whole host of challenges. Here are some things every business owner that has had his or her team go remote has to consider:"}, {"type": "sentence", "content": "All of these can be tackled with a good work from home policy."}, {"type": "sentence", "content": "This is how I’d do it:"}, {"type": "sentence", "content": "The key to success here is that initial video call, and communicating effectively. Be efficient and make sure your solution speaks to every single one of the fears that the business owner brings up."}, {"type": "sentence", "content": "Starting an online consulting service is a great way to quickly start your own business. It’s an innovative business idea which a lot of business owners have a need for in today’s world."}, {"type": "subtitle", "content": "Business Idea #6: Drop Servicing"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: Optional web design"}, {"type": "sentence", "content": "Key to Success: Finding the right niche"}, {"type": "sentence", "content": "Revenue Model: Services arbitrage"}, {"type": "sentence", "content": "Drop servicing is the new drop shipping."}, {"type": "sentence", "content": "It’s an up and coming trend where people looking to start their own business facilitate work. Here’s how it works:"}, {"type": "sentence", "content": "Pretty simple, hey?"}, {"type": "sentence", "content": "Drop servicing is simply the act of facilitating an online transaction for a business owner by using a freelancing marketplace like Fiverr."}, {"type": "sentence", "content": "The key to success here is finding the right niche to operate in."}, {"type": "sentence", "content": "First and foremost, it’s best to choose a niche you have some experience in. That way, you can add some value to the project and you’re doing more than just facilitating the deal."}, {"type": "sentence", "content": "From our example above, if you had some wordpress design skills, you could do the work of compiling the blogs into SEO-friendly environment and getting the Business Owner set up for SEO success. You charge an hourly rate for that too."}, {"type": "sentence", "content": "The more value you can add — the better. You’ll set yourself apart from other traditional drop-servicers who just outsource everything."}, {"type": "sentence", "content": "Make sure you get a clear budget from the business owner first, or give them a clear quote so that you both know what you’re in for. The last thing you want is to have to pay a bunch of freelancers for their work and the business owner turns around and says, “That’s too expensive”."}, {"type": "sentence", "content": "Drop servicing is a great business idea because it requires little time investment and if you’re operating in a high-price niche, there is significant income to be made."}, {"type": "subtitle", "content": "Business Idea #7: Online Subscription Services for Home Goods"}, {"type": "sentence", "content": "Difficulty Level: 3/5‍"}, {"type": "sentence", "content": "Main Skills Required: Online store setup, Search engine marketing."}, {"type": "sentence", "content": "Key to Success: Finding the products."}, {"type": "sentence", "content": "Revenue Model: Selling products at a mark up."}, {"type": "sentence", "content": "Marc Lore started Diapers.com in 2005. It was initially called 1800Diapers. All they did was deliver baby diapers to moms around America. No one was doing it yet."}, {"type": "sentence", "content": "Marc was told that diapers are a “loss leader” in supermarkets, so he should steer clear. Diapers.com is now worth over $750 Million USD."}, {"type": "sentence", "content": "People are transitioning to online shopping more and more. The rise of the eCommerce giant Amazon has meant a transition to online shopping has become more and more prevalent as delivery times and costs have plummeted."}, {"type": "sentence", "content": "Online shopping now accounts for 16% of all retail transactions as of 2019."}, {"type": "sentence", "content": "One of the great things about home goods, is that they have a very low return rate. People know what dish-washing soap they like, and they don’t need to try it on."}, {"type": "sentence", "content": "Home goods also lend themselves to a subscription-based model where you can increase the lifetime value of a customer."}, {"type": "sentence", "content": "Here’s what I’d do:"}, {"type": "subtitle", "content": "Business Idea #8: Athleisure Clothing Company"}, {"type": "sentence", "content": "Difficulty Level: 4/5‍"}, {"type": "sentence", "content": "Main Skills Required: Online store setup. Digital marketing."}, {"type": "sentence", "content": "Key to Success: Quality product + market fit (haha!)"}, {"type": "sentence", "content": "Revenue Model: Selling online products"}, {"type": "sentence", "content": "The athleisure industry has taken off."}, {"type": "image", "content": "https://miro.medium.com/max/2728/0*qp9fyurhkIsBA25T.jpeg"}, {"type": "sentence", "content": "More people are working out and staying fit. As they’re doing that, they’re realising that athletic clothing is actually quite comfortable too. And so ‘athleisure’ has been born. It’s the baby-child of athletic wear and leisure wear. It looks good — but feels even better."}, {"type": "sentence", "content": "Some popular brands in the space right now include:"}, {"type": "sentence", "content": "The key to success here is finding a loyal customer base. Don’t try and be everything to everyone. Nail down on a niche and start there."}, {"type": "sentence", "content": "Make your value proposition clear. Here’s an example: “Performance when you need it, comfort when you want it.”"}, {"type": "sentence", "content": "‍I’d go for a niche like athleisure for trail runners. Find out what they like, verify the demand, and then find a manufacturer. One thing I’ve learned from starting my own online clothing company: Start with a local manufacturer! You want to have control and be able to iterate your product. It’s very difficult to do that when the manufacturer is overseas."}, {"type": "sentence", "content": "Work with some up and coming influencers for quick exposure."}, {"type": "subtitle", "content": "Business Idea #9: Bespoke Men’s Tee’s"}, {"type": "sentence", "content": "Difficulty Level: 3/5‍"}, {"type": "sentence", "content": "Main Skills Required: Setting up an online store. Digital marketing."}, {"type": "sentence", "content": "Key to Success: Quality product."}, {"type": "sentence", "content": "Revenue Model: Selling online products."}, {"type": "sentence", "content": "The men’s tee. Many have tried, and many have failed."}, {"type": "sentence", "content": "<blockquote class=”twitter-tweet”><p lang=”en” dir=”ltr”>What’s the best tshirt brand?<br><br>I want plain colors and durability. No bacon collar. <br><br>Good fit to show off my potentially huge muscles (one day, maybe) a plus. <br><br>So…which brand should I buy? <a href=”https://t.co/Pd9P4BZgPZ\">pic.twitter.com/Pd9P4BZgPZ</a></p>&mdash; Sam Parr ⚪️ (@theSamParr) <a href=”https://twitter.com/theSamParr/status/1258813383563829248?ref_src=twsrc%5Etfw\">May 8, 2020</a></blockquote> <script async src=”https://platform.twitter.com/widgets.js\" charset=”utf-8\"></script>"}, {"type": "sentence", "content": "The men’s tee has something of a cult following. There are men all over the world looking for a reliable t-shirt that has the following features:"}, {"type": "sentence", "content": "No fancy features. No fancy designs. If you can get the above right, you’ll have men all over the world ready to reach for their wallets. T-shirts are an essential. They’re something every single man in the world needs."}, {"type": "sentence", "content": "The key to success here is definitely a quality product. Tick the boxes above, and you’ve found yourself a winner."}, {"type": "sentence", "content": "What I’d do is take a note from Sam Parr’s tweet and search on Twitter for posts about men’s tee’s and people looking. If they’ve got anything above a 5000 follower count, send htem a free tee with a note:"}, {"type": "sentence", "content": "“I noticed you were interested in a plain men’s tee. I think I’ve got a winner. It’s soft, durable and won’t stink. I’d love some honest feedback if you wouldn’t mind me sending you one for free?”. If they like it, chances are they’ll promote it."}, {"type": "sentence", "content": "Focus on reviews. Build a cult following."}, {"type": "subtitle", "content": "Business Idea #10: Employee Care Packages"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: People skills. Setting up an online store."}, {"type": "sentence", "content": "Key to Success: Being willing to do the initial legwork."}, {"type": "sentence", "content": "Revenue Model: Selling products online."}, {"type": "sentence", "content": "I feel like I’m harping on about employees going remote. Maybe I am."}, {"type": "sentence", "content": "Here’s another business idea you can action that has to do with the movement of people out of offices."}, {"type": "sentence", "content": "In my newsletter, The Signal, I surveyed business owners on the following question:"}, {"type": "sentence", "content": "“Would you like to send your employee’s a care package which shows them that you care?” The overwhelming majority (79%) of the 650+ responses said that they would."}, {"type": "sentence", "content": "For those that said No, I asked another question:"}, {"type": "sentence", "content": "“If the care packages were made up of products that supported other local businesses in your area (think bee keepers, bakeries, barber shops etc.), would you reconsider?”. Of the 21% of people who responded with No, 66% changed their mind based on the above consideration."}, {"type": "sentence", "content": "Keepyourcitysmiling.com is doing this in a few cities around the USA. Since mid-march, they have topped $280 000 USD in revenue."}, {"type": "sentence", "content": "To make this happen, you’re going to have to do a little bit of initial leg work which involves reaching out to all the businesses in the cities you’re trying to target and set up the logistics of how you get their products into your boxes, and at what prices."}, {"type": "sentence", "content": "You’ll then need to do some outreach to business owners. Send them a link to a quick online store, mention the local businesses you’ve partnered with and ask if they want a pre-filled box or custom boxes for their employees."}, {"type": "sentence", "content": "Make the process as efficient as possible for them. You want them to be able to do everything in a few clicks. Business owners are busy people."}, {"type": "sentence", "content": "Here’s a growth hacking tip: Allow personal notes from employers. Then on the back of the notes, write something about each of the businesses you’re supporting. Encourage the employee’s to take a photo of their box and tag the relevant businesses (and you) on a social media post. Free marketing."}, {"type": "subtitle", "content": "Business Idea #11: Meal Planning Blog"}, {"type": "sentence", "content": "Difficulty Level: 1/5‍"}, {"type": "sentence", "content": "Main Skills Required: Writing. Little bit of cooking knowledge. Digital design."}, {"type": "sentence", "content": "Key to Success: Great content."}, {"type": "sentence", "content": "Revenue Model: Affiliate, if possible. Otherwise eBook and Recipe sales."}, {"type": "sentence", "content": "What’s the worst part about having dinner? Finding something to have for dinner."}, {"type": "sentence", "content": "I’ve been staying with my parents for this lockdown period and the saying is that “When it’s your night for dinner, you’re not allowed to ask for help on deciding what to make for dinner — that’s the hard part.”"}, {"type": "sentence", "content": "Meal planning also saves busy people time. There’s mental fatigue involved in deciding what to cook."}, {"type": "sentence", "content": "Here are some different niches you could create meal plans for:"}, {"type": "sentence", "content": "The revenue model here is a tricky one."}, {"type": "sentence", "content": "The key to success is going to be creating value for your readers. Give them three weeks of meal planners so they can experience the convenience of your product. Then charge for a more in-depth product that includes grocery lists and recipes etc."}, {"type": "sentence", "content": "I’d do an eBook, with recipes and templates bundled as part of the product. Focus on high volume and a subscription model."}, {"type": "sentence", "content": "If you make this — I’d probably pay for it. I hate deciding what to eat."}, {"type": "subtitle", "content": "Business Idea #12: Help Local Business Set Up (And run?) Online Stores"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: Setting up an online store. Digital design."}, {"type": "sentence", "content": "Key to Success: Finding and targeting businesses which lend themselves to online commerce."}, {"type": "sentence", "content": "Revenue Model: Profit share on extra revenue generated through online sales."}, {"type": "sentence", "content": "We’ve already discussed how more and more retail is moving online."}, {"type": "sentence", "content": "Helping local businesses set up their online stores for success would be a great and easy business you can start today."}, {"type": "sentence", "content": "It would require some knowledge of ecommerce. If you don’t have that — it’s extremely easy to learn. Most sites like Shopify have tutorials set up which show you exactly how to set up a store and run it."}, {"type": "sentence", "content": "You could include a suite of services you could either provide yourself, or outsource (See Business Idea #6: Drop Servicing). Some of those might include:"}, {"type": "sentence", "content": "The trick here is to find an efficient way to convert the businesses current offering into one that is compatible with an online store. You may have to get creative with your fulfillment."}, {"type": "sentence", "content": "Each situation and business is unique. The more thought you can put into it, the better."}, {"type": "sentence", "content": "Here’s something to consider: Operate on a profit share model. You get a share of any additional revenue you create for the business. That way, you’re not actually costing them any money, and you’re incentivized to make it work. Win-win."}, {"type": "subtitle", "content": "‍Business Idea #13: Second Hand Niche Clothing"}, {"type": "sentence", "content": "Difficulty Level: 4/5‍"}, {"type": "sentence", "content": "Main Skills Required: Setting up an online store."}, {"type": "sentence", "content": "Key to Success: Finding the right niche and creating a brand that resonates."}, {"type": "sentence", "content": "Revenue Model: Take a commission on the transaction value."}, {"type": "sentence", "content": "High fashion has become the fashion. Super niche brands like Supreme are taking the fashion industry by storm. British GQ called Supreme the “coolest streetwear brand in the world right now”."}, {"type": "sentence", "content": "The only problem? It’s supremely expensive. (ha-ha)"}, {"type": "sentence", "content": "Most of these high-fashion brands are bought by the uber-wealthy who will likely only wear the garment once or twice and then it becomes ‘uncool’. They don’t want to be seen wearing the same clothes again."}, {"type": "sentence", "content": "The opportunity here is to create a marketplace for high-fashion clothing. Rotaro.co.uk is a company in the UK which rents out high-fashion women’s dresses."}, {"type": "sentence", "content": "This model isn’t new. Companies like Solesupremacy.com have been in the second-hand fashion game for ages. Their niche: Sneakers."}, {"type": "sentence", "content": "As with any marketplace, the trick is about finding a balance between enough supply and enough demand. Here are some tips for starting an online marketplace."}, {"type": "subtitle", "content": "Business Idea #14: Create An Online Course"}, {"type": "sentence", "content": "Difficulty Level: 2/5‍"}, {"type": "sentence", "content": "Main Skills Required: Basic video shooting and editing. Basic graphic design."}, {"type": "sentence", "content": "Key to Success: Finding a question that needs answering and just starting."}, {"type": "sentence", "content": "Revenue Model: Selling an online course."}, {"type": "sentence", "content": "Online courses is a hot topic at the moment."}, {"type": "sentence", "content": "Because most cellphones are capable of taking HD video, creating an online course has never been easier. You might not even need that. I’ve come across plenty of courses which are literally all filmed on a screen."}, {"type": "sentence", "content": "I don’t know enough about anything to make an online course, though. That just isn’t true. The imposter syndrome is the biggest inhibitor of people starting an online course. I know it’s true for me. Who am I to be teaching someone about starting a business, I’m no expert? Sure, I’m not — but I’ve got a unique set of experiences and skills which makes what I have to say valuable."}, {"type": "sentence", "content": "That’s what you need to realize. There is no other person in the world who has your unique combination of skills and experiences. That cocktail is what will set you apart from the rest. You might bring a fresh insight to an old topic, directly because of those experiences."}, {"type": "sentence", "content": "Here’s a brain-storming exercise for you to go through which will guide you towards what you can teach people:"}, {"type": "sentence", "content": "When you’ve nailed that down, you should have a pretty good answer to the question of what to make an online course about. Keep in mind that the goal here is to sell the course. You need to create it in a place where people are likely to spend money on it."}, {"type": "sentence", "content": "You can use a platform like Teachable to help you create and sell your course. They’ve made the process super easy and efficient."}, {"type": "sentence", "content": "Here are three tips for starting an online course:"}, {"type": "sentence", "content": "Don’t get stopped by the imposter syndrome. Starting an online course is one of the best ways to generate passive income. Once it’s done — it requires very little maintenance work and the money keeps rolling in."}, {"type": "subtitle", "content": "Business Idea #15: Bespoke Pet Accessories"}, {"type": "sentence", "content": "Difficulty Level: 3/5‍"}, {"type": "sentence", "content": "Main Skills Required: Setting up an online store. Digital marketing."}, {"type": "sentence", "content": "Key to Success: Understand your audience."}, {"type": "sentence", "content": "Revenue Model: Selling products online."}, {"type": "sentence", "content": "When people are emotionally connected to something, they spend money irrationally."}, {"type": "sentence", "content": "There are few things more genuine than the emotional connection between a human being and their pet. The global pet-goods market is expected to exceed $270 billion USD by 2025."}, {"type": "sentence", "content": "A change in the way we treat pets is at the forefront of the change in consumer behavior. Pets are being treated more and more like humans, and consumers are spending more on their pets than ever before."}, {"type": "sentence", "content": "Look at the increase in consumer interest in the term “calming dog bed”."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*DR2TElXvYO5wy8DC.jpeg"}, {"type": "sentence", "content": "“Dog accessories” gets 28 700 unique monthly searches."}, {"type": "image", "content": "https://miro.medium.com/max/1878/0*ETddVqBadqEv_B5Q.jpeg"}, {"type": "sentence", "content": "The other great thing about the pet industry is that people spend money on pets no matter the economic situation. The pet industry is almost immune to recession."}, {"type": "sentence", "content": "Just look at the $chwy share price over the past 6 months (from 11 May 2020). Chewy.com is an online pet accessory retailer."}, {"type": "image", "content": "https://miro.medium.com/max/2326/0*ZCthmtCcWNhnj92j.jpeg"}, {"type": "sentence", "content": "To take advantage of this, you need to start small. It’s a tough world out there when you try and take on the big dogs head on."}, {"type": "sentence", "content": "Pick a niche you know, like… Siberian Forest Cats."}, {"type": "image", "content": "https://miro.medium.com/max/1360/0*KS2zy-vNwOAGSZVl.png"}, {"type": "sentence", "content": "Because, um, why wouldn’t you? Look at that face!"}, {"type": "sentence", "content": "Find out everything you need to know and then start a blog/website and create content for those owners. Once you understand your customer base, you can create products that speak to their needs."}, {"type": "sentence", "content": "The trick is making your offer unique. Pet’s are also becoming extensions of the owners’ identity. That means you need to understand the owner to understand the market."}, {"type": "sentence", "content": "2 elements which will help you be successful:"}, {"type": "sentence", "content": "A great brand ID will go a long way here."}, {"type": "subtitle", "content": "Summary"}, {"type": "sentence", "content": "So that’s it.. Here’s a summary of the 15 innovative business ideas you can start from home today…"}, {"type": "sentence", "content": "Business Idea #1: Write a Home Made Bread eBook"}, {"type": "sentence", "content": "Business Idea #2: Start a Comedy Podcast"}, {"type": "sentence", "content": "Business Idea #3: Create a Fitness Blog"}, {"type": "sentence", "content": "Business Idea #4: Write a Work From Home eBook"}, {"type": "sentence", "content": "Business Idea #5: Do Online Consulting for Businesses Converting to Remote Work."}, {"type": "sentence", "content": "Business Idea #6: Drop Servicing"}, {"type": "sentence", "content": "Business Idea #7: Online Home Goods Subscription Service"}, {"type": "sentence", "content": "Business Idea #8: Athleisure Clothing Company"}, {"type": "sentence", "content": "Business Idea #9: Bespoke Men’s Tees"}, {"type": "sentence", "content": "Business Idea #10: Employee Care Packages"}, {"type": "sentence", "content": "Business Idea #11: Meal Planning Blog"}, {"type": "sentence", "content": "Business Idea #12: Help Local Businesses Set Up Online Stores"}, {"type": "sentence", "content": "Business Idea #13: Second Hand Niche Clothing"}, {"type": "sentence", "content": "Business Idea #14: Create an Online Course"}, {"type": "sentence", "content": "Business Idea #15: Bespoke Pet Accessories"}, {"type": "sentence", "content": "Any comments? Drop ’em in below."}, {"type": "subtitle", "content": "Final Advice"}, {"type": "sentence", "content": "Remember, ideas are great, but they are nothing unless you do something with them. If you want to start your own business, you have to start somewhere."}, {"type": "sentence", "content": "Analysis paralysis is a common problem among first time entrepreneurs. I used to suffer from it terribly. All of these ideas are ones I would start myself. The truth is, I don’t have the time."}, {"type": "sentence", "content": "My first business was an online clothing store. I started it when I was in high school and later sold it during college. Those years of manually fulfilling orders, learning about marketing, and dealing with customers set me years ahead of anyone my age who hadn’t done it."}, {"type": "sentence", "content": "The learning curve is so steep, and so gratifying."}, {"type": "sentence", "content": "That’s why the number one thing I can advise you to do is just start. I’m here to help with that. If you like the look of one of these ideas, reach out to me on Twitter and we’ll get you going together."}, {"type": "subtitle", "content": "Here’s Some More Reading You’ll Like"}], "topic": "startups"}