{"title": "This Is What the Brains of Resilient People Have in Common", "data": [{"type": "subtitle", "content": "Resilience is a skill, and it can be learned"}, {"type": "sentence", "content": "Life doesn’t get more forgiving, but we have the ability to become more resilient."}, {"type": "sentence", "content": "How fast do you bounce back? Do you cry over the pieces of a broken heart, or do you make beautiful art out of them?"}, {"type": "sentence", "content": "Are you the oak that fights the wind and breaks? Or the willow that bends and survives?"}, {"type": "sentence", "content": "I don’t know if I would describe myself as a resilient person, but I sure strive to be. The outcome of a situation is our reaction to it, not the situation itself. This is why I try to hold myself accountable for higher standards than expected from me. I don’t want to have to excuse or pity myself."}, {"type": "sentence", "content": "And so, I went digging into brain info, like I always do when I have a question. What does it mean to be resilient, and how can you increase your resilience?"}, {"type": "sentence", "content": "Of course, neuroscience holds the answer: Resilience is structural. Resilience is functional. Resilience has specific neurobiological underpinnings. Most importantly, a resilient brain can be trained."}, {"type": "sentence", "content": "Let’s keep an open definition of resilience: the ability to recover quickly from difficulties, the adaptation to adversity, trauma, tragedy, threats, or stress."}, {"type": "sentence", "content": "The word resilience comes from the Latin resiliens, which means “to rebound, recoil.”"}, {"type": "sentence", "content": "But resilience is very heterogeneous. It’s not about being tougher, being stronger, being better. At its most basic core, resilience is an adaptive neurobiological and neurochemical response."}, {"type": "sentence", "content": "Being resilient doesn’t mean you don’t face hard times, on the contrary. To be resilient, one should have learned what it means to be in a stressful and challenging situation. One should have tasted pain and hardship and outgrown it."}, {"type": "sentence", "content": "The brain establishes a two-way communication as part of a feedback loop between itself, the immune system, and cardiovascular systems, giving rise to the well-known “fight-or-flight” mechanism in response to acute stress."}, {"type": "sentence", "content": "But this is only the first step of the process. If an adequate homeostatic response does not follow acute recovery, the initial response could ultimately result in harmful after effects."}, {"type": "sentence", "content": "Let’s jump in. What makes a brain more resilient than another?"}, {"type": "sentence", "content": "Several factors from developmental to neurological, psychological, and genetic."}, {"type": "sentence", "content": "The good news? Your brain is flexible and can be trained to develop resilience."}, {"type": "sentence", "content": "It’s not a trait or a gene that you either have or don’t have. It’s a whole set of behaviors, adaptations, thoughts, and actions. It’s an example of neuroplasticity, and neuroplasticity is the ability of the brain to change, adapt, and form new connections."}, {"type": "subtitle", "content": "Developmental factors"}, {"type": "sentence", "content": "The developmental environment is a crucial contributor to resilience. The way we are brought up, the situations that we face, the support systems, and our earliest coping mechanisms contribute significantly to our capacity, or lack of it, to face trying times later in life."}, {"type": "subtitle", "content": "1. Absence of extreme childhood toxic stress"}, {"type": "sentence", "content": "Severe trauma and adverse events in childhood can profoundly affect a child’s brain and the stress response system."}, {"type": "sentence", "content": "Over the last 2 decades, research has shown that resilience in both children and adults is a common outcome following distress, especially for mildly stressful situations¹. This moderate exposure seems to be related to enhanced learning and mastery of self-control."}, {"type": "sentence", "content": "While moderate and intermittent exposure to stress promotes resilience, researchers discovered that chronic subjection to extreme situations is associated with increased mood swings, anxiety, depression, and addiction². Common types of childhood trauma include abuse and neglect, violence, life-threatening accidents, extreme medical procedures, loss or separation, wars and disasters, extreme poverty."}, {"type": "image", "content": "https://miro.medium.com/max/2200/0*HibSgSg1w2SboCIP.png"}, {"type": "subtitle", "content": "2. Unexpected factors that negate early trauma"}, {"type": "sentence", "content": "“Believing You Have a Degree of Control Negates the Power of a Stressor”."}, {"type": "sentence", "content": "Some factors can play a pivotal role following childhood exposure to extreme trauma, leading to stronger resilience instead of pronounced vulnerability³."}, {"type": "sentence", "content": "The main one is the degree of control a person has over the situation; can a person do anything to change their situation? Or are they trapped and already defeated?"}, {"type": "sentence", "content": "The empirical evidence corroborates this example. By learning to navigate through adversity, we fortify our resilient disposition."}, {"type": "subtitle", "content": "3. Distress immunization"}, {"type": "sentence", "content": "“Stress inoculation” ³ refers to the ability of a person to adapt to the adverse effects of stress. This concept even became a psychotherapy method to help patients in advance and teach them how to deal with potential circumstances."}, {"type": "sentence", "content": "Think of it as a vaccine or immunity against predictable stress."}, {"type": "sentence", "content": "The stress inoculation concept is also an explanation of why over-protecting children can backfire later in life."}, {"type": "image", "content": "https://miro.medium.com/max/700/0*suFfBD1ehBNngQn_.jpg"}, {"type": "subtitle", "content": "Brain Patterns"}, {"type": "sentence", "content": "There is a running fact in the neuroscience community when it comes to the study of resilience: vulnerability is a failure of plasticity."}, {"type": "image", "content": "https://miro.medium.com/max/1658/0*gIhKdNwNX5c9oJt4.jpg"}, {"type": "sentence", "content": "There is some mind-blowing evidence of brain differences between individuals with varying degrees of vulnerability, so try to follow."}, {"type": "sentence", "content": "Resilience is regarded as a dynamic adaptive process. Scientists have looked at both structural and functional correlates: how the brain is built and how it works."}, {"type": "sentence", "content": "This is what has been uncovered so far. They all point to the same initial message: the brain can be trained to develop resilience."}, {"type": "subtitle", "content": "1. Reduced brain connectivity"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*j4tG25GPCS8uEpGb.png"}, {"type": "sentence", "content": "The Amygdala is a brain structure associated with fear, learning, and anxiety. In many functional MRI studies, it has been shown that connectivity to the Amygdala is inversely proportional to levels of resilience. In other words, the more vulnerable a person is to stressors, the higher the connectivity between their Amygdala and other brain areas⁴."}, {"type": "sentence", "content": "Therefore the Amygdala is activated more frequently or by milder stimuli, generating a more significant emotional response."}, {"type": "subtitle", "content": "2. Higher plasticity in active resilience"}, {"type": "sentence", "content": "Resilience is an active progression of events, not a passive process. This means that there is something at work in our brains when we’re exhibiting toughness. Nestler, a professor of neuroscience who studied stress vulnerability in mice said⁵:"}, {"type": "sentence", "content": "This translates to the idea that susceptibility to stress is a failure of plasticity, a brain unable to adapt and compensate for damaging alterations that happened during earlier exposure to stress."}, {"type": "subtitle", "content": "3. Reward systems"}, {"type": "sentence", "content": "If you’re a regular reader of my posts, you’ll recognize my favorite brain pathway: the reward system."}, {"type": "sentence", "content": "So powerful and involved in EV.ERY.THING."}, {"type": "sentence", "content": "This is no exception. “Enhanced functioning of the reward circuitry contributes to resilience to stress and trauma.” ⁸"}, {"type": "sentence", "content": "The mesolimbic dopamine pathway is usually linked to reinforced behavioral responses to rewards, and a functional abnormality to this network leads to depression, demotivation, and anhedonia, among others."}, {"type": "subtitle", "content": "4. Fear systems"}, {"type": "sentence", "content": "We want to avoid excessive overgeneralized fear responses to be able to bounce back easily."}, {"type": "sentence", "content": "We mentioned the Amygdala, and its link to fear. Other structures include the hippocampus, medial prefrontal cortex, nucleus accumbens, ventromedial hypothalamus, and some nuclei."}, {"type": "sentence", "content": "These areas are part of a very primitive system and play a key role in learning and conditioning. For this system to function correctly, it requires synaptic plasticity; i.e., the formation and destruction of new synapses and connections based on experience, situations, and responses to the situations⁷."}, {"type": "sentence", "content": "There is a variety of neurochemical systems involved in the fear circuitry, including BDNF, GABAergic signaling, and NMDA/AMPA. These have been investigated as potential pharmacological drug targets for reducing fear response in PTSD and enhancing resilience to displaced fear associations."}, {"type": "subtitle", "content": "Psychological factors"}, {"type": "sentence", "content": "There is significant literature for the psychosocial traits and factors that influence a person’s ability to cope with stress. The science has shown a direct and strong correlation between these factors and the flexibility of a brain’s response, further paving the way to the idea that resilience can be trained, taught, and developed."}, {"type": "sentence", "content": "Personality, psychological traits, cognitive processes, behaviors, and active coping mechanisms, interact with biological factors, and enhance adaptation in the face and aftermath of traumatic events, contributing to resilience."}, {"type": "sentence", "content": "Here is a brief overview, omitting the details."}, {"type": "subtitle", "content": "Other factors"}, {"type": "sentence", "content": "Of course, like any other predisposition, there are genetic and epigenetic factors involved in the levels of resilience of vulnerability a person has to stressors. These are out of our direct control."}, {"type": "sentence", "content": "A range of genes and polymorphisms have been tied to this trait, including, but not limited to: Neuropeptide Y (anxiolytic effect), the HPA axis (which shapes resilience to trauma), polymorphisms of the reward and fear systems and serotonergic (stress sensitivity) systems."}, {"type": "sentence", "content": "Epigenetics changes — modifications to the genome without changes in the DNA sequence — have also been linked to a predisposition to fragility."}, {"type": "subtitle", "content": "Increase your brain’s resilience"}, {"type": "sentence", "content": "First, let’s talk about promoting resilience in children."}, {"type": "sentence", "content": "Everything you say and do to a child leaves a lasting stamp on their brain, the positive as much as the negative."}, {"type": "image", "content": "https://miro.medium.com/max/1928/0*ZaHyG2PxuVNNYupY.jpg"}, {"type": "sentence", "content": "Over-protectiveness, as well as severe maltreatment during upbringing, can have similar effects on the child’s ability to develop a healthy coping mechanism in adulthood."}, {"type": "sentence", "content": "The American Psychological Association shares the following tips to help build your resilience."}, {"type": "sentence", "content": "5. Don’t be afraid to seek help! You’re not weak; you’re just not trained enough, and that’s okay. It comes with time, patience, and acceptance; but it comes eventually."}, {"type": "sentence", "content": "6. Believe you can achieve it because science has proved it; you can."}, {"type": "sentence", "content": "I’m not going to pretend I’m not scared of what the future holds. I try to promote this hopeful and resilient thinking knowing that life doesn’t get easier or more forgiving the more you grow up."}, {"type": "sentence", "content": "In the end, it’s about quality, happiness, and enjoyment more than it is about mere survival."}, {"type": "sentence", "content": "~Adriana~"}, {"type": "sentence", "content": "Thank you for taking the time to read."}, {"type": "sentence", "content": "Sign up to BrainChronicles & stay updated with trending neuroscience and psychology news and research."}, {"type": "sentence", "content": "For more interesting facts and information about the human brain."}, {"type": "sentence", "content": "Sources:¹https://www.ncbi.nlm.nih.gov/pubmed/11315249/²https://reader.elsevier.com/reader/sd/pii/S0306453008000693?token=C6699D28EC1FCC0DE0D7532D188D5528CFC5DF353F0BDFCA0A2C331365D259281A55E58EBD00E634BE0CC3A7265D2104³https://www.tandfonline.com/doi/full/10.1080/08964289.2016.1170661⁴https://www.frontiersin.org/articles/10.3389/fpsyt.2018.00693/full⁵https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3580862/⁶https://www.ncbi.nlm.nih.gov/pubmed/24744379⁷https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(11)00103-2?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0166223611001032%3Fshowall%3Dtrue⁸https://www.frontiersin.org/articles/10.3389/fnbeh.2013.00010/full#B103"}], "topic": "neuroscience"}