{"title": "The dangers of premature scaling", "data": [{"type": "subtitle", "content": "THE STARTUP SHOW"}, {"type": "subtitle", "content": "Bugs, bugs everywhere."}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*CYqkf0lTUhxwUxqKrc0Hsg.jpeg"}, {"type": "sentence", "content": "They say that premature scaling is a major cause of startup death."}, {"type": "sentence", "content": "What is premature scaling?"}, {"type": "sentence", "content": "It’s when a company spends vast amounts of money on non-essentials such as hiring more people, renting expensive offices, etc. before achieving product market fit."}, {"type": "sentence", "content": "In a different form, premature scaling can also mean doing things out of order — for example, acquiring too many users and then not having a bug-free enough product to retain those users, which results in wasted marketing dollars."}, {"type": "sentence", "content": "We all know that spending on non-essentials can be a waste of financial resources and quickly shrink up runaway."}, {"type": "sentence", "content": "What we don’t really pay attention to is premature scaling that on the outside looks like progress, but is in reality what I call “fake progress.”"}, {"type": "sentence", "content": "Here’s an example."}, {"type": "subtitle", "content": "Bugs"}, {"type": "sentence", "content": "A buggy product is like a bowl of soup with little insects in it that then breed to create even more little insects."}, {"type": "image", "content": "https://miro.medium.com/max/6930/1*wyMxvKseYJeaXZFwQqUXVQ.jpeg"}, {"type": "sentence", "content": "If you’re a product owner, you’re always trying to find those little insects lest your customers find them for you."}, {"type": "sentence", "content": "If you don’t look for those insects, you end up with more insects in your soup and more unhappy customers."}, {"type": "sentence", "content": "Not a great situation."}, {"type": "sentence", "content": "Without properly planning out your product roadmap and defining your system’s architecture, you can easily find yourself in a situation where you’re dealing with an onslaught of bugs and angry customers."}, {"type": "sentence", "content": "Sure, by scaling quickly, you may have more customers and a more sophisticated product in the short term, but it’s progress that cannot be sustained. Hence the term “fake progress.”"}, {"type": "sentence", "content": "For eventually, you will reach a point where your product becomes so buggy that it simply makes no sense to keep it on due to the number of customer complaints flowing in."}, {"type": "sentence", "content": "Why put yourself in such a tough spot? Why not properly plan out your product’s architecture from the get-go so you don’t end up in a situation where you’re fighting an un-winnable fight of bugs and angry customers?"}, {"type": "subtitle", "content": "Slowly"}, {"type": "sentence", "content": "At the early stages, slowly is how you should build your product, at least until you get a handle on the number of bugs that show up."}, {"type": "sentence", "content": "Once you have a solid system in place for addressing bugs, slowly ramp up your customer acquisition efforts and closely monitor how your product responds to more users. If bugs start showing up at an uncontrollable rate, scale back your customer acquisition efforts so that your engineers can have some capacity to address the causes of those bugs, which can sometimes be deeply rooted in your product’s overall architecture."}, {"type": "sentence", "content": "Try not de-prioritize bugs in favor of fast growth and avoid band-aid solutions if you can. Also make sure to fix and document every bug."}, {"type": "sentence", "content": "Or you will end up with bug soup."}, {"type": "image", "content": "https://miro.medium.com/max/8800/1*UPnNsuWYcv5Ng8TllOEsiA.jpeg"}], "topic": "ux"}