{"title": "A 3-Minute Hack for Focus You’ve Probably Never Heard Of", "data": [{"type": "subtitle", "content": "I use this technique when writing and it has helped me publish thousands of stories on the internet."}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*cpuIftldRwds_uMaow-E-g.jpeg"}, {"type": "sentence", "content": "In 2016 a smart UX Designer shared a tip with me."}, {"type": "sentence", "content": "I asked her, “How did you sit down for four hours straight and finish that PowerPoint deck?”"}, {"type": "sentence", "content": "Her answer was weird: “Binaural Beats.”"}, {"type": "sentence", "content": "“What The F is that,” I said."}, {"type": "sentence", "content": "For the next few years I ignored her advice and went back to trying to be creative in complete silence without distractions. It was torture."}, {"type": "sentence", "content": "Achieving perfect silence is near impossible."}, {"type": "subtitle", "content": "Level 1: Enter Binaural Beats"}, {"type": "sentence", "content": "Sitting down and writing is hard for me. If I lose my attention then I find it difficult to get it back again."}, {"type": "sentence", "content": "Once I find a flow state, I want to stay there for the rest of the day while I write. Before discovering binaural beats, this was incredibly difficult."}, {"type": "sentence", "content": "What are binaural beats?"}, {"type": "sentence", "content": "Binaural Beats is essentially music that repeats over and over. There is no actual beat, but instead a tone that is created in your brain as a result of two different frequencies being played at the same time."}, {"type": "sentence", "content": "When I studied sound engineering, we were taught about Shepard tones. These are sounds that appear to endlessly rise and fall in pitch without your brain necessarily realizing it. These tones are similar to what you hear in Binaural Beats. What’s the point of all of this?"}, {"type": "sentence", "content": "If you find it hard to focus, play binaural beats in your headphones while you work. Here is the binaural beats soundtrack I use to get you started."}, {"type": "subtitle", "content": "Level Two of Focus"}, {"type": "sentence", "content": "I discovered this next level of focus by accident. On days when I need to be creative and have binaural beats playing, I keep the music going. So if I stop for a lunch break, I keep the sound playing in my headphones."}, {"type": "sentence", "content": "During a bathroom or hydration break, the same thing. If I’m watching a speech on Youtube as research for something I’m writing, the binaural beats keep playing in the background. The binaural beats don’t stop."}, {"type": "sentence", "content": "With the same music playing over and over and a constant amount of noise, my focus doesn’t break even for a second."}, {"type": "subtitle", "content": "Level Three of Focus"}, {"type": "sentence", "content": "Accidentally, one afternoon, my headphones broke. My girlfriend lent me her noise cancelling headphones."}, {"type": "sentence", "content": "By playing binaural beats on repeat with noise cancelling headphones, I found an even deeper level of focus. It was quite astounding and helped me write for longer without succumbing to distractions."}, {"type": "subtitle", "content": "It Turns Out Many Creatives Use Them"}, {"type": "sentence", "content": "I’m a bit of a Johnny-come-lately with the whole hacking your focus using binaural beats thing."}, {"type": "sentence", "content": "I spoke to a few other creatives I know and almost all of them use background music. Some use movie soundtracks without lyrics. And then a small subsection of crazy productive people, who churn out loads of work, have also discovered the power of binaural beats."}, {"type": "sentence", "content": "If you want to focus more and get more creative work done, try binaural beats for yourself and notice the difference."}, {"type": "sentence", "content": "I have become a content generating machine since using binaural beats for the last year or so. It’s part of my secret sauce and now you can use it for yourself."}, {"type": "sentence", "content": "You can do your life’s work when you’re able to sit down and get into flow states quickly, and for longer periods of time, thanks to binaural beats."}, {"type": "subtitle", "content": "Join my email list to stay in touch."}], "topic": "productivity"}