{"title": "Generate OneDrive Direct-Download Link with C# or Python", "data": [{"type": "subtitle", "content": "Example of Generating Direct Download Link for COVID-19 Dataset and Import to Pandas Dataframe"}, {"type": "sentence", "content": "In many projects, you may need file hosting services to share a large number of datasets, scripts, or any files with the direct download option. You may already use the most popular hosting services such as Google Drive, Microsoft OneDrive, DropBox, and iCloud. In this article, I will focus on how to make a direct download link from the OneDrive.com."}, {"type": "subtitle", "content": "Why direct download link?"}, {"type": "sentence", "content": "The direct download would let you flexibly use the file in any other software. For example, if you host the excel or csv table dataset with a direct download link, the receiver can directly load it to the Pandas dataframe in Python."}, {"type": "subtitle", "content": "Why OneDrive?"}, {"type": "sentence", "content": "I guess I do not have to introduce so much about the OneDrive. It offers 5 GB of storage space free of charge. That would be enough for any big dataset. If you have a really big dataset to share, please consider the database instead. Most of you even have Microsoft Office 365 which includes online space of 1 TB. Also, it is easy to use, share, edit online."}, {"type": "subtitle", "content": "Let’s Get Started"}, {"type": "subtitle", "content": "Share Your OneDrive File"}, {"type": "sentence", "content": "You just need to go to OneDrive, drag and drop to upload any file there, click on the “share” button on the top of the page and click the copy link. That’s it!"}, {"type": "image", "content": "https://miro.medium.com/max/3928/1*E_la-oRXF_HJ2l9OnTStJA.png"}, {"type": "sentence", "content": "For example, I share the COVID-19 time-series dataset from CSSE as an excel table through the OneDrive. And when you access this dataset through the link you created, the browser will automatically open the Excel Online for you to explore the dataset in table format. How convenient!"}, {"type": "image", "content": "https://miro.medium.com/max/2078/1*yMga6T4FMBlCVmw0PdIpuQ.png"}, {"type": "sentence", "content": "But, unfortunately, it needs several clicks or redirects if your receiver wants to download the dataset. So, it is better for you to share a direct download link if your purpose is to let your receiver download the file."}, {"type": "subtitle", "content": "Generate OneDrive direct download link"}, {"type": "sentence", "content": "According to the OneDrive API docs, you can easily generate the OneDrive direct download link with these logics:"}, {"type": "subtitle", "content": "Option 1: Generate direct download link with C#"}, {"type": "sentence", "content": "To follow the above logic, the OneDrive API docs also provide an example script in C# for you as follows:"}, {"type": "sentence", "content": "You may try to run this script online in C# with the following link:"}, {"type": "sentence", "content": "After opening the link, you just need to change the sharingUrl to any of your OneDrive link. Wait for some seconds, then you get the output direct OneDrive download link in the output console."}, {"type": "image", "content": "https://miro.medium.com/max/4860/1*7WRHoCTQcDllKygJpjYw-Q.png"}, {"type": "subtitle", "content": "Option 2: Generate direct download link with Python"}, {"type": "sentence", "content": "Python is popular in many Data Science projects. So, you might want to generate a direct download link in Python directly before doing the data analysis with the dataset. If someone (or yourself) shares the OneDrive link, you may turn that it to a downloadable link with the following Python script:"}, {"type": "sentence", "content": "For example, you can follow the script below to generate the direct download link from our COVID-19 dataset example in excel format. URL: https://1drv.ms/x/s!AmLiprCs46qqhMgFb5pcJisePNNlXw?e=ZgPsGZ then import it to the Pandas dataframe:"}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "This article introduces how to share your files through the OneDrive and turn it to the direct downloadable link with C# or Python. Please, note that you may use apply this logic and rewrite it in any other programming language as well. I hope you enjoy this short article and able to apply this method to share the dataset in any of your projects. Feel free to left me a message if you have questions, comments, or suggestions."}, {"type": "sentence", "content": "Be Safe and Healthy! Thank you for Reading. 👋😄"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*MNFmwGe54AM97bW1"}, {"type": "sentence", "content": "Find more of my articles here:"}, {"type": "image", "content": "https://miro.medium.com/max/2554/0*510hvzRCzjJr-l7b.png"}], "topic": "data-science"}