{"title": "First Principles Friday: Treat Your Team Like Leaders to Fully Tap Their Potential", "data": [{"type": "subtitle", "content": "How to use intent-based leadership to inspire your team, maximize effectiveness and make your organization stronger."}, {"type": "sentence", "content": "In today’s post, I’ll share 7 principles to strengthen your team using intent-based leadership. Intent-based Leadership is a leadership approach where a manager encourages their team to present them with solutions to a problem rather than presenting a problem and deferring to the manager to solve it. It’s an approach where the team is empowered to say “X,Y and Z are happening. Here is what we intend to do,” and the manager can agree or disagree."}, {"type": "sentence", "content": "This leadership style was created by U.S. Naval officer David Marquet in the 1990s. He first implemented it while he was the Commanding Officer of the submarine, USS Santa Fe. At the time, the submarine community followed a strict leader-follower policy in the command structure. This meant that his crew would do anything he said- even if he was wrong. He saw this in action when he first came aboard the Santa Fe, a different type of submarine than he had trained on. He gave orders that would have been right for his old submarine, but weren’t applicable for his new one, the Santa Fe. Instead of correcting him or pointing it out, the crew just froze, unsure of what to do or say."}, {"type": "sentence", "content": "Marquet realized the strict leader-follower approach could be catastrophic. So he started using the intent-based leadership style with the new crew. When Marquet began treating his crew like leaders rather than followers, and gave control rather than taking it, operations took a dramatic turn. The Santa Fe went on to achieve the highest retention and operational standings in the Navy. This leadership approach was admired and adopted throughout the submarine force."}, {"type": "sentence", "content": "By the time I was an officer on submarines, intent-based leadership was the predominant leadership approach. If you haven’t already, read my previous post on the 7 pillars of the Nuclear Navy. The principle of “watchteam backup” was a crucial cultural element that allowed the intent-based approach to succeed. He capitalized on this cultural norm to successfully implement this new leadership paradigm."}, {"type": "sentence", "content": "The intent-based approach ensures all employees and team members are fully engaged and contributing with their full intellectual potential. This gives them more autonomy and control, empowering them to lead. This leadership style is also a huge contributor to team motivation which is another reason why it has become so effective."}, {"type": "sentence", "content": "Marquet went further and states that an intent-based approach will make:"}, {"type": "image", "content": "https://miro.medium.com/max/2236/1*fjFWsx__6l9nD6_ktelwsg.png"}, {"type": "subtitle", "content": "So how exactly can YOU implement “intent-based” leadership?"}, {"type": "sentence", "content": "As the name implies, you need to design a culture and environment where your team comes to you with their intent and requires little direction from you. But this depends upon you also rigorously training the team so they have the understanding and context behind decisions and processes. They need to know where they fit into the larger organization and how their individual contributions help the team accomplish the mission and how the team’s goals help accomplish the larger organization’s mission."}, {"type": "sentence", "content": "To do this, you need to give up control and cascade down decision-making power to the subject matter experts. In most situations, managers and team leaders are removed from the minutiae of day to day functions, so they are no longer technical experts. This is why you need to give up control- you no longer have the information required to retain control!"}, {"type": "subtitle", "content": "The golden rule of intent-based leadership:"}, {"type": "subtitle", "content": "Along with the golden rule of intent-based leadership, use these 7 principles to implement an intent-based leadership practice with your team:"}, {"type": "sentence", "content": "The most important thing to remember here is that change takes time. Giving up control and affording your team more freedom will be uncomfortable. You may even find that delegating authority is easy at first, but as stressful situations arise, you may feel the need to take back control. Don’t do it!"}, {"type": "sentence", "content": "When this happens, work on self-identifying this urge and counteracting it. Use these journaling prompts as a start:"}, {"type": "sentence", "content": "Remember that long-term success is never easy. There will be mistakes and setbacks. But as your team becomes more and more empowered and trust is strengthened, you’ll accomplish more and see the full fruits of your labors."}, {"type": "subtitle", "content": "To your leadership!"}, {"type": "subtitle", "content": "Check out my latest stories:"}, {"type": "subtitle", "content": "I write to engage with my community. You can contact me directly at jared@chaptersandinterludes.com if you have questions."}], "topic": "leadership"}