{"title": "A Last Hurrah with Emily", "data": [{"type": "subtitle", "content": "1"}, {"type": "sentence", "content": "It is late in afternoon on our first full day in Iquique, and I am sitting on a patio outside a Chilean version of a menú place. I have just had a very decent lunch for the apparently reasonable price of forty nine hundred pesos. Most non-fast food restaurants here want seven thousand for a decent lunch, where one can sit and feel like a dignified person for a little while, after days spent on dusty roadsides and nights sleeping in sandy places. How quickly standards change — I would only have considered paying this in Arequipa for a special occasion, and this is just a lunch, but something felt special enough about it to make seven dollars seem reasonable. I had a fried cut of albacore tuna, an empanada and a salad, washed down with a limonada."}, {"type": "sentence", "content": "I chose this restaurant because it was comparatively affordable, but also because the patio looked like a good place to linger awhile. Not many other diners in these late lunch hours, no blasting reggaeton. The meseras didn’t keep asking me if I wanted anything more. So I did indeed linger and did some writing, protected from the sun by an umbrella, or as they call it, un parasol. A for-the-sun. Rain umbrellas have a different name: paraguas. Sometimes spanish makes so much sense."}, {"type": "sentence", "content": "People here love sitting out on these patios that jut out into the street, eating and drinking and talking. Day and night, all of the cafe bar restaurants seem to have some people at them. You just don’t find this in Perú. People do sit in plazas, and there is definitely a culture of going out to the bar/club, but not so much sitting around at cafés. This practice, this cafe life, is much more like Europe."}, {"type": "sentence", "content": "In general Chile is much more orderly, relaxed and dignified than its neighbor to the north. I didn’t expect to like it as much as I do. There is the lingering difficulty of the accents, which I don’t feel like I’m making any progress with; the expense — a lot of things are priced like the US; and the sheer barrenness of this coast. The hills above the city are absolutely devoid of life, a bleak sun-scorched dull brown. But below is this city with a smattering of trees, relatively modern and just a bit quaint, tranquil and friendly enough."}, {"type": "image", "content": "https://miro.medium.com/max/6528/1*5KHVlnifvstbxtFj-iB-bg.jpeg"}, {"type": "sentence", "content": "This is the first thing I’ve done today, at least outside of the hostel, a day I’ve taken necessarily slowly. Necessary, after three days of advanced/rough travel, waking up in a different town each day than we woke up in. In some ways it makes sense, as we both have a long ways to go and not much money. But I also wonder if I might be getting too old for this sort of thing. It feels exhausting just thinking back on my recent life. The festivities around leaving Arequipa, playing a show, saying goodbye to everyone I got to know, staying up late with Karem night after night, and getting violently stomach-sick my last full day there took a lot out of me. This was followed by buses, a border, and extreme travel, trying to keep up with a twenty-three year old, hitchhiking and wild camping all the while. Phew."}, {"type": "sentence", "content": "My traveling companion is eighteen years younger than me, drinks more and then wakes up with the energy to do yoga in the morning. Had I more money, and the correlating time, I could stay here a week and just relax, get my energy back, get the hang of the various kinds of Spanish going around. But I know I have to keep moving. If not tomorrow, then the day after, it will be the road again."}, {"type": "sentence", "content": "Slept in as best I could — read: slept off the rum — through all sorts of hostel comings and goings in the hallway outside our door. When I finally stumbled out of bed I made a pot of black tea and drank a cup on the rooftop terrace looking out at the sea and another on the ground floor inner courtyard patio. This hostel is perfect for us — shabby but comfortable, a place where the travelers have created their own community."}, {"type": "sentence", "content": "After my two cups of tea, I traded one courtyard for another, sat down with my new friend Julian on the streetside patio, and moved on to my next tea experience. As a good Argentine, he was drinking Yerba Mate, and in good cultural form he of course wanted to share, which I was delighted about. This was a sign that I was getting closer to the Land of Mate, closer to Uruguay, my destination. We passed back and forth, not a gourd but a stainless steel cup which he called a mate, with a leather embossed outer holder. He poured water from a thermos, filling it up each time he’d pass it to me. The water was scalding hot and the bombilla — filtered metal straw — was burning my lips a little, so I’d take my time letting it cool a bit. I’m not sure if this is frowned upon when sharing mate, but everything seemed to be relaxed."}, {"type": "sentence", "content": "At my request, Julian explained how to conjugate for vos, a different form of second person singular than the standard tu or usted. There was only one irregular — for ser, to be — which happens to be one of the first things any traveler asks you. Instead of the usual De donde eres? — where are you from — vos conjugates as De donde sos? I’d heard this over and over the night before, and wanted to get to the bottom of it. The other verb conjugations were disorienting because for verbs with an irregular conjugation — for example tener is (tu) tienes — with vos the conjugation is regular, but with the accent at the end: (vos) tenés. This was going to be a little bit of a headache. Perhaps this seems like a slight difference, but the sound of words changes significantly. Tienes sounds like “tee-yen-es”, where tenés sounds more like “teh-ness”."}, {"type": "sentence", "content": "In late morning I cooked a good breakfast of Huevos Pericos, which somewhere in Central America became my traveling breakfast of choice. You can always find halfway decent eggs, tomatoes, onions. I am getting back into my traveling mind, but not without some difficulty. This day of rest is helping a lot with the transition, after eight months where I mostly was in one place. The ability to find places to relax and stop out here on the road is crucial."}, {"type": "sentence", "content": "Checked my email for the first time in three days, and found a message from my long-lost friend Becky in New Orleans. It was an in-depth, thoughtful email, one of those that you can’t expect, that only come around every once in a while. She is a good writer and sketched out her recent life, which has taken a decidedly more domestic turn. She is living with her partner, and is more and more involved in the life of his ten year old daughter."}, {"type": "sentence", "content": "Among other things, she described her experience of Mardi Gras. For so long that day was one of the centerpieces of my year. When I lived in New Orleans and a few years after, I saw eight straight Fat Tuesdays. Two years ago Becky and I were almost attached at the hip on the same surreal journey from early morning pancakes until fall of night when Mardi Gras gets not-good-weird and I was quasi-kidnapped by another woman. But that’s another story."}, {"type": "sentence", "content": "Last year, I was in Colombia, and Carnaval is a big deal, at least in parts of that country. Colombian carnival music, which I was hearing a lot in the weeks leading up to it, reminded me of Mardi Gras Indian music and I’d been seeing footage of parades on TV, so the Tuesday in question I was very much aware of the day. I was traveling with a couple friends — Miles from San Francisco and Daniela from Buenos Aires — and I regaled them with Mardi Gras stories while on our bus ride down from Lago de Tota in the Andes of Boyacá department."}, {"type": "sentence", "content": "This year, Mardi Gras fell two days ago. I must be pretty far away from New Orleans, because I didn’t even notice. Waking up on a public beach in a border town, hitchhiking on a semi truck, making camp in strong winds in a ghost town fishing village were enough to entirely distract me. My world was so unknown and immediately palpable that it never crossed my mind what might be happening on Royal Street in New Orleans or at the steps down by the Mississippi above Jackson Square."}, {"type": "sentence", "content": "I was presented with one clue, after the fact: last night walking around, I repeatedly saw people streaming out of churches, which I thought was strange on a weekday night. And then I saw the black marks on their foreheads. Ash Wednesday. This was the first time it occurred to me that the day before might have been Mardi Gras, what had once been the peak of my year. Realizing that I’d utterly missed the day was a little jarring."}, {"type": "sentence", "content": "Emily and I have spent most of our time here in Iquique separately, with the exception of the hours last night hanging out with lots of other people. This morning she spent a long time sitting at a table in the hostel office registering for classes in the fall at CU-Boulder, and it felt like part of her was already gone. Her heart is in southern Chile, at this dream of a farm retreat where she will be volunteering, and where maybe there is a boy involved. Her mind is going back to school. She has about a year left for her undergraduate degree, and has a determination to finish. We’ve talked a lot about the state of our home country over the months we’ve known each other, and though at this point she’s not quite as sour on things as me, it seems to be more of a sense of duty than a desire to go back."}, {"type": "sentence", "content": "It’s a good thing for us to have some time alone, after three days when we were almost always together. And it’s quite an adjustment from being casual friends in a city to traveling together, navigating all the little challenges and trying moments of day after day. She seems different, moody and distracted. I wonder how I must seem. I’m doing my best to let go of the idea that it’s about me, and just let things go."}, {"type": "sentence", "content": "Either way our partnership has an expiration date; in the next city down, Antofagasta, I’m turning east, up towards the Andes. Emily may accompany me up to the high Atacama desert, but she probably will just carry on southward. She seems to be leaning towards not coming with me to San Pedro, the town in the desert, and even if she does, then we’ll certainly split up there, as I’m crossing over into Argentina, and she won’t do that. It’s likely we have only two more nights together. She has a long, long way to go still. I have two more borders to cross and two more countries to see, but she’s got a lot longer way to go than me."}, {"type": "subtitle", "content": "2"}, {"type": "sentence", "content": "Our plan for the night is to go out and play some music on the streets of Iquique. I say “our plan” but it hasn’t been fully agreed upon. Emily and I have been talking about it for a couple days, but when I’d brought it up earlier she’d been noncommittal and said she’d see how she was feeling. Julian insisted that the thing to do was to go to a bar, ask the bartender or barker if we could play, do three songs and then pass around a hat; that playing on the street would be much worse. But Emily absolutely did not want to do that."}, {"type": "sentence", "content": "We’d gone busking several times in Arequipa, though that was a little different. The hat, or guitar case as it may be, is on the ground, a passive receptacle with an implied request for donation. When you go up to someone and put the hat in front of them, it’s much more confrontational. I understand. But years of living in New Orleans cured me of that particular inhibition, and it’s standard conduct there to have a pretty woman or a friend of the band circulate through the crowd, passing the hat. I suppose New Orleans is good at curing inhibitions in general."}, {"type": "sentence", "content": "Either way, Emily was a positive-leaning maybe for playing on the street, and a solid no for bars. In the late afternoon I went for a walk to check out the two places Julian had hesitantly recommended. There was a long calle peotonal closed off to traffic about five blocks away called Paseo Baquedano, and it was really quite nice. Cafés and bars and benches with trees planted in the street. The largest collection of older architecture I’d seen in the city, pastel colors, an almost Caribbean influenced feeling. Palm trees and antique streetlights, very ocean-centric. A bit of the vibe of Key West, Florida.The paseo led up to Plaza Arturo Prat, a broad well-kept plaza with not many people. I found a few potential spots for busking, but at least in the daytime the street was about as sleepy as the buildings."}, {"type": "image", "content": "https://miro.medium.com/max/6528/1*J87WSElEiHWhUX5DRvqL2w.jpeg"}, {"type": "sentence", "content": "I walked down to Playa Cavancha, the beach a few blocks the other direction from our hostel, a wide gently curving beach of light gray sand with black sea rocks on the north end and a whole mess of fancy hotels to the south. There is a malecón between the boulevard-like street and the beach, with benches and shaded spots, a lot of people running and walk-and-talking by. This was the other place Julian had mentioned as a busking spot, and it had potential. Found my way down to the beach, where hundreds of people were laying out on towels, frolicking in the water and drinking beers. I stripped down to my swim trunks and waded in to brave the waters of the Pacific. It seemed somehow a little less cold than Pisagua, though we were a few hours further south, but maybe it was just the hot sun."}, {"type": "sentence", "content": "Warmer or no, it was bracing and I didn’t last long. Sitting on my towel afterward, consciousness reset, letting the warmth come back into my body, that thing called “beach” got through to me. It had been such a long time, all of Perú I suppose, where the combination of barren desert beaches, foggy weather and ice cold water made it hard to feel the festive aspect of sand and sea. But it was here in Iquique, and I found myself warming to the idea of staying in this city longer. Emily had said she wanted to leave the next day, after two nights, and I was thinking maybe I’d just let her go. We were about to split up anyway. Take the time to rest some and swim each day; hang out with Julian and learn some Argentinian guitar playing. I was about to leave the coast and head across the continent, and wouldn’t see an ocean again until Uruguay."}, {"type": "image", "content": "https://miro.medium.com/max/6430/1*ZymbgkpTqp2w6_wQ5SPXsg.jpeg"}, {"type": "sentence", "content": "When I got back to the hostel, Emily was in fact up for playing some music, and I was delighted that we’d at least have one last hurrah. We took our time and went out after seven and a bit before sunset, just when the sea wind was coming in and finally cooling the day. We went to the beach promenade first. I got out my guitar and tuned up and we started playing some songs. The spot was beautiful, but there didn’t seem to be much foot traffic, and those who would walk or run by paid us no attention. What I hadn’t considered was that the noise of evening traffic on the avenue and the crashing of the waves would swallow up the sound of my acoustic guitar and our voices, so those passersby could barely hear us. After a few songs of playing into the wind the sun set behind us, we agreed to try the pedestrian street and packed up our show."}, {"type": "sentence", "content": "Since I’d been at the Plaza in late afternoon, there was a whole concert set up with a stage and loud amplified music. Or maybe it had been there and I didn’t notice it. But either way we weren’t going to be playing acoustic music anywhere near that. So we walked back towards the ocean, realizing that most of the cafes and bars were playing their own recorded music on speakers, and there just wasn’t a lot of aural space to work with. We eventually found a spot that was partly lit, and just far enough away from the bars on either side that we could barely get away with playing."}, {"type": "sentence", "content": "We did our thing, played the fifteen or so songs we know how to play together: some of mine but mostly covers, some in Spanish but mostly in English, and we weren’t getting a lot of attention. A slow trickle of pesos coming in; every so often a person walking by would nod their head. It was okay — I was having fun playing with Emily and we have our own world together once we start making music. By far our biggest fans were the barkers at the adjacent bars. After a while they turned down their music a little bit, and started clapping after each song. Now we were feeling it a little more, and letting loose. The trickle of passersby and pesos had turned into a steady stream, and a few of them would stop and listen to half a song. We played songs we didn’t really know, played the same songs a second time. The night was getting on but I didn’t really want it to end."}, {"type": "sentence", "content": "The street was turning sleepy again, and at some point a guy came up to us saying he had a bar around the corner and would we come play a few songs there? This was better than what Julian had been talking about — we were actually being invited to play. I asked him where the bar was, unilaterally declared that we would come and he left. Emily was still unconvinced. We talked about the nature of asking for money as gringos down here and I would have let it go but we had just been asked to play at a bar in Chile and we weren’t going to show up?! I stuck with it and she reluctantly agreed. We got our things together and walked in the direction he had pointed."}, {"type": "sentence", "content": "It was a little confusing, but about a block and a half away, behind a parking garage, was a little restaurant painted in bright primary colors, a handful of people sitting out at scattered tables on a covered patio with bistro lights, music playing through speakers. I popped my head in the door and our guy was behind the bar, and he was serving some people, but saw me and enthusiastically gave a thumbs up. Afuera? I asked and pointed to the patio, and he nodded. Música? and made the symbol of turning a volume knob, to which he also nodded, but gave me the two finger sign of “in a minute”."}, {"type": "sentence", "content": "I went back out to confer with Emily. She was not into it, but she was going to do it anyway. She said she’d do two songs, and we agreed upon “Home” and “Friend of the Devil” which are probably our best, and I said I’d do one solo to start. She went to the bathroom or the bar, and I said to the scattered tables, Buenas Noches, and sang “Don’t Think Twice it’s Alright” a Bob Dylan song, to almost no reaction. By late in the song Emily had come back out, and we did our two songs and the crowd was slightly more responsive. A middle-aged couple stopped talking altogether and listened."}, {"type": "sentence", "content": "Walked around to each table with my hat in hand, and at all but one table someone gave at least something. I thanked the bartender and we went on our way and Emily was just happy that it was over. We hadn’t counted our money but we had enough to buy something. It was time to celebrate so we walked towards the centro looking for something like a dive bar with food. On a corner after about six blocks we walked past a patio where who did we find but Julian, my patron saint of street music, singing a heartfelt folkloric ballad, red in the face, voice hoarse from too many nights at too many bars. I hadn’t heard him play in public yet, so we had to go in and listen. We sat down at a table and he saw us and gave a sad smile and carried on to a disinterested audience."}, {"type": "sentence", "content": "While we listened we counted the money we’d made in little piles and found we had more than seven thousand pesos, which sounds like a lot but is really only ten bucks. It was enough to get two big bottles of beer — Arequipeñas, in fact, a not particularly good beer from our Peruvian home — fries with cheese and a couple empanadas, and we ordered this from a waitress and felt like a success. After Julian had played a couple songs and walked around with the hat he came over to talk to us."}, {"type": "sentence", "content": "I told him proudly that we’d played on the peotonal and had gotten invited into a bar, thinking he’d be proud of us, but he seemed preoccupied and just talked about how frustrated he was. Mala noche. People here didn’t appreciate music, and he wasn’t feeling well, maybe he was getting sick. Mala comida, he said, holding his stomach, and said he was going home. We said we were sorry and hoped he felt better. He bid us buen provecho as our refreshments arrived and left into the night, saying maybe he would go to one more bar. We ate our fries and empanadas and drank our beer in little glasses and it was certainly worth chalking up in the small victories department."}, {"type": "subtitle", "content": "3"}, {"type": "sentence", "content": "Over our beers, Emily said she’d decided she was ready to keep moving. We agreed that we could easily do another day and night in Iquique, but we both have a long way to go. Maybe it didn’t help when I told her earlier that the map on the wall at the hostel made it look like we were closer to Lima than Santiago. She’s going a lot further than Santiago. I had been considering just staying in Iquique and resting another day, but sometime when we were playing, I realized we’d be leaving this city together. For the moment at least, we are a team, and as long as we’re going the same direction, I should accompany her on the road."}, {"type": "sentence", "content": "Next she announced that we needed to leave the hostel at 7 am. Given that it was midnight, we were at a bar and had just bought liter beers to drink, we hadn’t packed our bags or researched where we needed to go to even get in position to hitchhike, this seemed rather unrealistic, and I said so. She said, “Okay, fine. Eight,” with a stern look in her eye. We ended up smoking a joint out on the patio back at the hostel and talking for a long time about the state of the world with Matias, the thoughtful juggler from Buenos Aires. Sometime well after two I was sitting by myself on the ramshackle roof looking out at the dark ocean, listening to music in headphones."}, {"type": "sentence", "content": "My old friend Reid, who had helped me start this journey nineteen months ago, had sent me a new song that day, his first new music in ages, and asked for my feedback. It was this slow-building, moody synth track, and it seemed like a perfect activity for that moment. Feeling very peaceful, a mostly sleeping night city, listening over and over to this seven minute long brooding heartfelt contemplative song in the dark. By then I’d pretty much decided that I didn’t want to leave in the morning at all, certainly not in less than six hours time. I was just hoping Emily didn’t still want to leave, and didn’t make any final decisions."}, {"type": "sentence", "content": "At eight I woke up to the sounds of street traffic out front, and felt surprisingly decent enough that I figured we might as well try to go. Emily was still in deep sleep. After making a pot of tea, I woke her up, just to ask if she wanted to leave town that day. She mumbled something about a bad sunburn and rolled over, and I started putting my bags together. A few minutes later she woke up for real, and said “okay, let’s do this.” By nine-thirty we had everything together, she’d made a couple of sandwiches, and her mood seemed to be better than it had been in a couple days."}, {"type": "sentence", "content": "We slung on our bags, said goodbye to whoever was around — Julian had not appeared yet that day — and took our leave of the Hostal Sunset Beach. We crossed over to the opposite side of Avenida Arturo Prat, the main boulevard along the ocean, and after a little while caught a blue city bus. The driver said he wasn’t going to Huayquique, the place I’d identified as the southern edge of town, but he said he would point us to another bus that would. That one, a yellow bus, took us to the beginning of Ruta 1, the coastal highway heading south."}, {"type": "sentence", "content": "It felt like an achievement just to have gotten this far: out of the hostel and to the outskirts of the city. For some reason I had confidence we would get picked up, even though that hadn’t happened once in our two previous days hitching. This was an awkward spot to try to hitch from, with local access roads sandwiching the highway, and barely a median separating them for us to stand on. On the auspicious side, it was a good overcast day for standing by the road."}, {"type": "image", "content": "https://miro.medium.com/max/5622/1*yi2_orUo98vvyR3dPxGZog.jpeg"}, {"type": "sentence", "content": "After about twenty minutes, sure enough a compact silver car stopped for us, a little friendly man driving. He said he was going to Verde, a place we hadn’t heard of, but I quickly asked “al sur?” and he nodded and that was good enough for us. We hopped in and it turned out he was from Perú, originally from Puno, then Tacna. He was unimpressed that I had been to both places, and didn’t ask anything more."}, {"type": "sentence", "content": "Fifteen miles down the coast, he turned off at the sign for Verde, leaving the main highway. I don’t think he understood that we weren’t trying to go there, and even when I asked him to please leave us on the main highway he didn’t really get it and kept on for half a mile. Finally he responded to our continued requests, seeming a little confused, and pulled over. We thanked him and then had to hoof it uphill with our bags a long way back to our road. This wasn’t very far on our way, but we were out of the city entirely and in a better spot to catch a ride. Here we were on a wide highway shoulder at the crest of a long rise, brown desert in every direction."}, {"type": "image", "content": "https://miro.medium.com/max/6528/1*extc5KswNzeEDA559nUUxQ.jpeg"}, {"type": "sentence", "content": "We were there for about an hour, enough time for Emily to eat her sandwich, sitting on the ground leaning against her pack, for me to eat a hard-boiled egg sprinkled with salt, smoke some cigarettes and drink hot tea from my thermos. Enough time to sing a couple songs, to teach her the rules of a word game I like. Not many cars passed at all, and very few of those even acknowledged us. It was the whole pretend-I-don’t-see-the-hitchhikers keep-my-foot-on-the-gas thing."}, {"type": "sentence", "content": "And then suddenly a big red semi downshifted to brake hard as it passed us, and pulled over a hundred yards up the highway. “Do you think he pulled over for us?” Emily asked. I said we’d better go find out, and we threw on our bags and ran. Sure enough, he was offering us a ride, all the way to Antofogasta, to Santiago if we wanted. I think Emily is considering the latter. The next sign said ANTOFOGASTA 380 k. We had scored a good ride."}, {"type": "sentence", "content": "Our driver is a quiet man, maybe early fifties named Renato, his long hair pulled back into a pony tail. It’s a bumpy, shifty ride; I don’t know whether this is due to the road, driver, or truck. Maybe a combination of all three. Renato is not riding smooth, and today neither are we. But by hook or crook we are many hours deeper into the epic desolation that northern Chile. It feels like on this day we are speeding towards the future, whatever our fortunes will be: to Emily and I splitting up, to Patagonia then Colorado for her, to Argentina and then Uruguay for me. And on a technical level this is a momentous day in my journey."}, {"type": "sentence", "content": "In a few hours we will be crossing the Tropic of Capricorn, meaning that I will have traveled far enough south that I’m leaving the tropics and entering more temperate climes. It’s a long way from tropic to tropic. I crossed the Tropic of Cancer on my second day in México, five hundred and eighty four days ago, taking a bus from Monterrey to San Luis Potosí. But the rattling of the road jars me out of any sense of premature nostalgia and reminds me that first we have to get through today."}, {"type": "sentence", "content": "The scenery is stark and beautiful: sheer brown and gray mountains to our left, inland; to our right is rocky coastline, boulders buried white with guano, some as big as houses, a deep blue Pacific. Renato the driver likes 80s metal from the states — we have listened to the entirety of Metallica’s “…And Justice for All”, now it’s something a little more melodic and hair-metal that I’m not familiar with. He doesn’t say much, maybe five sentences in the hour we’ve been riding together. Emily’s in shotgun this time, taking occasional pictures through the bug-streaked windshield. I’m sitting on the bed in the back of the cab, trying my best to write despite the shifting ride."}, {"type": "image", "content": "https://miro.medium.com/max/6528/1*l6sR5rvCW4EMid5bWZZMaw.jpeg"}], "topic": "travel"}