{"title": "How A Post-Grad Wants To Reimagine Education", "data": [{"type": "image", "content": "https://miro.medium.com/max/14720/0*rHzrX7owDzajz3Of"}, {"type": "sentence", "content": "New York’s governor, Andrew Cuomo, and Bill Gates want to make online education permanent, even in a post COVID-19 world. I’m someone who has spent most of my life as a student, even while in the working world, and I have other ideas."}, {"type": "subtitle", "content": "The State of The State"}, {"type": "sentence", "content": "Before tearing online education apart, let me address a few things that give the conversation some validity. Cuomo has a real problem on his hands. According to the state itself, New York spends 30% of its annual budget on education. New York spends $22,366 per pupil annually — the highest in the nation. The national average in the United States for this metric is $11,762, almost half that of the empire state. While New York’s spending may match it’s motto, excelsior (ever upward), its performance is mediocre. According to US News, New York’s Pre-K through 12 education ranks 25th in the nation."}, {"type": "sentence", "content": "Unsurprisingly, the money New York spends on its poorly performing investment has to come from somewhere, namely the taxpayers. As is most common, education here is funded through property taxes. I’m a resident of Long Island, where property taxes are commonly well in excess of $10,000 per year. This inefficiency is unsustainable and genuinely undermines the quality of life for New York’s residents. Throwing money at the problem hasn’t worked thus far, so a unique solution might just be the most likely to work."}, {"type": "image", "content": "https://miro.medium.com/max/6048/0*XtFH5g_UnlYg0Iq2"}, {"type": "sentence", "content": "Cuomo’s argument is that school buildings are waste. The land they sit on could be privatized and taxed. The facilities cost a great deal to maintain. Each school has public employees on local and state payrolls who aren’t teaching classes. There would be substantial financial savings if students were given a decent laptop and a basic internet connection or a subsidized high speed connection if buildings were taken out of the picture. When it comes to saving money, he’s absolutely right. Among a number of questions, the first and foremost would have to be whether this dramatic shift is worth it."}, {"type": "subtitle", "content": "My Experience With Online Education"}, {"type": "sentence", "content": "When it comes to education experience, I have more in common with Bill Gates than I do Andrew Cuomo, since we’ve both taken classes through Harvard University but never quite got that degree. Ironically, I took my classes online, albeit after getting my B.S. in psychology from a university I resided at prior."}, {"type": "sentence", "content": "When it comes to taking college classes online, especially from a university like Harvard, I couldn’t recommend it highly enough. I’ll explain why I’m against making online education universal, but let me briefly share the tremendous benefits."}, {"type": "image", "content": "https://miro.medium.com/max/12032/0*zTzvJn0MvhjoJuhb"}, {"type": "sentence", "content": "The most recent class I took through Harvard involved watching weekly prerecorded lectures that were as captivating as Ted Talks, but obviously much longer. More memorably was the experience with my study group professor, who made me aware of Zoom before COVID-19, as he logged on as the sun outside his Tokyo residence rose while the sun outside my New York apartment fell. There were people from so many different perspectives, from students working towards their undergraduate degrees to the man who launched Twitter in the Middle East."}, {"type": "sentence", "content": "I received a tremendous education online. Let’s be honest with ourselves. Most of us receive some sort of online education every day, be it academic lessons to makeup tutorials. That puts me at the risk of sounding like a Luddite when I say that I’ve been dwelling upon numerous reasons for why Reimagine Education would be a catastrophe."}, {"type": "image", "content": "https://miro.medium.com/max/1598/1*_q4INKZ5GAxh8pcaCySWrg.jpeg"}, {"type": "subtitle", "content": "Beyond The Classroom"}, {"type": "sentence", "content": "Let’s contextualize my experience for a moment. My only background with online education took place in my twenties. While I may not have had the traditionally studious environment of a university classroom, I did have the comfort of being in my apartment with my wife. Considering New York’s control over the medium by which education is conducted stops at Grade 12, my experience will be shared by literally no one affected by this."}, {"type": "sentence", "content": "While university campuses may not be the proper setting for safe spaces due to the purpose of a college education, it is without a doubt that primary schools should be a safe space for children. For many children, home is associated with trouble. Dad lives and eventually dies by the bottle. Mom is still on those painkillers she stopped needing three years ago. An older sister is abused by an anti-social boyfriend. The family dog urinated in the living three days ago, but the stench still remains. These are lives led by children who know no other reality at home. What they’ve also come to know is that school is their escape."}, {"type": "image", "content": "https://miro.medium.com/max/11562/0*3yUyIYFJybca0qCF"}, {"type": "sentence", "content": "Taking these children away from their place of refuge and the only thing that clues them into what a life worth living looks like will shred the morsels of mental health they desperately cling onto into forgotten memories. A child without an ounce of innocence left is a child who has been willfully failed by society."}, {"type": "sentence", "content": "According to Child Help, state agencies across the United States found 702,000 confirmed cases of child abuse in 2014 alone. Four to seven children die from abuse daily. Of those that survive, 80% of them struggle with psychological disorders in adulthood. While we make the time to reimagine education, let’s not forget to reimagine what these children’s lives will look like after another six to seven hours of potential daily exposure to mistreatment."}, {"type": "image", "content": "https://miro.medium.com/max/8484/0*4808agQwNeDItyC-"}, {"type": "subtitle", "content": "Less Will Be Learned"}, {"type": "sentence", "content": "Quarantine has allowed us to see what remote education looks like. While mom is balancing accounts in the kitchen, dad is handling budgets in the dining room. In the living room, their child is on a Zoom call with their class. Mom and dad hear the teacher. All is well."}, {"type": "sentence", "content": "Except, all is not well. Most schools use Chromebooks for remote learning. If you think that what your kid can do on that Chromebook is restricted, think again. The effort by children working together over the internet to unlock their school-provided Chromebooks is a stronger cooperative task force than any team you’ve been a part of in the office. If all else fails, most of these kids have the world in their pocket via smartphones anyway."}, {"type": "sentence", "content": "This leads me to an honest question. If you were 11 years old and you had access to any piece of information, meme, game, or form of communication, why on God’s green Earth would you pay attention to Ms. Sally attempting to explain onomatopoeia through a low quality webcam?"}, {"type": "sentence", "content": "Kids will want to direct their interests elsewhere, but kids aren’t stupid. They know that school has some sort of relative importance. In order to get by, they’ll tune into Ms. Sally periodically to figure out their approximate understanding of what she is teaching. If Ms. Sally is explaining something that is fairly self-evident to the student, that student is probably tuning back over to TikTok or YouTube."}, {"type": "image", "content": "https://miro.medium.com/max/10598/0*rQKwBW-QpVJVagJ8"}, {"type": "sentence", "content": "Perhaps if the student is learning during this time regardless, it wouldn’t matter. YouTube is home to hundreds of Ted Talks for example. There is evidence to show that the student won’t be learning at all though. According to Dr. Deb Lonzer, multitasking makes it difficult for children to “absorb information” and “connect thoughts and ideas.” The constant switching back and forth between school and media is as good as doing neither at all. Essentially, it’s a monumental waste of time."}, {"type": "sentence", "content": "As if that isn’t bad enough, an article published by the National Institute of Health states that the more time kids spend on social media, the more likely they are to have a negative self-view, struggle with interpersonal relationships, and engage in self-injuring behavior and suicidal idealization. Social media is exactly what these kids, especially girls, will occupy this extra time with."}, {"type": "subtitle", "content": "Parents and The Workforce"}, {"type": "sentence", "content": "Remote learning for developing children can result in increased child abuse, a lack of any real education, and poor mental health. While that should be enough to reject Reimagine Education, the list of cons for this idea continues to grow. As it turns out, this program is not particularly great for parents either."}, {"type": "sentence", "content": "If a child is not at school, an adult needs to be with that child. Leaving a small child to their own devices (no technology pun intended), is negligence. That means that someone in the family has to step up and make themselves available while their child is learning remotely. While this has been fairly easy during quarantine, most people, especially those who struggle financially, will need to return to a physical location to work. Under Reimagine Education, what happens to your child?"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*pQljkVEnsSnSZOH8"}, {"type": "sentence", "content": "There are a number of ways this plays out. The most fortunate will have a grandparent, aunt, uncle, or family friend who is gracious enough to host the child during the day. There are plenty of households in which there are two parents and only one works. These people would be fine."}, {"type": "sentence", "content": "Low income families may need both parents working. Single parent households are beyond common. Sure, there would be a surge in childcare services, but those who already pay for childcare know the enormous cost associated with it."}, {"type": "sentence", "content": "Simply put, Reimagine Education would cripple the less fortunate financially, not just today, but for generations to come by maximizing the divide in education quality. As each generation passes through the system, the effect would compound. The state that is home to Ellis Island would be flagrantly rejecting its original identity as the home of opportunity for people of all backgrounds."}, {"type": "image", "content": "https://miro.medium.com/max/4096/0*xi2fxwVgw6eZFFZt"}, {"type": "sentence", "content": "When researching solutions to this issue, the only tactic I could come across would be to institute universal basic income. For those unfamiliar, this would be a set amount of money given to all people on a recurring basis with no questions asked. Andrew Yang’s 2020 campaign cornerstone of $1,000 per month for every American 18 or older is an example of this."}, {"type": "sentence", "content": "To find out if this feasible, I looked into redistributing the education budget. As stated earlier, New York spends $22,366 per pupil annually. Let’s pretend New York’s Reimagine Education could get that down to just $1,000. With 2,622,879 students in the state and a savings of $21,366 per student, that would free up $56,040,432,714. That is an enormous, albeit unrealistic, sum of money. According to the New York State Department of Health, New York has 15,053,173 residents 18 or older as of 2010. That number would be higher today, but even this completely Utopian scenario would only provide $3,722.83 to each adult annually. That helps a downstate single mom scrape by for about seven weeks."}, {"type": "subtitle", "content": "Where Do We Go From Here?"}, {"type": "sentence", "content": "If I left the article here, I would have done something I hate. So far, I’ve explained why New York needs a shift in education due to financial pressure and then broken down why the only one on the table isn’t any good due to its inefficiency, likely negative mental health effects, and inequality of opportunity. Anyone can use their perspective to put an idea through demolition, but now it’s time to put on my construction hardhat and come up with an alternative solution."}, {"type": "sentence", "content": "Our education system has remained largely the same since World War II, which is a big reason for why America generally stands on top of the world stage. It’s the same system that put a man on the moon. That’s incredible, but have we done anything of a similar magnitude recently? Is America on top of the world stage when it comes to education? According to the OECD, the United States comes in at number 20, just behind the nuclear superpowers of Latvia and Lithuania. Sarcasm aside, what could countries like these offer that the United States doesn’t? To find out, I looked straight to number one — Finland."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*W_MPMOqR4GHdZD8b"}, {"type": "sentence", "content": "This wasn’t my first time checking in with the OECD to see which countries ranked highest in education. In 2015, I took Cross Cultural Psychology at Mount St. Mary’s University with the wonderful Dr. Caitlin Faas, who utilized a significant portion of the class to focus on contextualizing the topic of the course within the world of education. Take a wild guess which frosty group of Europeans ranked highest five years ago — the Finns."}, {"type": "sentence", "content": "In Finland, the attitude towards education doesn’t start with the student. It starts with the teacher. Teachers are highly respected members of society, similar to doctors in the United States. That respect isn’t given to them either, because just like becoming a doctor in the United States, becoming a teacher in Finland is a thoroughly rigorous process. For starters, only the top few universities can even offer teaching degree programs. That makes these schools extremely competitive, but it also produces the best talent."}, {"type": "image", "content": "https://miro.medium.com/max/9764/0*QREwbCUEYb52Jn7s"}, {"type": "sentence", "content": "In Finland, school consists of classes during the day. That is it. While recreational sports are popular, the teams are not affiliated with the school. That means children aren’t being taught during the day by coaches who have to teach. In the United States, far too many schools put the varsity football coach in the classroom to meet rules for the league that the school participates in."}, {"type": "sentence", "content": "Finland also doesn’t do homework. Students still take comprehensive exams at year-end, but that is the majority of their obligation outside of class. This allows students to start working on their work-life balance from a young age. While homework has been shown to help in retaining information, perhaps the school day itself would be more effective if kids knew they could give their full effort during the school day, instead of conserving their mental efforts for the daily practicums that await them after their classes."}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*A6WjDcWFAFQndHlC"}, {"type": "sentence", "content": "Finland’s education system may sound like a fairy tale to some, but don’t get too excited yet. The Finnish population is about 28% of the state of New York’s, and the cultures are rather different from one another. Comparing Finland to New York is comparing apples to oranges."}, {"type": "sentence", "content": "There are so many reasons for why the Finnish education system might not work in the struggling Empire State; however, its success is one crucial reason to have hope for what’s to come. Reimagine Education may not be the answer to our woes, but it is in reimagining education as a society, as teachers, as students, and as parents that we will find that answer. It seems for the time being that we all have some homework to get cracking on."}], "topic": "education"}