{"title": "How to Build a Diversity & Inclusion Program that Lasts", "data": [{"type": "sentence", "content": "By Sarah Morse, Prachi Sharma, and Josh Cherry"}, {"type": "sentence", "content": "The importance of diversity within the workforce is well established at this point, yet much of the tech industry struggles to build diverse teams. Diversity matters not only for ethical reasons, but also from a business perspective: diverse teams outperform non-diverse teams, and teams led by diverse leaders are more likely to propose novel ideas that lead to innovation. Yet so often, as companies grow, they fail to recruit and retain individuals from diverse backgrounds: the bias to action that fuels Silicon Valley frequently leads to recruiting fast rather than well. When companies reach the point of maturity when at last they can pause and reflect, it is often to realize that they’ve built a culture and team that does not represent their user base."}, {"type": "sentence", "content": "In late 2018, despite multiple previous attempts to recruit diverse talent to Lyft’s Data Science team, we had failed to make substantial inroads. Our efforts had been at times unsustainable, at others fruitless. We had grown our team significantly in five years — from a scrappy group of ten to a mature Data Science org — but only around 20% of us were from target groups (women, black/African American, and LatinX)."}, {"type": "sentence", "content": "In October of 2018, we — a small group of data scientists — created the Diversity and Inclusion Group (DIG) as an answer to the difficult question of how to build a sustainable initiative centered around recruiting and retaining diverse talent within Data Science. We credit the structure of DIG for its impact and staying power. Here’s how DIG works:"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*ymj8xAqE4JvotmrH"}, {"type": "sentence", "content": "Since October 2018, DIG volunteers have delivered significant impact in our efforts to recruit and retain diverse talent to the Data Science team and promote a culture of inclusivity. In 2019, we increased the percent of our team from a target background from ~20 percent to 32 percent. We held our first ever Lyft Data Science Panel in April of 2019 to recruit diverse talent, and have since hosted several more meetups with that goal. The following October, we hosted a Data Challenge to recruit university students to internship positions, and were pleased to see the majority of our finalists come from a diverse pool of students. In addition, we launched a mentorship program that ~40% of Data Science has participated in, represented the Lyft Data Science org at multiple conferences (including Grace Hopper and AfroTech), created a suite of reference materials on inclusivity best practices, held informal gatherings to establish stronger connections within Data Science, and built strong relationships with Lyft’s recruiting and centralized I&D teams. The success we had with DIG in 2019 inspired the creation of three parallel Data Science team initiatives — Learning & Development, Onboarding, and Knowledge Share — which closely mirror the structure and processes of DIG."}, {"type": "sentence", "content": "Accomplishments may be impressive when you string them together in paragraph form, but the reality is that we are constantly learning. To save others from the same long road of discovery, we’ve coalesced a year’s worth of lessons into a set of principles that we hope will help jumpstart I&D efforts across Tech and other industries. Here are Lyft Data Science’s 10 principles for building a successful grassroots Diversity and Inclusion group:"}, {"type": "sentence", "content": "DIG needed to be approachable and sustainable. We accomplished that by structuring DIG so that every individual had a well-defined and reasonable scope, and so that the success of one workstream didn’t depend on another. Potential volunteers could be sure of the commitment they were signing up for (essential in a workplace where urgent tasks crop up daily). The advantages of a decentralized structure were made clear when one of our workstreams was blocked on a project for months. While the leads of that workstream worked to unblock their team, their volunteers were able to pivot to other tasks. Meanwhile, the efforts of our other workstreams continued unimpeded."}, {"type": "sentence", "content": "2. Keep participation open, and communication transparent."}, {"type": "sentence", "content": "Anyone at any level is welcome to participate in DIG. All are welcome (volunteer or not) to attend the bi-weekly Leads Meetings and listen in or offer ideas as well as to attend meetups and events hosted by DIG."}, {"type": "sentence", "content": "The Data Science team is continuously reminded of DIG via org-wide communications. By publicizing DIG’s efforts, we motivate volunteers by emphasizing the importance of their work, hold the group accountable for producing results, and turn “DIG” into a household name that all Data Science team members recognize. At Lyft, we did this via a Biweekly DIGest that highlighted recent efforts, upcoming events, and calls-to-action."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*Bytllk8RW2rRpM4A"}, {"type": "sentence", "content": "3. Let the work your group does evolve."}, {"type": "sentence", "content": "Over the course of the year, we began to understand the impact of DIG’s various efforts, and we took those lessons and adapted our focus accordingly. We shifted volunteers and spun up new workstreams as the Data Science team grew and participation in DIG grew with it. Enabling workstreams to dissolve and new workstreams to be created keeps existing volunteers engaged, inspires new volunteers to join, and democratizes the process of defining the group’s focus."}, {"type": "sentence", "content": "4. Define a recruitment process for the group."}, {"type": "sentence", "content": "As we ramped up DIG, we outlined a process to sign up volunteers and transition people in and out of roles. DIG formally recruits new volunteers every six months and determines where to allocate them based on changes to workstreams. A defined recruitment process with term limits for leads ensures that new people consistently have an opportunity to lead and that a single person doesn’t become essential for the success of a particular workstream."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*5NO6DPKROiYF8TDS"}, {"type": "sentence", "content": "5. Track progress to hold volunteers accountable."}, {"type": "sentence", "content": "Having a clear process to track progress holds people accountable, inspires effort, and creates an efficient way to communicate updates. DIG uses a tracker that highlights owners for projects, biweekly progress, and blockers. Workstream leads provide updates in the tracker that are then reviewed in the biweekly Leads Meeting. Regular updates keep volunteers and leads accountable for executing and ensure that potential blockers are surfaced quickly."}, {"type": "sentence", "content": "6. Find an executive sponsor who cares."}, {"type": "sentence", "content": "Having an executive sponsor (Director+) matters for the success of an initiative like DIG. From the start, we had to align with Lyft’s broader I&D team, coordinate efforts across Data Science and recruiting, and secure a budget for events we wanted to attend or host. Exec level folks have the ability to push things along when blockers arise, and are more easily able to connect relevant parties across a company as big as Lyft. In addition, execs can push to have participation in the group recognized more formally (an advantage we’ll discuss in more depth below)."}, {"type": "sentence", "content": "7. Build partnerships with key orgs — especially Recruiting."}, {"type": "sentence", "content": "One of the main goals of DIG is to recruit diverse talent. Tackling that challenge has meant identifying new sources of potential candidates, prioritizing the most promising recruiting opportunities, and operationalizing new recruiting processes. To do this, we needed a strong partnership with Recruiting — Recruiters have specialized expertise that Data Scientists lack, and having them on our team meant that we could leverage their experience to make better decisions. We asked recruiters to volunteer for DIG as leads or workstream participants, and were fortunate to have several Recruiters join. They play a critical role in determining which conferences to attend, what kinds of events to host, and informing our strategy by leveraging information about the hiring pipeline."}, {"type": "sentence", "content": "In addition to Recruiting, we also developed lines of communication with our internal I&D team, the People team (HR), and our Legal team. When we are uncertain about the best path forward, we can turn to these partners to draw on their experiences in I&D and hiring. For example, when looking at the source of the increase in our team’s diversity from 20%-32%, we saw that the majority of that increase was driven by an increase in the number of women on the team. With help from our partners in I&D we were able to expand our focus in 2020 to target conferences and plan meet-ups that would better enable us to recruit black/African American and LatinX data scientists, as well as female data scientists. (While COVID-19 has temporarily stalled these plans, we fully intend to pick up where we left off when we are safely able to)."}, {"type": "sentence", "content": "8. Ensure that the group’s success doesn’t rest on one person’s shoulders."}, {"type": "sentence", "content": "We set DIG up to thrive in the absence of any single person. People leave the company, get busy with other projects, or have things come up in their personal lives. To be successful, a group needs to be able to withstand any temporary or permanent personnel changes."}, {"type": "sentence", "content": "In DIG, we wanted to preclude any one person from being essential for the success of the group or a workstream. For example, a decentralized reporting structure means that if one workstream is in flux when someone leaves, the rest of the group can still make progress. A defined recruitment process ensures that new volunteers step up to fill gaps. Documenting progress in a formal tracker means that new people can easily pick up from where others left off. Co-leads for any leadership position means that if one lead has to step back, their co-lead can pick up the slack. Term limits ensure that no single person can become too important. Six month transitions ensure that we are constantly updating our documentation, adding a layer of protection against institutional knowledge living with a small group of people."}, {"type": "sentence", "content": "9. Reward participation in your I&D group."}, {"type": "sentence", "content": "People will volunteer, and volunteers will engage if they know that their reporting structure values this work and that participating will reflect well on them when review cycles come around. Ideally, people volunteer because they agree that diversity and inclusion are important — and many do. But relying on that alone runs the risk of putting the burden of effort on those most affected by a lack of inclusivity and diversity. Incentivizing participation means that people who may not prioritize inclusion or diversity otherwise take up the mantle and work to improve their teams. The Lyft Data Science career pathways explicitly states that investment in our team is expected, and DIG is one way to meet that expectation."}, {"type": "sentence", "content": "10. Have fun with it!"}, {"type": "sentence", "content": "Diversity and inclusion work is important, but it can also be emotionally draining to continuously work to create more diverse and inclusive teams. It’s helpful to intersperse the more taxing, long-term work with lighter projects that everyone can enjoy and use to recharge. Our culture-focused workstream organizes events that the entire Data Science team enjoys: low-key social gatherings, informal presentations where a few Scientists can present on something outside of work they are passionate about, book clubs, etc. These events are well-attended and allow DIG volunteers and the broader Data Science organization to enjoy the community we’re building. Ultimately, people participate in things they enjoy — making DIG fun has kept people volunteering term after term."}, {"type": "sentence", "content": "DIG is an ever evolving group; we’re constantly learning from our successes and failures. One thing we’ve learned is that partnerships are invaluable — they enable idea sharing, efficient recruiting, and a culture of collaboration and support on difficult topics. If your organization has a data, data science, or other decentralized I&D group, we would love to hear from you, share ideas, and partner on events. Please reach out to us at diversity-in-science@lyft.com — we look forward to improving diversity and inclusion together!"}, {"type": "sentence", "content": "If you are interested in joining our incredible team of Data Scientists, check out our careers page!"}], "topic": "leadership"}