{"title": "The Ultimate Price Of Cyber Bullying", "data": [{"type": "subtitle", "content": "Bullying | Social Media | Mental Health"}, {"type": "subtitle", "content": "Words can hurt, they can weaken and they can kill… so think before you speak"}, {"type": "sentence", "content": "It happens again and again. Hurtful comments on a Twitter page. Harassment on a Facebook profile. This time, it cost the life of 22-year-old Japanese pro-wrestler and Netflix star Hana Kimura."}, {"type": "sentence", "content": "She recently was part of “Terrace House”, a bachelor-like reality show where people live together in a house monitored by cameras for the public eye. She got into a fight with a male housemate who washed his clothes together with her wrestling attire, to which she overreacted and tipped his hat off his head, seemingly angry."}, {"type": "sentence", "content": "As a response, she received a huge shitstorm on social media. People started telling her “nobody needs you” and “you should kill yourself”. She was constantly targeted with harassment throughout her career, but these comments finally pushed her over the edge. The events following the terrace house incident developed into an ongoing storm of harassment and bullying."}, {"type": "sentence", "content": "Two days ago, on May 23, 2020, she took her own life."}, {"type": "subtitle", "content": "Cyberbullying is a constant venom"}, {"type": "sentence", "content": "Those who know me also know my stance on the topic of bullying. It’s despicable and vile behavior, which has no place in our society. Yet there are those who are ignorant about their own behavior. People who can’t see or understand the wake of devastation they cause by speaking hurtful words to others."}, {"type": "sentence", "content": "Even the heaviest stone will break if you smash another rock against it long enough. Our mental health is no different. Just because someone presents themselves as mentally resilient, does NOT give you the right to attack them."}, {"type": "sentence", "content": "You cause great harm. The damage does not need to be visible on the surface to be valid. If you use words to hurt someone, you’re guilty of mental abuse. It’s not really any different from physical abuse."}, {"type": "sentence", "content": "And the longer it goes on, the higher the price will be. In too many cases, the ultimate price has been paid. A human life."}, {"type": "sentence", "content": "This time, it took the life of a 22-year-old woman who had the brightest part of her future still ahead of herself. She’s 8 years younger than I am. But she’s gone."}, {"type": "subtitle", "content": "Stop bullying where it starts"}, {"type": "sentence", "content": "There will always be idiots who indulge in bullying others. People who lack any self-respect, trying to feed their frail egos by stomping someone else’s. If you see something like this developing, it’s your obligation to put an end to it."}, {"type": "sentence", "content": "Especially on social media, where the own anonymity and peer pressure play a role, most people tend to jump on a specific hype train and blindly join groups to copy their behavior. At first, it’s only one or two bullies. Then more people come together and without even knowing what’s going on, they will start repeating the words they hear."}, {"type": "sentence", "content": "Simply to feel acknowledged within the group they just found. Not to hurt someone else. But to make themselves feel loved by their peers."}, {"type": "sentence", "content": "This causes a snowball effect, where even a few bullies harassing someone can quickly spin out of control. The result is a shitstorm as Hana Kimura had to endure this week."}, {"type": "sentence", "content": "If you witness bullying, please, use your brain. Don’t team up with the bullies, but with the victims instead. Show solidarity. Show compassion. Prevent needless harm from happening where it begins."}, {"type": "subtitle", "content": "In memory of Hana Kimura"}, {"type": "sentence", "content": "Hana Kimura was a rising star in the wrestling world. Just like her mother Kyoko, she was bound to become one of the most acclaimed wrestlers in the industry."}, {"type": "image", "content": "https://miro.medium.com/max/1320/1*VHsLfPEGDBmuWLXJp6pU1A.jpeg"}, {"type": "sentence", "content": "She debuted in her wrestling career in 2016 and has since won many championships. She also was part of Stardom, one of the top promotions for women’s wrestling in Japan."}, {"type": "subtitle", "content": "Don’t blame the victim"}, {"type": "sentence", "content": "I know some people upon seeing this will try blaming the victim. It’s easy to say “it’s their fault for not standing up for themselves”, or “if they don’t want to get bullied, they shouldn’t be mean in public”."}, {"type": "sentence", "content": "But nothing ever justifies bullying. Not even bullying a bully. If you do that, you’re not better than them."}, {"type": "sentence", "content": "Hana Kimura has put up with harassment and bullying for a long time. In fact, a lot of young women in the entertainment industry suffer from it. I remember a case where a young porn star committed suicide over a similar form of harassment because she didn’t want to have sex with gay men I think."}, {"type": "sentence", "content": "Hana Kimura was not as strong as she pretended to be. Inside she knew how hurtful all this was. She was just a 22-year-old woman, still trying to find her bearing in the world."}, {"type": "sentence", "content": "Think before you speak. Choose your words wisely, they might hurt or kill someone."}, {"type": "sentence", "content": "And don’t be blind to bullying and harassment. Show some valor. Step in."}, {"type": "sentence", "content": "Kevin is an editor and writer for the ILLUMINATION and Polyglot Poetry publications. Follow him on Twitter and LinkedIn."}], "topic": "social-media"}