{"title": "How Body Awareness Can Help Us Understand Our Emotions", "data": [{"type": "subtitle", "content": "Strong feelings can have physical manifestions"}, {"type": "image", "content": "https://miro.medium.com/max/7872/0*t_WeWjwR8kKmyhZw"}, {"type": "sentence", "content": "Once viewed as a mere competitor of rational thinking, emotions hold a somewhat unique place in the overall picture of our wellbeing. Still, understanding one’s own emotions can be a daily biggest struggle."}, {"type": "sentence", "content": "During my PhD studies, I examined research on emotions and aspects, but knowing the theories did not always help me in understanding my own feelings. Why do I feel so bad? Why do I have no desire to do anything? What is this chest pain when somebody hurts me?"}, {"type": "sentence", "content": "I learned that there are ways to increase awareness about what’s happening with our emotions, and how this affects our bodies and our lives. The theory of emotional intelligence (EQ) might offer some solutions. At the heart of the EQ is the idea that control over one’s own emotions starts with the ability to perceive them. Knowing and understanding your emotions, you can healthily manage your mood and open the door to a more mindful and happier life."}, {"type": "sentence", "content": "The question is, how can we perceive and understand our emotions better? For me, understanding my own emotions started from carefully listening to what my body was trying to tell me."}, {"type": "subtitle", "content": "Body and Emotions"}, {"type": "sentence", "content": "The idea that our bodies and emotions work hand in hand is not new. The relationship between the two has gained much attention from psychologists. Did you know, for example, that negative emotions can lead to real physical pain? Or that positive emotions can undo some serious heart complications caused by negative emotions?"}, {"type": "sentence", "content": "In other words, whatever happens in your body may influence your emotions and vice versa. Emotions also seem to invoke different sensations around some areas of our bodies."}, {"type": "sentence", "content": "In one study, participants had to color the parts of a human silhouette in which they felt emotions while watching emotional scenes from the movies. The drawings were then analyzed and combined to plot bodily maps of fourteen primary emotions, from anger to envy."}, {"type": "image", "content": "https://miro.medium.com/max/5148/1*XfsrLtS_w_sxAQmYzRfbGA.png"}, {"type": "sentence", "content": "This was a revelation to me. I had known that emotions had physiological signals, but mostly in the context of facial expressions and different reactions such as sweating or a fast heartbeat. But it’d never occurred to me that we tend to link our bodily sensations to different emotions and vice versa."}, {"type": "sentence", "content": "Although psychologists are wary about saying that emotions genuinely live in these areas of our bodies (read How Emotions Are Made if you want to get an introduction into the topic), the fact is clear — this chest pain you may feel when you’re sad is as real as it gets."}, {"type": "sentence", "content": "If so, what does it mean?"}, {"type": "subtitle", "content": "Enter Body Awareness"}, {"type": "sentence", "content": "The fact that we can feel real pain from strong emotions suggests that monitoring one’s bodily reactions and accompanying emotions might enhance emotion perception."}, {"type": "sentence", "content": "Very often, we go through life without paying much attention to how we feel and what we feel."}, {"type": "sentence", "content": "Stress at work, the tension in the relationship with your partner, and one deadline after another make us insusceptible to any kind of drama, but only until it’s too late to fix what’s been long broken."}, {"type": "sentence", "content": "As a result, our emotional pain overwhelms us, and we chase it with pills, drinks, and other habits, ruining not only our health but also social relationships. I’ve done terrible things to my body when I felt down, so I know what I am talking about."}, {"type": "sentence", "content": "One way to avoid these problems is to be attentive to one’s own body and respond to its signals."}, {"type": "sentence", "content": "From my personal experience, I can say that paying close attention to my body allowed me to understand better 1) what I feel, and 2) recognize if something requires my immediate attention."}, {"type": "sentence", "content": "I figured out that the best way to understand what’s happening in my body is to ask the following questions:"}, {"type": "sentence", "content": "I usually ask these questions when I note the changes in my mood (both positive and negative), trying to figure out what exactly I feel and what causes it."}, {"type": "sentence", "content": "Asking these questions gives me plenty of room for exploring the connection between my body and emotions. I also do it to practice to recognize my emotions promptly and to manage them more mindfully."}, {"type": "sentence", "content": "For example, when I feel that because of the tension in the relationships with my partner I feel down (usually I feel weakness in my extremities and chest pressure in these moments), I realize that instead of lying on a couch with the phone in my hands it’s better to go for a walk in the park or for a bicycle ride. It won’t help to improve the relationships, of course. But it will let me switch the context and improve my mood, which can help me later in fixing what’s broken. At least, partially."}, {"type": "subtitle", "content": "My Emotion-Bodily Sensations Cheat Sheet"}, {"type": "sentence", "content": "Every emotion is unique. I know it from my own experience, and you probably know it too."}, {"type": "sentence", "content": "Some emotions make you feel energized, while others make you feel down and under pressure."}, {"type": "sentence", "content": "That doesn’t mean, however, that there is a distinctive fingerprint for each emotion. From my experience, I know that some emotions tend to share physical sensations, which can make it challenging to identify the exact emotion."}, {"type": "sentence", "content": "The key, however, lies in practice. I noticed that with time I became more sensitive to what I felt and was able to use more words to describe how I feel both to myself and to my partner."}, {"type": "sentence", "content": "Below is my list of bodily reactions associated with different emotions. It’s based on my personal experience, but I hope that you may find it useful too."}, {"type": "subtitle", "content": "Anger"}, {"type": "sentence", "content": "Anger is a powerful emotion that we usually experience when something is against our goals or expectations. To be honest, I hate feeling angry. Anger drains my body and mental energy, leaving that bitter aftertaste of remorse, which makes me sad."}, {"type": "sentence", "content": "Depending on the intensity of my anger, the feelings that accompany it may include:"}, {"type": "subtitle", "content": "Sadness"}, {"type": "sentence", "content": "Sadness is a negative emotion that we usually feel in response to loss or defeat. The role of sadness is to inform us that something is wrong, help us reevaluate our goals, and motivate us for life change in the face of new circumstances."}, {"type": "sentence", "content": "Sadness has many faces, but I’ve noticed that the usual physical signals of sadness include:"}, {"type": "subtitle", "content": "Joy"}, {"type": "sentence", "content": "Joy is a pleasant emotion that we usually feel when events in our life are in accord with our goals. It creates the urge to play, push the limits, and be creative. Joy broadens our attention and helps us to be open to new experiences."}, {"type": "sentence", "content": "Joy is a strong emotion that involves all of the body parts (see the image above). I’ve noticed that when I feel joy (usually when something big works out or when my partner and I go hiking), I tend to experience:"}, {"type": "subtitle", "content": "Fear & Anxiety"}, {"type": "sentence", "content": "Fear and anxiety are very similar and usually occur in response to a threat or potentially adverse outcomes of a future event (e.g., failing a job interview). The role of both emotions is to prepare us for a stressful situation and mobilize body resources for a fight-or-flight response."}, {"type": "sentence", "content": "As a PhD student with teaching responsibilities, I experienced fear and anxiety before every single lecture. There were times when I thought I would actually faint in front of the students. The bodily reactions that usually accompany my fear are:"}, {"type": "subtitle", "content": "Love"}, {"type": "sentence", "content": "Love is perhaps one of the most mysterious emotions. Some studies show that love may encompass many positive emotions, from the interest in a person to the joy of sharing breakfast with them to gratitude for being together."}, {"type": "sentence", "content": "Nevertheless, very often, the feeling of love results in bodily reactions that are similar to fear. For example, people who are in love may feel fluttery in the stomach and shivery, especially at the beginning of the relationship (I miss this feeling)."}, {"type": "sentence", "content": "At the same time, love, like joy, have strong bodily responses that are difficult to link to one part of the body. Many people say that when they’re in love they feel:"}, {"type": "subtitle", "content": "The Takeaway"}, {"type": "sentence", "content": "Practicing body awareness allowed me to listen to my body and identify if something requires my attention."}, {"type": "sentence", "content": "This, in turn, allows me to understand better and manage my emotions more mindfully."}, {"type": "sentence", "content": "I ask the following questions to practice body awareness:"}, {"type": "sentence", "content": "The cheat sheet of emotion-bodily sensations in this post is based on my personal experience, but hopefully, you can find it useful too. Use it as a starting point; track your own physical responses to emotions and then create your own list. After all, emotional intelligence starts with understanding your own emotions and describing them with words that resonate with you and not somebody else."}], "topic": "mindfulness"}