{"title": "The Analog Challenge: A Month Devoted to Deep Things", "data": [{"type": "sentence", "content": "Working from home has its advantages and disadvantages. While we no longer have the dead time associated with commuting to and from work, there is no shortage of endless distractions in our digital and physical environment. This led me to think: am I squandering this “extra” time?"}, {"type": "sentence", "content": "While I agree with recent literature on the importance of taking it easy on ourselves during this unprecedented time in recent history, I’ve noticed my habits and routines slipping, leaving me to experience a low-grade, persistent hum of anxiety, sluggishness, and distraction."}, {"type": "sentence", "content": "Sensing the impact this may have on my clients, family, and, of course, myself, I am committing myself to a month-long challenge (May 6 — June 6) to reduce my reliance on optional technology and increase the time I spend in the analog world. And given that I’ve recently opened up my own law firm, it’s a perfect time to carve out a new work routine concentrated on deep work. If you feel like this too, I invite you to create your own analog challenge too."}, {"type": "subtitle", "content": "The Rules"}, {"type": "sentence", "content": "1) No social media unless for work purposes:"}, {"type": "sentence", "content": "While I don’t consider myself a social media addict, I do have Twitter, Instagram, and LinkedIn accounts that I often check once a day. Over the next thirty days, I won’t be logging into any of them unless it’s for work (e.g. my firm maintains a weekly newsletter and I share them on my LinkedIn and Twitter feeds)."}, {"type": "sentence", "content": "2) No television unless with company:"}, {"type": "sentence", "content": "Admittedly, I’m not a huge tv watcher. However, my partner and I do enjoy watching an episode of a show during the evenings that she’s not at work (she’s a critical care nurse and works night shifts). Because we do other activities together like play board games and go for evening walks with our dog, the hour that we spend passively watching a light-hearted show doesn’t concern me. (Plus, it’s great to watch the occasional trashy tv show with wine and popcorn!)"}, {"type": "sentence", "content": "3) No podcasts:"}, {"type": "sentence", "content": "The toughest rule of them all. However, while I owe a lot to podcasts, listening to too many can crowd out your own thoughts and opinions. I appreciate insights from world-class intellectuals and entrepreneurs, but I still need to roll up my sleeves and learn from my own experiences. Instead of listening to others, this month I’m focusing on listening to myself."}, {"type": "sentence", "content": "4) Intermittent E-mail Checks:"}, {"type": "sentence", "content": "As a lawyer, e-mail is the primary source of communication with clients, opposing parties, process servers, and — now due to the coronavirus — even courthouses. However, it’s important that e-mail doesn’t takeaway from the deep work required to effectively litigate complex civil actions."}, {"type": "sentence", "content": "Over the next thirty days, I’m committing to checking e-mail no more than three times throughout the work day: 9:00 AM, 12:00 PM, 4:30 PM. Also maintaining a sense of realism into this challenge, I’ll also allow myself to check e-mail once during the weekend (Sunday morning or afternoon)."}, {"type": "sentence", "content": "5) Default to Analog:"}, {"type": "sentence", "content": "If there is both a digital and analog tool for a particular task or action, the default will be the analog tool. That means no digital to-do apps, calendars, or spreadsheets. All my tasks, meetings, and notes will be recorded with pen and paper. The only exception are books that I read on Kobo and Kindle."}, {"type": "subtitle", "content": "Assistance"}, {"type": "sentence", "content": "A ‘Dumb’ Phone:"}, {"type": "sentence", "content": "To reduce temptation, I’ve taken the step to uninstall all the non-essential apps on my phone —even banking apps. What remains is the ability to make phone calls, send/receive text messages, listen to music, take pictures, and obtain directions through a navigation app."}, {"type": "sentence", "content": "The Freedom App:"}, {"type": "sentence", "content": "The irony of using a digital application to combat digital distractions is not lost on me. This morning I purchased a subscription to Freedom, and I’m kicking myself for not having done it sooner. Just knowing that I’m unable to go through the rolodex of distracting websites that I’ve long used to pacify myself has provided with a newfound sense of clear-headedness."}, {"type": "sentence", "content": "So far, I’ve created a recurring session during the work week that blocks all distracting websites (some that I’ve specifically included and others that Freedom characterizes as distracting) between 10:00 AM — 7:00 PM. I still haven’t figured out what restrictions I should implement during the weekend but since I’ll be off social media and have hard boundaries around media consumption, I’m not overly concerned."}, {"type": "sentence", "content": "Books:"}, {"type": "sentence", "content": "For the past little while I’ve engaged in lighter reading, unable to tackle some of the denser books that require patience, persistence, and a heck of a lot of concentration. This analog challenge is the perfect time to finally tackle those lengthy must-reads."}, {"type": "sentence", "content": "For example, I recently started Ron Chernow’s Grant and I’m excited to have the cognitive bandwidth to fully immerse myself in this rich scholarship."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*ZxNgdtjo7UKtacbjt0CXeA.jpeg"}, {"type": "sentence", "content": "Let me be clear: my goal is not simply to read more books but read harder books better. Over the next thirty days, I plan to incorporate a book log into my Bullet Journal and see whether that will help me retain more information from what I read."}, {"type": "subtitle", "content": "Concluding Thoughts:"}, {"type": "sentence", "content": "It’s clear that challenges lie ahead. But undoing my increasing reliance on digital technology is crucial if I’m going to achieve the personal and professional ambitions I’ve set for myself."}, {"type": "sentence", "content": "I know what you’re thinking: is this not Cal Newport’s Digital Detox Challenge? Yes and no. For me, social media is not so much a problem as digital technology and the toxic message of productivity gurus that in order to work effectively one must have the fanciest to-do apps. I want to discover a path to craftsmanship built with pen and paper rather than software."}, {"type": "sentence", "content": "It’s about rejuvenating my sense of curiosity, nourishing independent thought, and forsaking efficiency for deep, satisfying work."}, {"type": "sentence", "content": "To quote the title of this publication: It’s simple but not easy. Wish me luck."}], "topic": "productivity"}