{"title": "The Nike 'Space Hippie' Collection was produced for the concept of human life on Mars!", "data": [{"type": "image", "content": "https://miro.medium.com/max/2560/1*PDEyDqlx1UBxb87FA7yvFw.jpeg"}, {"type": "sentence", "content": "With the world gradually heading towards a circular economy, Nike have managed to produce an ingenious concept for their latest collection of sneakers. The range goes by the name ‘Space Hippie’ and were designed with the idea of the human race living on Mars and being unable to source the required materials to produce sneakers from scratch so each part must be recycled making these sneakers extremely sustainable and potentially a future classic in the sneaker-head world!"}, {"type": "sentence", "content": "With the concept in mind of Mars living, these sneakers needed to be produced with a circular economy in mind. The ‘Space Hippie’ collection is produced using, in the words of Nike, ‘Space Junk’ which is their term for materials that can be found on the factory floor, recycled and re-invented into an entirely new product."}, {"type": "sentence", "content": "Producing the Space Hippie range has inspired Nike to take a much more in depth look at the way in which they design their products, they realise that a company such as themselves are large enough to not only dramatically reduce the amount of carbon used in producing their products but also lead the path for others to make change. Since producing the ‘Space Hippie’ collection they have announced a campaign called ‘Move to Zero’ which focuses on climate change and they can shape the sport industry to think in a more sustainable manner."}, {"type": "sentence", "content": "The knitted uppers of the sneakers are produced from ‘Space Waste Yarn’ which is produced from one-hundred percent recycled material, such as plastic bottles, t-shirts and yarn scraps. The cushioning for the shoe is produced using reprocessed ‘ZoomX’ foam and uses about half the Carbon that a normal standard Nike sneaker would take to produce, it is combined with factory scraps from the ‘Vaporfly’ to give extra comfort. The bottom part of the sneaker is made from a blend of standard Nike foams found throughout their range and about 15% Nike Grind Rubber. When you combine all of these parts you produce something that not only is aesthetically pleasing on the eye but has a much deeper meaning."}, {"type": "sentence", "content": "The combination of textured knit, random patterned soles and a cross between minimal and colourful creates a very charming product. The Nike Grind granules within the sole create a highly individual texture and colour mix which makes the ‘Space Hippie’ range really look like something from the future and personally I hope the future heads in a similar direction."}, {"type": "sentence", "content": "The Nike ‘Space Hippie’ collection sets new benchmarks for recycled design, if all sneaker companies could follow suit in the use of materials over your usual fabrics such as Leather, Suede or Wool then we would have less carbon released during production and a smaller amount of animal products on the market. As Nike’s competitors battle it out on who can produce the best looking, most sustainable sneakers we are ending up with some incredible works of art for all to enjoy."}, {"type": "sentence", "content": "Thank you for taking the time out to read this article, I hope it inspired you and motivates you to consider a deeper meaning within your design process. See you again soon for the next one!"}, {"type": "sentence", "content": "Did you enjoy this article?"}, {"type": "sentence", "content": "How could the design of these sneakers be improved upon?"}, {"type": "sentence", "content": "What would you like to see done differently in future ranges?"}], "topic": "design"}