{"title": "The most common scaling mistake leaders accidentally make", "data": [{"type": "image", "content": "https://miro.medium.com/max/10734/1*HXzQ9TSaa3hR19ZQ7E8ffw.jpeg"}, {"type": "sentence", "content": "Leaders at scaling startups make plenty of mistakes. This is expected. Some are easier to spot than others. Here’s one that’s tricky to see before but easy to see in hindsight."}, {"type": "sentence", "content": "When it comes to scaling mistakes, business strategy gets lots of attention. It’s an important one for sure — especially finding the sometimes elusive product market fit. Without a solid business strategy the company simply can’t survive. Unless you’ve found an unlimited pot of investment, your runway eventually runs out if you don’t execute business strategy well. Making sure the business is viable in the market is critical. It’s just half the equation. If we stop there, narrowing focusing on one side, it means we ignore a key partner of business strategy: organizational strategy."}, {"type": "sentence", "content": "I’m not going to argue that organizational strategy should come before business strategy. That would be sheer folly. Not to mention wrong — business strategy comes first with organizational strategy following. This is how it should be. Where business strategy tends to focus outward, organization strategy looks inward, tending to the internal garden of the company. When considered together, they form a whole.The problem is internal strategy lags too far behind. The lag is fine for a while but the cracks will begin to show, shaking the foundation of the company if left unattended for too long."}, {"type": "sentence", "content": "The consequences come slowly and then all at once."}, {"type": "sentence", "content": "The organization atrophies or becomes besieged with conflict: warring fifedoms emerge, decision making becomes a battleground, substantive progress halted. Organizing your people and processes should never be ignored. Scaling a startup is tricky business so there’s a long list of organizational mistakes one can make. There’s one I see over and over again."}, {"type": "sentence", "content": "Waiting too long to hire folks with experience in People processes and organizational strategy."}, {"type": "sentence", "content": "Scaling startups are dynamic, living creatures; change the only constant in this environment. A key person leaves the company. Teams get rearranged. Sales is suddenly introduced to a team that’s been product focused. All this change rearranges the molecules but our relentless focus on the business means we don’t notice until we feel a searing pain in our interactions that never seems to go away."}, {"type": "sentence", "content": "Focusing on the business side is easy to do as you just try to get the darn company into momentum, to get to viability. It’s still one of the biggest mistakes leaders can make. The consequences of this mistake sadly are often felt too late. The impact of this mis-step is so well-stated by Anil Dash, CEO of Glitch in his yearly update."}, {"type": "sentence", "content": "“Under-investing in HR and people infrastructure while a startup goes through a big period of growth is one of the most common, and egregious, mistakes.”"}, {"type": "sentence", "content": "The inside of a business can often feel messy and elusive. How do you create a culture that feeds both the company and the people in it? How do you give people autonomy while making sure the business finds product market fit? The answers to these questions can be complicated so it’s easy to step over it as we relentlessly focus on viability. We figure we’ll get to it later, when things calm down. Except things never really calm down in scaling startup, do they?"}, {"type": "sentence", "content": "The other reason we don’t hire soon or experienced enough in this area is that we’ve come to associate HR with practical tasks like payroll, benefits and legal compliance. All of this seem pretty straight forward, and don’t seem to require specific expertise. There’s also a belief that HR folks only focus on protecting the company from legal liability. Some are that way, but the best People professionals spend far more of their time focused on creating an environment and systems that help the people and company to grow rather than on legal compliance."}, {"type": "sentence", "content": "When it comes to the people side of the business, hire much earlier and more experienced."}, {"type": "sentence", "content": "While someone new to the field can learn how to administer benefits and payroll, they don’t have the skills or expertise to lead the strategy around things like creating culture, career development, conflict resolution, and leadership development."}, {"type": "sentence", "content": "Unless this deficit is addressed, the company will struggle to carry out important parts of its vision like supporting remote work, reducing organizational friction, moving away from traditional hierarchical structures to flatter ones, and salary transparency among other innovative org strategies. Unless the CEO or COO has significant People experience and have time to guide them, hiring someone with zero or little HR experience is unfair to them and your team. This is one area where leaders commonly under-invest and the consequences can sneak up on them."}, {"type": "sentence", "content": "If you invest in them, folks who tend to the internal organization can become real multipliers for your business."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*8upE_qpa-WkCkvc_ECGmbQ.jpeg"}, {"type": "sentence", "content": "These folks focus on the people side of your company. This focus doesn’t mean it’s all soft skills. This work involves both strategy and tactics. A person new to the field can get up to speed on the tactics pretty quickly but organizational strategy from a People perspective requires experience, skills and expertise. The organizational side of the business can either be a hindrance or an incredible multiplier when a company really begins to grow."}, {"type": "sentence", "content": "For instance, an experienced People professional can help you develop a hiring strategy and system that reflects the culture, the company values and allows you to scale. Many startups do well with hiring in the beginning when the team can fit around a couple of tables but struggle when they reach 30 or more. The informal systems they relied on stop working slowing down hiring or resulting in mis-hires. Your experienced HR person can create a solid recruiting system that helps the team codify what’s most important, streamlines the hiring process, reduces bias in hiring and decrease new hire churn to nearly zero."}, {"type": "sentence", "content": "An experienced People Operations professional can help the business scale in other ways like supporting the development of your leaders, scaling the culture, creating career development tools and processes, conflict resolution, designing Code of Conducts and conflict policies and much more. Your People team can help you scale by taking care of the organizational side of the business so the team can focus on building the product, getting product market fit and providing excellent support to customers."}, {"type": "sentence", "content": "One of the best investments leaders can make is hiring an experienced People professional."}, {"type": "sentence", "content": "You probably don’t want to hire a former CHRO from a big company — they’ll be too expensive and will likely be more accustomed to delegating rather than doing. That said, there are plenty of experienced manager and director level folks who are competent and looking for more autonomy and an opportunity to grow like a startup can provide."}, {"type": "sentence", "content": "Many startups leaders have jeopardized the future of the company by not investing in experienced People Operations soon enough."}, {"type": "sentence", "content": "Don’t be one of them."}, {"type": "sentence", "content": "This article was based on an earlier version published at: http://www.suzanbond.com/articles/the-most-common-scaling-mistake"}], "topic": "startups"}