{"title": "How to Write a Blog on Topics You Know Nothing About", "data": [{"type": "subtitle", "content": "Is there anything more intimidating than a blank page and a deadline?"}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*CKWA6aJa-uyWIbTBC0FQKQ.jpeg"}, {"type": "sentence", "content": "Whether you’re a freelancer, writer, marketing professional, or somewhere in between, there will inevitably come a time when you are asked to write a blog on a topic you know nothing about. I’ve had to do it for a luxury scarf retailer, a clinical communication platform, a rooftop bar in Chicago, and pretty much anything else you can imagine. As a content creator, that’s just part of the job."}, {"type": "sentence", "content": "I’d be lying if I said this wasn’t an intimidating feat, especially when deadlines and other projects are involved. Being an above-average writer has its obvious benefits. But it also means that everyone will come to you when they need writing aid. And, most people assume that because you’re a good writer, you can successfully write about any topic."}, {"type": "sentence", "content": "While writing a blog on completely foreign topics can be challenging, stressful, and time-consuming, there are ways to successfully craft a compelling, authentic article with little more than a baseline understanding of a subject."}, {"type": "sentence", "content": "After years of doing exactly that, I’m going to give you the exact strategy I use to write blogs on topics I know nothing about. Let’s dive in."}, {"type": "subtitle", "content": "Where To Start?"}, {"type": "sentence", "content": "I always begin a new project by establishing all the relevant parameters. Reel in the necessary stakeholders and make sure you keep remain transparent and maintaining an open line of communication with the beneficiary of your work. It’s also a good idea to keep a running checklist handy that includes everything you may need before starting like the draft deadline, word count, revision requirements, available market research, and more."}, {"type": "sentence", "content": "This is the oft-overlooked, yet very essential part of any content strategy; building a solid foundation to work from. I always err on the side of caution by asking all relevant questions early on in the process, instead of pretending like I know what I’m doing and paying for it down the line."}, {"type": "sentence", "content": "Writing about new topics is a challenge in itself. You don’t want any additional headaches siphoning away precious time and energy before you actually dive into the writing process."}, {"type": "subtitle", "content": "Request Brand Guidelines"}, {"type": "sentence", "content": "Depending on what your deliverable is, this could vary project to project. If you’re writing an internal blog, you should already have access to the company’s mission statement, core pillars, typography/design lookbook, and language preferences. If you are freelancing or doing client work, I recommend getting your hands on any sort of brand guidelines available."}, {"type": "sentence", "content": "Every company utilizes a slightly different style and tone. Understanding their brand guidelines will allow you to keep messaging consistent. Think of Dollar shave Club and Self Magazine which try to be humorous and relatable or HubSpot which offers very niche-specific content in listicle formats."}, {"type": "sentence", "content": "If you can at least maintain the company or individual's voice that you are writing for, then the blog will be somewhat successful. Honestly, that’s often half the battle."}, {"type": "subtitle", "content": "Perform A Light Competitive Analysis"}, {"type": "sentence", "content": "According to HubSpot, “A competitive analysis is a strategy where you identify major competitors and research their products, sales, and marketing strategies. By doing this, you can create solid business strategies that improve upon your competitors.”"}, {"type": "sentence", "content": "Normally, competitive analysis is used to find content gaps that you can take advantage of. In this scenario, we’re going to use it for our research. You’re basically looking for the top “competitors” on the topic you need to learn more about. Let’s say I am asked to write about something random like Mechanical Engineers. Through a quick Google search, I found that a central hub for content can be found on the American Society of Mechanical Engineers website. From there, I will have quick access to their resources, social media pages, and tons of relevant content. In less than 30 minutes, I could gather enough information to get started. Just make sure that all sources used are credible and high-authority."}, {"type": "sentence", "content": "Now, I emphasize doing a light competitive analysis for two reasons:"}, {"type": "sentence", "content": "Again, you don’t need to be an expert. Knowing how to write to the audience you’re targeting and obtaining a few key resources already gets you over a third of the way there."}, {"type": "subtitle", "content": "Dive Deep On Social"}, {"type": "sentence", "content": "This step is pretty straightforward."}, {"type": "sentence", "content": "You want to know what other people are saying online about your topic. If it’s relevant, I find that customer reviews give me a lot of ideas because they’re raw and emotional. A person felt so passionately about a product or service that they had to leave a review."}, {"type": "sentence", "content": "I recently had to write a blog for an educational software company, of which I had never heard of. Going through social media and seeing what real consumers had to say about the company put me in the right headspace to understand how they are perceived. Without having any knowledge of the topic, I could still conjure up a solid article evoking the same emotion that their audience experienced."}, {"type": "subtitle", "content": "Make A Personal Connection"}, {"type": "sentence", "content": "I’d say this is optional, but it has really helped me write blogs when motivation levels are low and interest is waning. If the topic is really out there, I try and find common ground to add personal equity into my writing."}, {"type": "sentence", "content": "When I had to write a 500-word blog post for an exterminator on Fiverr, I initially struggled to conceptualize ideas that would make the content really pop. Why in the world when anyone cares to read an exterminators blog?"}, {"type": "sentence", "content": "Artistic language simply didn’t fit the vibe of the website, therefore leaving my draft feeling flat and uninvolved. So, I really thought about what it’s like to have a pest problem in your home. I remembered a time when my neighbor had to sleep at a hotel for four days because her house was taken over by an exterminator. And that way of thinking sparked a new direction that I had previously been missing. One that really captured the urgent emotional resonance of a consumer in need of an exterminator, and how this specific brand would step in as the “savior”."}, {"type": "sentence", "content": "Writing about new topics can be a stressful experience if you have no skin in the game. It doesn’t hurt to try and find some sort of common ground to build from."}, {"type": "subtitle", "content": "Start Writing In the Middle"}, {"type": "sentence", "content": "Here’s my theory: If I can write one engaging line in the middle of a blog, then I have enough content to keep going and successfully pull it off."}, {"type": "sentence", "content": "The middle is where writers tend to get stuck and readers tend to lost interest. Sometimes you can almost feel the content running out of steam because the writer used all of their colorful vocabularies in the introduction as a hook. I want a skimming reader to get caught up in the middle and then decide to hunker down until the end."}, {"type": "sentence", "content": "This will also let you know whether or not you have enough substance to write the entire article. If writing a sentence in the middle is incredibly difficult or intimidating, it may be best to do a little more research."}, {"type": "subtitle", "content": "Block Out 20 “Hard Minutes”"}, {"type": "sentence", "content": "Once the middle sentence has been written, I set a timer for twenty minutes, put my phone off to the side, and free-write as much as possible."}, {"type": "sentence", "content": "When writing on topics you are still vaguely familiar with, it can be difficult to actually start writing. I like utilizing this exercise because it pushes you out of your comfort zone and actually begins to formulate the blog. Don’t do any editing or grammar checks- just write and see what happens."}, {"type": "sentence", "content": "One of the primary habits that prevent most people from working quickly is the tendency to edit while writing. There’s no reason to agonize over one word that will keep you in a perpetual “almost finished” mode. Allow yourself to complete B- work just to get the ideas down, and then go back and edit later."}, {"type": "sentence", "content": "Twenty minutes may sound like a breeze, but it can be mentally draining and difficult for novice writers. We all feel those urges to grab our phones or click on a different tab. But the only way this works is if you practice self-discipline and focus for the entire twenty minutes."}, {"type": "subtitle", "content": "Massage The Details"}, {"type": "sentence", "content": "Now is where you take the jumbled mess of words, thoughts, and ideas, and turn them into a brilliant piece of content. I usually keep all of my research notes at the bottom of the page and I like to go through them to make sure I’m not missing any important points. I will also mark any places that need additional research and delete portions that don’t fit with the overall story."}, {"type": "sentence", "content": "You can start to utilize writing tools like Grammarly to eliminate repetitive words and help the blog take shape."}, {"type": "subtitle", "content": "Print A Copy And Read It Out Loud"}, {"type": "sentence", "content": "Writing about subjects you know little or nothing about is certainly more difficult than writing about the things you enjoy. But it’s an incredible way to build your creative muscle and get exposure to new ideas and connections."}, {"type": "sentence", "content": "After the first draft has been written, I print a copy."}, {"type": "sentence", "content": "I can’t tell you how many mistakes I have found by simply reading my writing out loud from a physical sheet of paper. There’s something unique about switching from a screen to a piece of paper, almost like your brain is relieved for the change of scenery. Yes, modern technology makes grammar editing and flowery language easier than ever. But I still haven’t found anything that beats this grammar school strategy."}, {"type": "sentence", "content": "And if you can read it in front of someone else that’s even better. It will verify that the blog is easy to understand and that all of your points actually make sense. I know that I have certain tendencies that I use for my own audience. But when writing for my agency or freelancing, I have to try and avoid this and write for their audience."}, {"type": "subtitle", "content": "Get Feedback And Double-Check Your Facts"}, {"type": "sentence", "content": "The final step is to get a second set of eyes on the blog if possible and double (or even triple) check all of your facts. Unfortunately, you’re still not a subject-matter expert. If you can get someone to read it with a little more experience in the topic then that’s great. If not, at least go through every claim made with a fine-toothed comb and make sure everything is factually accurate."}, {"type": "sentence", "content": "Being confident in your writing abilities and vulnerable enough to ask for a second opinion will ensure that you took all the necessary steps before delivering the final copy."}, {"type": "subtitle", "content": "Hit Send"}, {"type": "sentence", "content": "There you have it."}, {"type": "sentence", "content": "Hopefully, these steps encourage you to take on new challenges in the wonderful world of content creation. Writing blogs about unfamiliar topics isn’t going to be easy, but it’s an excellent way to learn, connect, and ultimately improve."}, {"type": "sentence", "content": "Remember, just because you aren’t an expert doesn’t mean you can’t play the role of one."}], "topic": "freelancing"}