{"title": "Did Cosmic Rays Shape Life Forever?", "data": [{"type": "sentence", "content": "“The Chiral Puzzle of Life” could be explained through cosmic rays, answering one of the most important questions in chemistry and biology."}, {"type": "sentence", "content": "Long before animals roamed the Earth, before the first bacteria, and even before the development of DNA, tiny molecules found they could make simple copies of themselves."}, {"type": "sentence", "content": "Cosmic rays pouring down from space constantly bombarded those molecules as they replicated, and developed over time. These particles, raining down from distant stars and galaxies, could have played a significant role in the what would become the chemistry of life."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*EJ04-w4wdMLPaVzd9DesSg.gif"}, {"type": "sentence", "content": "Mirror, Mirror, on the Wall…"}, {"type": "sentence", "content": "Molecules can take on various shapes as they form during reactions. Some of these molecules can be mirror images of molecules having the same number and types of molecules, but bound together in different shapes."}, {"type": "sentence", "content": "Some of these shapes can be mirror images of each other, similar to the way hands are opposite images of each other. They line up if faced palm-to-palm or back-to-back, but they cannot be placed evenly upon one another with both hands up or down."}, {"type": "sentence", "content": "When chemicals take on similar mirror shapes, they are known as chiral molecules. This chirality of molecules is sometimes known as handedness, due to its relation to human hands. This property of chiral molecules can have significant effects on reactions within living structures."}, {"type": "image", "content": "https://miro.medium.com/max/1530/1*P2kKAmQVF1SEf_G4njTFWQ.jpeg"}, {"type": "sentence", "content": "Inorganic reactions are oblivious to the handedness of chemicals. However, reactions involving every single important biomolecule — DNA, RNA, and amino acids — life uses just one form of molecules. Attempting to use the mirror twin can often result in unexpected — often tragic — results. A single wrong-handed molecule in DNA can destroy its spiral structure."}, {"type": "sentence", "content": "“The ribonucleic and deoxyribonucleic acids (RNA and DNA), responsible for the replication and storage of genetic information, are made up of linear sequences of building blocks with the same handedness, called nucleotides, whose arrangement is neither periodic nor random and contains the genetic information needed to sustain life,” researchers explain in an article detailing their findings, published in The Astrophysical Journal Letters."}, {"type": "sentence", "content": "You Can Call Me Ray"}, {"type": "sentence", "content": "The chiral nature of some chemicals was first discovered in 1848, by famed chemist Louis Pasteur. This led to wild speculations, attempting to understand why biological reactions are so uniquely fussy about the handedness of chemicals. Pasteur’s early guess, more than a century-and-a-half ago, was that a basic, underlying asymmetry in nature was responsible for differences in left- and right-handed molecules in biological systems."}, {"type": "sentence", "content": "This new study suggests the biased way nature handles chemicals for life may be the result of cosmic rays coming from space long ago."}, {"type": "sentence", "content": "“We propose that the biological handedness we witness now on Earth is due to evolution amidst magnetically polarized radiation, where a tiny difference in the mutation rate may have promoted the evolution of DNA-based life, rather than its mirror image,” said Noémie Globus of the Kavli Institute for Particle Astrophysics and Cosmology (KIPAC)."}, {"type": "sentence", "content": "Cosmic rays are high-energy radiation, created by energetic processes around the Cosmos, bombarding Earth from all directions at enormous speeds."}, {"type": "sentence", "content": "“About 90 percent of them are protons, with the remainder consisting of electrons and atomic nuclei. In their journey across the galaxy, the electrically charged particles are deflected by magnetic fields. This scrambles their paths and makes it impossible to trace their origins directly,” NASA describes."}, {"type": "sentence", "content": "This energy strikes the atmosphere of Earth, where it breaks apart into fundamental sub-atomic particles. By the time they reach the ground, most of this energy is in the form of muons, a type of particle unlike normal matter."}, {"type": "image", "content": "https://miro.medium.com/max/950/1*Kfd-ZpW1O7-pIfSN5IMccg.jpeg"}, {"type": "sentence", "content": "Muons are exceptionally unstable, existing for just two millionths of a second. However, they travel close to the speed of light, meaning they can cover plenty of distance during that time — being detected as deep as 700 meters (2,300 feet) underground."}, {"type": "sentence", "content": "These particles are also magnetically polarized — meaning they all share the same magnetic polarization. When they decay, these particles release an electron (the familiar negatively-charged particle found in the outer clouds of atoms). These electrons created each share the same magnetic polarization."}, {"type": "sentence", "content": "Researchers believe these polarized muons, able to penetrate nearly any barrier, combined with the similarly-polarized electrons, may have worked to together, influencing chiral reactions as life first began to form on Earth."}, {"type": "image", "content": "https://miro.medium.com/max/2880/1*KXKDfJ6zlwYE4dez3sRrTg.jpeg"}, {"type": "sentence", "content": "Over time, the constant bombardment by polarized muons and electrons would have preferentially affected each type of molecule, altering mutation rates between left- and right-handed protobiological molecules."}, {"type": "sentence", "content": "Just a small advantage of one state over the other would, over time, result in a long-term advantage, similar to a house edge in gambling casinos. Right-handed molecules eventually won the struggle, becoming the basis of all biology."}, {"type": "sentence", "content": "Such effects may also apply to worlds beyond the Earth, as well, researchers speculate. Conditions like these likely extend far into the Cosmos."}, {"type": "sentence", "content": "“We are irradiated all the time by cosmic rays. Their effects are small but constant in every place on the planet where life could evolve, and the magnetic polarization of the muons and electrons is always the same. And even on other planets, cosmic rays would have the same effects,” Globus explained."}, {"type": "sentence", "content": "Bacteria could be at the center of new studies examining how the microbes react to bombardment by radiation over a range of magnetic polarizations. Samples taken from comets and asteroids could also be examined, looking for a chiral bias in their internal structures."}, {"type": "sentence", "content": "By studying how cosmic rays affected chemistry during the dawn of life, we may learn more about life on worlds surrounding distant stars."}, {"type": "sentence", "content": "James Maynard is the founder and publisher of The Cosmic Companion. He is a New England native turned desert rat in Tucson, where he lives with his lovely wife, Nicole, and Max the Cat."}, {"type": "sentence", "content": "Did you like this article? Join us on The Cosmic Companion Network for our podcast, weekly video series, informative newsletter, news briefings on Amazon Alexa and more!"}], "topic": "science"}