{"title": "The Coronavirus Vaccine May Not Work on the Elderly", "data": [{"type": "subtitle", "content": "For those over 65, the pandemic is unlikely to end when the first vaccines arrive"}, {"type": "image", "content": "https://miro.medium.com/max/4242/1*wpjJKRB1oqZz1kuxrLwoLw.jpeg"}, {"type": "sentence", "content": "Last Friday, President Trump stood in the White House Rose Garden and announced “Operation Warp Speed,” a plan to deliver a vaccine for the coronavirus by the end of the year. At the president’s side was Moncef Slaoui, who had recently stepped down from the board of Moderna, the first U.S. company to test its vaccine on humans, in order to lead the effort."}, {"type": "sentence", "content": "“Mr. President, I have very recently seen early data from a clinical trial with a coronavirus vaccine,” said Slaoui. “These data make me feel even more confident that we will be able to deliver a few hundred million doses of vaccine by the end of 2020.” Then, early this week, Moderna unveiled early positive results from its safety trials, along with plans to take the Massachusetts-based company public."}, {"type": "sentence", "content": "Operation Warp Speed’s promise feeds into our hopes of finding immunity. But whether a vaccine arrives in six months or 12 months, it will come with an enormous caveat that scientists have been warning of for months, and our leaders have all but ignored: The first successful vaccine against the coronavirus may well fail the people who need it most — 50 million people over 65."}, {"type": "sentence", "content": "Vaccines, including Moderna’s, are generally designed to get out of the gate with the young and healthy in mind and only later are dialed-in for more vulnerable groups. The ambitious vaccine rollout timetable touted by the president likely represents the starting line, not the finish line, when it comes to the immunity of older adults."}, {"type": "sentence", "content": "“I don’t think life is ever going to be going back to the way it was,” says Janet McElhaney, a medical doctor and vaccine expert at Health Sciences North in Ontario, Canada, who is now herself in her midsixties. As we age, our bodies lose the ability to respond to new threats and to recognize ones we’ve previously been exposed to, which means that older adults don’t develop a vigorous defense following vaccinations."}, {"type": "sentence", "content": "Take, for instance, the influenza vaccine: For those in their forties and fifties, flu vaccines are between 30% and 60% effective. For people over 65, however, effectiveness frequently drops down into the teens. An essay published last month in the New England Journal of Medicine argued that “the pandemic response remains hamstrung by our limited understanding of how to generate effective immunity, particularly in the elderly.”"}, {"type": "sentence", "content": "Advances in modern genomics and molecular biology have allowed us to create safer, more targeted vaccines than we had in the past, but they have also created a wider gulf in the immunity achieved by the young and the old. Our earliest vaccines against polio and tuberculosis were made with a live, weakened virus. A whole virus presents a plethora of targets, or antigens, to the immune system, which is why it generates the strongest, most durable response. Some efforts for the coronavirus vaccine in China and India are indeed testing this method."}, {"type": "sentence", "content": "But a violent immune response can itself damage the body, as occurred with the mass rollout of the 1976 swine flu vaccine, which has been linked to 450 cases of the paralyzing autoimmune disorder known as Guillain-Barré syndrome. “You want the immunogen without all the inflammation,” says Margaret Liu, chairman of the board of the International Society of Vaccines."}, {"type": "sentence", "content": "Modern vaccines no longer rely on live, weakened virus particles. Researchers can now identify one or more pieces of virus protein that they believe will make a good target for the immune system and then deliver them to the body using a variety of clever methods. The technique Moderna and other companies are testing involves injecting just the genetic instructions — messenger RNA in Moderna’s case — for the coronavirus’s distinctive spike protein."}, {"type": "sentence", "content": "The downside of the more advanced methods is that they don’t offer as wide a variety of antigens to rile up our immune system, which becomes a problem for people whose immune systems are less vigorous. Moderna’s method, in particular, has never been approved in humans, let alone in older adults. “There is zero published data about the mRNA vaccine’s ability to work in older people,” says Norbert Pardi, an mRNA vaccine expert at the University of Pennsylvania, Philadelphia. “That’s a gigantic question mark.”"}, {"type": "sentence", "content": "Tailoring a vaccine to those over 65 depends on recognizing why they are so susceptible to the disease, which, in the United States, has killed more than half its victims in nursing homes. Just as the skin starts to wrinkle and sag with age, the body also starts to lose its physical mechanisms for clearing foreign particles from lungs and airways. This puts a higher burden on the immune system, especially its ability to produce antibodies that glom onto viruses and neutralize them before they penetrate cells and turn them into virus factories. The partial results Moderna released this week highlighted the fact that eight of the 45 subjects — all under the age of 55 — produced neutralizing antibodies against the coronavirus. Older people, however, generally don’t produce as many neutralizing antibodies in response to vaccination. One strategy to compensate for this is to give them more antigen. A flu vaccine for older adults, for instance, contains four times the dose as a typical shot."}, {"type": "sentence", "content": "There’s a second hurdle that a vaccine for those over 65 will have to clear. Although the ability to induce neutralizing antibodies is one of the main metrics that scientists and the U.S. Food and Drug Administration look at in judging a vaccine candidate’s prospects, eliminating an infection from the lungs will require recruiting a second branch of the immune system that involves killer T-cells, a special type of white blood cell that can destroy infected cells and halt virus replication."}, {"type": "sentence", "content": "Unfortunately, modern vaccines aren’t as good at stimulating this arm of our immune system, which is why vaccine additives known as adjuvants become key. The Shingrix vaccine against shingles, approved in 2017, was a rare win that proved to be nearly 90% effective among people aged 70 or older, thanks to a novel adjuvant isolated from the Chilean soapbark tree that ramps up T-cell immunity. “For older people, you need both arms of the immune system working to prevent serious complications,” McElhaney says."}, {"type": "sentence", "content": "Adjuvants are the black magic of vaccine development. Their immune-boosting effects help a vaccine work, but they can also, in rare cases, cause dangerous reactions, which is why manufacturers tend to be conservative with them. According to the Milken Institute, more than 140 potential vaccines for the coronavirus are in development around the world, and many will likely resort to aluminum-based adjuvants, old standbys that have been around since the 1920s. These adjuvants increase the amount of time an antigen is present in the body, buying more time to produce an immune response. Moderna’s adjuvant is a lipid nanoparticle that encapsulates the short-lived mRNA, keeping it from degrading too quickly."}, {"type": "sentence", "content": "Ofer Levy, director of the Precision Vaccines Program at Boston Children’s Hospital, believes we need to work harder to identify the optimal adjuvants for a Covid-19 vaccine before a raft of clinical trials launch this summer and fall. Doing so is traditionally complicated: Historically, most adjuvants are tested in rodent cells, which don’t necessarily reflect what happens in a typical human cell. And when a vaccine fails to be effective in clinical trials, it’s often hard to surmise whether the antigen or the adjuvant led to the downfall. Levy’s group, however, has the ability to test hundreds of thousands of vaccine-adjuvant combinations using fresh blood cells from people of all ages, including newborns and older adults. “We do things completely different from everybody else,” he says."}, {"type": "sentence", "content": "The idea is to identify adjuvants that will produce the strongest, broadest, and most long-lasting response with the smallest amount of antigen — in all age groups. Levy’s group is working in partnership with several biotechnology companies, including Exicure in Skokie, Illinois, and Avidea Technologies in Baltimore, to help develop vaccine formulations that will be safe and effective in all age categories. He is also in talks with Moderna, which has abandoned the highest dose it tested in people after it produced systemic immune reactions, such as fevers. The company may need to explore adjuvant strategies to produce the most robust response in older adults with lower dosages. Moderna did not respond to requests for comment, but it has plans to test its vaccine in people up to age 70. Prior to the recent results, Moderna’s chief medical officer brushed off concerns that it will be less effective for those over 65."}, {"type": "sentence", "content": "The harried timeline of Operation Warp Speed means there will be limited information about how long immunity from a vaccine lasts and whether it is safe for seniors in the long term. Vaccinating 300 million Americans with Moderna’s vaccine could cost tens of billions of dollars — a huge gamble for the country and a sizable payday for the company. “If it turns out the vaccine protects you for two months, that’s not ideal,” says University of Pennsylvania’s Pardi."}, {"type": "sentence", "content": "In the absence of a highly effective vaccine, the quality of life for older adults will largely depend on the successful development of Covid-19 drugs that directly attack the virus. Earlier this month, the FDA issued an emergency authorization for Gilead’s experimental drug remdesivir, which has only demonstrated a modest effect in helping hospitalized patients recover faster. But scientists are also testing a wide range of preexisting drugs and new compounds. A second line of defense could come from commercial monoclonal antibodies — though these are likely to cost hundreds of dollars a dose and would have to be re-upped every couple of months."}, {"type": "sentence", "content": "One vaccine-like defense on the horizon involves circumventing the frail immune systems of older adults by injecting the genetic instructions for making antibodies directly in their muscles and stimulating them to produce the antibodies. The technique was successfully tested in monkeys against the Zika virus, and two Massachusetts-based companies, Generation Bio and SmartPharm Therapeutics, are hoping to deploy it for the novel coronavirus. “We call it pop-up immunity,” says Timothy Brauns, chief operating officer of SmartPharm. “We hold the line until the reinforcements arrive.”"}, {"type": "sentence", "content": "Scientists are also exploring the possibility that some people may benefit from the live vaccines still used for certain diseases in other countries, and from exposure to infectious diseases such as malaria. “I’m not sure that there’s going to be one vaccine that is going to work with equal efficacy,” says Liu. “Some may be more effective not because of the vaccine, but because of the population.”"}, {"type": "sentence", "content": "While the first approved coronavirus vaccines may not be fine-tuned for older adults, Liu and McElhaney say they still stand to benefit. As younger people get vaccines, herd immunity will eventually take hold, shielding those over 65 better than the vaccines could."}, {"type": "sentence", "content": "For older adults, then, the pandemic will not come to an end with the bang of another White House press conference, but with the whimper of one more child getting stuck with a needle."}], "topic": "science"}