{"title": "How to be a Twitter power-listener", "data": [{"type": "sentence", "content": "Part of our jobs as developer advocates for Google Cloud is to be very well informed on all things related to our platform and help developers find the signal in all of the noise. Monitoring and engaging in social media is a big part of doing this well."}, {"type": "sentence", "content": "Like most of you, I use the Twitter app on my mobile device as well as twitter.com in my browser, but the growing number of things I needed to track quickly made these tools too onerous. I remembered seeing TweetDeck years ago before Twitter acquired them. TweetDeck has been around for a long time with an interesting history (article, wikipedia) and this weird history might have contributed to the lack of awareness of how amazing it is."}, {"type": "sentence", "content": "From the official How to use TweetDeck page:"}, {"type": "sentence", "content": "There is a standalone app for Mac OS but since the app doesn’t really offer any unique advantages, I just use the web version and leave it open in a tab."}, {"type": "sentence", "content": "https://tweetdeck.twitter.com/"}, {"type": "sentence", "content": "Below is a screenshot of my TweetDeck setup. I know, I know. It’s a LOT of stuff on the screen, but I love this level of density. I know exactly where to look to find what I need to know. It’s my Twitter cockpit."}, {"type": "sentence", "content": "You can add new columns of the following types:"}, {"type": "image", "content": "https://miro.medium.com/max/642/1*8VO_3wAZ6rps0xLwhCEIbw.png"}, {"type": "sentence", "content": "As you will see below, I mostly use the Search column type because it gives me the most flexibility in what is included in a column. Each column has additional filters and settings but I rarely have to use these."}, {"type": "sentence", "content": "To set this up properly, I had to learn how to do fairly advanced searches in Twitter, so in addition to learning about TweetDeck, you might learn a few search tricks too in this article. All of the search strings in the column descriptions below can be used in the normal Twitter app/site, so I made each of them a link to demonstrate this."}, {"type": "subtitle", "content": "My columns are setup as follows:"}, {"type": "image", "content": "https://miro.medium.com/max/548/1*wcFPDVEou3ncU_PPa-hZMQ.png"}, {"type": "sentence", "content": "TweetDeck has several useful settings. Mine are set as follows:"}, {"type": "image", "content": "https://miro.medium.com/max/1186/1*wdSQC4mP8LOF6ObTVwkWEg.png"}, {"type": "sentence", "content": "I’ve found that I’m much more efficient and effective on Twitter since implementing this. There are many commercial tools that take this to the next level with built-in tooling for responding and assigning, sentiment analysis, etc., but I find that TweetDeck is perfect for what I do."}], "topic": "social-media"}