{"title": "The Title of Data Scientist is on Sale", "data": [{"type": "subtitle", "content": "Opinion"}, {"type": "subtitle", "content": "The new “dollar tree” business in the data science industry is booming. But it is also very disappointing."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*Jg9Q-ih5Ayz8PeiAiwSQbw.jpeg"}, {"type": "subtitle", "content": "The impetuous era"}, {"type": "sentence", "content": "Someone posted this with a picture of certification on one of my social apps a few days ago. It was approximately the 10th time I saw this kind of post in the past three months. I barely know the person who wrote the post, but what I do know is he’s a sports management major, who even had problems dealing with Excel sheets."}, {"type": "sentence", "content": "It seems so easy now for people to claim themselves, data scientists, or data engineers."}, {"type": "sentence", "content": "I have to clarify myself here before I go any further. I love to see people enjoy the process of learning and share whatever they got along the way. But in the most recent time, I can literally feel that the academic atmosphere has been more impetuous than ever. People prefer to take short term courses, get some plausible certifications, and have fancy titles on their resumes rather than spend years to really get a degree, do in-depth research, and gain some meaningful experience. And it BOTHERS me."}, {"type": "subtitle", "content": "Knowledge is cheap, but the experience is not"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*mHcwZcatUxYqO1Dq"}, {"type": "sentence", "content": "In the past few years, the hottest college major has switched to Business Analytics from Computer Science. Social media talk about Business Analytics or Data Analytics all the time. And people from various industries are catching on before it gets cold."}, {"type": "sentence", "content": "Especially after the COVID-19 outbreak, people started to study and work from home. More and more businesses got involved in online learning because this market is bigger than ever. I can see the ads with the title of “learning data science within …” at least three times a day. To draw more users, those institutes tend to give a considerable discount. People can start to study python programming at as low as one dollar from what I heard."}, {"type": "sentence", "content": "I respect those who open to sharing their knowledge. But people who take the courses probably think differently, as I mentioned above. We are living in the best age in history. Every individual has unlimited access to the resources that may help us improve and grow specific knowledge. But a twenty-hour online course that costs 50 bucks cannot make anyone a data scientist."}, {"type": "sentence", "content": "Cheapening the title of data scientists is also not fair to those who spent years in the data science field for developing the foundations and propelling the industry to the next level. Image how do you feel when a person calls himself an artist when he just learned some jargon from Wikipedia. Image how do you think a person calls himself a chief chef of Italian food when he just learned how to cook spaghetti."}, {"type": "subtitle", "content": "The practice is the KING"}, {"type": "sentence", "content": "I began studying business analytics about nine months ago. Yet, the more I learn, the more I find myself ignorant. The more I do, the more precaution I will take with my work because I always know that being cocky at any moment could lead me to a wrong path without noticing."}, {"type": "sentence", "content": "I love to code. And what I learned from coding is passion does not produce anything until I put the energy into action. Moreover, repetitive practice is the king."}, {"type": "sentence", "content": "I still clearly remember that my first intermediate SQL assignment took me five hours to tackle 12 questions. I researched every line of code I wrote and tried my best to figure out the logic of them. I read numerous stack overflow posts from where clause to inner join, from case clause to pivot table, and from with clause to stacked bar charts. And I failed a hundred times before I executed the codes successfully. I spent nothing but my efforts and time to move my SQL skills to the next level."}, {"type": "sentence", "content": "I got my research assistant position this January. My first task is to calculate Boilerplate (Check out here). I was stuck on a “for loop” code for a week. I was googling and reading research papers for hours from midnight to the morning. I was still unable to solve the problem until I received some scrupulous guidance from my professor. I am not proud of myself for being so inefficient. Yet, what I learned from this task is more than what I learned from the school in months."}, {"type": "sentence", "content": "Debugging could be the most tedious work about data science. You have a great idea, but you cannot put it to work. How frustrating it is! If you have this feeling, it means you have met your bottleneck. Accept the fact that you are not good enough, and move on to do more research, read more papers, and do more exercise. There is no difference between coding and shooting a basketball. Think about how many times you missed before you made two three-points in a row."}, {"type": "sentence", "content": "I still encourage everyone to share their findings online since it is how we evolve. And I personally also took many online courses. But the knowledge is not granted. People don’t magically master anything. Want to begin a career in data science? My advice is to be patient, study from people who are better than you, analyze the mistakes you made and apply your knowledge to the real cases."}, {"type": "sentence", "content": "I probably will never be one of the greatest data scientists. But I know I am making progress every day."}], "topic": "data-science"}