{"title": "5 Tricks for Monetizing Your Art", "data": [{"type": "sentence", "content": "Whether you’re a full-time artist or just trying to turn your creative hobby into a side hustle, you’ve probably wondered how exactly you can monetize your art — and if you should do so. You hear people complain about artists who “sell out,” or perhaps you worry that your art isn’t good enough to command money."}, {"type": "sentence", "content": "Make no mistake: every artist deserves compensation for their time, labor, and creative value. Unless you’re asking $500 for stick-figure drawings, you’re probably worth more than you think."}, {"type": "sentence", "content": "The problem is that monetizing your art can be a cumbersome, soul-draining process. It requires a monumental effort just to figure out pricing — and then you have to market your work!"}, {"type": "sentence", "content": "Let’s look at some strategies for monetizing your art. We’ll talk about how to set your prices, some sites to check out, and most importantly, how to get in the right mindset to sell your work."}, {"type": "subtitle", "content": "5. Change your mindset to a professional one"}, {"type": "sentence", "content": "I see way too many artists who charge low prices for their art because “it doesn’t take me that long” or “I’m just doing it for fun.” Both those reasons are silly."}, {"type": "sentence", "content": "If it doesn’t take you long, you should be rewarded, not punished, for your creative productivity. People who think this way often have hourly jobs, so they figure they should charge what they make per hour. First of all, you’re probably being underpaid for your hourly-wage job, so don’t base it on that. Second, art isn’t just the product of labor. It carries artistic value, which is arguably priceless. The value of your work is more than the measurable time you put into it."}, {"type": "sentence", "content": "And if you’re just doing it for fun and charging less because of it, you’re dragging down the market rate for professional artists. You’re contributing to the confidence of choosing beggars that they can get awesome art for dirt cheap — or refuse to pay the going rate for creative work. Besides, why on Earth would you want to make less money just because you’re having fun? I personally love making money from my writing because I love writing. I’m not going to charge less because I love it. If anything, I’m going to charge more."}, {"type": "subtitle", "content": "4. Base your prices on what you want to earn"}, {"type": "sentence", "content": "A better approach is to figure out what you’d like to earn from your art. You need to earn back the cost of materials, and you also need to cover your labor costs. Add those costs up for each artwork. That’s your base price. Then, slap a profit margin on it — perhaps 20 or 30 percent. There’s absolutely no shame in making a profit off your work. You’re not a charity."}, {"type": "sentence", "content": "If you offer a creative service, think about what you need to earn. Plenty of people will pay peanuts for copywriting or graphic design — and their expectations will be super low. If you think you suck, by all means, sell your services for pennies. But you probably don’t think you suck, so don’t undervalue yourself. Remember, self-employment comes with its own costs, so set your rate at a level that can cover the basic expenses of doing business. Then, tack that profit margin on so that you actually have money to spend, save, and invest."}, {"type": "subtitle", "content": "3. Know your market"}, {"type": "sentence", "content": "I’ve been that artist who churned out dozens of artworks that no one wanted. It’s a sad-but-true fact: some of your favorite work won’t sell. That doesn’t mean that you don’t have art worth selling. However, you should think about products you can offer that serve a market need. There’s no shame in creating “pop art” to diversify your income streams."}, {"type": "sentence", "content": "Just as with any business, you need to figure out who your target customers are, then create art they will like. It may change by platform as well. For example, you might be able to sell your fine art in galleries or at art festivals, but if you want to sell it on a digital print shop such as Redbubble, you probably need to create some designs with mass appeal."}, {"type": "subtitle", "content": "2. Choose the right venue"}, {"type": "sentence", "content": "There are oodles of content publishing platforms, digital print shops, and online marketplaces. This can be overwhelming for artists who aren’t sure how to sell their art. First, it’s important to focus your sight on one or two platforms. While it may seem logical to set up accounts on every platform possible so that you can earn the most money, don’t forget that you need to effectively market on and promote each channel. And many of these channels have a social aspect, which means you need to connect with others in order to promote your content."}, {"type": "sentence", "content": "Here’s a quick and dirty list of ways to monetize your art online:"}, {"type": "sentence", "content": "Clearly, there are a lot of options. Choose one to three platforms to start monetizing your content."}, {"type": "subtitle", "content": "1. Build up your fanbase"}, {"type": "sentence", "content": "I recommend choosing platforms that require a lot of social interaction so that you can leverage your existing network and start building a community around your brand. That way, once you’re a bit more established, you can drive your fans directly to product listings on sites where discoverability is lower."}, {"type": "sentence", "content": "Very few artists instantly start making money off their art without a personal network. That’s because so many customers will come to you via word-of-mouth. You can’t afford to simply put your art out there and wait for customers. Don’t be afraid to shamelessly self-promote. Ask your friends and family to help by sharing your online shop, social media profiles, and anywhere else you’re promoting your art. This strategy may make you uncomfortable, but it’s a helluva lot cheaper and more effective than setting up your Etsy and waiting for results."}, {"type": "sentence", "content": "Follow these steps to start monetizing your creative work. Remember, once you start doing this, you’re effectively running a business, and it’s important to treat yourself that way. Don’t sell yourself short; DO sell yourself. Ultimately, most people like to support artists. They like to know that they’re getting a piece of creativity while helping an artist pay the bills. So, set your prices appropriately, know your audience, find your venue, and start making money off your art!"}, {"type": "sentence", "content": "Enjoyed this article? Sign up for our mailing list and get exclusive productivity tips, free digital productivity tools, and career advice for professional creatives!"}], "topic": "freelancing"}