{"title": "Beyond the Mirage of Private Practice", "data": [{"type": "subtitle", "content": "My advice to psychology students: consider clinical or health psychology"}, {"type": "image", "content": "https://miro.medium.com/max/10944/1*5S_e7hk-TQGYZZhk7Z4_1g.jpeg"}, {"type": "sentence", "content": "I have been working for the past twenty years in developing and delivering health interventions for people affected by various conditions, mostly HIV and chronic hepatitis infection. From time to time, I meet with psychology students, and I ask them about their dreams: what do you want to become in the future? More than 70% of those I have discusses with during the years are telling me that they want to have a private practice and to practice psychotherapy. Of course, I understand their dreams and their naiveté. Been there, done that!"}, {"type": "subtitle", "content": "Yet, I genuinely hope I can inspire at least some, to ponder on not considering psychotherapy. Here is why."}, {"type": "sentence", "content": "I was among the first generations of psychologists in Romania.Due to ideological reasons, the psychology studies were considered dangerous during the communist regime. By 1977, psychology was forbidden as a specialization in Romanian universities. It was reopened in 1990, after the fall of the communist regime, and I was among the first generations of students. It was a big competition to be accepted at this specialization at the University, there were 21 contestants per place.It seems that I was nerd enough to get a good grade: so, there I was, a University freshman in 1996’s Bucharest, 150 miles away from my family. I was proud of being among the students, thrilled about what we were about to learn. I could not wait for our introductory sessions with the professors. I was so curious to discover what psychology was about, its secrets, and the entire brave new world we were to be introduced to."}, {"type": "subtitle", "content": "Psychology and psychotherapy: a promise about unlocking unknown human potential"}, {"type": "sentence", "content": "I remember the inquiry from a young associate professor during our first get-to-know-one session at the “Fundamentals of Psychology” course."}, {"type": "sentence", "content": "- Why did you choose to study psychology?"}, {"type": "sentence", "content": "I was perplexed. I expected to have the moderator raise the curtain on the secrets of psychology, and instead, she was putting us in the spotlight. To be honest, as young and confused as I was, I did not have an impressive ready-made answer, unlike the rest of my colleagues. They gave me the impression that they did a soul search before applying for this Faculty, since they were shooting out their answers with the speed of a machine gun."}, {"type": "sentence", "content": "- I want to help people heal their souls, like a doctor of souls, said a beautifully dressed girl with a radiant face and perfectly combed hair."}, {"type": "sentence", "content": "- I want to decipher the human mind and to be able to manipulate other people into doing what I want, said one chestnut-haired boy in the front row with a sharp voice and a smirk on his face."}, {"type": "sentence", "content": "- I want to write a forensic psychology book and understand the behavior of murderers, said a tiny blond girl, with huge blue eyes and an upright posture, whom I later found out was also a black belt martial art fighter."}, {"type": "sentence", "content": "- I want to be able to develop and heal myself, so that I will become a better person who will face any adversity life might bring, said a serious skinny boy with high myopia behind me."}, {"type": "sentence", "content": "Yes, we were still kids in that group, most answers were funny and immature, if you think about it now, through the mind of a grown-up."}, {"type": "sentence", "content": "I came from the best high school in my city, where the main courses studied were mathematics and physics. I had a history of struggling with those, while feeling much more at ease with the humanistic classes. Maybe I should explain that the high-school curriculum in Romania was pre-set and did not allow students for any options. So, if the school curriculum dictated ten hours of mathematics and physics per week, followed by chemistry and informatics classes, that was it! During the final high-school year, we had a one hour per week psychology class. That one I enjoyed and the main reason was that I found myself learning relatively easy for that class."}, {"type": "sentence", "content": "So, my unimpressive answer was this: I chose psychology because I can remember easier what is taught in class. Less effort, that was all. An adult might later intellectualize such a response as an affinity for the study area, but I was a bit disappointed for not having a memorable answer like those intriguing colleagues. The truth was, at least in my case, that I had no idea what psychology had to offer, but judging from my colleagues’ answers, an aura of mystery was taking shape: a promise about unlocking unknown human powers."}, {"type": "subtitle", "content": "Alluring students with the carrot of self-development"}, {"type": "sentence", "content": "In those early years, when Romanian psychology was still trying to define its way, psychotherapy was an entirely unregulated area. There were no codes of conduct, no regulatory bodies (actually the Romanian College of Psychologists was established in 2005), no professional associations.A semi-official, parallel, and semi-private initiative was insinuated among students from psychosocial sciences, with the tacit approval of Professors in charge. Students could join “personal development” groups or psychotherapy groups, as part of their supplemental activities. We were supposed to pay a fee to enroll in those groups, and since the initiative was promoted within the Faculty, through credible sources, it looked like the right place to be if you wanted to learn more than the average student.The alluring promise was that after four years of personal work in those groups, we would become co-therapists and eventually certified therapists, with our practice."}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*_PYWOx1S9EjUCANMEV8VpA.jpeg"}, {"type": "sentence", "content": "Most students came to Bucharest from cities throughout Romania with really sparse contact with their families. Basically, they were taking their decisions and managing their lives all alone in the capital city, as best as they could; issues about consent, personal data protection management, policies regarding prevention of any kind of harassment were not even in their infancy in those times. Sessions were video-recorded most times, and after years and years, I wonder where did those tapes end up?"}, {"type": "sentence", "content": "We were studying in the former Ştefan Gheorghiu Academy for Socio-Political Education associated with the Central Committee of the Romanian Communist Party; the building kept its communist mise en scene, with only a few dim neon lights, old doors, and revolutionary wall mosaics. After all classes resumed, when all corridors were empty, and the winter darkness embraced the building quite early in the afternoon, we were to find our way to the meeting rooms. The group sessions with the freshmen students were run by older students, who did not entirely know what they were doing. But in our candid eyes, they were demi-gods: they already learned how to run the groups from the Professor herself. With her, we would work in therapy sessions eventually, if we realized ourselves enough, if we kept all our appointments and, of course, if we paid all fees."}, {"type": "sentence", "content": "Being enrolled in that group set up in all participants a series of beliefs and expectations that I have later understood as damaging, if not unprofessional. I will quickly list those as they come to my mind:- The expectation that all participants were traumatized by default: if you could not identify your trauma, it was not because there was none, but because the student was simply not aware or insightful enough in this stage of his or her life;- The expectation that all participants will express pain or suffering with actor-like drama skills: the louder one cried or expressed suffering during group exercises, the more approval he/ she would get from the two moderators, conventionally called therapist and co-therapist;- The expectation to accept their own psychological blindness: the group work was about revealing blind spots, and there was pressure to go along with the group’s interpretation;- The expectation to demonstrate progress and transformation from one session to another ;- The expectation of buying and studying all the books published by the Professor and her collaborators: as to progress faster in self-realization."}, {"type": "sentence", "content": "Our undercover emergent capitalist psychotherapy movement was alluring students with the carrot of self-development and with the promise of a career. Lured by credits, promotion, and quicker access to professional resources, combined with the desire to learn and become better persons, we unknowingly became cannon fodder for an emergent personal army of therapists. They were to produce money within a future psychotherapy institute, who would be continuously fed with students from the state faculty. Neat arrangement, eh?"}, {"type": "subtitle", "content": "The murky waters of personal development"}, {"type": "sentence", "content": "Here we were, at our advanced personal development, a few years later. We were the group of selected participants who were taking the final steps towards the promise made four years before. Now, we got to work directly with the Professor — psychotherapist — guru — entrepreneur and wife of the pro- dean. So, the pressure was high! We were almost reaching the dream of becoming junior therapists, and we were to be enlightened during the intense one or two-day group sessions that we attended regularly."}, {"type": "sentence", "content": "The content revealed by participants was always highly personal; the video-camera was always on; we had no idea or control on what would happen with our content, nor did we know that we had any rights regarding those aspects."}, {"type": "sentence", "content": "I guess that by that time, I was exposed long enough to the process to end up feeling that something was wrong. Before, I thought that it was mainly something that I needed to improve, to become more open, more aware, and more agile. Lately, my skepticism could not be tamed anymore by the charisma of the master, nor by the group pressure."}, {"type": "sentence", "content": "One event that has marked me was when a group participant, a young student about my age, was labeled by the master-therapist as resistant, since she did not accept the Professor’s interpretation. The student was trying to analyze in the group a conflict she had at work with another female colleague: the therapist was pushing her towards recognizing the parallel situation between her work conflict and a family conflict. Since that group was both a teaching and self-exploring group, from time to time, the therapist would stop and explain to the group what she was doing, as if the subject was absent from the room (unfortunately, she or he was present). So, when the therapist saw that the student was defending her point of view, evading all her interpretations, she turned her back to her subject and spoke to the rest of the group: this is a classic case of psychological resistance, and it is one of the most evocative examples we have ever seen in this group! Take a good look at this case, as you might encounter later in your practice, and you will have to recognize it!"}, {"type": "sentence", "content": "I can’t tell what my group colleague has felt, but I was shattered. I empathized with her, and I could not believe what was happening. What is that? I thought we were going from murky waters to clearer ones, but I could see for the first time the conflict of interest in that entire endeavor and how important it was not to be wrong, not even once. I started to understand that the guide herself needed guidance. I imagine that, in her position, the Professor could not get accurate feedback from anyone; no real external supervision was available. The entanglement of power, influence, complicated by the conflict of interest between the teaching role for the public University and the business aspect of the private project was probably quite difficult to manage. Therefore, slips like these were part of the package."}, {"type": "subtitle", "content": "How I threw away everything I have learned"}, {"type": "sentence", "content": "As I have stated, I was alone in Bucharest, avid to learn, hopeful, and willing to become a better person. And I was a combination of ambitious and vulnerable. Despite all that investment, I started to question my path of becoming a psychotherapist after reflecting upon the experiences of the advanced groups."}, {"type": "image", "content": "https://miro.medium.com/max/9856/1*v-V9b7CSvcQgOjidKNBcZw.jpeg"}, {"type": "sentence", "content": "Eventually, I have managed to see through the haze and leave behind that mumbo-jumbo called experiential psychotherapy. I’ve got employed in an AIDS clinic, and the reality of children and families affected by HIV did not fit any “exercises and techniques” that we practiced. My toolbox was useless!"}, {"type": "sentence", "content": "I was in the situation of doing a reality check of the dogma of the last years, and the balance was not in favor of experiential interventions. All that overload of subjectivism and phenomenological exploration was proven futile in the context of families affected by AIDS. There I was, working with doctors and nurses, avidly reading and learning about viruses, diseases, and highly active antiretroviral therapy. We were a team, attending for hundreds of children and families, and we had to find ways of addressing various categories of clinical problems, for which there were no predefined protocols. There were no benchmark interventions in those early days of AIDS pandemic in Romania: we were pioneers of clinical interventions and health projects in emergency unstructured situations. We were working with specialists from other countries, especially from the U.S., and we were learning by doing and fine-tuning our interventions by using a mix of best-practices, brainstorming, and practicing critical thinking."}, {"type": "sentence", "content": "In this context, I have come to appreciate how precious science is. How important measurable change at behavioral level is. Why evidence-based interventions matter. How we need to make simple things that fit where people are. Why we need to tailor interventions for groups of patients. And why it is important to communicate with other disciplines and with professionals from other countries.Basically, in a short while, I realized I was ready to throw away all those years of experiential training. What they taught us did not pass the test of important life problems."}, {"type": "subtitle", "content": "A discussion with young psychologists"}, {"type": "sentence", "content": "Today, among many responsibilities, I am also an employer. From time to time, I have to interview young psychologists who are looking for a job. What I have learned from these encounters is that, twenty years later, the school of experiential psychotherapy is still around. Unfortunately, it did not evolve towards a more robust model. The private network has rolled out to other cities and universities: marketing the personal development model, enrolling students and psychologists in long-term and expensive professional contracts, and selling the dream of changing the world in the safety of private practices, with more or less formal professional supervision."}, {"type": "sentence", "content": "This perpetuation is possible because the school of psychology in Romania is really weak: there is no money for research, only a handful of psychologists publish in international journals, and nepotism is still more a rule than the exception. Students don’t seriously study research, and even some faculty display a superficial understanding of statistics for social sciences. Plus, there is an inflation of private psychology schools, which almost anyone can graduate from, without genuinely studying. The graduates of these schools consequently seek to work with people, assist with their issues, and guide them through life challenges."}, {"type": "sentence", "content": "I have given chances to dozen of psychologists, both with some individual practice experience and those who were newbies. By employing them in the clinic where our team works, we were hoping to get them on-board with the mission of helping people with chronic conditions. Using their toolbox in the context of medication adherence, diagnosis disclosure, or symptom self-management. We were pushing them to discover the value of specific and practical help for a person who has to adjust to the changes associated with a disease. We wanted them to get excited about research and have them willing to learn more about statistics and how to measure change. Mix the scientist with the specialist in communication. What I find most often than not, is that dropping the psychotherapist fantasy narrative and learning a new professional role, re-learning, is a painful experience that most psychologists in our context avoid embracing."}, {"type": "sentence", "content": "As I stated at the beginning of the article, I have meetings with students from time to time. In my discussions with them, I am hoping that I can “sell” them the idea of considering health psychology as a career, even if they don’t study that in school. I am hoping that, instead of a private practice, they would envision themselves working in a hospital or a clinic."}, {"type": "subtitle", "content": "Why I wrote this piece"}, {"type": "sentence", "content": "I have seen through the mirage of working alone in private practice psychotherapy. We live in a society where physical disease needs to be addressed not only by doctors and nurses, but also by psychologists and social workers. We need to stop running after the carrot presented to students by various mercantile professional associations ( I have focused in this article only on my experience with experiential psychotherapy, although other colleagues could share similar shady stories about other therapy schools). Real social needs should drive our professional focus."}, {"type": "sentence", "content": "I have written this piece out of love for my profession and for the patients who need psychologists’ support. We are necessary, we can become a respectable profession in Romania, but we need to grow up. I will continue to speak against the manipulation of students, against the financial extortion of junior psychologists by various professional associations. I will continue to expect psychologists to know research and statistics, and develop the habit of taking evidence-based decisions in their practices. Our communist inheritance is still poisoning our life, but we can use our reason and evolve, one psychologist at a time. As Cesar Chavez said in his Address in 1984:"}, {"type": "sentence", "content": "© Ana-Maria Schweitzer 2020"}, {"type": "sentence", "content": "I am a Romanian health psychologist, working in philanthropy and involved in developing prevention and care programs for people with chronic conditions. As a seeker of meaning, I use writing and playing with words, as ways of uncovering both the order and disorder that reign inside and outside our minds."}], "topic": "education"}