{"title": "This 25-Year-Old Built a $13 Million Newsletter in 4 Years", "data": [{"type": "subtitle", "content": "How Alex Lieberman grew a nationwide news leader with 1.8 million subscribers"}, {"type": "image", "content": "https://miro.medium.com/max/3000/1*jLo2tGWXf1r16tWmkaVmxQ.jpeg"}, {"type": "sentence", "content": "Imagine a plane. A private jet, not the airline one. It’s been waiting for a couple of hours now. But it’s you they’re waiting for, because it’s now your plane."}, {"type": "sentence", "content": "And yet, you can’t stop stressing over the fact that private planes have a higher crash percentage than airline jets. You’re sweating like it’s your first date."}, {"type": "sentence", "content": "That is the nausea Alex Lieberman, a millionaire co-founder of the Morning Brew, wakes up to every morning. On paper, he is quite the Iron Man — graduation with honors, Forbes 30 Under 30, multi-millionaire by 25 — and he looks the part, too."}, {"type": "sentence", "content": "On the inside, however, lives a paranoid overthinker. When Alex’s newsletter hit the 1,000,000 subscriber mark, he let himself celebrate for 2 days. He is indeed the rare breed of person who’s just never satisfied with their achievements."}, {"type": "sentence", "content": "It’s a blessing and a curse, Alex says. You give up peace of mind, but you do get a newsletter that generates $13 million a year by the time your peers start looking for a job. I’m not going to speculate whether that’s a tradeoff worth taking. I’m going to show you how Alex did it based on these three interviews. Here’s what worked for Alex."}, {"type": "subtitle", "content": "1. He Put Together a Daily PDF Newsletter He Would Read Himself"}, {"type": "sentence", "content": "On his first job as a mortgage trader at Morgan Stanley, a 20-year-old Alex Lieberman didn’t seriously think about starting any business, let alone a media one. But he did need to stay up to date with the business world, so he read the Wall Street Journal every day."}, {"type": "sentence", "content": "He quickly realized that outlets like WSJ are “written by 50-year-olds for 50-year-olds.” It lacked the high-level news roundup needed for watercooler banter. It lacked the investigative hunger of discovering emerging business trends. Most importantly, it was written in a tone that could put even the hungriest future-preneur to sleep."}, {"type": "sentence", "content": "Many business gurus will tell you that we’re all experts at something and that we just need to find that one thing. Well, Alex wasn’t an expert in anything. He was just a young dude trying to make it in the finance world."}, {"type": "sentence", "content": "At the same time, Alex was helping fellow business school undergrads prepare for their job interviews. Knowing from experience that staying on top of business news is a big priority in finance, he would always ask his students what do they read. “I read the WSJ because that’s what my parents told me to do,” was the standard answer."}, {"type": "sentence", "content": "That’s when he knew. Fuelled by his desire for sharp, engaging, succinct business content, he started making it himself."}, {"type": "sentence", "content": "The first emails were sent as PDF attachments to a manually compiled list of 45 friends and family members. Alex wasn’t a good writer or a good designer. Alex wasn’t a good anything that’s related to email. But he was deeply curious about the business world, and it shined through. “I started getting texts from people saying, ‘Hey, I heard about your business roundup, can you add me to your list?,’” Alex remembers."}, {"type": "sentence", "content": "After four months of sending out daily business roundups, the subscriber list grew to over 1,000 people. Those weren’t just passive observers: When the Market Corner (that’s how the newsletter was called then) had just 200 subscribers, Alex would get 20 emails a day in response. Given that “the product looked like shit,” Alex knew he had something special."}, {"type": "sentence", "content": "Most importantly, until the 1,000 subscriber mark, Alex treated the newsletter like an evening hobby, not even a side hustle. Only after he realized there was real hunger for content like his did he seriously start considering the newsletter as a means to build an audience."}, {"type": "sentence", "content": "Reflecting on his success, Alex says that realizing whether a newsletter idea is in demand should be the first, second, and third priority of anyone thinking about launching a newsletter of their own. Email is timelessly sexy, but just because you have a newsletter doesn’t mean people will automatically read it."}, {"type": "sentence", "content": "Aside from asking yourself whether your newsletter idea is actually needed by any particular audience, you should also investigate whether email is the best delivery mechanism for that audience. “Different audiences consume content in different ways,” Alex reminds us."}, {"type": "sentence", "content": "The easiest way to make sure there’s an appetite for your newsletter — and this is what Alex did — is to write one for yourself. If you’re the end consumer, you’ll know exactly what you want to read and what you would delete instantly. If that’s not the path you want to take, then robust market research is in order — surveys, conversations, analysis. Otherwise, you’re shooting darts in a dark room, blindfolded."}, {"type": "sentence", "content": "By the time the Morning Brew hit a 1,000,000 subscriber mark, 15% of those readers came from direct word-of-mouth recommendations. “We have horrible SEO,” Alex says, which means that direct traffic to MorningBrew.com is a result of pure word-of-mouth. That’s what a kickass product alone can do."}, {"type": "subtitle", "content": "2. He Printed Fliers and Gave Lectures to Fellow Students"}, {"type": "sentence", "content": "Alex got his first 300 subscribers through pure daily grind. He would just send out his daily business roundup, people would share it via word-of-mouth (there were no CTAs enticing them to forward the emails), and friends of friends would ask to be added to the list one by one."}, {"type": "sentence", "content": "After that, Alex resorted to “every guerrilla tactic imaginable.” He would print out pieces of paper with interview questions and business riddles. For those who wanted the answer to their riddles, they had to sign up for the Morning Brew."}, {"type": "sentence", "content": "He would print flyers with the newsletter logo in heaps and place them in the Winter Garden, the common area in the Business School of Michigan. “Every day by 3 p.m. the janitors would pick them up,” but Alex would re-stock the table with new flyers by the next morning. Every morning, that is, until he got a threatening letter from the school’s administration."}, {"type": "sentence", "content": "Within a two-month period, Alex and Austin (his co-founder) spoke at 50 business classes and clubs — because that’s where their target audience was. Their message was simple: here’s what Morning Brew is, here’s the problem we solve, feel free to join. And it worked. Students would gladly write down their email addresses on a sheet of paper after each talk. When was the last time you gave a lecture to get someone to subscribe to your email list?"}, {"type": "subtitle", "content": "3. He Rolled Out a Kickass Referral Program"}, {"type": "sentence", "content": "Referrals account for 25% of Morning Brew’s readership, or roughly 450,000 people. Alex explains:"}, {"type": "sentence", "content": "The costs of maintaining this referral program are, Alex says, negligible. Their young professional demographic appreciates the gamification, and 450,000 subscribers is a number that speaks for itself."}, {"type": "subtitle", "content": "4. He Took Advantage of Paid Advertising"}, {"type": "sentence", "content": "A whopping 60% of Morning Brew’s readership comes from paid acquisition. A new subscriber is defined as a reader who opens five out of ten Morning Brew emails. By May 2019, the Morning Brew had spent over $1 million on paid acquisition channels."}, {"type": "sentence", "content": "Giveaways are a bomb when it comes to acquiring new subscribers, Alex says, and they do those on channels like Instagram. “We did a two-a-day MacBook giveaway — it’s like, we gave away two MacBooks a day. One to someone who referred someone, and the other to the person that they referred,” Alex says on giveaway days, they’ll grow their subscriber count by mid-five figures."}, {"type": "sentence", "content": "The beauty of the email business is in the consistently high-profit margins. So as soon as Alex and Austin started monetizing the newsletter and testing a few marketing channels, the math became very simple. Once the equation works, the only question left is: how do you amplify the results?"}, {"type": "sentence", "content": "In his journey of discovering the magic ad-buying formula, Alex started off broad, showing ads to anyone between ages 18 to 45, living in the United States, and having at least the slightest interest in business."}, {"type": "sentence", "content": "As the Morning Brew duo analyzed their campaign data, they noticed patterns. For example, it turned out that getting females to subscribe to the newsletter was three times more expensive than converting male readers."}, {"type": "sentence", "content": "Another thing they toyed around with was the ad creative. Alex and Austin tried many different copy-image combinations, but two particular campaigns worked extremely well:"}, {"type": "sentence", "content": "Alex thinks these images worked best because they feel “the most native” on social media — less like an ad and more like a post."}, {"type": "subtitle", "content": "5. He Only Reached Out to Companies That Are Already Buying Newsletter Promotions"}, {"type": "sentence", "content": "Morning Brew’s first dollar of revenue came from the University of Virginia, which paid them $700 to advertise on the newsletter. One day, Alex got a sponsored message from the university’s admissions department."}, {"type": "sentence", "content": "“So I literally just hit up that person on LinkedIn and said, ‘Hey, I saw you’re doing this. I’m assuming LinkedIn CPAs are pretty high. This is what Morning Brew is up to and we’d love to work with you guys,’” Alex said in his cold message."}, {"type": "sentence", "content": "This conversation led to a series of promotions that were spread out over the next nine months. Unfortunately, while tuition fees justify high CPAs for university leads, the actual marketing budgets for individual programs are tiny, and soon, they were spending all of their marketing budget on the Morning Brew promotions. The newsletter got too expensive."}, {"type": "sentence", "content": "Looking for customers who are already spending money on paid digital advertising became a primary qualifying factor for the Morning Brew marketing team, and it paid off big-time. With a team of just 13 people, the newsletter managed to land household names like Morgan Stanley, Axis Investing, Microsoft, and Dropbox for paid promotions."}, {"type": "sentence", "content": "In particular, the Morning Brew is interested in reaching out to specific marketing decision-makers who are already purchasing email promotions from other newsletters. Those people don’t need to be sold on the idea of promoting via email, they just need a good offer."}, {"type": "sentence", "content": "And their offer is this: The client pays for the number of unique opens of the email. It’s hard to refuse this one."}, {"type": "subtitle", "content": "6. He Delegates the Boring Stuff to His Mom"}, {"type": "sentence", "content": "Up until May 2019, more than four years into the business with 33 staff, Alex would spend three hours a day answering email. He eventually realized that “email is controlling [his] life,” and something had to be done about that."}, {"type": "sentence", "content": "Prior to this realization, Alex was a big proponent of doing things himself. From newsletter copy to customer support, Alex was the classic in-the-trenches leader — and that’s probably why the Morning Brew stayed so pure and engaging throughout the years."}, {"type": "sentence", "content": "But spending a quarter of your workday answering emails is not a viable option for a leader who’s looking to grow his business. So he put all of his daily activities into two categories: things I’m good at and things I’m not good at."}, {"type": "sentence", "content": "In the first category, you’d find things like coming up with creative ideas. Alex is the go-to guy in the office for sharp new directions. Most of his ideas suck, he admits, but the one out of ten is worth its weight in gold."}, {"type": "sentence", "content": "In the second category, you’ll find the classic Achilles’ heel of any creative person: calendar organization, replying to email, administrative tasks. It sounds pretentious to say that you’re not good at answering email, but when you get 350 of those a day while running a $13 million company, you have to get someone to lighten the load. It’s just not efficient not to."}, {"type": "sentence", "content": "The solution: make your mom the Chief of Staff."}, {"type": "sentence", "content": "The upside is that you can trust her with your private emails. Alex changed his mother’s email last name so people don’t realize it’s actually his mother who’s answering the emails. After sorting out emails with labels (important, not important, sales, content) Alex was able to reduce his email load from 350 a day to 70 a day. For a guy whose hour costs a lot, that is a huge improvement to the bottom line."}, {"type": "sentence", "content": "The downside is that you dread the day when your mom fails at a task and you have to reprimand her, because humans are not hardwired to deal with that issue."}, {"type": "subtitle", "content": "What Didn’t Work"}, {"type": "subtitle", "content": "1. He tried to cross-promote with other newsletters"}, {"type": "sentence", "content": "Cross-promotions sound enticing because they’re “free.” You promote someone else’s newsletter, and they return the favor. Win-win, right?"}, {"type": "sentence", "content": "Not exactly. Once the Morning Brew hit 2,000 readers, Alex and Austin were eager to partner up with newsletters that had 10,000–15,000 subscribers. After a few experiments, Alex concluded that “few partnerships actually work out,” while requiring tons of time and energy to coordinate a deal."}, {"type": "sentence", "content": "For example, one of the biggest deals Alex attempted to close was to get their business school’s career department to promote the newsletter. But much like financial firms, schools have rigorous compliance protocols, so it quite literally takes years to close a partnership like that."}, {"type": "sentence", "content": "Even if you do partner up with someone, it’s unclear whether all that hassle will pay off because many newsletters are semi-dead. Low engagement rates mean few readers transfer to your newsletter, and those who do — well, they’re just as passive as they were with the old newsletter."}, {"type": "subtitle", "content": "2. He partnered with the wrong ambassadors"}, {"type": "sentence", "content": "A small part of the Morning Brew’s readership comes from their ambassador program. But the first year they tried it, it was a comical failure."}, {"type": "sentence", "content": "Alex hand-selected 12 ambassadors that made sense on paper: the business club presidents, the fraternity leaders, the hyperactive social networkers. These people would go through proper application stages, including resume analysis and several interviews."}, {"type": "sentence", "content": "The problem was that these people take on myriad projects at a time, spreading themselves too thin to actually deliver results. “The thing that made them perfect also made them the worst possible people to be our ambassadors,” Alex recalls."}, {"type": "subtitle", "content": "3. He hired a “professional” writer"}, {"type": "sentence", "content": "For a newsletter business, the first bottleneck is content production: you need writers to produce more, better content while you can focus on landing promotion deals and building up marketing channels."}, {"type": "sentence", "content": "When Alex was first thinking of finding a writer, he took the “real media” approach: hire someone with a journalism background and experience in the media world. And, to his imminent disappointment, he did."}, {"type": "sentence", "content": "The problem was that the writer was simply unmotivated. They didn’t “feel” the cause of the Morning Brew. As a result, they produced unremarkable work — a deadly sentence for a first hire."}, {"type": "sentence", "content": "For his next attempt, Alex took a 180-degree turn and hired someone much like himself: a guy with no credentials, but equipped with an insatiable intellectual curiosity. Many people will tell you they’re intellectually curious, Alex ponders, but few actually know what it means to get to the bottom of something."}, {"type": "sentence", "content": "The writer turned out to be so effective that Alex made it the golden rule for all of his hires, not just content producers. Be insatiably curious instead of loudly intellectual; produce actual work instead of billable hours. That is the formula that built a 33-man team generating $13 million a year from newsletter promotions in just four years."}], "topic": "marketing"}