{"title": "Dispelling the Lootbox Myth", "data": [{"type": "subtitle", "content": "Why “surprise mechanics” aren’t real progression"}, {"type": "sentence", "content": "When the lootbox/gaming debate began to take off last year, several people in the industry tried to argue that lootboxes — or “surprise mechanics” — are just another form of progression in video games. In fact, one person even tried to convince me that the action RPG core gameplay loop (where the player acquires randomized loot) is the same as purchasing a lootbox. Recently, I’ve tested out this theory myself in an effort to verify it. Now I’m in a position to articulate why these two concepts are not the same."}, {"type": "subtitle", "content": "What is the “ARPG” loop?"}, {"type": "sentence", "content": "Let me start by defining what I mean by “ARPG loop”. ARPGs are built on the following cycle:"}, {"type": "sentence", "content": "ARPGs will always use some form of procedural generation (in other words, an algorithm) that pulls from a loot table and determines what gear is generated for the player. As a result, players won’t ever know exactly what loot is going to drop, although they may be aware of the preceding conditions that give rise to certain kinds of drops. Examples include: the player killing an elite monster, finding a treasure chest, or completing a quest."}, {"type": "sentence", "content": "There is always a correlation between player progress on the one hand, and nabbing loot on the other. Loot tables are pegged against a player’s level (or equivalent). As a result, the player will progressively find better and better gear as they move through the game."}, {"type": "sentence", "content": "Another important point is that loot represents only half of the player’s progression curve. The other element is levelling up the player character to unlock new abilities and skills — the best players will use this in concert with loot to create the most effective builds possible."}, {"type": "sentence", "content": "Now that I’ve explained the ARPG loop, let’s take a look at lootbox progression. We can find a good example of this in the mobile space."}, {"type": "subtitle", "content": "Contest of lootboxes"}, {"type": "sentence", "content": "Marvel’s Contest of Champions is a light fighter/character collection game on mobile. It’s been out for a few years now and is considered one of the more popular takes on the Marvel IP."}, {"type": "sentence", "content": "Characters in this game are categorized both by class (which determines strengths and weaknesses when compared with other classes) and star rarity. There are multiple variants of the different Marvel heroes and villains at different star levels: ranging from one to six."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*yCxzHPE1OMzL0aC53iJ0iQ.jpeg"}, {"type": "sentence", "content": "The higher the star level means that character will be stronger, and has a greater capacity for growth and strengthening them. By applying in-game currency in the form of Iso-8, you can level up a character. When that character is at max level, you can then rank them up by spending other in-game currency which allows you to level them higher. Characters also get a unique passive that can be acquired by pulling a copy of that character from a lootbox. All forms of progression of this kind also have in-game item skips that can be bought or acquired as well."}, {"type": "sentence", "content": "To be fair to the game, even lower star versions of character still retain their usefulness in the in-game arena, where you can fight AI-controlled versions of other teams."}, {"type": "sentence", "content": "Now the kicker: all character unlocks in the game are defined by the RNG of lootboxes, and there are a lot of them. There are lootboxes for resources, lootboxes for gold, lootboxes for every rarity level, lootboxes for items of every rarity level, themed lootboxes, limited time only lootboxes; if there is something in this game, chances are there is a lootbox for it."}, {"type": "sentence", "content": "And the chances to acquire champions reduce the higher the rarity goes. In a lootbox to acquire either a two- or four-star champion, I apparently had a three percent chance on a lucky pull if you believe the posted drop rates. There are lootboxes explicitly set up to drop a set rarity, but they are harder to find."}, {"type": "sentence", "content": "Here’s another factor: when you decide to pull a lootbox, the game will randomly shuffle the possible rewards in it, as you can see by the scrolling roulette at the bottom of the screen, but the choice will be automatically determined without having to watch the slot machine; it is simply there to add excitement."}, {"type": "sentence", "content": "Progress in the game is limited based on the luck that you have with the lootboxes. If you’re only pulling two- and three-star characters, the fixed power in place puts a cap on how far you can easily progress in the story. If you get stuck at a story mission, you can spend consumables for boosts, healing, and character revives; all costing the game’s premium resource."}, {"type": "sentence", "content": "As with other games of this type, a lucky pull can easily propel you through the game and make a lot of the content easier. With an early four-star champion, I manage to push through some of the early acts, but struggling to find better or equal champions."}, {"type": "sentence", "content": "Player skill is a big part about Contest of Champions: someone who figures out the timings for attacking and defense can get further with weaker champions to a point. As with a lot of free to play/mobile games, the rewards and resources earned get better on the harder maps. Having access to higher rarity champions early on gives you a heads up on resource collection, and there are some champions who are flat out amazing regardless of their star rarity."}, {"type": "sentence", "content": "Both Contest of Champions and ARPGs make use of randomized progression elements, but there is a big difference in how ARPGs handle this."}, {"type": "subtitle", "content": "Player-controlled progression"}, {"type": "sentence", "content": "Randomized progression has been a powerful motivator for players. That thrill of acquiring some new, powerful item has kept people playing many RPG-based games. However, randomized progression is not the same as player-controlled progression, which is present in ARPGs, but not in lootbox games."}, {"type": "sentence", "content": "Playing an ARPG, the player is in control of their progression in several ways. By playing the game and leveling up, they are acquiring new skills and have complete control over how their character handles. At the end of the day, rare loot is not the same in terms of utility as a new skill."}, {"type": "sentence", "content": "Secondly, the player in a way does control how they get new loot and upgrades to show up. As I said earlier in reference to loot tables and design, ARPGs provide the player with clear events that signify the chance of great loot. There is that buildup of knowing that there is an epic enemy or rare chest, followed by the reveal of your reward."}, {"type": "sentence", "content": "The problem with lootbox-focused games is that the lootboxes themselves drive all progression. You could play a game like Contest of Champions for 24 hours and not find one meaningful upgrade to your team or champions, or you could play for one hour and get a lucky drop. The player does not have control over the progression in a loot box game."}, {"type": "sentence", "content": "Even though skill does matter in Contest, there is an explicit wall in the game in terms of getting champions that usefully drive progression forward. Later challenges introduce specific rules and modifiers designed to give the AI more advantages. These rules can boost their stats, punish you for using specific tactics or champions, and are designed as progression walls. When you get to this point, you must have champions who are able to counter them or there is no way without spending money to get past them."}, {"type": "sentence", "content": "It’s also important to bring to everyone’s attention that loot in ARPG or gear-driven games is a secondary progression system. With lootbox titles, the items and drops from them is your primary progression system with skill being a distant second. ARPGs also feature additional systems and ways of acquiring gear in case you’re not getting lucky with drops. Path of Exile, Grim Dawn, and Diablo 3 all feature ways of buying or crafting gear that may not be as good as the finds in the field, but will allow players to at least be able to compete stat-wise with the enemies."}, {"type": "subtitle", "content": "Loot or luck"}, {"type": "sentence", "content": "Lootbox progression works, as evidenced by the numerous free-to-play titles (and even full-price games) that utilize it. But equating this progression system to more traditional player-driven systems is erroneous."}, {"type": "sentence", "content": "There are also important implications to consider for the longterm health of a game. Building an entire progression system on lootboxes alone does not motivate someone to play over the long run. There is always a downward pressure in unlocking progress with lootboxes the further someone plays. What always ends up happening is that there will come a time when only specific lootbox drops will help the player, and everything else will be worthless."}, {"type": "sentence", "content": "Some will argue that milling systems (taking resources and being able to apply them somewhere else) is an option, but when the cost becomes so great, the player will not have that rush when it comes to opening up lootboxes anymore."}, {"type": "sentence", "content": "Good design allows players to progress through multiple means, and not force them down only one path. Lootboxes can serve a purpose, but do not try to convince someone they are the superior form of progression in any video game."}, {"type": "sentence", "content": "If you enjoyed my article, consider joining the Game-Wisdom Discord channel. It’s open to everyone."}, {"type": "image", "content": "https://miro.medium.com/max/1996/0*L70aFjHmRjPEiob2.png"}], "topic": "gaming"}