{"title": "What Does It Take To Open A Closed Mind?", "data": [{"type": "subtitle", "content": "The futile exercise I can’t seem to give up"}, {"type": "image", "content": "https://miro.medium.com/max/7680/0*IF995He02yP7ouAo"}, {"type": "sentence", "content": "That day I said I wasn’t going to do it. I was not going to engage with people who were not teachable. I was not going to try to open minds that were voluntarily closed. I even made the vow on Twitter."}, {"type": "sentence", "content": "It didn’t last very long."}, {"type": "sentence", "content": "Social media is full of opinions these days. People spout them, and they do it often."}, {"type": "sentence", "content": "I have friends who are the staunchest conservatives and others who are the most liberal liberals. Typically I love this. The kind of people I don’t understand are those who seemingly have no opinions about anything. I’m not quite sure how you can care about the world, and stand for nothing."}, {"type": "sentence", "content": "This means I disagree with my friends on occasion. Or some friends most of the time. I look at the world differently than most and find myself on different sides at different times. Or maybe no side. Perhaps both sides. I see a lot of grey in the world, and not a lot of black and white."}, {"type": "sentence", "content": "I love to learn and try to learn from everybody. That’s why I haven’t unfriended some of my most obnoxious friends on Facebook. Sometimes amid their crazy rants, I learn something."}, {"type": "sentence", "content": "I am an idealist. In the perfect world I carry around in my head, people want to learn. They want to get better. They want to stop doing stupid things. They want to figure out what is right and wrong. They approach issues with as clean of a slate as possible and try to figure them out. They want the best for all, but if they can’t have that, they want the best for the most. Yes, they are interested in the impact on them, but it’s not the priority."}, {"type": "sentence", "content": "Do you see why life can be difficult for me?"}, {"type": "sentence", "content": "Sometimes I hate this idealism of mine because I am often disappointed in people. Still, I would far rather operate from this point of view than be someone who creates their own reality and will not ever leave it."}, {"type": "sentence", "content": "So back to the day when I tried not to engage with the unteachable. I didn’t last long. I ended up in a long debate with a friend who I could once argue with positively, before he went to law school and started to argue to win instead of to argue to learn. I know better than to engage with him on certain topics, but I get hooked in."}, {"type": "sentence", "content": "The topic was, of course, related to the coronavirus. He lives in Okinawa currently, and yet believes he understands what is going on in my community in the United States. He doesn’t believe quarantine has done anything to help things, the coronavirus is not as deadly as feared, and that isolation has hurt individuals in ways that the virus never could."}, {"type": "sentence", "content": "I tried to convince him he was wrong about some things. This discussion lasted from morning into the night. Some friends jumped on board and helped, but he was not moving. He didn’t listen to learn; he listened to win."}, {"type": "sentence", "content": "I finally gave up, not because he was right but because he was not teachable. Remember when I said my goal for the day was not to argue with someone who was not teachable? Yeah, I failed miserably."}, {"type": "sentence", "content": "No, I haven’t learned my lesson yet. I will continue to argue with him and people like him, though also at some point in the conversation, I will say, “There is no point in arguing with you further,” and walk away."}, {"type": "sentence", "content": "That won’t stop me from trying again next time."}, {"type": "sentence", "content": "Our world is full of people who have lost the ability to hear people when we challenge them. They argue to win. Facts don’t change their opinion, nor personal experience, nor articulate arguments. They are holding on tight to their view, and they will not change their mind."}, {"type": "sentence", "content": "Still, the idealist in me has to keep going. We have to get better. We have to stop letting the division get wider and wider, listen to each other, and find our way back to each other. Until we do, enacting positive change is very difficult."}, {"type": "sentence", "content": "I try to watch myself and examine my mind regularly. Am I holding on tight to my opinions, or can my mind be changed? Am I genuinely trying to learn or embracing what supports my preconceived notions and ignoring the rest? Is my brain open to new ideas and thoughts and perspectives? Can I rest in the grey and remember that all is not black and white?"}, {"type": "sentence", "content": "I want my mind to be active and changing. Learning and growing. When I argue, I want to be teachable and, on occasion, say, “Good point. I hadn’t looked at it that way.” Or maybe even “I was wrong, and you are right. Thanks for helping me understand.”"}], "topic": "mindfulness"}