{"title": "The Weird Science of How We Perceive Our Bodies", "data": [{"type": "subtitle", "content": "What it means to have ‘alien hand syndrome’"}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*1U8nqJsC7rkScSIsBRjCbQ.jpeg"}, {"type": "sentence", "content": "The human body plays a crucial role in personal identity. And yet, evidence from brain injury patients, and the science of perceptual illusions, suggest that physical identity may be more fluid than we think."}, {"type": "sentence", "content": "A 2013 article appearing in the Journal of Neuropsychiatry and Clinical Neurosciences reported the curious case of an 82-year-old woman who believed she no longer controlled her left arm. Instead, it now belonged to her brother."}, {"type": "sentence", "content": "Six weeks earlier, she had suffered a stroke that affected the left side of her face, arm, and speech. Contacting her doctors, she complained that “her ‘brother’s arm’ did not do what she wanted and that this was causing her significant distress,” say neurologists Hannah Shereef and Andrea Cavanna."}, {"type": "sentence", "content": "“Most people are convinced that their body parts are, in fact, their own, but in some clinical conditions, this sense of ownership can be lost,” explains neuroscientist Nadia Barnsley of Neuroscience Research Australia in Sydney."}, {"type": "sentence", "content": "Though rare, according to Barnsley, the condition — known by neuroscientists as “alien hand syndrom”’ — is not unique. And, along with other perceptual disorders, it provides essential insights into how people mentally represent their bodies."}, {"type": "sentence", "content": "There’s little doubt that “body image is a complex concept that symbolizes the way in which people perceive themselves and the way they feel and behave in relation to their own body,” writes lead researcher Santiago Mendo-Lázaro in Frontiers in Psychology."}, {"type": "sentence", "content": "If people with alien hand syndrome can “lose” parts of their body, could it also be possible to “take possession” of new limbs that don’t belong to the body?"}, {"type": "sentence", "content": "According to science, yes."}, {"type": "sentence", "content": "In a 1998 landmark study, researchers at the University of Pittsburgh performed an unlikely experiment, known as the “rubber hand illusion.” They asked participants to place one of their hands out of sight, behind a barrier. A lifelike fake hand was laid in front of them where their real one would have been. When the researcher gently brushed the hidden hand and the fake one (in plain sight) simultaneously, something interesting happened. “I found myself looking at the dummy hand thinking it was actually my own,” reported one of the participants."}, {"type": "sentence", "content": "Each of the 10 participants reported that they could “feel the touch not of the hidden brush but that of the viewed brush, as if the rubber hand had sensed the touch,” explained neuroscientists Matthew Botvinick and Jonathan Cohen. Such illusions — incorrectly combining feedback from a sense of vision, touch, and position — result in a false sense of ownership."}, {"type": "sentence", "content": "“Body ownership illusions provide evidence that our sense of self is not coherent and can be extended to non-body objects,” explain researchers Maryam Alimardani from the University of Tokyo, Shuichi Nishio of Advanced Telecommunications Research Institute International, and Hiroshi Ishiguro of Osaka University."}, {"type": "sentence", "content": "Such perceptual tricks provide psychologists and cognitive scientists with insights into how sensory input can recalibrate the mental representation of the body and form a new idea of the self."}, {"type": "sentence", "content": "And surprisingly, this effect can be extended to the whole body."}, {"type": "sentence", "content": "A study in 2016, appearing in Nature, asked people to control a virtual, human-like robot seen through a head-mounted display from a first-person perspective. In the first test, a 3D motion-capture system monitored movements of the volunteer’s hand. This was then mirrored, in time and position, by the action of the virtual robot on the screen. Participants reported a strong sense of owning the computer-drawn hand, even though it had no presence in the real world."}, {"type": "sentence", "content": "In the second test, participants wore electrodes attached to an electroencephalogram (EEG) to record the electrical activity of the brain. After a training period, participants were able to imagine simple movements — picked up by the EEG — to move the virtual hand. Again, the participants — though not moving — felt a very real sense of “owning” the hand."}, {"type": "sentence", "content": "Whether real or imagined, the participant’s movements, and corresponding visual feedback, gave the illusion that they owned the robot’s body — known by scientists as “body ownership transfer.”"}, {"type": "sentence", "content": "Research into illusions such as the rubber hand illusion and the virtual robot “can provide an invaluable tool for understanding the brain processes that modulate the sense of body ownership and experience of self,” say lead researchers Alimardani and Nishio."}, {"type": "sentence", "content": "But why is it important for science to have an idea of how people’s perception of their physical body may be false?"}, {"type": "sentence", "content": "Well, according to research, people’s view of who they are may — in a very literal sense — be influencing their immune system and damaging their health. This was proven in a 2011 study repeating the rubber hand illusion: Researchers recorded a lower temperature in the (real) “disowned” hand, and an increase in the body’s histamine production (involved in local immune responses). A 2014 study into autoimmune diseases, including rheumatoid arthritis and multiple sclerosis, produced further supporting evidence. It found that when the body fails to recognize itself, it may begin to self-destruct. “Autoimmunity is indeed the error of the immune system in recognizing its own cells as nonself,” says cognitive neuroscientist Marcello Costantini."}, {"type": "sentence", "content": "Improving our understanding of the mind’s perception of the body, and its impact on our physical well-being, may unlock the secrets of the immune system and long-term health."}], "topic": "neuroscience"}