{"title": "How to Break the Toxicity Pattern", "data": [{"type": "subtitle", "content": "These relationships are no joke"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*1tYHoNkbVVakiYBc"}, {"type": "sentence", "content": "Toxic, the word itself means poisonous. To anyone in a relationship with a person they love and trust, this description can seem drastic. How bad can it be? Sure, you fight sometimes, but that’s what healthy couples do. Maybe your partner pushes your buttons, but you tell yourself it doesn’t bother you. It’s important to know how far is too far."}, {"type": "sentence", "content": "What does poison do to you? It works its way into your system, discreetly. You might drink from the cup, pour yourself a refill. By the time you understand that you have ingested poison, it feels like it’s too late."}, {"type": "sentence", "content": "If you find you are working on your relationship tirelessly, and devote yourself to a partner who just doesn’t seem to care, this is a sign of toxicity. Your partner does not have to act violently to be a toxic person; the habits are emotionally damaging, too."}, {"type": "subtitle", "content": "Toxic Relationships: Defined"}, {"type": "sentence", "content": "If you are in a toxic relationship, these signs might hit close to home:"}, {"type": "subtitle", "content": "What to Do if You are Involved with a Toxic Person"}, {"type": "sentence", "content": "Once you have moved beyond the feeling of denial, you are likely going to stay firm between anger and confusion. How could they do this to you? The love you share holds empty promises of being amazing and wonderful. It is time to move forward now, for your well-being."}, {"type": "sentence", "content": "For any relationship to become salvaged, both people need to fix it. You can give it 110%, but if your partner cannot meet you halfway, the relationship won’t be healthy. Remember that more effort on your part won’t make up for the lack of effort on theirs."}, {"type": "sentence", "content": "A toxic relationship can change you as a person. Once vibrant and ready to take on the world, you have a more cautious approach now. Remember the person you were. If there were no consequences, would you enjoy being that person again?"}, {"type": "sentence", "content": "Don’t be fooled by empty promises of “trying harder” and making things work. They must take responsibility for the pain they caused you. Know your worth and what you stand for. If you don’t deal with these feelings now, they will come back with a vengeance."}, {"type": "sentence", "content": "Most importantly, you need to value your safety and mental health. If you get pushed to your limits, know that you do not have to put up with this. You are strong and valuable, an important being."}, {"type": "sentence", "content": "If you are in any danger and you cannot escape, reach out for help. Talk to someone about your situation. Call a helpline. The toxicity can quickly spread, but you don’t have to be on the receiving end any longer."}, {"type": "sentence", "content": "For more on mental health, relationships, and life, click here. Let’s stay in touch."}], "topic": "mental-health"}