{"title": "Introduction to the Business Pitch Deck", "data": [{"type": "sentence", "content": "A great and persuasive business pitch is the key factor for starting your business, especially for those looking for funding, and the pitch deck is as crucial as your face-to-face presentation. This article will show you some critical notions about how to create an appealing and effecting pitch deck."}, {"type": "sentence", "content": "The two most frequently asked questions, “what should be included?” and “how to make the slides impressive and effective?”, will be discussed in this article."}, {"type": "subtitle", "content": "What should be included?"}, {"type": "subtitle", "content": "1. It’s all about “problem-solving”"}, {"type": "sentence", "content": "(1) Where is the opportunity?"}, {"type": "sentence", "content": "a. Those unsolved problems or unmet needsThe word “opportunity” might be a little bit abstract, but the key concept is quite simple. There must be some unsolved problems or unmet needs that even the current solutions are still unsatisfying to the customers."}, {"type": "sentence", "content": "List no more than three issues you are going to solve corresponding to your priority or in the order you believe your solution has a better competitive advantage. Keep in mind, each issue should be a concrete concept but not too detailed. Also, the statements should always from the customers’ perspectives."}, {"type": "sentence", "content": "Beside simply list out the issues, there are two other common ways to make your statements feel more objective and convincing."}, {"type": "sentence", "content": "b. Market SituationAs the opportunities lie in those unsolved and unmet needs, a throughout understanding of the current market situation, such as available solutions and other primary competitors will be invaluable. This information helps you establish your strategy and target the right market as well."}, {"type": "sentence", "content": "I won’t recommend SWOT or other traditional analysis, instead, I think directly point out how those primary competitors try to solve the issues you have targeted would be the most simple and intuitive way. This gives the investors an overlook to the market, at the same time, demonstrates your capability to detect the competitors’ emphasis and make a difference, as nowadays almost all the investors understand the importance of differentiation."}, {"type": "sentence", "content": "I suggest making this part combined with the “competitive advantage” and put it after the “Business Model” slide."}, {"type": "sentence", "content": "-"}, {"type": "sentence", "content": "(2) How are you going to solve these problems?"}, {"type": "sentence", "content": "a. Solution.The “Solution” slide serves a disparate purpose to the “Business Model” slide. In the solution slide, you should indicate “how” you are going to address those issues and “what results/improvement” could be expected, which correlate to those problems mentioned in the “Problem” slide. The “how” will be the features of your product."}, {"type": "sentence", "content": "If you already have the prototype or lunch your product, you might leave the features in the “Product” slide and make the statement here more like a “ slogan”, or in other words, the takeaway of your solution."}, {"type": "image", "content": "https://miro.medium.com/max/3172/1*p1oWPleGSmJY5DDP2qiymA.png"}, {"type": "sentence", "content": "b. Product.This slide is optional, however, it would be great if you have something to demonstrate. You could build a prototype to illustrate the key features of your products."}, {"type": "sentence", "content": "c. Business Model. A business model is different from the revenue model, which is considered part of the business model, it demonstrates the relationships between all parties evolved in business activities, the value created to the customers, and also the generation of cash flow."}, {"type": "sentence", "content": "A clear diagram will be extremely supportive of better comprehension. If the idea is quite simple, directly show the revenue model is another option."}, {"type": "sentence", "content": "-"}, {"type": "sentence", "content": "(3) Why is your idea valuable? In other words, why you think your idea is superior to the others?"}, {"type": "sentence", "content": "a. Competitive AdvantageThis can be anything more than just the product itself and the features your competitors don’t have, being the first to the market or having years of experience in the field could all be your competitive advantage, even a more user-friendly interface. Nevertheless, the competitive advantages you highlight, to some extent, should have a higher entry barrier."}, {"type": "sentence", "content": "Furthermore, I like to add the following graph to not only illustrate the difference from the competitors but also reflect the marketing STP."}, {"type": "image", "content": "https://miro.medium.com/max/2900/1*NCGrNtQU8awXRl7eJTaJ2w.png"}, {"type": "sentence", "content": "b. Other AdvantageYou may also highlight your “absolute advantage”, for example, the patent your business owns."}, {"type": "subtitle", "content": "2. The team is as important as the product."}, {"type": "sentence", "content": "The management team is definitely the foundation of a successful business. In this slide, you should anticipate what the investors want to know. It’s kind like the Linkedin profile while looking for a job that all the information should be strongly connected to the work you are going to do."}, {"type": "sentence", "content": "It already became a standard that the “Team” slide will have the following information with professional, but not too formal, personal images."}, {"type": "subtitle", "content": "3. Feasibility should always be considered."}, {"type": "sentence", "content": "(1) Market Growth"}, {"type": "sentence", "content": "This section serves the purpose of not only showing if you have an explicit understanding of the market and the profitability of your business(present) but also the sustainability/potential(future) of your business. Some might divide this section into two parts, the market size/validation, and market growth."}, {"type": "sentence", "content": "The market size and validation indicates the “volume” and the “value” of the market, which should correspond to your marketing STP. There are many ways to show the data, one is providing the number of, for example, total users and the yearly revenue generated. Another commonly adopted way is showing the penetration rate from the whole market to your target market."}, {"type": "image", "content": "https://miro.medium.com/max/2904/1*XHPoO62htZLmK28avAL_mg.png"}, {"type": "sentence", "content": "As for market growth, using a dynamic diagram makes it more intuitive."}, {"type": "sentence", "content": "-"}, {"type": "sentence", "content": "(2) Financial Estimation"}, {"type": "sentence", "content": "A prediction/forecast on your financial situation is definitely required. The investors understand there are many uncertainties at this moment. The decisive part would be whether you make the estimation reasonably enough. The income statement and balance sheet will be a great support and even help you after you really start your business, but are not necessities at this moment. The total revenue of the upcoming three years would be enough."}, {"type": "sentence", "content": "I would write another article about how to make a reasonable financial report/forecast in the near future."}, {"type": "sentence", "content": "-"}, {"type": "sentence", "content": "(3) Fund Requirement"}, {"type": "sentence", "content": "To make sure your business survives even with poor performance, it’s better to have the capital that could last three years corresponding to your expense. This part could be merged with financial estimation."}, {"type": "image", "content": "https://miro.medium.com/max/2652/1*4R_nTfpeQd7iu7A7ncHwsA.png"}, {"type": "sentence", "content": "To conclude, here are the pages included but not limited to your business pitch (The order can be adjusted, but I would recommend arranging in this way)."}, {"type": "sentence", "content": "The total slides shouldn’t be more than 10 slides."}, {"type": "sentence", "content": "The order can be changed only if it is logical with the presentation, for example, I like to focus on the solutions so I would put the “Solution” right after “Problem”. I do see some would introduce the current market and competitors after the “Problem” slide in order to show the opportunities."}, {"type": "subtitle", "content": "How to make it impressive and effective?"}, {"type": "subtitle", "content": "1. Less is more"}, {"type": "sentence", "content": "Remember, there is a difference between a normal presentation and a pitch deck, that is exactly why we don’t simply call it “business presentation”. The pitch deck is aimed to give the essential information to the “investors”. Thus, always ask yourself what is the most important thing the investors might want to know. This mindset also applies to creating each slide of your pitch deck."}, {"type": "sentence", "content": "(1) Focus on one topic/idea on one page"}, {"type": "sentence", "content": "Every statement on the same page should surround one topic/idea. It’s obvious all the statements in the “Problem” slide are about the unsolved problems or unmet needs. If you want to further discuss the current solutions in the market, you should put the information into the “Market and Competition” slide."}, {"type": "sentence", "content": "This concept also applies to the statements in the slides. Each sentence or number tells only one idea."}, {"type": "sentence", "content": "(2) Don’t put too much information"}, {"type": "sentence", "content": "There shouldn’t be more than three statements in one page. Also, I recommend using only one sentence, graph, or the number for one statement."}, {"type": "sentence", "content": "(3) Be a statement or conclusion, not an explanation."}, {"type": "sentence", "content": "We might be used to “storytelling” in our daily lives, starting from the situation all the way down to the result. However, the pitch deck and even an effective presentation start from the conclusion. The explanation and details are left to your face-to-face presentation."}, {"type": "image", "content": "https://miro.medium.com/max/3156/1*obFZFblup4vyisl8elA6mQ.png"}, {"type": "sentence", "content": "(4) Use diagrams, graphs, and images wisely"}, {"type": "sentence", "content": "The diagrams or graphs could make the abstract idea more concrete, but don’t rely too much on these expressions. Use these tools only if they do ameliorate the presentation not because they look fancy."}, {"type": "sentence", "content": "-"}, {"type": "subtitle", "content": "2. Consistency creates a stronger impression"}, {"type": "sentence", "content": "(1) Identical layout and color"}, {"type": "sentence", "content": "This doesn’t mean that you can only use the same layout or even one or two colors through your presentation. What it means is the slide should have an identical “characteristic”. For example, if you prefer your slide with equally-divided sections, you may use different formats to present those sections. It might be columns, images, or icons."}, {"type": "image", "content": "https://miro.medium.com/max/2912/1*qVt3oHNT6yito_nIyB5CDA.png"}, {"type": "image", "content": "https://miro.medium.com/max/2900/1*57WVrnSZUp2zW_xt34lv0Q.png"}, {"type": "sentence", "content": "(2) Put your logo at the same spot all the time"}, {"type": "sentence", "content": "-"}, {"type": "subtitle", "content": "3. Keep asking yourself “what kind of takeaway you want to create?”"}, {"type": "sentence", "content": "Imagine yourself the investor, who has no idea about anything from your business. What is your impression, or to be more explicit, what would you describe this business idea after reviewing the presentation? That’s an innovative business model? The team is professional and reliable?"}, {"type": "sentence", "content": "You could practice your presentation with the pitch deck to your friend and ask their feedback to see if they feel the same as what you try to express."}, {"type": "subtitle", "content": "There is no so-called perfection, but you could always make it better"}, {"type": "sentence", "content": "The pitch deck is one of the elements to the first step of starting your business, successful fundraising, there are still many details you need to pay attention to. The face-to-face presentation plays another decisive role, which I would like to share in the future."}, {"type": "sentence", "content": "It’s not easy to create a “perfect” presentation, not to mention a perfect business idea. Don’t get distressed if you are questioned or doubted, all these experiences would make the business idea more mature and help your entrepreneur dream come true."}], "topic": "startups"}