{"title": "Marketing aspects to consider as a UX designer", "data": [{"type": "sentence", "content": "Debates between marketers and UX designers are not uncommon. I’ve encountered a few debating over features or interactions like pop-ups, newsletter signups, etc.. Instead shouldn’t both teams, Marketing as well UX Design, focus on the people ensuring they are having a great experience using the product? Doing their best to ‘convince’ not-yet users by a great experience to become full-time users?"}, {"type": "sentence", "content": "It is clear that UX Designer have to take users’ aspirations as well as business goals into consideration. Often it is a fine balance for UX Designers advocating users and taking care of business goals simultaneously. As mentioned above occasional pop-ups forms on websites are required, even if it interrupts the user experience, as a method to reach readers to convert them to regular users. Potentially it is even fair to say that Marketing and UX Design are two sides of the same coin. In some sort, both practices focus on and design for their users or potential users."}, {"type": "image", "content": "https://miro.medium.com/max/7422/1*LC4_qZRSG2_MDmgjVr4WnQ.jpeg"}, {"type": "sentence", "content": "Firstly, I would like to dive deeper into the actual differences between UX Designers and Marketers. Secondly, I‘ll point out how Marketing and UX teams should work hand in hand by taking Marketing aspects into UX practices."}, {"type": "subtitle", "content": "Differences between UX Design and Marketing"}, {"type": "sentence", "content": "Despite the overlap between marketing and UX design, there are a few key differences that I’d like to point out that make their practices very different."}, {"type": "subtitle", "content": "1. Group focus vs individual focus"}, {"type": "sentence", "content": "Marketers usually validate solutions with focus groups and they are concentrating on statistically significant numbers. On the contrary Designers will observe individual users and their behavior to uncover unmet needs and design solutions for them. Steve Jobs once famously said:"}, {"type": "subtitle", "content": "2. Conversion rate vs user experience"}, {"type": "sentence", "content": "Marketing focuses ultimately on increasing conversion rates which ideally equals an increase in sales. In comparison, UX Designs’ main focus is on building the best possible experience for the users. Sarah Lewis has said it quite nicely in her article Design vs Marketing:"}, {"type": "sentence", "content": "Those differences are subtle but important. Marketers often pick up where designers leave off. Once a prototype is established by the design team, the marketing team will test this with focus groups to find out if the idea scales."}, {"type": "subtitle", "content": "Taking Marketing aspects in UX Design practices"}, {"type": "sentence", "content": "As I’ve mentioned above Marketing and UX Design differs in the approach to the customer experience and the end goal. But how can UX Designers take Marketing aspects into consideration and implement them into the design rather than handing over a prototype without thoroughly thinking about business goals (i.e. conversion rate)?"}, {"type": "subtitle", "content": "1. Focus on the first impression"}, {"type": "sentence", "content": "As the word already implies a first impression only happens once. Presumed the product is distributed via a website the ‘above the fold’ area should be on point. According to the eye-tracking study of the Nielsen Norman Group 57% of viewing time happens above the fold. Only if the content is compelling enough the viewer continues scrolling."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*TD2U-6L_cXn7N5GpXJmHCw.png"}, {"type": "sentence", "content": "Therefore it is crucial to get it right. Whether this first impression is a good or a bad one depends on a lot of factors: website speed, structure, colors, spacing, scrolling, symmetry, amount of text, fonts, and more. While it might not always be possible to change all of these factors at once there are a few things UX Designers can modify to make a stronger impression on first-time visitors."}, {"type": "sentence", "content": "Zara is doing a great job and is addressing all of the four points mentioned above. There is no visual overload, only a single photograph is being used, the Designers used a harmonious color palette, they are encouraging interaction and scrolling through visual cues and alternative navigation styles."}, {"type": "subtitle", "content": "2. Embrace Clarity and Ease of Use"}, {"type": "sentence", "content": "While UX Designer must strive for simplicity in their website design, they should not forget that ‘clarity in communication’ and ‘ease of use’ are the ultimate end goals. Marketers are focused on conversion rates. If ‘clarity in communication’ and ‘ease of use’ is being used effectively by UX Designer, Marketers can focus on other areas. Additionally, a great foundation between those two departments will be established when working hand in hand. I’d like to provide an example for communication with clarity below:"}, {"type": "sentence", "content": "The first option provides a shorter CTA text, yet the user needs to read the sentence below the question to make a decision. The second option however, provides self-explanatory buttons that streamline the whole dialogue. How can UX Designer apply this throughout the whole design?"}, {"type": "sentence", "content": "In Leadpages example the hierarchy is clear. They are using a big headline, using the serif typeface ‘Value Serif’ to catch their user's attention. The copy is clear, concise and on point. By having only one button filled with color they are directing the user's attention to the ‘Start a Free Trial’ button, which by clicking it, redirects straight to the pricing/ sign-up page."}, {"type": "sentence", "content": "To sum it up, a UX Designers' goal is to create captivating experiences for the users AND meets business goals such as conversion rates. Both UX Designer and Marketers should welcome collaborations as both departments can learn from each other having different focuses on the users."}, {"type": "sentence", "content": "Thanks for reading! If you want to collaborate, talk about UX design, or just chat, hit me up via LinkedIn."}], "topic": "design"}