{"title": "Unexpected final piece to unlocking self-driving cars: human oversight", "data": [{"type": "subtitle", "content": "The intermediate phase of autonomy with occasional, remote human-controlled vehicles will have incredible market values."}, {"type": "sentence", "content": "The biggest cost for gig driving economics right now is the driver time. This is a cost both for the individual and the organization — the driver only has a finite amount of time (in one car), and paying one individual per ride is causing rideshare apps to present some impressive losses (source and source). To hold market value, Uber rides are as much as half off in some cities (Uber cost tool and Uber San Francisco fees)."}, {"type": "sentence", "content": "Mobility companies signal that removing the driver is a path to profitability, but what about the intermediate phase with few drivers for many cars?"}, {"type": "sentence", "content": "This article shows you:"}, {"type": "image", "content": "https://miro.medium.com/max/1950/1*_MYkl2PKn_4tMD-PX4DwTw.jpeg"}, {"type": "subtitle", "content": "Brief history of autonomous cars"}, {"type": "sentence", "content": "From Robin R. Murphy’s “Autonomous Cars in Science Fiction,” 2020. Paradise and Iron predicted that every moving system on an island paradise was fully autonomous — there wasn’t even a steering wheel. This extends to more than cars, this means that cranes are autonomous, construction is person-less. Full autonomy systems will touch more than self-driving cars."}, {"type": "sentence", "content": "Self-driving cars are the case study we focus on because it’s what we spend most of our time in (and there’s been more than 270 million registered vehicles in the US alone in 2018). The story of self-driving cars crossed with engineering started with the DARPA Grand Challenge in 2004. A 150-mile long course through the desert."}, {"type": "sentence", "content": "In 2004, 0 cars made it 10 miles."}, {"type": "sentence", "content": "In 2005, a couple finished the course. The video below shows you how different the view of a self-driving car was then from now. This was pushing the limits of autonomy."}, {"type": "sentence", "content": "Now, self-driving cars are a much more defined area of research and development. This isn’t an article about where self-driving cars are at a technological level. The government even has websites now defining that."}, {"type": "sentence", "content": "This is an article that focuses on one patch on one problem."}, {"type": "sentence", "content": "The problem — Corner cases: self-driving cars are bad at dealing with unforeseen environments like construction, fallen trees, road damage, etc."}, {"type": "sentence", "content": "The solution — Remote control: call a human in to figure out how to maneuver around the rare obstacle."}, {"type": "sentence", "content": "Why this works: with enough sensors and computers, we can make self-driving cars incredibly safe. When they aren’t sure of something, they go slow. When they’ve never seen something before, they stop."}, {"type": "sentence", "content": "A stopped car isn’t very useful though. That’s when we have human overseers call in, look at the video feed, and drive around the challenge. Everyone wants their Tesla to be fully autonomous, but we need some way to get data for the .0001% of miles that the car hasn’t seen, or may never see."}, {"type": "subtitle", "content": "Teleoperation of autonomous cars"}, {"type": "sentence", "content": "There’ll be office buildings for Uber drivers (or maybe they’ll be outsourced to India). Here, the drivers will be sent mini-driving challenges. The mini-challenges will be hard for a computer, but they’ll be trivial for a human. Something like: there’s a man with a slow sign and the road is now one way, or: there’s a trash can in the road. The human operator needs to assign 3 waypoints around the obstacle."}, {"type": "sentence", "content": "In a testing fleet, say a car is stuck at a stop sign or unknown obstacle 10% of a time. That means 1 human could cover 10 cars ideally, but say 5 cars to be safe. That’s 1/5 the driver cost that is making Uber burn cash."}, {"type": "sentence", "content": "This factor scales incredibly well. Consider a beta round of autonomous vehicles with only 1% unknown vehicles. Now 1 driver controls 50 cars. This scaling will only improve with time. It results in a dramatic reduction in costs."}, {"type": "sentence", "content": "This would be a paradigm shift in self-driving cars. The technology we have is already way closer to this — it just depends on the level of interruption you are okay with. I would be much more comfortable letting a system take over that is safety first, with back up human supervision. Wired is the only publication I found giving this application the attention it deserves. Here is some continued reading."}, {"type": "subtitle", "content": "Who will be first to self-driving cars?"}, {"type": "sentence", "content": "This is an open debate on any self-driving car article. Who will do it first? I think the answer is someone we haven’t seen yet, but it depends on what you mean by “solving autonomous driving.”"}, {"type": "subtitle", "content": "Tesla: The data-driven approach"}, {"type": "sentence", "content": "By getting enough data, Elon Musk bets that end-to-end deep learning approaches can safely control Tesla cars. He also thinks that it’ll be here way before any of its competitors (I am a little skeptical). This is a highly application-specific approach and has a high potential for increasing the value of the cars."}, {"type": "sentence", "content": "It isn’t clear how Tesla plans on dealing with corner cases. Neural networks are essentially memorizing data, so how do they memorize data they haven’t seen?"}, {"type": "subtitle", "content": "Waymo: The autonomy-stack blueprint"}, {"type": "sentence", "content": "Many sensors, over-engineered safety, and a long term vision. Waymo is not trying to compete with Tesla, it is trying to make a safe and reliable autonomy blueprint that extends beyond just self-driving (and it getting some financial backing to do it). What is an “autonomy-stack”? It is a collection of intelligent algorithms: one for planning which roads to take, one for controlling the steering column, one for controlling the motor power, etc. Waymo wants to do it all and make their cars."}, {"type": "sentence", "content": "This is a long-term approach. If it works for passenger cars, it’ll work for trucks, delivery drones, construction management, and more."}, {"type": "subtitle", "content": "Small Autonomy Startups: Filling economic niches"}, {"type": "sentence", "content": "Other startups will fill in the gaps between data-driven, car specific approaches, and engineering blueprints. There will be many financially viable applications here."}, {"type": "sentence", "content": "The first to get self-driving taxi’s in a specific city: huge."}, {"type": "sentence", "content": "The first to get safe, autonomous delivery drones (for Amazon or food): huge."}, {"type": "sentence", "content": "The first to get closed-course self-driving cars (think airport shuttles): huge. Self-driving cars in a confined area have way fewer corner cases to encounter and human experts called in can handle them with ease. Optimus Ride wants to bring autonomous vehicles to small, high traffic areas. By understanding that the autonomous system will have limitations in the early years — and designing for human assistance in the autonomy stack — they can roll out sooner."}, {"type": "sentence", "content": "There are so many of these cases. Let humans patch over the corner cases and get to a viable product sooner."}, {"type": "sentence", "content": "Inspired by an amazing conversation from Lex Friedman and Sertac Karaman. Watch it here."}], "topic": "artificial-intelligence"}