{"title": "How to Become The Freelancer Clients Crave", "data": [{"type": "subtitle", "content": "5 steps to building a better freelancing business"}, {"type": "sentence", "content": "There are two types of freelancers: One kind requires you to lower your price, accept any work that comes your way, and adopt a G.S.D.F. Mode (Get Sh!t Done Fast Mode). Another kind requires you to set a fair price, select work that interests you, and adopt a G.S.D.W. Mode (Get Sh!t Done Well Mode)."}, {"type": "sentence", "content": "Which kind to you want to be?"}, {"type": "sentence", "content": "When I started out in freelancing, I was the first kind. Most newbie freelancers are. When one difficult client emailed me saying “put the baby down and get your head in the game” after I made an honest mistake, I decided to change."}, {"type": "sentence", "content": "I wanted to become a freelancer clients crave, not the freelancer clients push over."}, {"type": "sentence", "content": "To become a freelancer clients crave, I took myself more seriously and trusted that what clients want more than anything isn’t just a service or final product, they want to succeed — And it’s our job as freelancers to help them do just that."}, {"type": "sentence", "content": "Here are the steps you need to take if you want to do the same."}, {"type": "subtitle", "content": "Step 1: Identify your client’s goals and get your client closer to them month after month"}, {"type": "sentence", "content": "Sure, your client might bring you on for one straightforward project with a few deliverables, but understand this is just a small piece of a much larger puzzle."}, {"type": "image", "content": "https://miro.medium.com/max/5938/1*LeyNyp8FEB3n_SOxlB0GDg.jpeg"}, {"type": "sentence", "content": "The first step of being a better freelancer (and locking yourself into a longterm deal) is to identify what it is your client is trying to achieve."}, {"type": "sentence", "content": "Maybe they’ve asked you to design a logo for a new website. Why are they building a new website in the first place? Maybe they’ve requested you build an evergreen funnel. What metrics are they looking to hit?"}, {"type": "sentence", "content": "Once you identify their larger scope goals, offer your unique skill set to help them achieve those goals."}, {"type": "sentence", "content": "I work with experts in specific fields of knowledge who want to create membership sites or eLearning sites for their audience. At the end of the day, they aren’t looking for a website, they are looking for a tool that’ll grow their message, teach their audience, and free up more of their time."}, {"type": "sentence", "content": "Not only do I build these custom websites, I offer to help jump-start their mailing lists, create content, and build out their product “ecosystem” to help them succeed."}, {"type": "sentence", "content": "Each client I take on has their own needs but the larger goal is always the same."}, {"type": "sentence", "content": "Have a broader view of how your work fits into your clients' overall goals. If you can do that, you’ll be doing a lot more than designing logos."}, {"type": "subtitle", "content": "Step 2: Educate your client"}, {"type": "sentence", "content": "You aren’t a magician. Sure, maybe you have a few secret tricks up your sleeve, but there’s no reason to keep your client guessing how you do what you do."}, {"type": "sentence", "content": "As I mentioned, I build membership and eLearning sites. There are certain simple configurations my clients can do on their own without needing me all the time. I want them to feel that they have some control."}, {"type": "sentence", "content": "In other words, I don’t want my clients to resent that they are tied down to me. I want them to become competent users of their website. So I take great care to educate them every step of the way."}, {"type": "sentence", "content": "Educating your clients can take on any of the following:"}, {"type": "sentence", "content": "It may seem like bad business to teach them to do what you do, but I’ve never found that to be the case."}, {"type": "sentence", "content": "Instead, educating your clients builds trust, and trust builds longer business relationships. Most of my business now is either from repeat clients or referrals from clients who speak highly of me."}, {"type": "sentence", "content": "I call that good business."}, {"type": "subtitle", "content": "Step 3: Retainers make everyone happy"}, {"type": "sentence", "content": "I don’t like tracking my hours."}, {"type": "sentence", "content": "For one thing, it makes any time spent doing things I enjoy feeling like I’m losing out on revenue. For another, it treats my work as a buffet, pick out what you want when you want."}, {"type": "sentence", "content": "Clients are busy. Most of the time they are thinking about their business and their work, not yours. Having a retainer does a few things:"}, {"type": "sentence", "content": "Remember step one about identifying goals? Here’s how you pitch your retainer to a client:"}, {"type": "sentence", "content": "Typically, I will reduce my hourly rate by 20% for a retainer. It seems like a huge cut, but you’re paying for the consistency. And I only pitch a retainer if I’ve already proven my worth after a project and I’ve enjoyed working with the client."}, {"type": "subtitle", "content": "Step 4: Communicate better"}, {"type": "sentence", "content": "Guess what, no one wants to read your 5,000-word email."}, {"type": "sentence", "content": "How you communicate and how often are key to a good relationship with a client. I try to keep a few things in mind:"}, {"type": "sentence", "content": "With some clients, I am juggling multiple priorities and timelines. It’s my responsibility to keep my clients up to speed without overwhelming them."}, {"type": "sentence", "content": "I don’t use Slack because I don’t want to give my clients unfettered access to me. That’s why I still prefer good old email. However, instead of drafting long-winded emails to explain something, I use Loom."}, {"type": "sentence", "content": "Loom is a simple screen recording plugin that allows me to record my screen and talk. It's easier than emailing “On the site, about 2/3 of the way down I added a new opt-in button. Let me know if you like the color.” I can just press record and show them."}, {"type": "sentence", "content": "I even use Loom for basic communications, here’s a recent example:"}, {"type": "subtitle", "content": "Step 5: Care about your clients’ success"}, {"type": "sentence", "content": "I built an eLearning website for a client who ended up making well over $100,000 with it. At first, I thought Dang, I should have charged more. But then I realized, no, I charged a fair rate for my efforts and the 100 grand was the result of her countless years spent in her particular field of knowledge. It was her success, not mine to pilfer from."}, {"type": "sentence", "content": "Guess what, she’s one of my repeat clients."}, {"type": "sentence", "content": "When I started out in freelancing, all I cared about was shipping my work and finding the next client. I quickly found out that if you care about your clients’ success, you succeed as well."}, {"type": "sentence", "content": "Not only does caring about your clients’ success show in your work, but it also — and I keep harping on this — builds deeper trust which is the ultimate freelancing trade secret."}, {"type": "sentence", "content": "It’s also just a good human thing to do."}, {"type": "subtitle", "content": "Go, be a freelancer clients crave"}, {"type": "sentence", "content": "If you want to transform your freelancing business, it starts at the top with you. Find what your clients want to achieve and help them achieve it. Always educate your clients to become competent users of your products or services. Get them on a retainer. Communicate frequently and clearly. And lastly, care about your clients."}, {"type": "sentence", "content": "If you can do all that, you’ll find yourself in a much better position and working with clients who adore you. If I missed any freelancing tips, please feel free to share them in the responses below."}, {"type": "sentence", "content": "I’m still learning along the way, so be sure to keep in touch to learn more."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}