{"title": "Leadership in a disruptive crisis", "data": [{"type": "subtitle", "content": "As startups assess their post-Covid purpose, founders need a framework for decision making that will prepare them for the recovery."}, {"type": "image", "content": "https://miro.medium.com/max/1462/1*aWVmP4BqXgsyCnJYqWVBbA.jpeg"}, {"type": "sentence", "content": "The unprecedented nature of the current crisis has created a challenge of unique complexity. Every business has been affected, and so has almost every aspect of normal life.For many startups, especially those that were in touching distance of product/market fit, everything has changed. The business plan that showed the way ahead until very recently no longer applies."}, {"type": "sentence", "content": "Many early-stage businesses are grappling with a new question that didn’t even exist two months ago: Why is our business essential in a post-Covid world? ‘Nice to have’ is just not going to work."}, {"type": "sentence", "content": "You know if you have a ‘nice to have’ proposition if customers aren’t returning your calls or promised orders have disappeared. For those trying to convince themselves that these effects are just temporary and all will be well once COVID subsides, think again. Hope is not a strategy."}, {"type": "sentence", "content": "A test of leadership"}, {"type": "sentence", "content": "Navigating our way through this crisis is a true test of leadership. There is no tried and tested playbook to pull off the shelf. With no definitive endpoint, building a new plan that galvanises the team and customers alike will seem like a huge act of faith, so we need some structure to help build the route forward. To create milestones that feel achievable."}, {"type": "sentence", "content": "A framework recently proposed by Gartner provides a useful starting point. Looking at this model through the lens of an early stage business, we can see how this provides a phased approach that founders can use to lead the recovery strategy."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*bbsBroUHUfbQMfz0.png"}, {"type": "sentence", "content": "The beauty of this model is its simplicity. A strong visual picture is powerful when rallying the team and investors — it provides a constant reference point and an overall structure for planning the roadmap ahead. As Gartner reports:"}, {"type": "sentence", "content": "“Research by social and organizational psychologists and medical professionals points out that recovery is a process rather than an event. That process has distinct phases as individuals and organizations work their way through a crisis event and its implications. The phases presented here are based in part on those observations and research. COVID-19’s influence on economic conditions influences how companies move through these phases.”"}, {"type": "sentence", "content": "We can see how these phases relate to the actions that many startups have been taking."}, {"type": "sentence", "content": "Phase 1: React and Respond.Most are through this phase. Fearing the worst, runways have been extended through all manner of cash conservation initiatives. Where possible, employees are now working from home and the transition to a virtual office operating environment has been made."}, {"type": "sentence", "content": "In the Gartner model, leaders guide their teams through this initial phase by:"}, {"type": "sentence", "content": "Building a new fact base is often the most emotionally wrenching step: Just a short time ago you felt this was all under control. You had invested months converting assumptions into facts as you neared Product/Market fit. Most of that has just gone out the window."}, {"type": "sentence", "content": "Phase 2: Redirect to New Realities.As we continue on the downward slope, a more thorough impact assessment must begin as customer demand falls. The focus is on getting into a position to make key decisions and take action."}, {"type": "sentence", "content": "The current business model must examined as the scale of the impact becomes more vivid. Rapid evaluation of the changes required to survive then thrive is now needed."}, {"type": "sentence", "content": "As we discussed in our earlier blog, the big question now looms; is it time to pivot your startup? If the underpinning problem/solution thesis has been totally swept away, a full pivot will be required. If there has been a less radical change in your target market, a partial pivot may be needed. Either way, changes must be made."}, {"type": "sentence", "content": "As the reworked business model is implemented, the next challenge is knowing when you have ‘bottomed out’. You will be monitoring every metric you can get your hands on to see if fortunes are changing. Brutally honest situational awareness is paramount. However, expect a period of real ambiguity and uncertainty as changes will need time to take effect."}, {"type": "sentence", "content": "Phase 3: Rebound to the Future.Just saying these words right now feels very odd. Unless you are in one of those few sectors that are surging ahead because of Covid, this might seem like wishful thinking."}, {"type": "sentence", "content": "If you have successfully created a bridge to this point you will see customer demand taking hold. This may not be for the same products or services you were planning a few months ago, or even for the same customers, but you will be on the recovery path."}, {"type": "sentence", "content": "Leadership observations"}, {"type": "sentence", "content": "Through this crisis we have gained enormous insight into how effective startup leaders operate. We have helped founders and their teams through some huge changes and seen them operate at close quarters. Even though many of these projects are still in progress, the standout attributes that are driving young businesses forward against these strong headwinds are already becoming clear:"}, {"type": "sentence", "content": "Above all, move quickly — but remember to take everyone with you. Use simple and repeatable methods with your team to discover and assess options. Be consistent. This fosters openness, trust, and contribution."}, {"type": "sentence", "content": "In summary:"}, {"type": "sentence", "content": "About the author: John Hall is CEO and co-founder of Duet Partners, a corporate finance firm that provides specialist funding support to high growth technology companies. His 30-year tech career began with major US semiconductor and software companies, and was based in the Valley during the late ‘90’s. Before Duet he was CEO of a VC-backed consumer electronics company, sold in 2009 following several rounds of capital raising. In the past 10 years he has advised dozens of founders on the startup to scaleup journey and is a retained Board advisor to a number of UK technology companies."}], "topic": "startups"}