{"title": "Playful Lessons Learned from Running Out of Gas. Who Runs Out of Gas Anymore?", "data": [{"type": "subtitle", "content": "Here’s what happened"}, {"type": "image", "content": "https://miro.medium.com/max/5120/1*t3ybKv1KdJl3QLP9Va8_Ww.jpeg"}, {"type": "sentence", "content": "My husband and I love classic cars and trucks and have always owned one. None of our classics have been fancy or expensive. They all had to be “good runners”, fairly reliable. (Because really old stuff isn’t always reliable.) They all were cars or trucks we could drive every day or go for a long Sunday drive in."}, {"type": "sentence", "content": "We currently own the old truck in the image above. It’s a 1962 Chevy C10. The year I was born. 57 years old."}, {"type": "sentence", "content": "We love owning and using our classic truck because it makes us smile."}, {"type": "sentence", "content": "We smile looking at. It is so cute! It’s got an old bench seat across the width of the truck. It has a stick shift on the wheel shaft. Extremely basic knobs. Roll down windows. No air conditioning or heat. But it stays surprisingly cool in the summer with the windows rolled down and warm in the winter from the engine heat."}, {"type": "sentence", "content": "We smile when we go for a drive. It’s got a nice sound and a nice feel. We smile because it makes us slow down physically and mentally."}, {"type": "sentence", "content": "It. Just. Makes. Us. Smile. So. Much."}, {"type": "sentence", "content": "And, apparently, makes most everyone else who sees it smile, too."}, {"type": "sentence", "content": "We get waves, thumbs-ups, and lots of “Great truck!”"}, {"type": "sentence", "content": "I love that we can spread a little sunshine from just an old truck."}, {"type": "sentence", "content": "When my husband and I play tennis together, we drive it to the tennis courts."}, {"type": "sentence", "content": "Last year, we drove it to the tennis courts, played tennis together, and decided to drive through town on the way home. We live on the outskirts of a college town. Our favorite sandwich shop was in town and we decided to stop on the way home."}, {"type": "sentence", "content": "We stopped at a red light at one of the busiest intersections in town. The light turned green, we slowly moved ahead with the traffic….."}, {"type": "sentence", "content": "And. The. Truck. Died."}, {"type": "sentence", "content": "The engine stopped."}, {"type": "sentence", "content": "We coasted to a stop in the middle of the intersection."}, {"type": "sentence", "content": "My husband turned to look at me with that expression all men use when facing their wives when they may have done something wrong: fear, horror, dismay, I’ve-been-caught, Oh-No!"}, {"type": "sentence", "content": "We had run out of gas."}, {"type": "sentence", "content": "Who runs out of gas these days, huh?"}, {"type": "sentence", "content": "I’m going to pause the story here to give you some background…"}, {"type": "sentence", "content": "My husband is an amazing, handy, fix it guy, especially with our old cars and trucks. This is a skill and ability that I really admire and respect about him. (I am not Handy. At. All. )"}, {"type": "sentence", "content": "The fuel gauge had been broken for several weeks. In order to replace the fuel gauge, he needed to pull out the steering wheel, and just didn’t want to bother with it yet. It was a big project he was putting off. He was inserting a stick in the gas tank to see if there was gas or not."}, {"type": "sentence", "content": "Hello? How many of us can remember using a stick to measure how much gas we have left? Uh, anyone my age or older. So, yes, old farts. This makes me feel so old."}, {"type": "sentence", "content": "He forgot to use the stick prior to taking this trip to the tennis courts."}, {"type": "sentence", "content": "We’ve been married 28 years. We have never raised our voices with each other, yelled at each other. We have never said ugly words to each other that we would later regret. Never."}, {"type": "sentence", "content": "I know this is one of the reasons we are still married. We treat each other with courtesy and respect."}, {"type": "sentence", "content": "Yet, after running out of gas that day, he looked at me as if I might raise my voice and call him names."}, {"type": "sentence", "content": "What?!"}, {"type": "sentence", "content": "Okay, back to the story…"}, {"type": "sentence", "content": "He waited for my response."}, {"type": "sentence", "content": "And waited."}, {"type": "sentence", "content": "I smiled at him and said, “Honey, what is really great about this problem?”"}, {"type": "sentence", "content": "He smiled back at me and said, “I really love you right now.”"}, {"type": "sentence", "content": "You see, I am a life coach."}, {"type": "sentence", "content": "I studied life coaching because I not only wanted to help others, but I wanted to learn and use all the life coaching tools in my own life."}, {"type": "sentence", "content": "And, I do."}, {"type": "sentence", "content": "Powerful questions are part of my life coaching toolbox."}, {"type": "sentence", "content": "This question: What is really great about this problem? is one of my favorite life coaching questions that I have used over and over in our life, marriage, travels, trials, and tribulations."}, {"type": "sentence", "content": "Serious circumstances and not-so-serious circumstances…like running out of gas in the middle of an incredibly busy intersection."}, {"type": "sentence", "content": "It is a great question."}, {"type": "sentence", "content": "I said, “The first thing that is really great about this problem is that you have me here with you. We are in this together.”"}, {"type": "sentence", "content": "In our marriage, travels, trials, and tribulations, one of our lessons is that a problem shared with each other is halved and feels much lighter and easier to handle. We have found this to be true for us."}, {"type": "sentence", "content": "It was 1:00 pm and students, faculty, staff, and workers poured out of the nearby buildings and were crossing the intersection."}, {"type": "sentence", "content": "Hundreds. Of. People."}, {"type": "sentence", "content": "Swarms. Of. People."}, {"type": "sentence", "content": "He said, “You move over to steer, while I push.”"}, {"type": "sentence", "content": "As he stepped out of the car, several students yelled out asking if we needed help? We immediately had fifteen guys helping to push the truck out of traffic up onto the wide sidewalk."}, {"type": "sentence", "content": "This was the second great thing about this problem — lots of help. Friendly help."}, {"type": "sentence", "content": "Everyone was smiling!"}, {"type": "sentence", "content": "Another great thing about this problem — we spread smiles!"}, {"type": "sentence", "content": "No one honked or yelled at us. The backed-up traffic waited patiently while our newfound friends helped push the truck off the road. Several people rolled down their windows and said things like “Great truck!” “Love the truck, man!” Many waved and smiled."}, {"type": "sentence", "content": "We have AAA. Another great thing about this problem. I called to ask them to bring us gas. There are no gas stations in the middle of our college town. The AAA call center said it would take an hour for gas to be delivered."}, {"type": "sentence", "content": "Then, as we waited, we started playfully coming up with other things that were really great about this problem."}, {"type": "sentence", "content": "It was a beautiful, sunny, warm day."}, {"type": "sentence", "content": "Many students and faculty stopped to admire the truck, smile, take a picture, or tell us a story about an old truck in their family."}, {"type": "sentence", "content": "At least a dozen men — young and old — stopped to tell us they had restored an old car or truck with their father. They showed us pictures. We heard wonderful, heartfelt, detailed stories about bonding with their dad over a truck restoration."}, {"type": "sentence", "content": "We loved hearing these stories, sharing truck talk, feeling the nostalgia with them. Everyone took a picture of our truck. All of them, whose dad was still alive, said they were going to call their father tonight to reminisce about old trucks. Wow, so cool, huh? Another great thing about this problem."}, {"type": "sentence", "content": "University police drove by twice, rolled down the window, and just asked if we were okay. No tickets, citations, scoldings, or warnings. We were taking up the whole sidewalk in a remarkably busy part of town. Another great thing about this problem."}, {"type": "sentence", "content": "Another great thing about our problem was that we were not in a hurry. No afternoon appointments, no where we had to be, no phone calls to make."}, {"type": "sentence", "content": "We were delighted with ourselves, our truck, and what was happening in life at that moment!"}, {"type": "sentence", "content": "After about an hour, AAA arrived with our gas."}, {"type": "sentence", "content": "One gallon."}, {"type": "sentence", "content": "One gallon was free with our membership."}, {"type": "sentence", "content": "But wait!"}, {"type": "sentence", "content": "We could buy one more gallon from him for five dollars!"}, {"type": "sentence", "content": "Hmm. I could have gotten upset at five dollars a gallon, because at the time, gas was about two dollars a gallon, but I was so in the flow of what was great about this problem, that I said, “How wonderful! Another. Gallon. Yes!”"}, {"type": "sentence", "content": "Even the AAA guy had an old truck story to share with us."}, {"type": "sentence", "content": "We poured our two gallons into the gas tank, started up that old truck. Traffic waited, with smiles, while we pulled off the sidewalk and into the street."}, {"type": "sentence", "content": "We made our way to the nearest gas station to fill up. Still smiling."}, {"type": "sentence", "content": "We had lunch at our favorite lunch shop. Still smiling."}, {"type": "sentence", "content": "We kept coming up with what was great about this problem! For another week! Laughing and smiling."}, {"type": "sentence", "content": "And, yes, my husband fixed the gas tank gauge that week."}, {"type": "sentence", "content": "He thought the parts he needed would cost a lot, but they were easily found and less than five dollars. Another great thing about our problem."}, {"type": "sentence", "content": "A year later, we still smile at each other about this story. When we drive through that intersection, when others smile and waive at us, when we just go for a drive to slow down and feel good. We smile."}, {"type": "sentence", "content": "A serious situation or a silly situation, this is a powerful question."}, {"type": "sentence", "content": "What is really great about this problem?!"}, {"type": "sentence", "content": "The more answers, the more powerful your shift in mindset. The more playful and silly the answers, the more playful and delightful the shift in mindset."}, {"type": "sentence", "content": "And, yes, sometimes the small things in life become the big things that we reminisce, and smile, about that most."}, {"type": "sentence", "content": "I am a Life Coach & Small Business Coach. I help others get clear on the life and business they would love to manifest, know that they can have it, and help them choose it. Be sure to get all my articles, stories, tips, tools, and inspiration by joining my newsletter here."}], "topic": "mindfulness"}