{"title": "The mystical unicorn designer", "data": [{"type": "subtitle", "content": "Are you still hunting?"}, {"type": "image", "content": "https://miro.medium.com/max/1684/1*-gH0fl787TZa61jM4a_Y8w.png"}, {"type": "sentence", "content": "It was at the beginning of April 2020, I was working as a UX consultant and had just finished an assignment at a large telecom company. Companies started laying off due to the corona pandemic and one after another, the assignments were canceled. I was still a candidate for one UX assignment but the message from my consultancy company was clear, get the assignment or you are laid off. No pressure there."}, {"type": "sentence", "content": "More than 70 candidates but I made it to the interview. The interview went well and I was to do the “design test”. I was to come up with a concept, describe and visualize my design process, and design a minimum of four screens in Sketch. The feedback? One sentence. The graphical design was not good enough compared with the other applicants."}, {"type": "sentence", "content": "Okay, I was bitter because I would now lose my job but still. Being turned down based on my visual design skills when applying for a UX job is not cool. After working in the industry for seven years I am still amazed by companies looking for the unicorn designer. A designer that can design everything from animated blockbuster movies to spaceships."}, {"type": "sentence", "content": "You have probably all seen the job requirements that look something like this:"}, {"type": "sentence", "content": "You should have 10 years of experience from the following:"}, {"type": "sentence", "content": "And yes, you have a large, pointed, spiraling horn on your forehead and you enjoy jumping around on rainbows."}, {"type": "sentence", "content": "You get the picture. My question is how one person can be amazing at UX design, UX research, and graphical design? And a fantastic developer? And be great at motion design and after-effects? Would you take your child to a pediatrician that also claimed that he/she was an amazing surgeon and dentist? Of course not. You would not believe that one person can be specialized and amazing in all of those fields. But still, when it comes to design many recruiters and companies believe that there is the ONE that can design everything."}, {"type": "subtitle", "content": "Unicorn designer or ”T-shape”/ “Pi-shaped” professional"}, {"type": "sentence", "content": "I work primarily with UX and Service Design. I have done it for seven years now and so far I have not met a designer that could do it all. Working with other designers one quickly learns who is the best in different areas. It could be that I ask Erica if I need some tips on insight research, while Sam is the one doing the usability testing because she is great with the users, and Anna is the visual artist. Sure, everyone in the team could do everything but I wouldn’t expect Anna to be the best researcher, and the result would be poorer compared to if Erica did it."}, {"type": "sentence", "content": "It was quite common to talk about ”T-shape” profiles a few years ago, having a depth in one area and broad knowledge in related fields. For example as a UX designer you would be great at UX design, designing wireframes and prototypes, but you also know how to do your research if necessary or design the UI. Being a “T-shaped” designer is different compared with the unicorn designer, a “T-shape” does not fool you that he or she is a expect of everything. These last few years, we have started talking about “Pi-shaped” professionals. They have a broad base with two expertise areas but they are still no unicorn designers."}, {"type": "sentence", "content": "My advice for companies still hunting the unicorn designer is to hire designers who complement each other instead. To hire designers who have different expertise areas."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*xkUhWUUscAqkI5SYmMKB7A.jpeg"}, {"type": "subtitle", "content": "UX team of One?"}, {"type": "sentence", "content": "How about if you are looking for a UX team of One? You can only afford to hire one person to do it all? It is a tough one but face it, whoever you hire will not have the full package. Even if they talk the talk and have 20 years of experience working for this company and that company. No. No. No. You would need to prioritize. Hiring a generalist typically means you hire someone mediocre at everything. Define the most important skills. For example, if you hire someone awesome at UX design you could have someone come in extra to help with the research and especially usability testing. Supervising usability testing on your design can be tricky, even if you do not think that you are bias, you are. Also, have an art student do the UI design."}, {"type": "sentence", "content": "In his article “UX team of One: Why you never need to feel alone”, Jared M. Spool has some other tips on how to include other people in your organization in the design process and share responsibilities. It could be finding those hidden champions inside our organization, people who are interested in design, and want to learn and help. Encouraging people in the organization to step forward."}, {"type": "sentence", "content": "To conclude. Unicorn designers are a myth. And even if some exist they are so rare that you will not find them. Instead of hunting the unicorn designer hire designers that complement each other."}], "topic": "ux"}