{"title": "3 Easy Tricks to Get Started with Python (and Ditch Excel!)", "data": [{"type": "subtitle", "content": "An Introduction to Pandas for Excel Power Users"}, {"type": "sentence", "content": "So you’ve taken the mental leap and want to learn Python — that’s awesome! But where to start?"}, {"type": "sentence", "content": "Let me guide you through tasks you already know how to do in Excel and how to do them in Python!"}, {"type": "sentence", "content": "You’ll be using Pandas, the primary data analysis library in Python."}, {"type": "sentence", "content": "If you need to install Pandas, you can do this using pip or conda:"}, {"type": "sentence", "content": "Pandas loads data into dataframes, which you can think of as Excel sheets."}, {"type": "sentence", "content": "Let’s load a dataset into a datagram. You can accomplish this by using the following code. We’ll also explore the first five rows by using the Pandas head method:"}, {"type": "sentence", "content": "To follow along with the tutorial in Excel as well, the file can be found here."}, {"type": "sentence", "content": "There are a number of differences between Excel sheets and Pandas dataframes. Let’s take a quick look!"}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*GBRlHvfDL6DTSeCtYzliuw.png"}, {"type": "sentence", "content": "Ok, now let’s get started!"}, {"type": "subtitle", "content": "Filtering, Sort, & Reorder Columns"}, {"type": "sentence", "content": "Excel is a much more visual tool, which makes it easy to click a button that abstracts the function behind what you want to accomplish."}, {"type": "subtitle", "content": "Sort by a Single Column"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*ynVJmneBRTb9OQM9xtKHwg.gif"}, {"type": "sentence", "content": "For example, if you wanted to sort a column in Excel, you could simply:"}, {"type": "sentence", "content": "To do this in Pandas, you would write:"}, {"type": "subtitle", "content": "Sort by Multiple Columns"}, {"type": "sentence", "content": "Sometimes you might want to sort by multiple columns."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*khIQ6Tya547G4G7NSyJCag.gif"}, {"type": "sentence", "content": "Again, Excel makes this easy:"}, {"type": "sentence", "content": "Click on the Data tab"}, {"type": "sentence", "content": "To do this with Pandas, simply add a list to the “by” argument:"}, {"type": "subtitle", "content": "Filtering Columns"}, {"type": "sentence", "content": "Filtering columns is an easy task in Excel! Simply click on the Data tab, then Filter. This creates arrows on all the column headers. When you click on these, simply fill in your selection:"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*xoEVTZ1MX7GFBTzqImKMpA.gif"}, {"type": "sentence", "content": "In Pandas, this is just as easy:"}, {"type": "sentence", "content": "What’s great about this, you can also use comparison operators to select more than 10 units, or select based on multiple conditions:"}, {"type": "subtitle", "content": "Reordering Columns"}, {"type": "sentence", "content": "Reordering columns is more of a visual cue for yourself."}, {"type": "sentence", "content": "To drag a reorder a column in Excel, you’d select the column by click its header, hover on the side until the cursor changes to a four-pointed arrow, then hold the SHIFT key and drag the column to a new position:"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*wZ3y7u5r5GvPWRuXj4HT9Q.gif"}, {"type": "sentence", "content": "To accomplish the same thing in Pandas, you simply write in the order of columns you want to have into a double set of square brackets:"}, {"type": "subtitle", "content": "Pivot Tables (with Percentages)"}, {"type": "sentence", "content": "Pivot tables are one of those things that take you to the next level in Excel."}, {"type": "sentence", "content": "They allow you to easily summarize data quickly, without needing to rely on complex formulas."}, {"type": "sentence", "content": "Say you wanted to know the total value of sales in each region, you would:"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*91hExdCvrtRhpHlpumZWMw.gif"}, {"type": "sentence", "content": "To accomplish the same thing in Pandas, you could simply use the pivot_table function:"}, {"type": "sentence", "content": "Let’s break this down a little bit:"}, {"type": "sentence", "content": "For a deep dive into the Pandas Pivot Table function, check out my other post on Pivot Tables in Pandas."}, {"type": "subtitle", "content": "Show Pivot Table Values as Percentages"}, {"type": "sentence", "content": "You may want to show your values as percentages of the column total. Again, Excel makes this very easy:"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*SNzy2g-tIZZwagYFQCNT-w.gif"}, {"type": "sentence", "content": "It’s just as easy to do this in Pandas. The easiest way is to create a new column for this:"}, {"type": "sentence", "content": "Let’s take a look at what’s happening:"}, {"type": "subtitle", "content": "Creating Charts"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*7tsq14amcZywNsKMeXSV7Q.gif"}, {"type": "sentence", "content": "Now, what if you wanted to create some charts, this is incredibly easy in both Excel and in Python."}, {"type": "sentence", "content": "Let’s look at Excel first. If you want to plot this pivot table out as a column graph:"}, {"type": "sentence", "content": "In Pandas, this is even easier. Pandas comes with one of Python’s top data visualization libraries functionality built-in. It’s as easy as adding .plot(kind = ‘bar’) to the end of your code:"}, {"type": "sentence", "content": "This might look a little daunting. Let’s break it down:"}, {"type": "sentence", "content": "Note: if you’re using Jupyter notebooks, you can display the chart inline by writing this code after importing your library:"}, {"type": "subtitle", "content": "Bonus Tip: Format Values Properly"}, {"type": "sentence", "content": "While you’re working with data, it may be helpful to format your values properly."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*mQBfk7ZexccYCH-HN4IB3A.gif"}, {"type": "sentence", "content": "For example, formatting currencies as dollars (etc.) or percentages as percentages."}, {"type": "sentence", "content": "To do this in Excel, you would:"}, {"type": "sentence", "content": "Pandas hides this away a little bit, which is something that can stump newcomers quite a bit."}, {"type": "sentence", "content": "An easy way to accomplish this would be using the apply() function. What this function does is take a series and apply another function to it. The function being applied would be the one formatting the values."}, {"type": "sentence", "content": "If you wanted to format the Sales column in the pivot dataframe, you could write:"}, {"type": "sentence", "content": "This might seem a little round-up (and it is), but it does give you a ton of flexibility in terms of how you style your data. Let’s take a closer look:"}, {"type": "sentence", "content": "Similarly, if you wanted to stay percentages, you could write:"}, {"type": "sentence", "content": "In this code, we created another function called format_percent() and went through similar steps as above."}, {"type": "sentence", "content": "Note: The ‘% of column total’ column has been amended to not multiply the value by 100. This is because the formatter does this automatically."}, {"type": "subtitle", "content": "Where You Can Learn More"}, {"type": "sentence", "content": "Thank you so much for reading this article! I hope you found it useful!"}, {"type": "sentence", "content": "I have written a number of articles that explain how to take on common and advanced Excel tasks in Python, if you want to check them out!"}, {"type": "sentence", "content": "If you’re ready to take the plunge into Python and Pandas, I have also written an eBook that provides a complete introduction to Python, Pandas, and Matplotlib and will have you up and running in no time!"}, {"type": "sentence", "content": "You can find it by clicking this link."}, {"type": "sentence", "content": "Have a great day!"}], "topic": "data-science"}