{"title": "Build A Great Website Fast Part II", "data": [{"type": "subtitle", "content": "Tools for New Businesses During COVID-19"}, {"type": "sentence", "content": "This article is a part of the series “Entrepreneurship During COVID-19”"}, {"type": "sentence", "content": "In Part 1 of “How to Build a Great Website Fast” we chose a name for our hustle, created a compelling tag line, and found an interesting cover photo."}, {"type": "sentence", "content": "In this next section, we will go through the process of how to best showcase your services, create a short bio, talk about the importance of the Subscribe button, and connect your website to a domain."}, {"type": "subtitle", "content": "Showcase Your Offerings"}, {"type": "sentence", "content": "You want your website to quickly tell people what product or services you offer. Each different kind of service will need a slightly different architecture to best display their offerings."}, {"type": "sentence", "content": "For businesses where it is really easy to understand the basic offering and your differentiation is the style you bring to your work, the best way to quickly communicate your offerings is to show, not tell. This is best for companies like food websites, photography, clothing brands."}, {"type": "sentence", "content": "One of the most effective ways to do that is by using a gallery in your website. This website from Julia & Gil conveys quickly that their service specializes in engagement and wedding photography. The photographer’s style focuses on black and white or pastel photos with the people in the center of the frame."}, {"type": "image", "content": "https://miro.medium.com/max/2032/1*hwi8h1pSybCpmpOmFVUGYw.png"}, {"type": "sentence", "content": "For other tech-focused businesses where companies might still be learning how to best integrate this technology into their businesses, it is better to “chunk” examples of how your tech can be used. This is relevant especially for drone, 3D printing, or sensor companies that people do not yet interact with directly in their daily lives."}, {"type": "sentence", "content": "Drone Base has used this technique to show how they use drones across a wide variety of industries, including Real Estate, Residential property showings, and Wind Farm maintenance."}, {"type": "image", "content": "https://miro.medium.com/max/1128/1*7oFMvU6RA0sgFxZ_dGv4JA.png"}, {"type": "sentence", "content": "For community-focused businesses where one of the most important pieces, don’t be afraid to share your story and set expectations of how people will interact in the community."}, {"type": "sentence", "content": "Christopher Frizelle’s “Quarantine Club” is a place for people to read together and delve deeply into the symbolism, social impact, characters, and narratives within the books they read. Though at first the Quarantine Club’s website seems like a lot of text, it conveys a distinct community: this is for people who love to read a lot and want to do in-depth analysis."}, {"type": "image", "content": "https://miro.medium.com/max/1316/1*yUAWVewQEmOjMyPuldk52A.png"}, {"type": "sentence", "content": "Decide which type of website architecture is best for your website, and then Select Add on the Wix editing panel and add in whatever layout would work best for your business."}, {"type": "image", "content": "https://miro.medium.com/max/1072/1*4eRh84xDMUJ4zmMgVdkszA.png"}, {"type": "subtitle", "content": "“About Me” Section"}, {"type": "sentence", "content": "A great way to humanize your business is to add an ‘About Me’ section. Generally, you should include details about your previous work experience to show why you are qualified and give readers insight into why you started your hustle."}, {"type": "sentence", "content": "The information that you want to include in this section and the tone you strike depends on what you want to convey to your audience. If you want to give off a professional tone, stress your credentials and previous work experience."}, {"type": "sentence", "content": "For example, in the female-founded design studio MADE BY WMN, Kathy Luong stresses her educational background of having a BA in Business Marketing from Seattle University."}, {"type": "image", "content": "https://miro.medium.com/max/2140/1*yDFv35spsOy5tOx1NocaeQ.png"}, {"type": "sentence", "content": "If your About Me section is more focused on showing your personality that you imbue into your community, you can be more open with your personal story of how your personal journey led you to start this hustle. For example, with Yoga With Tim, Tim talks about how he was overweight when he was younger, and his journey towards mindfulness and better health influenced him to"}, {"type": "image", "content": "https://miro.medium.com/max/2566/1*tBNNDQ5Zg17qfHWqtzmcpQ.png"}, {"type": "subtitle", "content": "Change Onlookers Into Customers"}, {"type": "sentence", "content": "You want as many people that come to your website to move further down what is called the acquisition pipeline from an onlooker to a customer. If your product or service is something that people tend to use only once, make your Contact information easy to fine. Make sure to use a professional email address. If you do not want people to know your personal phone number, you can set up a Google Voice number."}, {"type": "sentence", "content": "If you are building a community that engages people multiple times, you will want to have a Subscribe button. To encourage people to Subscribe, you should be clear what they will get out of it, since people do not want low-quality spam in their inboxes. Examples include “Subscribe for fresh weekly recipes” or “Subscribe for access to exclusive Yoga Videos.” You want to convince people what you provide is of high value."}, {"type": "subtitle", "content": "Connect to Your Domain"}, {"type": "sentence", "content": "If you have not already, go to a place where you can buy a domain name to register your website (we recommend Domain.com). Then on your dashboard go to Connect Domain and Connect a domain you already own."}, {"type": "image", "content": "https://miro.medium.com/max/2398/1*WgyAW8EM6TncTgU6F1Havg.png"}, {"type": "sentence", "content": "Select the website you want to connect your domain to and Select Next and then enter your domain name. Then head over to Domain.com and go to DNS Name Server settings. Replace your current name servers with ns2.wixdns.net and ns3.wixdns.net. This means the traffic to your website will be routed through Domain.com and to your Wix website."}, {"type": "subtitle", "content": "Finishing Touches"}, {"type": "sentence", "content": "You’re almost done! Before we move on, you should check how your website renders on a phone. You can view how your website will look on a phone by toggling to the Phone view on the Wix dashboard."}, {"type": "image", "content": "https://miro.medium.com/max/642/1*hBRuG522g7M5b2VP2uD4vw.png"}, {"type": "sentence", "content": "Read through W3’s Accessibility Guidelines to make sure everyone can use your website. This includes such things like adding in “alt text” to photos and making sure text has enough contrast so as to be visible to people in low light or who might have visual impairments."}, {"type": "sentence", "content": "Show your website to a few friends and ask for feedback. Ask for feedback on several levels."}, {"type": "subtitle", "content": "Next Steps"}, {"type": "sentence", "content": "You’ve set up your hustle’s website! You should be extremely proud for making the first step towards creating something great. In the next section, we’ll learn how to effectively use Zoom to interact with your community and facilitate high-quality digital events."}], "topic": "marketing"}