{"title": "Being a Working Writer Means Income Streams. Here’s How to Build Them.", "data": [{"type": "subtitle", "content": "A real plan for reaching your financial goals."}, {"type": "sentence", "content": "A Working Writer is someone whose job is writing."}, {"type": "sentence", "content": "There are people who write as a hobby or write as an artist. But Working Writers have an expectation that their work will result in a pay check and (at least partially) support them."}, {"type": "sentence", "content": "Today I want to talk about what I think is the most important skill someone who wants to be a Working Writer needs to cultivate. That is the ability to develop income streams."}, {"type": "sentence", "content": "It’s exceedingly rare for a writer to be able to earn a full-time living from a single source of income, if they are self-employed. It happens, of course. Maybe you freelance full-time for one publication. Or you are that unicorn who is able to earn enough from the sale of novels."}, {"type": "sentence", "content": "And of course, you might not be self-employed at all. Some working writers have regular 9-to-5 jobs. Journalists and some technical writers come to mind."}, {"type": "sentence", "content": "The ability to see and utilize income streams is a top-level skill for working writers, though, regardless of their current situation."}, {"type": "subtitle", "content": "Start by making a list of your current income streams."}, {"type": "sentence", "content": "This is actually two steps."}, {"type": "sentence", "content": "First, list your actual, current income streams. Where is your money coming from. Not just writing money, any money. Things like social security, pensions, day jobs that aren’t writing related, freelance or gig jobs that aren’t writing related, child support, even things like food stamps etc. count."}, {"type": "sentence", "content": "If you share finances with someone else (a spouse or partner for instance) then include household income streams."}, {"type": "sentence", "content": "Here are mine: Writing on Medium, Ninja Writers Club and Academy, Patreon, affiliate sales, coaching, Etsy sales. Room and board from my parents-in-law."}, {"type": "sentence", "content": "Now, make a list of income streams that you aren’t utilizing, but that you could very, very easily. Maybe you’ve got some things lined up, but you just aren’t taking advantage of them right now. If you are eligible for any kind of income that you’re not utilizing (for instance, you’d be eligible for food stamps or social security, but you haven’t applied), that goes on this list."}, {"type": "sentence", "content": "Here are mine: I have a Substack account that has 1800 followers, but I haven’t done anything to monetize it yet. I could increase my Etsy income by a lot, fairly easily. I could take on more coaching clients. I could offer another paid course to my email list."}, {"type": "sentence", "content": "My husband cares for his parents, who both have Alzheimer’s disease. He is in the process of becoming eligible to be paid for that work via Medicaid. (We hope that will start in June.) If things were dire enough, he could get a day job to bring in income and I could take care of his parents while I work from home. (I’m super, super glad we don’t have to do that, but we could.)"}, {"type": "sentence", "content": "This exercise should give you a good baseline of your current income situation and an idea of income streams you could start flowing relatively easily."}, {"type": "subtitle", "content": "Now, spread your wings."}, {"type": "sentence", "content": "Once you have a handle on current income streams and the low-hanging fruit, it’s time to think more broadly."}, {"type": "sentence", "content": "My favorite exercise for this kind of thinking is to imagine your life five years from now. Five years is far enough away that anything seems possible, but not so far that it feels like an impossible timeline."}, {"type": "sentence", "content": "What would you like your financial life to look like in five years? Do you want to have moved from shift work entirely into being self-employed? Do you want a good-paying job with a company? How much money do you want to be making? What kind of work do you want to be doing to earn that money?"}, {"type": "sentence", "content": "One note on the ‘how much’ question. It goes hand-in-hand with the ‘what kind of work’ question. Maybe you want to have an 8-figure income, but make sure that you want to do the kind of work that it takes to make that much money as a writer."}, {"type": "sentence", "content": "Also, I highly recommend you focus on things you have control over for this exercise. It would be nice to be earning an 8-figure income via writing blockbuster movies or having bestselling novels, but so much of that is entirely out of your control that it isn’t very useful as far as income streams go."}, {"type": "subtitle", "content": "Here’s where I’d like to be in five years:"}, {"type": "sentence", "content": "I want to be earning some part of my income from my novels."}, {"type": "sentence", "content": "I imagine that Ninja Writers will still be going strong. In five years, it will be ten years old. I would like to continue to have a steady income from Ninja Writers that relieves the pressure from my fiction writing to earn it’s keep."}, {"type": "sentence", "content": "I would like to have the ability to be a classroom teacher, if I need to. I don’t anticipate that I’ll need to implement that income stream, but it’s one I’d like to have ready to go just in case."}, {"type": "sentence", "content": "I want an email list of 100,000 writers."}, {"type": "sentence", "content": "I’m five years into my Working Writer journey (actually, I’m 20 years in, but five years into being self-employed.) When I did this exercise in 2015, it looked a lot different."}, {"type": "sentence", "content": "I wanted to quit my day job. Badly. I had blogging as a big player in my plans. Ninja Writers was barely a spark of an idea, but I wanted to write and sell a novel-writing course."}, {"type": "subtitle", "content": "Now, shift into analysis."}, {"type": "sentence", "content": "When you look at your five-year-plan, what do you see? Is there anything on your list that would require education or training? Is there anything that you need to pull out and make a plan for?"}, {"type": "sentence", "content": "When I look at my list, I can see that my goal of being able to move into classroom teaching if I ever need to requires some education. Five years is plenty of time for me to take care of that."}, {"type": "sentence", "content": "All of my plans, with the exception of the teaching thing, require me to keep my email list growing and healthy. It’s taken me five years to build a list of 20,000+ writers, so it’s ambitious to build up to 100,000 in the same amount of time. This is one of those things though where I’ll be happy wherever I land, as long as there is growth. I’m aiming for the stars and there’s no real failure here because my email list is already solid."}, {"type": "sentence", "content": "I don’t have a blogging goal on my five-year-plan. That surprised me. But, when I think about it, blogging is an extension of Ninja Writers. It’s what I do to communicate and teach. It’s nice when it brings in an income, but it’s too volatile for me to count on."}, {"type": "sentence", "content": "If my blogging efforts hold steady, I’ll be happy. I definitely need to continue to have other income streams, though, because relying on it as a main source of income is too crazy-making for me."}, {"type": "sentence", "content": "I want to make some part of my income as a fiction writer. That means that I need to prioritize writing fiction in the next five years. I can’t sell something I haven’t written, after all."}, {"type": "subtitle", "content": "Now, make a plan."}, {"type": "sentence", "content": "Start by pulling a list of 5-year goals from the last exercise."}, {"type": "sentence", "content": "Here are mine. In five years, I want to: have a solid 6-figure income, have a novel under contract, be prepared to apply for a teaching license if necessary, and have an email list of 100,000 writers."}, {"type": "sentence", "content": "Next, ask yourself these questions."}, {"type": "sentence", "content": "Work your way backward, until you have a set of next steps that make absolute sense and that you can implement with the resources you have today."}, {"type": "sentence", "content": "If you have a next step that you can’t take because you’re lacking something necessary, then that’s not your next step. Keep working backward until you figure out what it is."}, {"type": "sentence", "content": "It might help to take your five year goals one at a time. Here’s an example of one of mine."}, {"type": "sentence", "content": "When I look at all of my five year goals this way, I end up with a collection of things I can do this week to reach those goals."}, {"type": "sentence", "content": "Revisit your goals every week. It shouldn’t take more than a few minutes. Just figure out what your very next step is. And take it."}, {"type": "subtitle", "content": "Here’s my secret weapon for sticking with whatever your thing is."}, {"type": "sentence", "content": "Shaunta Grimes is a writer and teacher. She is an out-of-place Nevadan living in Northwestern PA with her husband, three superstar kids, two dementia patients, a good friend, Alfred the cat, and a yellow rescue dog named Maybelline Scout. She’s on Twitter @shauntagrimes and is the author of Viral Nation and Rebel Nation and the upcoming novel The Astonishing Maybe. She is the original Ninja Writer."}], "topic": "freelancing"}