{"title": "Facebook’s Pivot to WFH Sparks Uncertainty for Menlo Park", "data": [{"type": "subtitle", "content": "The company’s Menlo Park headquarters have shaped the city. So too would an exodus of employees."}, {"type": "image", "content": "https://miro.medium.com/max/8668/1*H6CTkBe85ieSmZV_u3ZS4A.jpeg"}, {"type": "sentence", "content": "Facebook may be an online platform, but its physical presence is firmly rooted in Menlo Park, California, where its sprawling headquarters and iconic “1 Hacker Way” address are emblematic of the company’s past and future. Since 2011, Facebook has played a dominant role in the small city, and its ongoing expansion there will mark the largest development Menlo Park has ever seen."}, {"type": "sentence", "content": "It was a surprise, then, when Zuckerberg announced on Thursday that Facebook could become a remote workforce in the coming decade, a decision spurred by the coronavirus, which has shuttered technology campuses across the nation. Fifty percent of Facebook employees may be working remotely in five to 10 years, he estimated — a massive shift from the company’s previous emphasis on an on-site workplace that sees 6,000 people shuttled along 80 routes to its Bay Area campuses each day. Soon, employees will be able to apply to work remotely on a permanent basis, and new job openings will be made available to remote workers beginning this week."}, {"type": "sentence", "content": "“I think Facebook will be the most forward-leaning company on remote work at our scale, and we’ve been working on a thoughtful and responsible plan to do this,” the CEO wrote on Facebook. But what will this transition mean for Menlo Park, a city whose identity has become entwined with Facebook?"}, {"type": "sentence", "content": "Despite Zuckerberg’s estimate that half of employees could be remote by 2025, Facebook has made additional claims that the existing campuses will remain in place. For example, Zuckerberg said in a Thursday livestream on Thursday that he is “committed to keeping our offices and making them great too.”"}, {"type": "sentence", "content": "“We expect to continue to have many people still working out of our offices around the world, including Menlo Park and the Bay Area,” a Facebook spokesperson added in response to OneZero’s question about its Menlo Park headquarters."}, {"type": "sentence", "content": "It’s not yet clear how many Menlo Park-based Facebook employees will actually become remote workers in the coming years, and whether this will affect Facebook’s investment in the city. But the outcome will be important to the future of Menlo Park. Of Facebook’s 48,000 employees worldwide, roughly 15,000 workers report to the Menlo Park campus."}, {"type": "sentence", "content": "In recent months, Twitter, Apple, Google, and Microsoft have told their employees to work from home, and Facebook isn’t alone in embracing remote work. But as a major employer in the area, countless workers, businesses, and communities orbit Facebook’s headquarters, which means changes to its footprint would likely produce shockwaves. The company itself has encouraged workers to become residents of Menlo Park, and until 2018, offered a $15,000 “balanced work-life” bonus to employees willing to relocate within 10 miles of Facebook’s campus."}, {"type": "sentence", "content": "Observers have likened Facebook’s relationship to Menlo Park as one of a company town. In exchange for rapidly expanding its campus, Facebook has signed multiple development agreements with the city, allowing it to say that it “promotes connection and community” there, rather than driving people out. It has dedicated millions of dollars to subsidizing teachers’ rents, hiring public safety officers, and establishing a local housing fund. When Facebook committed $1 billion to its latest project, an enormous mixed-use complex called Willow Village, it also donated funds to create a police force dubbed the “Facebook Unit,” which patrols the area surrounding its campus to the ire of communities already overpoliced, as I reported last year."}, {"type": "sentence", "content": "These agreements are meant, in part, to ameliorate the trauma of Facebook displacing local residents and accelerating gentrification in Menlo Park and neighboring East Palo Alto."}, {"type": "sentence", "content": "“We were the petri dish for their little experiment,” said JT Faraji, an East Palo Alto resident and founder of the activist group Real Community Coalition, in response to questions about potential shifts at Facebook’s Menlo Park campus. Faraji, whose art collective, Hood Squad, serves a free breakfast in East Palo Alto and Oakland to homeless residents each month, says he is curious if problems like traffic and soaring rent prices will improve. But he’s also conscious that if Facebook leaves, so could funding for the various nonprofits and initiatives that the company has promoted. In April, for instance, Facebook launched a $15 million small business grant program in partnership with the mayors of San Francisco, Oakland, and San Jose."}, {"type": "sentence", "content": "“I wonder how much Facebook is going to pull back from investing in our community,” he said."}, {"type": "sentence", "content": "“This announcement gives a lot of unanswered questions that somebody from their policy team should be addressing very publicly.”"}, {"type": "sentence", "content": "Facebook’s work-from-home announcement came days after the company published revised plans for its 59-acre Willow Village expansion. On Wednesday, the company said it would be reducing the amount of office space and increasing the amount of housing within the new complex. Facebook stressed to OneZero that this resulted from community input, and was not a response to workforce changes."}, {"type": "sentence", "content": "“We care about being good neighbors wherever we have offices and don’t expect our support for local communities to change,” said Facebook’s spokesperson. According to the company, Facebook’s commitments to Menlo Park will not change."}, {"type": "sentence", "content": "Menlo Park mayor Cecilia Taylor, who has sat on the Menlo Park City Council since 2018 and became mayor in December 2019, did not respond to a request for comment."}, {"type": "sentence", "content": "While an exodus of Bay Area tech workers may come as good news to some residents, Facebook has signaled that it intends to expand elsewhere in the country. In his Facebook post, Zuckerberg wrote that Atlanta, Dallas, and Denver are now being eyed for future hubs."}], "topic": "business"}