{"title": "How Nintendo Got Us to Advertise Them for Free", "data": [{"type": "subtitle", "content": "All they did was kill the music"}, {"type": "image", "content": "https://miro.medium.com/max/12480/0*wSlmOLCAddwbbmMP"}, {"type": "sentence", "content": "It started with a few Youtube comments."}, {"type": "sentence", "content": "“I think it needs music, honestly.”"}, {"type": "sentence", "content": "“This would be perfect with Titanic music in the background.”"}, {"type": "sentence", "content": "“No music…You know what to do :)”"}, {"type": "sentence", "content": "And then all hell broke loose."}, {"type": "sentence", "content": "On November 11th, 2018, Nintendo released the trailer for their new game, Super Smash Brothers Ultimate. Since its original launch in 1999, the fighting crossover series has sold 60 million copies worldwide."}, {"type": "sentence", "content": "Fans always complain about whichever famous character is missing, but this time, the award for “most notable absence” went neither to Mario nor to Pikachu but to the music. Of course, that didn’t last long."}, {"type": "sentence", "content": "A few hours after the trailer was posted, a Twitter user added the music from Smash Bros. Melee, a prior installment in the series. The tweet got over 1,000 retweets and 3,000 likes. An hour later, another tweeter added a DMX rap song and racked up even more shares."}, {"type": "sentence", "content": "Less than halfway through the day, a gamer named “Mythical Mew” broke the social media jackpot. He synced Queen’s Don’t Stop Me Now to the one-minute clip, and, well, it’s literally music to your ears."}, {"type": "sentence", "content": "The tweet went insta-viral, garnering nearly 100,000 retweets and over 230,000 likes. A Youtube version of the trailer currently sits at over 1.3 million views. Both CNET and Mashable covered the event."}, {"type": "sentence", "content": "The lyrics and tune matched the trailer so perfectly that, suddenly, everyone was hell-bent on creating their own. The hunt for ever better, ever newer ideas was on. For hours, all you saw on Twitter was #SmashBrosMeme."}, {"type": "sentence", "content": "If you go back to the hashtag now, you can still see thousands of entries. Each of those entries has 10, 50, 100, 500 likes and retweets. Without lifting a finger, Nintendo was generating millions of views and impressions."}, {"type": "sentence", "content": "Heck, even I made six different versions. It was too much fun to not jump on it. Dig up your favorite songs, drop them on the clip in an app, share to social, and you’re done. It was addicting in a positive sense."}, {"type": "sentence", "content": "Nostalgia, creativity, getting props from strangers online — for a few hours, everyone seemed to forget they were busy, that they were an adult and “not supposed to do stupid stuff like this,” as our parents told us as kids."}, {"type": "sentence", "content": "By the time the world went back to work, Nintendo was set. When Smash Bros. Ultimate was released four weeks later, it broke all sales records. 5.6 million copies in the first week. As of today, the game has sold nearly 20 million times — about a third of the series total over the last 20 years."}, {"type": "sentence", "content": "It all begs one question: Did Nintendo drop the music on purpose?"}, {"type": "sentence", "content": "The trailers of all prior Smash Bros installments had music. Nintendo has access to great composers. How come this time, for the first time ever, they didn’t use it?"}, {"type": "sentence", "content": "The company never publicly confirmed the stunt, but marketers around the world should take note. Here’s why Nintendo’s no-music trailer was genius:"}, {"type": "sentence", "content": "Finally, and this is the most important thing, Nintendo made something true to their spirit. By giving everyone a break from their adult lives for a bit, they did what they came here to do: Bring fun, joy, and games to the people."}, {"type": "sentence", "content": "Participating in #SmashBrosMeme was like playing a Nintendo game."}, {"type": "sentence", "content": "If that’s not the ultimate advertisement, I don’t know what is."}, {"type": "sentence", "content": "Did Nintendo set this trailer to Queen music and then remove it, hoping someone would find the connection? Was there no music for legal reasons? Did an intern forget to unmute the music before exporting the file?"}, {"type": "sentence", "content": "We’ll never know, but the result is worth applauding. I salute you, Nintendo. You made us do your marketing for you, and we had a blast doing it."}, {"type": "sentence", "content": "Was it a coincidence? Maybe. But for a company whose name translates to “leave luck to heaven,” it sure looks like genius."}], "topic": "social-media"}