{"title": "How I’m Learning to Love Myself (and How You Can Too)", "data": [{"type": "image", "content": "https://miro.medium.com/max/5400/1*_hdxRs-xWPmFyF96lf7Q9Q.jpeg"}, {"type": "sentence", "content": "In a recent post, I wrote about why some of us struggle to connect with each other. Spoiler alert; it’s essentially because we don’t love ourselves enough to love others in turn. What I didn’t say, though, is how I’m learning to love myself. Note I didn’t say ‘how I learnt to love myself’ in the finite? That’s because loving yourself is a practice. To use a well-worn cliche, it’s about the journey, not the destination. So, without further ado, here are some of the steps I took on my ongoing journey to love myself. If you’re ready, you might try some of them too."}, {"type": "subtitle", "content": "I sought therapy"}, {"type": "sentence", "content": "I’ve talked publicly about therapy a fair bit because it’s been the single most valuable thing I’ve ever done; and that’s not hyperbole. It changed my life. Why? Because many of us go through life either trying to change our external circumstances to make us happier/more fulfilled/richer/more popular/or [insert another goal]. What people constantly tell us, but we don’t really believe, is that ‘happiness’ is an inside job. It sucks because working from the inside out is hard. Like really fucking hard. In the past three years, I’ve found myself, at times, completely unraveled. Unpacking your baggage is painful. Yet, I’d do it again in a heartbeat to get where I am today."}, {"type": "sentence", "content": "I recognise that therapy is a privilege, and one that not everybody can afford. The most pertinent point here, however, is that I was ready to go looking for help. If you’re ready to look inward then there are plenty of other things you can do to start your very own journey to self love."}, {"type": "subtitle", "content": "I read, a lot"}, {"type": "sentence", "content": "Self help books are a bit of a minefield and many of the popular psychology ones arguably do more harm than good but there are also lots of really great ones out there. Read reviews, ask friends for recommendations — and feel free to comment if you want to explore a particular topic. I’m a psychotherapy student now so my reading list is pretty hardcore. If I can help, I’d love to."}, {"type": "subtitle", "content": "I journal every day"}, {"type": "sentence", "content": "In the past year I’ve filled 5 journals. I do it every single day without fail and it’s probably the single most important ‘action’ I take to work on my mental health. When I started this work I didn’t know who I was or what I needed. I relied on other people to tell me. I was codependent. While therapy gives you a space to reflect on your own wants and needs, it’s just one 50 minute slot per week. You can take as much space as you need in a journal. I write to reflect. I write to rage. I write to tap into subconscious thoughts. Here are a few exercises to help with the latter;"}, {"type": "subtitle", "content": "Stream of consciousness writing"}, {"type": "sentence", "content": "Set a timer for 5 minutes and just write. The only rule is that you’re not allowed to stop. ‘Even if you’re writing ‘I don’t know what to write’ over and over, keep going and something else will come. You’ll reveal thoughts and feelings you didn’t even know you had — and admitting your own feelings to yourself is half the self-love battle."}, {"type": "subtitle", "content": "Write with your non-dominant hand"}, {"type": "sentence", "content": "Because it takes so much effort, writing with your non-dominant hand is another fascinating way to reveal thoughts and feelings you’re not aware of while your mind is busy concentrating on something else. When I do this I like to write a question with my dominant hand (try ‘how do you feel right now?’ as a starter for ten) and respond with the other. You may be surprised with what you write. These are valuable insights."}, {"type": "subtitle", "content": "Write in the third person"}, {"type": "sentence", "content": "Writing about yourself in this way can feel mega cringe. But it can also help give you some perspective. We tend to get caught up in our thoughts and feelings and lose sight of the wood for the trees. I often find that writing about myself in this way means that I am much kinder to myself. We’re our own worst critics and each have a little inner asshole, yet we wouldn’t talk to others’ that way. Writing in the third person helps us drop the judgements of our inner critic. Learning to ignore this critic is key to learning to love yourself. Note I said ignore’, not ‘silence’. When I’ve tried to silence my critic in the past she’s just got louder. The key, for me, has been to let her have her say but to then choose not to take heed. Over time, this has helped kinder, more compassionate voices to get louder."}, {"type": "subtitle", "content": "I meditate"}, {"type": "sentence", "content": "When I was first introduced to meditation I hated it. I thought ‘how the hell am I supposed to silence my mind?’ It became much more valuable when I finally understood that meditation isn’t a thing you can learn to ‘do’ and it’s not about silencing anything. It’s about developing awareness of what’s going on inside you. It’s a practice."}, {"type": "sentence", "content": "The point of meditation is to identify how you feel (physically and emotionally) and what you’re thinking about, and then to disidentify from these thoughts and feelings by ‘noting’ them (becoming aware). This is how I developed a part of my mind I call ‘the Watcher’. The Watcher is a part of my mind that now watches as thoughts and feelings arise. Often (not always — it’s a practice remember!) I watch as thoughts or feelings arise. This means that I don’t immediately get caught up in them. I don’t react to them. I just note them and am able to let them go."}, {"type": "sentence", "content": "It looks a little like this:"}, {"type": "sentence", "content": "Inner critic: “I think that guy’s being a real asshole — he just spoke over me. I feel so undermined. Does he think I’m stupid or something? Well I guess I must be if nobody will listen to me”"}, {"type": "sentence", "content": "Watcher: “ Oop, my inner critic had a field day then. That guy is being a bit of an asshole but it’s really nothing to do with me. He’s probably just insecure or something.”"}, {"type": "sentence", "content": "My mouth: “I hadn’t finished speaking yet. Is it ok if I finish what I was saying?”"}, {"type": "sentence", "content": "In the past, I may have reacted to an exchange like this. I would’ve been totally hijacked by my inner critic. I may have seethed or stewed for days. I may have cried or vented for hours. I would’ve ‘blamed’ the guy in the made-up exchange for my feelings. These days I respond (as oppressed to reacting) and usually get things cleared up in a matter of seconds."}, {"type": "sentence", "content": "I started meditating using the Headspace app and developed my own practice over time. You could try it on your own first though. Take 5 minutes and focus on your breath. Ask yourself ‘how am I feeling’ and try to notice when you’ve got caught up in your thoughts. Come back to your breath and repeat. That noticing IS meditation. The more you notice, the more aware you will become. And if you can’t do it at all on some days, that’s ok too. Just keep trying for a few minutes each day."}, {"type": "subtitle", "content": "I take responsibility"}, {"type": "sentence", "content": "This was a biggie. And no mean feat. I still struggle with this sometimes and am ever practicing. My therapist once explained boundaries to me in a really simple way. She said: “Your thoughts, feelings, ideas and behaviours are your responsibility, nobody else’s. Nobody can make you feel anything, it’s what happens in your mind that determines how you feel.”"}, {"type": "sentence", "content": "I understood this intellectually but grappled with it a lot in the three years that followed. First I had to identify what my thoughts, feelings, ideas, and behaviours were. This led me on a journey to figuring out what I needed and how my needs aren’t being met. From there, I had to learn how to get my needs met. Which leads me to my next point."}, {"type": "subtitle", "content": "I try to be vulnerable"}, {"type": "sentence", "content": "This is another thing I constantly fuck up but am getting better at with practice. Over the course of our lives we unlearn vulnerability. We get hurt and we gather defence mechanisms to keep us safe. But these defence mechanisms also stop us from connecting to people. I used to think I was being vulnerable but over time I realised I was actually, subconsciously, saying “I’ve got this, I don’t need your help.”"}, {"type": "sentence", "content": "Now I ask for help from friends and family when I need it and I’m careful to be very clear about what I’m asking. I might say “I just need a friendly ear if that’s ok? I’m not after answers or solutions, I just need to talk it out.” Being able to learn about, and slowly drop, my defense mechanisms has allowed me to practice being vulnerable. In turn, this has enhanced the connections in my life no end."}, {"type": "subtitle", "content": "I try to show up for myself"}, {"type": "sentence", "content": "While it’s totally ok, necessary even, to ask for help — we also need to learn to help ourselves. When I feel sad I still instinctively pick up my phone as I’d rather have someone else soothe me. But there’s a bit of a paradox at play here — we can’t get our needs met by others until we can meet our own needs too. Now when I feel sad I try to sit with it for a bit first. I might cry, mediate, or journal — sometimes I talk to my imaginary inner child and she asks for a hug. After all that I may still reach out to a friend but the actions I take first are helping me learn to self-soothe — a crucial life skill that many of us don’t learn as children."}, {"type": "subtitle", "content": "I surround myself with like minded people"}, {"type": "sentence", "content": "Not everybody is ready for this sort of work, and some people never will be. If you’re surrounded by cynics and people that blame others for their shortcomings you will find your own self development journey much more difficult. I’m very lucky to be training with a group of like minded people, with whom I feel very safe to talk about ‘all this stuff’. But I’ve found that my friendship group has changed and morphed around me too. Some people have drifted away, and that’s ok. Others, who are on their own journey to self awareness, feel closer than ever. (To those friends, I know you’re reading this, you always do. Thank you, I love you from the bottom of my heart.)"}, {"type": "subtitle", "content": "I learnt to be alone"}, {"type": "sentence", "content": "Solitude is another thing on this list that’s a practice, not a ‘thing’. Some days I simply cannot stand being alone with my thoughts. And that’s often why we need other people. We treat them as objects to project our shit onto. We might judge them for being angry, instead of admitting our own anger. Being alone, in conjunction with some of the other tips I’ve mentioned, allows us to get to grips with what’s going on inside. It also helps us learn to self-soothe and to meet our needs. Until I could meet my own needs, nobody else could either. No matter how much I wanted or demanded it. It’s just not possible."}, {"type": "subtitle", "content": "Putting it all together"}, {"type": "sentence", "content": "It’s not uncommon for people to talk about the virtues of loving yourself, but having an intellectual understanding of something and actually embodying it are world’s apart. Unfortunately, if you’ve got emotional baggage that’s holding you back (and let’s face it, who hasn’t) there’s no easy fix. Plenty of people opt to turn away from self development and are content to keep their metaphorical fingers in their metaphorical ears. But if you’re ready to take a long hard look in the mirror and take responsibility for your own needs then hopefully some of my experiences can help you get started. I promise you, it’ll be worth it. You’re worth it."}], "topic": "mental-health"}