{"title": "Scaling up: Quantum computing’s greatest challenge", "data": [{"type": "subtitle", "content": "A brief quantum reality check"}, {"type": "image", "content": "https://miro.medium.com/max/1880/0*v4ceqJVQvMe1wgdn"}, {"type": "sentence", "content": "It is perhaps the greatest irony of quantum computing that the very qualities that make it unique also present the biggest barriers to scaling up. The reality of just how developed today’s quantum computing capabilities are is often obscured by the hype around the technology’s budding applications. I have reported on such applications regularly, in an effort to explore their potentiality for both positive and negative impacts on society and the environment. While this is an important lens through which to examine the quantum landscape as it unfolds before our eyes, it is equally important to balance this forward-looking perspective with a realistic assessment of where the development of quantum computing currently lies."}, {"type": "sentence", "content": "Until recently, ‘quantum supremacy’ was used as an important benchmark to signify a turning point in the development of quantum computing, where a quantum computer would be able to outperform classical computers at a given task. However, in 2019 when Google announced they had actually achieved quantum supremacy using their 53-qubit quantum processor, the loaded yet limited meaning of this term became clear. While Google used the opportunity to add another notch to its belt, the feat performed was essentially a “useless computation”. The controversy that immediately followed was less a question of Google’s success in technically meeting the definition of “quantum supremacy” and more a debate about the value of using this achievement as a meaningful benchmark in the development of quantum computing."}, {"type": "sentence", "content": "Though the achievement of quantum supremacy sounds grand and was indeed upheld as quantum computing’s would-be ‘Wright brothers’ moment, this advancement did arguably little to enable quantum computing to lift off and take flight. Use of the term has all but fizzled out since then, with some even commenting on the term’s undertones of colonialism and racism and petitioning for it to be removed from the lexicon of major publications like Nature. While the term ‘quantum advantage’ now functions broadly as a replacement for supremacy, it may well be best to avoid this game of semantics and media hype altogether, in favour of switching focus to a more widely applicable indicator of development."}, {"type": "sentence", "content": "Of course, the answer depends on who you ask. From a purely scientific standpoint, the goal is to outperform classical computing technology, or to be able to perform calculations that even the world’s most powerful supercomputers cannot. However, science does not operate in an isolated bubble. This is especially so with the development of quantum computing, where there are high political and commercial stakes in its promised outcomes. The fact remains that quantum computers are being developed in order to be used for practical applications across a multitude of spaces, from defence to modelling climate change to drug development and beyond. Challenges across industries eagerly await solutions promised by this new computational power."}, {"type": "sentence", "content": "For most of the world outside of the laboratory, the end goal of quantum computing thus relates to achieving applied utility. This statement ties the inherent value of quantum computing to its promise of solving real-world problems, a potential which can only be realised once quantum computers can scale up to drastically improve power and accuracy. For this reason, there will likely be no ‘aha’ moment for quantum computing, at least for civil society. Rather, a steady stream of incremental developments will continue to push the technology toward greater quantum coherence, producing more stability and predictability over time-ultimately enabling its proposed revolutionary impact across industries."}, {"type": "sentence", "content": "However, the road is paved with insidious hurdles and there is no map. In fact, the quantum development landscape is incredibly diverse. There is no one way forward but many paths, which a variety of camps have staked their bets on along the way. The foundation of these disparate approaches to building a quantum processor comes down to the very core of quantum systems: quantum particles known as qubits. While there are a handful of different types of qubits, each with their own unique way of interacting with each other, three types in particular are being touted as the way forward: superconducting, trapped ion and silicon spin qubits. As each type of qubit has its own unique qualities, each system construct has unique requirements in order to operate."}, {"type": "sentence", "content": "The most fundamental challenge facing the task of getting quantum computers to scale is the fragility of qubits. In order to successfully execute a computation using the laws of quantum mechanics, all qubits must be kept in a coherent state of superposition. This is incredibly difficult to achieve for a number of reasons. Any environmental interference in the quantum system produces what is known as decoherence. Decoherence results in a loss of information, as qubits collapse or fall out of a state of superposition, rendering the quantum properties of the device nil."}, {"type": "sentence", "content": "These interferences, known as “noise” in the quantum world, include the slightest variance in vibration, radiation, electromagnetic waves or temperature. As such, environments built to house quantum processors are extraordinarily precarious and expensive to build. Most quantum systems require temperatures colder than deep space to operate, necessitating large, specialized refrigerators. And any interaction from even a stray electron will cause the system to decohere. Essentially, today’s quantum computers can only operate in a sealed vacuum-like environment that is colder than deep space. That makes for a pretty severe inhibitor to wide-spread usability."}, {"type": "sentence", "content": "On top of that, the more qubits that are added, the more difficult it becomes to keep them in this tenuous state of coherence. Herein lies the crux of the issue: Drastically more qubits are required in order to allow quantum computers to scale up to applied functionality. To put this into perspective, today’s most powerful quantum computers have less than 100 qubits. While there is no universal agreement, it is predicted by most researchers that millions of qubits will likely be required in order to enable quantum computers to be useful in applications like drug development. Without scaling up, quantum computers will never live up to the promises that have been touted by governments, futurists and scientists alike for nearly two decades."}, {"type": "sentence", "content": "As insurmountable as these challenges may seem, researchers around the globe are beginning to carve promising inroads into solving some of quantum computing’s most pervasive problems. Recent work offers solutions that enable quantum processors to operate at more feasible temperatures. Quantum error correction codes are also being developed, which can be used across diverse quantum systems. The internationally collaborative work being done by quantum researchers helps to inch the development of quantum computing along, day by day."}, {"type": "sentence", "content": "Though today’s quantum computers have limited demonstrable functionality, and are “noisy” and error-prone, that does not mean they are without value. Quantum computers, at least for the foreseeable future, will not operate alone but in cohesion with classical computing systems. In the near-term future, quantum computers will likely be used to support classical computers, allowing them to achieve greater processing power. For example, D-Wave’s cloud-based quantum processor is currently available for free to innovators working to combat COVID-19. The Canada-based company hopes its emerging technology can be put to use by researchers working toward creating vaccines and therapies, supply distribution, logistics and diagnostic solutions."}, {"type": "sentence", "content": "While hype may serve a purpose in keeping financing and interest in quantum computing flowing, it is important to clear the air every now and then to ensure our expectations are realistic. Quantum computers are, by most estimates, at least a decade off from enabling commercially scalable applications. While progress seems at times to be hurdling us quickly into a quantum future, the reality is that we are far away from even being able to know for certain if this technology will ever be able to deliver on its immense promises. Still, there is inherent value in exploring the vast potential of quantum computing. This practice allows us to offer a perspective on the ways in which they could be both most useful and most dangerous to society. As always, there is value in optimism, so long as it is tempered with a dose of realism."}, {"type": "sentence", "content": "Originally published at https://projectqsydney.com."}, {"type": "sentence", "content": "Please note this is a non-exhaustive explanation of some of the major barriers to the applied usability of quantum computers. My work aims to shed light on emerging tech issues in a way that is accessible to a non-specialist audience."}, {"type": "sentence", "content": "You can get in touch and learn more about me and my work here."}], "topic": "science"}