{"title": "The Man Who Beat the Market By Beating His Emotions", "data": [{"type": "subtitle", "content": "How Bruce Kovner made billions trading like a computer"}, {"type": "sentence", "content": "Everyone’s heard of Warren Buffett, George Soros, and Peter Lynch. Over the past half-century, these world-famous celebrity investors have not only beaten the market but have thrashed every notable industry benchmark."}, {"type": "sentence", "content": "Some highly successful investors, however, avoid the limelight, managing money via family offices. Bruce Kovner is one of them. For decades, “the Market Wizard” has been generating alpha in the shadows. He gained the nickname due to his robotic trading style, which he developed during his early years in financial markets."}, {"type": "sentence", "content": "In 1977, a young Kovner bought $3,000 worth of soybean futures contracts, and quickly realized gains of $40,000. But greed got the better of him: refusing to take profits he watched his contracts fall $17,000 before finally pushing the sell button. Although he earned $20,000 profit on the trade, the $17,000 loss from his unwillingness to lock in gains led him to take an ultra-conservative approach to risk management in his future career."}, {"type": "sentence", "content": "During his time at Goldman Sachs, Kovner noticed traders that let their losses run were doomed to fail, so he did the opposite, adding ultra-tight stop-losses to every trade. If a position went as little as 1% against him, he accepted defeat, trading out without hesitation."}, {"type": "sentence", "content": "As Kovner thought in terms of risk instead of emotion, when a trade hit its stop-loss, it was a signal that he’d missed something the market was pricing in. He acted on what the market was doing, not what he thought the market should be doing."}, {"type": "sentence", "content": "Risk management looks straightforward, but in reality, it’s hard to stay disciplined. To increase our chances of choosing the most profitable outcome, we must bypass our emotions by overriding several innate biases."}, {"type": "sentence", "content": "First, there’s risk aversion where we lock in profits too early, sacrificing any further gains, even if the trade is going our way. It’s natural to take a sure outcome over gambling for a higher return. If there’s a chance we’ll lose $500, we’ll gladly take $500 even if we’re expected to win $750."}, {"type": "sentence", "content": "Conversely, if we’re losing money, the anchoring effect tricks us into holding onto losing trades. If we’ve spent hours researching an idea and waited patiently for a good entry point, when a trade goes against us, we focus too much on the initial work rather than the losses. These tend to increase further when confirmation bias sets in as we discount any new, incoming information that invalidates our original thesis."}, {"type": "sentence", "content": "As you see, it’s a downward spiral when we succumb to just one cognitive bias. Our minds, by default, force us to sell too early and to buy too late. “Buy high and sell low,” not “Buy low and sell high.”"}, {"type": "sentence", "content": "Though a few of us manage to control our emotions, Kovner has mastered the art of combating his money-losing impulses, controlling the most unfavorable part of the human condition when it comes to trading. He’s taught himself and others around him to trade like a machine. Acting robotic is a bad quality in most disciplines — try working in marketing or sales with a monotone voice and zero human skills — but non-human tendencies remain apt in a job where you profit from being emotionless."}, {"type": "sentence", "content": "Which makes you think, how is Kovner so good at it?"}, {"type": "sentence", "content": "“He’s a psychopath” might be the first idea that pops into your head. He’s not, of course. But if he was, psychopathy is not a cure for anxiety as psychopaths feel fear but see no danger — the opposite traits of a skilled risk manager."}, {"type": "sentence", "content": "Discipline has also played a part. He trained at the Juilliard Music School excelling in the harpsichord — a slightly unorthodox keyboard. Hours upon hours of repetition and habit forming paid off which manifested later on in his career. At his hedge fund, Kovner fired any trader caught breaking his strict risk management rules. Though, he wasn’t completely heartless: he allowed obedient traders to reenter losing positions, but only on the next day and providing they wrote an updated thesis on why the trade was still a winner."}, {"type": "sentence", "content": "Though there’s no smoking gun, no secret to explain why Kovner thrived at managing risk consistently over time, when you study his life and his career, it’s a mix of emotional maturity, discipline, and vigor."}, {"type": "sentence", "content": "But saying that, these aren’t the only things you need to conquer financial markets. You need quality fundamental analysis to predict global growth and inflation, to predict company earnings, to predict moves in currencies, commodities, and interest rates. You need technical analysis to gauge investor sentiment, to find good entry and exit points, and to time trades effectively. You need all this to even have a chance of making money — let alone generating alpha."}, {"type": "sentence", "content": "But Kovner already had a successful trading process, so he took his art to the next level, hiring the best traders in the business and enforcing his robotic style of risk management upon them. It was the way he monitored and controlled their every emotional move that set his hedge fund apart from the competition, allowing himself to become one of the richest, most successful hedge fund managers of all time."}, {"type": "subtitle", "content": "Want more analysis and ideas? Subscribe to my mailing list."}], "topic": "economy"}