{"title": "Five Lessons On Life From Zen Buddhist Master Shunryu Suzuki", "data": [{"type": "subtitle", "content": "You yourself make the waves in your mind."}, {"type": "sentence", "content": "I remember when I was a teenager, I was quite stubborn. In many ways I still am. What makes my current mindset different from that of my old self is the fact that I am actively working on getting rid of this hard headed nature."}, {"type": "sentence", "content": "I was a basketball player in high school, with delusions of future grandeur. One day the coach tried correcting my shooting stance, yet I ignored the suggestions. I knew better."}, {"type": "sentence", "content": "The problem was my ego. It prevented me from seeing that I could be wrong. It was only after I started reading books influenced by Taoist and Zen Buddhist thought that I started waking up to all the basic mistakes I was making in my life."}, {"type": "sentence", "content": "One concept stood out for me. It was “shoshin”, the beginner’s mind. In order to progress you need to get rid of your ego, and start seeing things from the perspective of a beginner. This was a revelation that changed my entire world-view."}, {"type": "sentence", "content": "One of these life changing, mind blowing books of wisdom is a little book called “Zen Mind, Beginner’s Mind”. This is a collection of talks given by Shunryu Suzuki, a Zen Buddhist master."}, {"type": "sentence", "content": "Towards the end of his life, Suzuki moved from Japan to the US. His work was instrumental in popularizing Zen Buddhism in the US and around the world."}, {"type": "sentence", "content": "The book is divided into 3 sections titled:"}, {"type": "sentence", "content": "These three phrases correspond to body, feeling, and mind."}, {"type": "sentence", "content": "Reading the book will help you if you feel your life is chaotic and lacks direction. Modern life is all about being bombarded with emails, pressure at work, and just general nonsense. Now a global pandemic has disturbed life as we know it. This has made many people feel agitated, stressed, and anxious."}, {"type": "sentence", "content": "The lessons of Zen master Shunryu Suzuki can be life changing. Applying them can show you how to have a calm mind in all the noise happening around you. Who knows, maybe they can even start your journey towards enlightenment."}, {"type": "subtitle", "content": "Empty Your Mind"}, {"type": "sentence", "content": "Zen Buddhists believe that the original state of a person’s mind is non-demanding and pure. However over time it gets corrupted and loses its state of self-sufficiency."}, {"type": "sentence", "content": "Ego thinking takes over your internal mental states. Your motivations become less pure, more centered on selfishness. This makes it much easier for your mind to transgress and become immoral. This is how stealing, cheating, or other vices enter your behavior."}, {"type": "sentence", "content": "Shunryu Suzuki mentioned that for most people these ego-centered ideas usually end up taking over their life. This leads to a karmic life, a cycle of actions and reactions which shape your destiny."}, {"type": "sentence", "content": "In order to get away from karmic life, you need to empty your mind first. An empty mind is ready for anything, and open to anything. The key here is to get back to that pure state where you had no ego, and your only want was to learn."}, {"type": "sentence", "content": "This type of mindset is found in babies, and beginners. The Japanese term for this is “shoshin”, or beginner’s mind. To truly learn, this is the state you need to be in."}, {"type": "sentence", "content": "By adopting this type of frame in any situation that you are faced with, you can get away from all the negative things that are holding you down. Instead, you enter a state of true joy and positivity. This is the Zen mind."}, {"type": "sentence", "content": "If you want to have a Zen mind, you need to keep your beginner’s mind. It’s a mind that is open to different possibilities, one that is ready to doubt, and to accept. In this way it differs from the mind of an expert, which is usually set in its ways and habits."}, {"type": "sentence", "content": "The key to having a beginner’s mind is not to have self-centered thoughts. Instead take a step back and stop thinking of achievement. It is about having a non-ego attitude."}, {"type": "sentence", "content": "Shunryu himself could serve as an example of a person with this type of attitude. He was a modest man. In many ways his attitude epitomized Socrates’ statement “All I know is that I know nothing.”"}, {"type": "sentence", "content": "The words “satori” or “kensho” are the Japanese terms linked to enlightenment or Buddha-nature. In the foreword, the editor of the book mentions a joke by Shunryu’s wife about why the Zen master very rarely mentions these terms. It’s probably because he “never attained satori.”"}, {"type": "sentence", "content": "Even as he became a renowned Zen master, Shunryu stayed humble and didn’t let hubris get to him. His ego never entered the equation. Wise as he was, he could see that just like Socrates, all he knew is that he knew nothing."}, {"type": "sentence", "content": "This is probably the most important lesson to always remember. You need to empty your mind, stay humble, and approach everything with a beginner’s mind. If you get rid of your ego, you will open yourself up to something much greater."}, {"type": "subtitle", "content": "Work on Yourself First"}, {"type": "sentence", "content": "Suzuki’s great insight was that people are control freaks. They try to organize things around them. However, they never realize the fact that you can’t order things, if you yourself are not in order."}, {"type": "sentence", "content": "That’s why you need to work on yourself first. The purpose of Zen teachers is to open up your mind, to get you to wonder. In this way you start posing questions and answering them, finding your own nature in the process."}, {"type": "sentence", "content": "In many ways this is very similar to the ancient Greek mantra to “know thyself”. Suzuki mentioned that the purpose of studying Buddhism is not to study Buddhism, but instead to study ourselves."}, {"type": "sentence", "content": "This focus on your inner state reminds you of the fact that the only thing under your control is you. Life is about taking things into your own hands. Don’t expect anything from anyone. It’s up to you how you act in the face of life."}, {"type": "sentence", "content": "Unless you help yourself, you will not be able to help anyone. And furthermore, no one will be able to help you. One thing to realize is that the priorities of most people are wrong. They chase money, fame, or spend their time satisfying their instant gratification."}, {"type": "sentence", "content": "Working on yourself implies clearing your mind of illusions. It’s not just about having empty values, but also how you approach things. Shunryu reminded his students that a lot of things are outside human control. What you need to do is to just observe."}, {"type": "sentence", "content": "A big part of Zen practice is meditation. This involves sitting in a lotus position called zazen. While seated like this, you are supposed to breathe and try not to think about anything. Zazen practice requires discipline, but it is a necessary step for mastery over yourself."}, {"type": "sentence", "content": "For Zen Buddhists, this practice is the path towards enlightenment. Breathing cultivates awareness of the true nature of humanity. And this realization is part of achieving Buddhahood."}, {"type": "subtitle", "content": "You Yourself Make The Waves in Your Mind"}, {"type": "sentence", "content": "Zen Buddhism has many parallels with Stoicism. It is not the events themselves that matter, but your opinion of them. It’s not the outside that causes trouble, instead you yourself are the one who makes waves inside your mind."}, {"type": "sentence", "content": "The point of Zen is to help you to remain calm in midst of a chaotic world. While things happen around you, the true reality lies inside your thoughts. Zen practitioners make a distinction between a “small mind”, the mind driven by your ego, and the “big mind”, your higher self at peace."}, {"type": "sentence", "content": "It’s about being above it all. The big mind is a calm mind. Thoughts inside your mind are just like waves in the ocean. You can’t stop them from coming, but you can lessen their impact. This you learn to do when you switch over to your big mind while doing zazen, breathing, and sitting in the lotus posture."}, {"type": "sentence", "content": "One part of accessing the big mind is changing the frame you take towards things. As Suzuki says, most people are always complaining about something. However, a student of Zen turns this bad thing into a good thing."}, {"type": "sentence", "content": "For example, one person could see failure as something to be sad about. However, a person using their big mind turns it into a learning opportunity. Not only do you learn about how to do things better, you learn about yourself."}, {"type": "subtitle", "content": "Real Calmness is Found in Activity"}, {"type": "sentence", "content": "The aim of Zen Buddhist practice is a calm mind. This is usually done sitting in zazen, engaged in mindfulness and meditation. However, Suzuki says that this is not the only way to achieve calmness. Real calmness can be found in activity itself."}, {"type": "sentence", "content": "While this might seem a bit abstract, I have discovered what he means by this. In the past few years in order to get away from the chaos of modern life, I started engaging in strenuous activities that really challenge me. I took trips to train in martial arts in Thailand, but also did high-altitude hiking and climbing."}, {"type": "sentence", "content": "Hiking in nature is where you experience calmness. It is also where you really get to live in the now. For you are stuck between your start and your destination, and the only thing you can do is to keep on moving."}, {"type": "sentence", "content": "As you get more and more tired, you concentrate on each step. It’s all about putting one foot in front of the other. Martial arts training also gives you similar types of feelings. Maybe that’s why in Japan, Zen practitioners are also often martial artists."}, {"type": "sentence", "content": "One piece of advice that Shunryu gave to his disciples is to engage in the things that they do with their whole body and mind. You need to be engrossed in your activity."}, {"type": "sentence", "content": "This advice is similar to what people like Einstein gave as well. In a letter to his son, Albert Einstein wrote that the secret to learning is to do things with such enjoyment that you don’t notice that time passes."}, {"type": "sentence", "content": "When you are fully engaged in an activity, you enter a state of flow. This is a concept that modern researchers have used to describe a mental state of being fully immersed in an activity. You are in the “zone”."}, {"type": "sentence", "content": "It’s about hyperfocus and concentration. In such a state you merge action and awareness, and your sense of time and space is distorted. You become so engrossed with the experience that other things stop mattering."}, {"type": "sentence", "content": "Some people have even posited this state as the key to happiness. Zen Buddhism doesn’t believe in duality, but instead in oneness. This means that there is no difference between your mind and body. They are one. In states of flow, this becomes a reality."}, {"type": "sentence", "content": "However, you need to keep in mind that the point of doing activities should not be to seek things that are outside your control. If you do that, you will never find them."}, {"type": "sentence", "content": "There is a difference between seeking calmness or any other larger abstract goal like freedom, and doing activities that could (but might not) result in calmness or freedom."}, {"type": "sentence", "content": "These things are largely outside your control. The only thing you can do is to engage in activities, and find calmness or freedom on the way. They will be a by-product of what you do. Don’t seek, but do!"}, {"type": "subtitle", "content": "The Struggle Itself Gives You Meaning"}, {"type": "sentence", "content": "It is the struggle itself that gives you meaning. Zen Buddhism is all about the journey. The destination is just secondary. This type of thought really epitomizes the old Nike slogan of “just do it!”"}, {"type": "sentence", "content": "For Zen masters excellence is not the goal, but perseverance is. Practice of Zen isn’t about achieving certain results. It’s about bringing focus."}, {"type": "sentence", "content": "When you start practicing Zen, or any other activity, you will most likely struggle at first. That’s OK. To struggle is the point. It actually lets you learn and allows this to stick better."}, {"type": "sentence", "content": "In fact, those people who find great difficulties in practicing Zen (or anything else) will find more meaning in it. People usually don’t really appreciate what they get for free, but treasure things that took effort to achieve."}, {"type": "sentence", "content": "Talent often doesn’t matter. Suzuki gives an example of horses. The best horse, the one which has the most talent, might cruise naturally at the beginning. However, it might not work as hard to improve."}, {"type": "sentence", "content": "On the other hand, the worst horse might struggle at the beginning. However, by working hard, at the end it can become much better than the naturally talented horse. Hard work beats talent."}, {"type": "sentence", "content": "Talented people often reach a plateau and struggle once they reach a certain stage. One reason could be that they are coasting on their talent, and don’t adopt a beginner’s mind."}, {"type": "sentence", "content": "Suzuki emphasized practice. This was the key to everything. You don’t become better by reading about it. You become better by actually practicing. That’s why whenever you want to improve in anything, you need to have a two-pronged strategy, where you combine reading and learning with actual practice."}, {"type": "sentence", "content": "All this advice is very practical for every day life. In a world of hustle and bustle, in a world halted to a standstill by a pandemic, Shunryu Suzuki’s tips can help you to gain perspective. Above all, they can show you how to keep a calm mind."}, {"type": "sentence", "content": "This type of mindset can really make a difference as you face your challenges day to day. Remember, a Zen mind is a beginner’s mind."}, {"type": "subtitle", "content": "Mind Cafe’s Reset Your Mind: A Free 10-Day Email Course"}, {"type": "sentence", "content": "We’re offering a free gift to all of our new subscribers as a thank you for your continued support. When you sign up using this link, we’ll send you tips on how to boost mental clarity and focus every two days."}], "topic": "mindfulness"}