{"title": "Can We Live in Harmony with Nature?", "data": [{"type": "subtitle", "content": "I spent two months camping in the challenging, wild bush of Kenya, Africa to find out."}, {"type": "image", "content": "https://miro.medium.com/max/7374/1*QmJv_huaMsSOG42i6KEP7Q.jpeg"}, {"type": "sentence", "content": "Our altered world is adjusting norms and many of us are seeking new ways to fulfill our basic needs, such as physical movement. More people are turning to and discovering the healing power and beauty in nature as they move out of doors."}, {"type": "sentence", "content": "By the time I left Europe for Africa with my Swiss friend Anna, I had already embarked on numerous challenging expeditions in radically different environments. The most taxing exploration I underwent was a two month journey down the Amazon River from Rio Napo, a small tributary in Ecuador, to Belem, Brazil at the rivers’ mouth in the late 70's."}, {"type": "sentence", "content": "Anna had been steadily asking me for two years, to accompany her to the bush on Manda Island, across the Mikanda channel from Lamu, Kenya. She and her partner had constructed a shelter there and camped four months of each year for ten years until they broke up, abandoning the hut to reabsorb into the wild. Her heart was linked to this place and she was deeply longing for one last immersion. Knowing we held similar values and that I could adapt to many variances in nature was a key factor in her petitions."}, {"type": "sentence", "content": "At the age of 31, I felt an internal shift developing as my desire for ongoing global treks was being replaced by the prospect of a meaningful, stable career. I decided to take her up on her offer as a guide and companion to a very challenging locale as a last hurrah in the wild. I wanted to see what I was truly made of, in terms of sheer grit."}, {"type": "sentence", "content": "After arriving in Lamu, Anna contacted her friend Obo. He readily agreed to sail us through the Mikanda Channel to Manda Island in his majestic wooden dhow. He eventually steered through a small gap in a lengthy coral reef, landing us on the beach of an immense lagoon, nature’s vast swimming pool, free of the perilous currents in the Indian Ocean."}, {"type": "sentence", "content": "It was late afternoon and we had precious few hours of daylight left before the abrupt and early equatorial sunset. We were relieved to see the hut still standing, catching our first glimpse of it as we scrambled up a sand dune. Although it was in obvious disrepair, at least it gave us something to begin with and a bit of protection from the wildlife."}, {"type": "sentence", "content": "We entered the site with the utmost respect for whatever might be awaiting us. We were human intruders and needed to lessen our impact as much as possible. We immediately discovered a large nest of biting ants barring our entry into the shelter. We felt sorry disturbing the ants, but they had to go."}, {"type": "sentence", "content": "We made a fire and used the coals to uproot them as they scurried about, biting our feet and ankles on the way to a new home. Meanwhile, I was about to move deeper into the shelter when I heard a rustle in a pile of grass mats in the corner."}, {"type": "sentence", "content": "I ran and told Obo I was sure a snake was under the mats. He found a long, sturdy stick and poked the pile from afar. Out shot a red spitting cobra over 8 ft. in length. It rapidly slid up one of the corner support poles and down the other side into the bush. Obo told us these cobras can spit venom from a distance of 5 ft., straight into one’s eyes and cause permanent blindness if the antidote is not available in time. Welcome to the bush!"}, {"type": "sentence", "content": "Obo had to wait for the shift in tides to leave at pre dawn the next morning. After his departure, Anna and I began organizing our camp and making fire to start boiling water for the spicy cups of chai we drank every morning."}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*zFGLCMoRozMAiCkVsFVKaw.jpeg"}, {"type": "sentence", "content": "Dawn light appeared, along with the bees I had been hearing about in Anna’s bush tales for ten years. With a clock timed precision, they arrived in a swarm, searching for sweet water. We sat perfectly still, sipping our chai, as they crawled over our sweating bodies, into crevices, licking our skin for exactly half an hour before zooming off, reappearing again at dusk. This enforced stillness was filled with a unique entertainment as colorful and swift Karman Bee Eating birds swooped into the swarm for their daily meal."}, {"type": "sentence", "content": "The third day of our stay I was practicing yoga in the hut and in a headstand when a slender, bright green snake uncoiled from a rafter above and dangled down to my eye level, checking me out. I softly called out to Anna for help. It was this moment when I knew both of us had gone ‘tropo’, a term describing humans going a bit feral and mentally unbalanced in the tropics."}, {"type": "sentence", "content": "“Wow, a Green Mamba! How exciting to actually see one. They’re very shy and I’ve never had an up close encounter before. What a gorgeous specimen.”"}, {"type": "sentence", "content": "“Hey Anna, I don’t know how long I can hang out in headstand while you have a love fest with the mamba and by the way, aren’t mambas called two steppers because you can die that quickly if they bite you?”"}, {"type": "sentence", "content": "“Yeah, they’re highly venomous so we’ll have to come to an agreement with her if she wants to live with us.”"}, {"type": "sentence", "content": "This sounded logical to us in our ‘tropo’ state. After Anna distracted Daisy, as we ended up naming her, I descended and we sat down to voice our own agenda directly to her long body, now extended along the roof rafter. We told her we would be fine with her presence if she could relocate to the massive thorn tree shading our hut."}, {"type": "sentence", "content": "We watched quietly as she slid away, showing up later in a high branch of the thorn tree where she hung out for three weeks until disappearing. A very anthropomorphic approach to a tricky situation but it seemed to work."}, {"type": "sentence", "content": "On our fifth night we woke up in pitch darkness to the sound of a large animal very nearby. We heard snorts and then to our surprise, crashes against the sturdy, wooden gate barring night entrance to the hut. We shot out of our sleeping bags in alarm as the crescendo increased and the shelter shivered with the impacts. We grabbed our flashlights. Anna went for her spear gun as I armed myself with the machete."}, {"type": "sentence", "content": "We couldn’t believe what we were seeing. Was this a baby rhino and it’s mother on the way to gore us? This beast had short, spindly legs in relation to its’ massive torso, red beady eyes and a most unfortunate face. It was on a frenzied, caffeine high after discovering and wolfing down our black tea grounds we had forgotten to bury that day. I looked it over again and realized it was a humongous wild boar, not unlike the one that had charged me while I was attempting to poop in the Amazon."}, {"type": "image", "content": "https://miro.medium.com/max/5354/1*htRpmMEbCAGRig0NgZod1g.jpeg"}, {"type": "sentence", "content": "We made a lot of noise and threatened the boar, telling him we would turn him into bacon if he didn’t back off. As if our pathetic weapons could make a dent in his tough hide. He eventually became exhausted by his fruitless efforts and stormed away into the bush night."}, {"type": "sentence", "content": "Bobby the boar became a daily visitor at nightfall when he could smell our fish grilling from afar. We felt the ground shake as he closed in on our camp, his snorts and grunts an additional warning call. We made a deal with Bobby just like we had made with Daisy the snake. Bobby could have our leftover fish if he waited until we had our fill. Once this agreement was established, he miraculously showed up a bit later and never stormed out hut again."}, {"type": "sentence", "content": "Many other more benign forms of wildlife began to visit, especially nocturnal ones such as ocelots. They were quiet but sometimes jiggled a cup enough to wake us so we could watch their movements with awe. One night a pack of hyenas woke us with their carrion eating stink and cackling calls, similar to human laughter."}, {"type": "sentence", "content": "Every late afternoon we hiked a couple of miles to a sweet water well where a small group of locals maintained an historic Portugese ruins site. They knew Anna from years past and were very open and friendly, allowing us our two containers of water a day as well as a small bucket over our heads to wash the salt water away."}, {"type": "sentence", "content": "It helped that Anna spoke Swahili fluently. They called us bush babies and laughed at our tales. We brought them small gifts and delighted in their children who taught me wonderful phrases such as maziwa lala, ‘sleeping milk’ to describe yogurt."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*Poe9wVqHlgcLzEyyL0ATLQ.jpeg"}, {"type": "sentence", "content": "We guarded our ration of sweet water with a fierceness, recycling it over and over until it was too putrid to use. Carrying the weight of our full containers each evening for the next days use, constantly reminded us of this precious resource."}, {"type": "sentence", "content": "The few families at Takwa Ruins and the people we ran into on Lamu Island when we resupplied once a week, were our only contact with the outside world. We entered a state of total immersion with nature. We didn’t use any toiletry products such as lotion, shampoo, deoderant or even toothpaste, preferring baking soda. As the days melted by our bodies began smelling like the ocean and air."}, {"type": "sentence", "content": "We lost track of time and entered a parallel universe, resonating in accordance with the earth’s rhythms. We looked forward to our daily meditation sessions with the bees, our rambles through the bush and long swims in the lagoon."}, {"type": "sentence", "content": "In the final week of our two month stay we were treated to a fantasy both Anna and I shared but never considered might happen. One of my camp chores was to wash our dinner dishes in the sand and ocean every morning. On this day, I was scrubbing away when I heard a strange sound, similar to a baby crying. I scanned the beach and saw a very large object washed up on the distant shore. I ran to get Anna and the two of us raced back down the beach."}, {"type": "image", "content": "https://miro.medium.com/max/6522/1*2vICmvlTMkTGRc3_0twTew.jpeg"}, {"type": "sentence", "content": "A dolphin had beached! We thew off our wraps and began gently nudging it back into the water. She spoke to us in a language we didn’t understand but we knew she was in distress. She was very heavy and it took all our strength to push her back in the ocean."}, {"type": "sentence", "content": "Once she could swim again, we thought she would exit safely from the lagoon and our job was done. Imagine our confusion when she began to swim figure eight’s between our bodies standing at chest height in the water."}, {"type": "sentence", "content": "We looked at each other, thinking the same thought. Since she didn’t seem prone to leaving us, would she give us a ride? Yes! Over the next hour we had multiple rides with this amazing mammal. Skin against skin, she took us one at a time on small dives and whirls until we released hold, taking turns. We entered a state of pure ecstasy."}, {"type": "sentence", "content": "We were very concerned she would be stranded in the lagoon and die if she couldn’t navigate the reef opening. Every time we swam with her toward the gap, she would turn around and follow us as we headed back to the beach. We tried over and over to guide her to freedom and yet she persisted in choosing our company."}, {"type": "sentence", "content": "Finally, our exhausted, lean bodies demanded sustenance. We swam with her one last time to the gap and told her we had to go and so did she. We thanked her for the profound gift she had bestowed and begged her to save herself."}, {"type": "sentence", "content": "Swimming as fast as we could back to the beach, we ran up a sand dune and crouched behind it out of sight. She bleeped and whistled for us but we stayed hidden, only peeping up to track her whereabouts. After ten minutes or so, she gave up, successfully entered the gap and swam away. I will never forget the magic of this special moment."}, {"type": "sentence", "content": "We both felt sad leaving our cherished domain, never to return. Bobby, Daisy and other wildlife had become like fierce family pets. Obo came to collect us after we gifted all our supplies and said teary goodbyes to the families in the ruins."}, {"type": "sentence", "content": "Now I knew I could live in the wild, not only in comfort and synchronicity with nature’s pulse, but also holding the knowledge that out of doors was our natural state too."}, {"type": "image", "content": "https://miro.medium.com/max/8064/1*PTFMftFHPCt3ze6Y6blfdA.jpeg"}, {"type": "sentence", "content": "I think of these two months as a blessing and one of the happiest, most peaceful periods in my life. I received an invaluable education from Mother Nature. Treat the environment with respect and steward the earth where ever I might land. I already knew this through my own history, but living this philosophy on a daily basis was another thing altogether."}, {"type": "sentence", "content": "Adapting to what arose, rather than expecting the land and it’s creatures to conform to our desires, showed me how vital it is to co-operate with nature. We humans are always tampering with our resources, installing dams, creating structures blocking the routes wild animals have used for ages, etc."}, {"type": "sentence", "content": "We protect ourselves from exposure to the wild and can’t recall its’ gifts and lessons. We forget our earth is breathing and the elements carry a message, if we will only listen."}, {"type": "sentence", "content": "We can choose to create our own lifeline to our magnificent, spinning planet full of treasures. We can remember this present time, when more of us are engaging with nature and perhaps realizing how far afield we’ve wandered from our true source of sustenance in our modern lives."}, {"type": "sentence", "content": "Earth needs our human compliance to exist in harmony with her offerings. She can be your faithful companion and reorient you into a new state of being. She is willing. Can you heed her call?"}], "topic": "travel"}