{"title": "The Fight Over Free Will", "data": [{"type": "image", "content": "https://miro.medium.com/max/7652/1*-4fe_VdKMVeJ91ktS1bmPg.jpeg"}, {"type": "sentence", "content": "There is still no peace in the war over free will. Philosophers and scientists regularly talk past each other, and it can be difficult to know exactly what someone means when they say “free will is an illusion!” or “free will is real!”. People start with different definitions of what it means to be free, which naturally leads discussions deep into a rabbit hole."}, {"type": "sentence", "content": "Many long and painful debates have focused on what people are thinking when they use the phrase “free will”. So you first need to decide what you think it means to be free. Do you feel as though you have a mind plus a brain, and that your mind makes a decision which your brain then implements as an action? Would it shock you if scientists could read your unconscious brain activity to predict some decision you were going to make — “you” being your conscious mind — before you had made that decision yourself?"}, {"type": "sentence", "content": "Beliefs about mental events preceding brain activity are typically “dualist”. This is the idea that there are separate substances for mind and brain: the mind is an immaterial substance like a soul, and the brain is a material substance made of biological matter. Sometimes, people don’t believe that they’re dualists, but many of their beliefs and actions suggest that they adopt those kinds of assumptions implicitly. Rather than the mind being simply a function of the brain, dualism would mean that the mind can cause events to happen in the brain. The dualist behavioral sequence of buying a coke in a store might look like this:"}, {"type": "sentence", "content": "The dualist notion of a decision beginning with a mental thought rather than brain activity is unscientific. For any intention, thought, or decision you make in your mind, there must have been prior brain activity that determined it, because there’s no other way you could have developed a thought. Thoughts depend on brain activity and cannot emerge independently through any substance outside of the biological matter in your brain and body."}, {"type": "sentence", "content": "So if your very first awareness of wanting a coke emerged at number 1 in the sequence above, some brain activity pattern must have come before it to create that feeling of wanting a coke. And if the brain activity came before your very first experience of a conscious intention, then you must have been unaware of that activity by definition. Therefore, unconscious brain activity determines your conscious thoughts, and a realistic coke-buying sequence would look more like this:"}, {"type": "sentence", "content": "So here’s the first question: Does the sequence above surprise you? If you find it counterintuitive, then you’re certainly not alone. Despite never calling myself a dualist, my early natural intuitions about free will depended on dualist assumptions (conscious thoughts arising before brain activity) rather than scientifically credible assumptions (brain activity arising before conscious thoughts). For that reason, I was shocked when I first came across neuroscience data showing researchers could analyze people’s unconscious brain activity and use it to predict their conscious decisions several seconds before they reported making them. The surprise pushed me firmly into the “free will is an illusion” bandwagon. If neuroscientists can tell me that I’ll choose a coke rather than a smoothie before I make the decision myself, how could I possibly have free will?"}, {"type": "sentence", "content": "Even if someone asked you why you chose a coke at the moment you decided, you’re unlikely to respond with anything more informative than a shrug. Who knows? You kind of just felt like having a coke. The truth is that underlying your immediate urge for a coke was a sequence of unconscious brain activity that ultimately pointed your attention toward the can of coke. That unconscious activity could be caused by many factors within and outside your body that you may never fully grasp. No wonder we shrug so often."}, {"type": "sentence", "content": "But the free will debate doesn’t end there. Yes, all of the scientific principles we know suggest that unconscious brain activity must precede and predict any conscious thought you have, and that scientists may be able to detect your thought before you can, but does that really mean we need to throw the free will out with the flat Earth?"}, {"type": "sentence", "content": "This is where the most interesting part of the free will debate comes in: moral responsibility. Should we say that “free will is an illusion” and find some other logic for holding people responsible for their misdeeds? Or should we resist that temptation, and instead say that “free will exists, but it’s not that dualist stuff where your conscious spirit dictates what your brain should do.” The former camp are typically labeled incompatibilists while the latter camp are labeled compatibilists. Incompatibilists argue that the concept of free will is entirely inconsistent with the fact that our thoughts and intentions are determined by processes outside of our will. Compatibilists argue that you can fully accept both — you can be both determined and free."}, {"type": "sentence", "content": "Compatibilists, including for example the philosopher Daniel Dennett, suggest that the free will we should care about is the kind of free will we already assume people have when they competently sign a contract. If you’re conscious with a sound mind, and you’re unaffected by duress or some other immediate external influence, then you have free will in choosing how to act each day, even if your decisions are ultimately determined by causes beyond your awareness. This is one of the “varieties of free will worth wanting”, as Dennett would put it: simply the capacity to actively and rationally respond to the world around us."}, {"type": "sentence", "content": "In other words, the people involved in the mainstream debate don’t particularly disagree about the physics of human choice. The conversation has instead become a debate about definitions rather than a debate about whether our decisions are ultimately outside of our own control. Most scientists accept that we live in a deterministic universe — all of our thoughts and actions are a consequence of myriad influences from our past that we have no control or even awareness of. But that doesn’t necessarily mean that we should call free will an illusion."}, {"type": "sentence", "content": "It can be both powerful and productive to understand why some people argue that free will is an illusion, because it shatters the common intuition that our conscious reasoning is the first step in our chain of decision-making. One advantage of this shattered belief is that it can help you empathize a little more with the decisions — often bad decisions — that other people make. Is it really worth hating people when their personalities and decisions are ultimately the product of deterministic luck?"}, {"type": "sentence", "content": "Nobody chooses where or when they’re born, and nobody selects the genes or parents they’re born with. The direction of your brain’s development is little more than a huge series of coin tosses, and your daily thoughts and choices are no less mysterious. As thinkers such as Sam Harris — an incompatibilist — often point out, if you pay close attention to your thoughts in the precise moment you experience them, you’ll begin to notice that they really do come out of nowhere. You no more choose the next thought that pops into your head than you do the next beat of your heart."}, {"type": "sentence", "content": "Importantly though, once the dualist intuition of free will has been shattered, it’s time to think a little more deeply about moral responsibility and the nuances buried within the phrase “free will”. Despite thinking like an incompatibilist for many years of my life, I’m now a born-again compatibilist. The free will we should care about is the type that distinguishes someone of rational sound mind from someone with impaired judgment. Immaturity, mental disorders, and overt manipulation can rob us of our healthy capacity to make choices. But under normal conditions, we can maintain the idea that we have enough behavioral flexibility to be considered morally responsible for the choices we make."}, {"type": "sentence", "content": "Behavioral flexibility lies along a continuum. While one person may have an obvious brain tumor that forces their decision-making down a particular route, another person may have an invisible brain abnormality that explains many of their bad choices. We can think of people as having degrees of free will; some more, some less. Everyone’s actions are ultimately determined by causes and influences outside their conscious will — upbringing, unconscious brain activity, and even quantum randomness — but at the scale of any individual person, behavioral flexibility matters enough to be called “free will”. For example, someone who can actively choose between accepting or rejecting an offer is more flexible, and therefore freer, than someone who is blackmailed into accepting it, even if the ultimate origin of every human choice is some unknown mixture of influences outside of personal awareness."}, {"type": "sentence", "content": "If we literally rewound the clock to any moment in our life, and recreated the exact physics of that particular moment, then we couldn’t ever act differently. Our identical body, brain, and world in that moment would determine that we make exactly the same decision again. But who cares? In reality, what matters are people’s decisions in slightly different circumstances. Are you capable of responding adaptively when things change a little or are you eternally condemned to repeat the same mistake because of your brain tumor, handcuffs, or underdeveloped capacity to act rationally? If you decided to beat someone up because they called you fat, would you also have beaten them up if they called you chubby instead? If you were fully conscious and able to reason, then maybe you would choose not to. But if you were sleepwalking, it would presumably make no difference what they said. In that sense, you would have diminished responsibility. That is the kind of free will that matters."}, {"type": "sentence", "content": "The debate is unlikely to end any time soon, but we certainly shouldn’t be hasty about an issue as important as moral responsibility. Do we have free will? I’d argue that most of us are free enough to be held morally responsible for our actions. Yes, we live in a deterministic universe, and yes, our level of behavioral flexibility (or free will if you wish) lies along a continuum. But our institutions, especially our legal ones, frequently require us to make a binary decision about whether someone should or shouldn’t be held responsible for their actions. Until we find something better, we can hold on to our existing notions of moral responsibility by analyzing someone’s behavioral flexibility when judging whether or not they were acting freely."}], "topic": "neuroscience"}