{"title": "Red Bull Untapped with Mardu Knights: a lesson in playing to your strengths", "data": [{"type": "image", "content": "https://miro.medium.com/max/2400/1*yQ3Qg98FzsqAn-02LEyCuQ.jpeg"}, {"type": "sentence", "content": "This past weekend, the Red Bull-sponsored Untapped series of Magic: the Gathering tournaments kicked off its 2020 edition with the first open international qualifier. Hosted on Magic Arena, some four and a half thousand people expressed interest prior to the event, with an actual 2466 competitors turning up for round 1 on the day."}, {"type": "sentence", "content": "Unless you’ve been ignoring Standard completely, you’ll be aware that for a good three weeks, the format bogeyman has been an 80-card menace built around the combination of new planeswalker Lukka, Coppercoat Outcast and Agent of Treachery, utilising the former’s -2 ability on a creature token to fetch out the latter, the only creature in the deck, for ‘free’. Backed up by value engine companion Yorion, Sky Nomad, the deck had a big target on its back going into the weekend."}, {"type": "sentence", "content": "It didn’t seem like anyone had figured out a consistent foil to it however, so the prevailing wisdom — if you wanted to win, that is — was to play the deck."}, {"type": "sentence", "content": "I did not. Play the deck, that is, not not want to win."}, {"type": "sentence", "content": "Why not?"}, {"type": "sentence", "content": "Honestly, I’m a decent player, but I’m not without flaws. Jeskai Lukka is an intense deck to play, with many complex decision points that can win or lose you the game on the spot — especially in the mirror. Eight rounds is a long tournament, especially with the potential delays that corralling players numbering the thousands would likely (and did) cause. Indeed, I think by the end of the final match, I’d been sitting at my computer (give or take breaks) for ten and a half hours."}, {"type": "sentence", "content": "I was loathe to put my fate in the hand of fatigue-induced misplays and the accompanying tilt, so instead I chose to play a more simple deck that I’ve had on my periphery for a while:"}, {"type": "subtitle", "content": "Mardu Knights"}, {"type": "image", "content": "https://miro.medium.com/max/1490/1*VyS-pLG7Y7JIkkpW-2-J8Q.png"}, {"type": "sentence", "content": "Unsurprisingly for a set inspired by Arthurian legends, last October’s new set Throne of Eldraine provided a significant skeleton for a knight tribal deck. Both Fervent Champion and Venerable Knight are good 1-drops, able to provide aggressive starts. There’s a lord in Inspiring Veteran, and a Hero of Precinct One-esque token generator in Worthy Knight. However, prior to the release of Ikoria: Lair of Behemoths, it did feel that there was something missing to make it a competitive deck."}, {"type": "subtitle", "content": "Companion Shenanigans"}, {"type": "image", "content": "https://miro.medium.com/max/530/1*jjZIHppW8Fl5YfHFXbV2Wg.jpeg"}, {"type": "sentence", "content": "One of those missing pieces was (probably?) Lurrus of the Dream-Den. While not as back-breaking in Standard as the card has been in older formats, this kitty companion provides valuable recursion and makes a toolbox out of your graveyard — a potential nightmare for your opponent indeed. The deckbuilding cost is not nothing — we lose access to aggro mainstays like Embercleave that push through important damage— but there are palpable benefits to having access to permanents your opponent has deemed too good to remain in play."}, {"type": "subtitle", "content": "Quick-Draws"}, {"type": "sentence", "content": "While most tribal creature decks are aggressive, people in armour charging around on horses with pointy sticks are particularly bellicose, so this is especially true of knights."}, {"type": "sentence", "content": "To that end, the deck’s 1-drops are pretty decent. Fervent Champion in particular, about the best red can do in the 1cc slot in general at the moment, really gets to shine here. There’s some nice synergy in these early drops too; a pair of Fervent Champions, or a Venerable Knight into a Fervent Champion, can deal 4 damage on turn 2, triggering Knight of the Ebon Legion’s second ability right away."}, {"type": "subtitle", "content": "Noncombat Damage Engines"}, {"type": "sentence", "content": "Other versions of the deck from the weekend (see: Chicken93 and Lee Shi Tian’s top 128-ing builds) preferred more front-heavy two-drops like Blacklance Paragon and Rimrock Knight. This seemed to work for them, but I felt it was a little one-dimensional."}, {"type": "sentence", "content": "What I like about my build of the deck is its ability to reach beyond combat to kill your opponent. Particularly against decks that can throw up a wall of blockers, or who are unable to punish you going wide via a sweeper effect, the combination of Corpse Knight and Worthy Knight make every knight spell you play a Shock to your opponent’s life total."}, {"type": "subtitle", "content": "Support Spells"}, {"type": "sentence", "content": "The support slots are the second important example of Ikoria really adding to the deck. Chief among these is Fight As One, an important tool to fight against red and white sweeper effects and punish your control opponents’ reliance on them to push through to the midgame. This deck has the ability to kill on turn 3 or 4 if unhindered, and sweepers are the primary way that you get punished."}, {"type": "sentence", "content": "Dire Tactics is just about as efficient removal as you could hope for. The majority of the deck is human, meaning you rarely feel Dire Tactics’ drawback. If you ever do find yourself without a human, you’ll either be trying to close out the game with non-humans, or your board is stone empty, in which case you’ve probably lost anyway."}, {"type": "subtitle", "content": "If Not Jeskai Lukka, Why Mardu Knights?"}, {"type": "sentence", "content": "Standard is actually quite open at the moment. Aside from Jeskai’s dominance, there are plethora of competitive decks, and thus a lot to account for."}, {"type": "sentence", "content": "The primary reason I was happy to sleeve Mardu Knights up for the weekend was its polarising matchups. While 50/50 matchups allow good players to leverage their playskill, the ability to give at least some of the field a good old fashion floor-mopping ensures at least some wins, hopefully avoiding the dreaded 0-X record."}, {"type": "sentence", "content": "Right off the bat, this deck goes toe to toe with any aggro deck, and I found it usually came out on top. In particular, against the Boros Cycling deck it seems almost impossible to lose, outside an overactive Drannith Healer and a couple of Zenith Flares. Against Flourishing Fox, Worthy Knight makes a steady supply of tokens to chump block, and their deck doesn’t really pack much removal, so Lurrus really shines. If they’re on the Valiant Rescuer plan, you can go just as wide on board, and leverage your alternative damage engine to drain them out, while Dire Tactics takes care of anything particularly disagreeable to your gameplan."}, {"type": "sentence", "content": "Decks featuring Obosh, The Preypiercer can be tricky, but again, going wide stalls the board against them, and as long as you save your limited spot removal for the Big Nasty, you should be fine. The red versions don’t have Embercleave to punish chump blocks, and the black versions aren’t generally aggressive enough to finish you off quicker than you can kill them."}, {"type": "sentence", "content": "Against big daddy Lukka, it’s 100% dependent on being on the play or draw, and whether or not they have the sweeper/you have have Fight As One. Birth Of Meletis’s 0/4 wall token is a tricky roadblock, because you basically just need to try and kill them as quickly as possible."}, {"type": "sentence", "content": "In post-board games, going heavy on Fight As One and Drill Bit give you the best possible chance of avoiding the game-ending wrath. It won’t always see you through — the ever-presentbut often it’s enough."}, {"type": "subtitle", "content": "Sideboarding"}, {"type": "sentence", "content": "The sideboard was imperfect going into the tournament, but I did end up using every card at least once. The problem is that you rarely want to dilute your main gameplan too much, so instead of going into matchup-specific numbers, I’ll give you a rundown of each card’s main uses, so you can decide for yourself."}, {"type": "sentence", "content": "4 Drill Bit"}, {"type": "sentence", "content": "An all-star against control strategies, Drill Bit neatly sidesteps the traditional downsides of Duress by hitting haymaking creatures too: Uro, Titan of Nature’s Wrath, Nightpack Ambusher, and the odd Hydroid Krasis often set up an unassailable roadblock on the other side of the board that Drill Bit lets you deal with before they become a problem."}, {"type": "sentence", "content": "More than anything though, it allows you to hit your opponents’ sweepers on the crucial turn before they play them — or, if they have two, stops you over-committing to the board in an effort to seal the win as quickly as possible."}, {"type": "sentence", "content": "2 Fight As One"}, {"type": "sentence", "content": "A second hedge against sweepers, Fight As One is also useful against the non-Lurrus versions of Rakdos Sacrifice. Mayhem Devil can absolutely wreck your day, but Fight As One helps you keep things alive, but also win combats you otherwise shouldn’t."}, {"type": "sentence", "content": "2 Embereth Shieldbreaker // Battle Display"}, {"type": "sentence", "content": "Troublesome artifacts don’t come up as often as troublesome enchantments (I’m looking at you, Fires of Invention/Wilderness Reclamation), but there are a couple that it’s important to kill as early as possible."}, {"type": "sentence", "content": "Chief among these is Witch’s Oven. Many decks are playing Grafdigger’s Cage to deal with Cat/Oven and Lurrus-type bullshit, but these decks are wise to the plan, and often pack a Battle Display or two of their own to deal with it. It’s much better to deal with the opposing problem permanently if possible, while leaving yourself an additional knight in exile to add to the board later."}, {"type": "sentence", "content": "2 Dire Tactics"}, {"type": "sentence", "content": "Bringing the suite up to the full four in matchups where there are some must-kill threats that you can’t steamroll, the exile clause is particularly effective against the likes of Anax, Hardened in the Forge."}, {"type": "sentence", "content": "2 Order of Midnight // Alter Fate"}, {"type": "sentence", "content": "There are a few grindy matchups, such as against sacrifice decks, in which you can’t afford to let their removal keep you off your gameplan. The primary target for Alter Fate is your own Lurrus, once they’ve smugly removed yours the first time. After that, it’s a useful flier, and yet another knight for all the other synergies."}, {"type": "sentence", "content": "2 Soul-Guide Lantern"}, {"type": "sentence", "content": "This is the card I’m least sure about, but it basically completely closes the door against Zenith Flare, so use against the Cycling deck at your discretion."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "I finished 6–2 on the day, a heartbreaking single point and seven places outside the cut for day 2, but I’m thrilled with how the deck performed. I faced 3 Yorion decks in the first four rounds, and beat them all. The two losses came to one Jeskai Lukka deck (piloted by the talented Thiago Rodrigues of Hareruya Hopes) and a very spicy creature-based version of Esper Yorion, against whose Oath of Kayas and Charming Prince/Yorion loop I felt the deck had no chance."}, {"type": "subtitle", "content": "Should I Play It?"}, {"type": "sentence", "content": "What Mardu Knights may be lacking in raw power, it makes up for in speed. If you feel the format is going too big and not respecting aggro, then it’s a good choice. You’ll often know within the first few turns whether or not you’re going to win, and there is no small amount of value in that over the course of a long tournament."}, {"type": "sentence", "content": "At the weekend, it felt like some of the control players were swinging back round to accounting for aggro with a number of Deafening Clarions and Archon of Sun’s Grace making the best lists. If this remains the case, it might be best to leave the Neapolitan Knights in your virtual binder."}, {"type": "sentence", "content": "There are a number of tournaments on the horizon, including the first Arena Open on May 30th, and the continuation of the Red Bull Untapped series in June and July. I’ll be competing where I can, and writing about what I learn. If you enjoyed this article, please come back and see what I have to say about those tournaments, and follow me on the links below!"}, {"type": "sentence", "content": "Follow Chris on Twitter: https://twitter.com/simia_dei"}, {"type": "sentence", "content": "Watch Chris on Twitch: https://www.twitch.tv/simia__dei"}], "topic": "gaming"}