{"title": "Sexually Abused at The Age of Eight", "data": [{"type": "subtitle", "content": "Abusing a kid can destroy their entire existence, and I’ve seen it up close in the life of a woman I love."}, {"type": "image", "content": "https://miro.medium.com/max/6536/1*zVxXh0xAEGJTwFVAxKYFIA.jpeg"}, {"type": "sentence", "content": "Trigger Warning: this article contains discussions of sexual assault that may not be suitable for all readers. Fearless community, please read with care."}, {"type": "sentence", "content": "“One day, you will find my diary, and only then will you understand everything.”"}, {"type": "sentence", "content": "As she said these words, a hidden and painful truth moistened her eyes."}, {"type": "sentence", "content": "It had always seemed evident to me that she was carrying a burden that shattered her inner peace. But I couldn’t know what it was — she never shared it with anyone."}, {"type": "sentence", "content": "But that day, with those words, she had shed a mystery into my soul for which, one day, I would probably find answers. Such secrecy turned into fear that grabbed me by the guts."}, {"type": "sentence", "content": "“One day, you will find my diaries, and only then will you understand everything.” — her words repeated over and over on my head."}, {"type": "sentence", "content": "In March of 2020, as she was going through the last days of her life, I went to pick up her belongings from the hospital. After an endless two year stay in a sorrowful hospital room, she had accumulated quite a lot of stuff. Letters from her friends, some still unopened, gifts from the family, postcards, or that book I once gave her."}, {"type": "sentence", "content": "Between her belonging, I also found her diary notes."}, {"type": "sentence", "content": "I was hysterical as I found myself in front of her handwritten diary notes, and I shook as I realized I was about to read them."}, {"type": "sentence", "content": "I wasn’t sure if I was ready, but I knew she wanted me to be — it may be time to discover a painful truth."}, {"type": "sentence", "content": "What I would have never been strong enough to face, not even in a hundred lives, is what I stumbled upon short after, and which would scar my life forever:"}, {"type": "sentence", "content": "I became pale. She was sexually harassed.At the age of eight."}, {"type": "sentence", "content": "A soulless man had abused her at the age of eight. A tsunami of feelings went through my heart. It felt like a hundred sharp knives pierced every corner of my body as if my flesh was butter."}, {"type": "sentence", "content": "I continued reading."}, {"type": "subtitle", "content": "Her secret answered many questions."}, {"type": "sentence", "content": "Sexual harassment when she was just a kid. That answered many things, from her perpetual sadness or apathy to her various mental illnesses throughout her life."}, {"type": "sentence", "content": "My head got overloaded with questions and martyrized with conjectures and improvised answers."}, {"type": "sentence", "content": "I had always wondered why an aura of sadness had constantly surrounded her or why she hardly ever shared any feelings. That burden she had always carried was so vast that it prevented her from having a happy life."}, {"type": "sentence", "content": "It was hard for her to act on her own without needing the approval of others, and one could quickly notice her inability to care or love herself."}, {"type": "sentence", "content": "Most of the time, she preferred to remain invisible to people’s eyes, to hide from the world, to go unnoticed."}, {"type": "sentence", "content": "She avoided interacting with anyone — each personal contact bred anxiety in her; it meant too much effort and trouble. If one rang the bell, she’d closed the curtains pretending not to be home. If one called on the phone, she would most likely not pick it up."}, {"type": "subtitle", "content": "I will never be able to tell her that I understand."}, {"type": "sentence", "content": "I would have loved to talk to her about it, but when I discovered the truth, it was too late — she was already incapable of speaking and almost unable to continue breathing. She was dying."}, {"type": "sentence", "content": "I will never be able to tell her that I understand; that it’s ok to have been sad and devastated; that she was so brave to have three children and that she was a good wife, mother, sister, friend."}, {"type": "sentence", "content": "That we all loved her just as she was, even hiding behind the curtains or not answering our calls."}, {"type": "sentence", "content": "I wouldn’t be able to tell her any of that, which broke my heart, as I felt the deepest helplessness."}, {"type": "subtitle", "content": "I understood she was ready to go."}, {"type": "sentence", "content": "She had been on the verge of death for so long already, and now, I understood that the moment had arrived — she was ready to go and rest in peace, knowing I would always comprehend her perpetual sadness."}, {"type": "sentence", "content": "Now that I had finally found out the truth of her endless pain, she didn’t have any pending burden to be uncovered by the people she loved."}, {"type": "sentence", "content": "The following morning, as I woke up, I received the news that she had stopped breathing during the night."}, {"type": "sentence", "content": "I believed, in a wave of awareness and understanding, that she had been waiting for me to know the truth before saying the last goodbye."}, {"type": "subtitle", "content": "Child abuse had clouded her entire life."}, {"type": "sentence", "content": "Sexual assault can wreck anyone’s life. And when that happens to a child, it can destroy their entire existence, and I’ve seen it with my eyes in the life of a woman I love."}, {"type": "sentence", "content": "Now I understand that she lived for more than sixty years with post-traumatic stress disorder."}, {"type": "sentence", "content": "Sexual harassment had changed the way she perceived the world and the reality around her. It did affect not only all her human relationships and connections for life but also her ability to express any emotion."}, {"type": "sentence", "content": "Everything made her feel vulnerable as when she was eight years old."}, {"type": "sentence", "content": "From now, the memories of that inhuman abusing her when she was a vulnerable kid will never haunt her again. She left us having our love and full understanding, always and forever."}, {"type": "sentence", "content": "However, I’ll be my entire life trying to understand why she wanted it this way, why she decided to keep for herself her devastating story."}, {"type": "sentence", "content": "It has been crucial for me to know her truth, but it has scarred my soul forever. Would I have discovered that any woman had suffered this monstrous experience, it would have been devastating."}, {"type": "sentence", "content": "But in this case, it is especially so, because that woman was my mother."}], "topic": "mental-health"}