{"title": "Use Evergreen Webinars As A Smart Ploy For Your Knowledge Commerce", "data": [{"type": "image", "content": "https://miro.medium.com/max/1696/1*R-C1_-MkqRwxqrRRRTh-SQ.jpeg"}, {"type": "image", "content": "https://miro.medium.com/max/824/1*6c48bOFtuKguEX3LWdswhA.jpeg"}, {"type": "subtitle", "content": "With Automated Evergreen Webinars, Record Once And Run Repeatedly. And Convert Your Customers With Ease"}, {"type": "sentence", "content": "You are an already overburdened solopreneur in Knowledge Commerce. Your content creation workload is enormous. You have no bandwidth to be conducting live events like webinars to push your selling a notch higher. Right?"}, {"type": "sentence", "content": "But you also know that among all content types and formats, webinars are powerful. A Content Marketing Institute study found this: webinars are in the top five effective content marketing tactics. But you don’t have the time to conduct live webinar events every now and again. Right again?"}, {"type": "sentence", "content": "Well, there’s a smart solution you can use to propel your customer-prospects over the edge. Convert them from dithering to buying by creating “evergreen webinars”."}, {"type": "sentence", "content": "What’s that you ask? At Solohacks Academy, we will show you exactly what evergreen webinars are. See how you can use them as potent selling tools. You don’t need to run regular live events, but you can achieve the same results as if you did. These days evergreen webinars do a fabulous job of offering the experience of live webinars, complete with interactivity simulation."}, {"type": "subtitle", "content": "1. Evergreen Webinars And Their Attractions For Marketers And Customers"}, {"type": "sentence", "content": "Even as webinars are great for marketing, a solopreneur always finds it hard to get the time to create hours’ worth of quality video content and stage really interactive events every now and again. That’s where the evergreen webinars come in and make life painless."}, {"type": "subtitle", "content": "a. What Are Evergreen, Automated, On-Demand Webinars?"}, {"type": "sentence", "content": "The term “webinar” comes from the words “web seminar”. Webinar marketing, in and of itself is a powerful selling tool for marketers of all kinds of products online. Webinars have the feel of a 45–60 minutes classroom — a video tutorial — where the marketer lays out a structured or semi-structured presentation of his topic and his product. He also invites questions that he can answer from participants."}, {"type": "sentence", "content": "By the end of the webinar there is also a good discount offer on the product the marketer is selling — to sweeten the deal for those who’ve invested time attending and listening to the webinar. Why webinars sell products so well is because people like the experience of an event that helps them over the edge from hesitation to confident buying."}, {"type": "sentence", "content": "We know what webinars are. But then what are “evergreen webinars”?"}, {"type": "sentence", "content": "Evergreen webinars are webinars that you can record once, and replay again and again"}, {"type": "sentence", "content": "Evergreen webinars are also known as automated or on-demand webinars. How do they work?"}, {"type": "sentence", "content": "To the solopreneur knowledge marketer, evergreen webinars offer a huge advantage. You can record webinars once, and can replay them again and again thereafter. They look and feel like live webinars. You have a speaker teaching something — or a marketer selling something. But you also have a simulated side-panel to the main teaching screen. It acts as if live discussions are taking place among attendees. The speaker can even answer some of these questions from these “attendees”. People would then feel even more like they are attending a live webinar."}, {"type": "sentence", "content": "You can also schedule certain times when the webinar will take place"}, {"type": "sentence", "content": "It will give registrants a further feeling of waiting to attend a live event. Making customers wait a bit before getting something they want — some crucial information or an attractive price-offer — is a well-known marketing tactic. Delays make the FOMO factor come into subliminal play. What is FOMO? Its’s the “Fear Of Missing Out”."}, {"type": "sentence", "content": "There’s a fine difference between evergreen, automated and on-demand webinars"}, {"type": "sentence", "content": "It depends on the degree to which you want to be transparent. It depends on whether you’d like to create a feeling that people are being asked to attend a live event. Or you can choose to be transparent. Tell people that it is a recording of an earlier-completed or pre-recorded webinar."}, {"type": "sentence", "content": "You could also make evergreen webinars “on-demand”. That means people can register at any time and see it at a time convenient to them — even immediately. They don’t need to wait for scheduled replays."}, {"type": "subtitle", "content": "b. Why Show People A Pre-Recorded Webinar When You Can Show A Video Instead?"}, {"type": "sentence", "content": "The answer lies in the numbers. People who are watching a video stay for only 10% of the video on average. They then leave."}, {"type": "sentence", "content": "People in a live webinar environment, stay for as long as 90% of the duration of the webinar."}, {"type": "sentence", "content": "Why is that? That’s because most webinars have some big offer to make towards the end, which could be “unpassable”. People like waiting and watching out for that."}, {"type": "sentence", "content": "No one likes to abandon any program midway that they know will have some thing of value right at the end."}, {"type": "sentence", "content": "Videos allow fast forwarding to the end. However during live webinars events, or even “on-demand webinars” you cannot fast-forward the video to see the end. Everything in an evergreen webinar is similar in feel and activity to a live webinar event … except that it’s not really “live”. It’s simulated “live”."}, {"type": "sentence", "content": "Always focus on providing highest quality content within your evergreen webinar."}, {"type": "sentence", "content": "Remember one thing. Since you eliminate the real-time interactivity from your webinar by making it pre-recorded, you have to do something to make it up to your webinar watchers. That’s why it’s important to provide really valuable and unique content, before you think of the selling pitch at the end of the webinar for your products."}, {"type": "subtitle", "content": "c. Why Do Customers And Marketers Love Webinars, Especially Evergreen Ones?"}, {"type": "sentence", "content": "A great quote that defines why you should use evergreen webinars is this one … from Hayley Friedman:"}, {"type": "sentence", "content": "“When it comes to converting customers, there are few things more powerful than a webinar … and few things more passive than an evergreen webinar.”"}, {"type": "sentence", "content": "Research says that the average webinar viewer tunes in for over 22 minutes"}, {"type": "sentence", "content": "That’s a lot of time spent on listening to marketing spiel. Why do customers seem to love webinars? It could be because webinars give them a break from whatever they are “doing”. They get time off “doing” to relax without guilt, and get some “learning”."}, {"type": "sentence", "content": "Some marketers say that customers may not like the idea of a pre-recorded webinar. They say customers prefer the interactivity possible with a live webinar. Attendees can ask questions and get doubts cleared — and that seems like a huge plus-point."}, {"type": "sentence", "content": "But on the flip side, live events may have inconvenient timings for some global time-zones. And the scheduled event timings may not suit people’s work/life balance."}, {"type": "sentence", "content": "Customers who like evergreen offer these alternate explanations"}, {"type": "sentence", "content": "They say they like registering and watching right away. Pre-recorded or on-demand webinars let them do this. There’s no waiting for the scheduled times, like live webinars."}, {"type": "sentence", "content": "They can also stop midway or watch in convenient parts. If they have questions unanswered in the webinar, they can always email the marketer. The questions can be even more detailed than ones you can ask during a webinar."}, {"type": "sentence", "content": "For marketers, webinars (especially evergreen ones) are a no-brainer"}, {"type": "sentence", "content": "Webinars give them a chance to give customers a “one-to-one” feel at scale. They are the alternative to one-off sales calls, or face-to-face meetings. You can market to tens of thousands of your customers at once, with all them feeling like they are being addressed exclusively on their personal pain-points."}, {"type": "sentence", "content": "Statistics reveal that people who watch webinars are 64% more likely to buy. But even that sounds like a small figure. Some marketers say they’ve touched close to 300% conversion increase with webinars."}, {"type": "sentence", "content": "Now add to all this the fact that evergreen webinars can help you achieve all this and more while you’re asleep. Is there a better way to make passive income?"}, {"type": "subtitle", "content": "2. Sharpen Your Strategy By Knowing When It’s Best To Use Evergreen Webinars"}, {"type": "sentence", "content": "Instead of merely valuing evergreen webinars for their convenience, see if they can form a distinct part of your marketing strategy. It helps to get clear on when evergreen webinars can work best for your business, and how you will therefore create, maintain, update and use them."}, {"type": "subtitle", "content": "a. When Should You Prefer Evergreen Webinars Over Live Ones?"}, {"type": "sentence", "content": "The main difference between evergreen and live webinars is that evergreen webinars are automated and recorded once. Live webinars are held one-time only. But the content of both could be the same. Only the presentation method changes."}, {"type": "sentence", "content": "Evergreen webinars are better if you would like these advantages"}, {"type": "subtitle", "content": "b. How Can You Make Sure Your Webinars Stay Evergreen?"}, {"type": "sentence", "content": "Let’s face it. No piece of content is going to stay evergreen because things in the online world do change. What’s relevant in your niche today might not be so one year later."}, {"type": "sentence", "content": "Also, the demands of your target audiences may change. People evolve all the time. Or your product may change and you may need to include new audiences."}, {"type": "sentence", "content": "Despite all this churn, it still makes sense to try and reduce your content workload as much as possible."}, {"type": "sentence", "content": "Create content that can stay evergreen for as long as possible"}, {"type": "sentence", "content": "While doing this, you have to exert your creativity. Your webinar still has to contain some excitement value for the audience. It cannot afford to become a drab event. This is where your thinking cap has to work. You have to come up with webinar content ideas with both longevity and some currency."}, {"type": "sentence", "content": "A few things you should avoid, though, are these:"}, {"type": "subtitle", "content": "c. Four Marketing Situations Best Suited To Automated, Evergreen Webinars"}, {"type": "sentence", "content": "Marketing products or services that need more consumer education"}, {"type": "sentence", "content": "Some products need a lot of consumer education before people buy them. For example, let’s take a skin care cream, with a new breakthrough ingredient. It needs to help people learn about this new ingredient and see scientific proof of its results. It needs to explain and show its difference. Consumer education is likely to be a long, slow process before it gains traction."}, {"type": "sentence", "content": "When something is new in the market, you must build trust with your audience. To build trust, you have to proliferate your knowledge to keep reinforcing your uniqueness."}, {"type": "sentence", "content": "For your evergreen webinar, you can screen-share a PowerPoint presentation. You can choose to talk into the camera for a face-to-face feeling. You can be a lone tutor or collaborate with an expert or an influencer."}, {"type": "sentence", "content": "Most important: see that your webinar content leads to trial or sales of your product or service."}, {"type": "sentence", "content": "People who watch understand that a webinar is a “sales pitch”. They expect a good pitch with a lot of good arguments and proof. They also expect a discount or some hefty offer for having given you their time. Make sure the education and the offer are worth their while."}, {"type": "sentence", "content": "Using tutorials to get easier buy-in for complex or specialist products"}, {"type": "sentence", "content": "If you have to sell complex or specialist products, it may requires a step-by-step tutorial. You may need to explain certain product features or usage practices. Teaching once may not be enough. You may need to re-teach the practices to different batches of users,"}, {"type": "sentence", "content": "We often see tutorial-based evergreen webinars used by SaaS companies. Engineering businesses use webinars a lot to train customers in product usage. Construction companies train building residents on fire safety drills via webinars"}, {"type": "sentence", "content": "Tutorial webinars could be good for solopreneur businesses too … if you have complex ideas to sell. Ad agencies can use webinars to sell concepts. They can also train clients on performance metrics to measure success."}, {"type": "sentence", "content": "Even if you are a lone freelancer, your clients may like to know what processes you use. How do you sequentialize the handling of their assignments? How should they set expectations? What will be your deliverables? At which stages should they pay you?"}, {"type": "sentence", "content": "Information like this needs repetitive exposure to many different client-prospects. The information content is not likely to be fast-changing either. Evergreen webinars work beautifully for situations like these."}, {"type": "sentence", "content": "Clear explanations, ahead of projects, can avoid relationship breakdown later. So think of tutorial evergreen webinars as more than teaching opportunities. Use them as expectation-management opportunities as well."}, {"type": "sentence", "content": "Explaining case studies to showcase your strategy, processes and results"}, {"type": "sentence", "content": "Who doesn’t love a good case study? They are a combination of storytelling — mixed in with strategy, tactics and results."}, {"type": "sentence", "content": "Case studies feel like sneak peek at some “behind-the-scenes” action that took place. Nobody can resist knowing the inner secrets and strategies that others used. Not only that, but case studies also show the final results. They show the path to results, which is compelling."}, {"type": "sentence", "content": "Do you think you have no case studies to showcase via evergreen webinars? You may have more than you think."}, {"type": "sentence", "content": "If you’re a freelance solopreneur, think about the past success of your client work. If you’re a creator of courses, think about the success stories of your students."}, {"type": "sentence", "content": "If you seem to have no case studies, look at all the ideas you have. Build stories of possibilities — show how to use your ideas in diverse cases. Here are two examples of what bloggers did with evergreen webinars to create case studies:"}, {"type": "sentence", "content": "Webinars like this with practical everyday case studies get hordes of new registrants all the time. Why should you be surprised? People love these simple, but personal and compelling, stories."}, {"type": "sentence", "content": "One caveat: If your case study involves a client, make sure you get their written permission to air it. They may not want their competitors attending your evergreen webinar. If there’s any resistance, don’t show names of businesses or brands. Don’t get too close to giving hints on who the case study is about. Stick to the insights, learnings and strategic issues of the case. Don’t drop obvious clues."}, {"type": "sentence", "content": "How you handled a situation is more important than who you handled it for. You are showcasing your brand’s plus-points, not the clients you have."}, {"type": "sentence", "content": "Stamping your brand uniqueness to reveal a few exclusive tips and tricks"}, {"type": "sentence", "content": "People love to know if you have a storehouse of unique tricks up your sleeve. If you do, you could use evergreen webinars to show people that you are a different kind of thinker. You can showcase a few hacks you have discovered that work wonders."}, {"type": "sentence", "content": "For example Brian Dean of Backlinko discovered a method of getting backlinks. He tried building content bigger and better than the guy who ranks №1 on the Google SERPs. He was mighty successful. So he named his trick the Skyscraper Technique."}, {"type": "sentence", "content": "He uses ideas like these in his webinars to whet people’s appetite to take his course. When he explains his Skyscraper Technique and says he has more like this in his course, won’t people rush to sign up?"}, {"type": "sentence", "content": "These are the kinds of brand-building and selling your evergreen webinar can do for you. You can set up a selling funnel where you get people to see your evergreen webinar for free … and pick up a discount if they sign up for your course right there and then."}, {"type": "subtitle", "content": "3. Advantages And Ease Of Creation Of Evergreen Webinars For Solopreneur Marketers"}, {"type": "sentence", "content": "If you have a goal of really making a lot of money with evergreen webinars, you surely can. There are some big advantages if you start regularly using them as part of your conversion-marketing. Aside from this, the ease of creation of evergreen webinars is also something that you’ll find attractive. Some of the tools we have today help you do a fabulous job."}, {"type": "subtitle", "content": "a. Four Big Advantages You Should Ensure Evergreen Webinars Give You"}, {"type": "sentence", "content": "I’d rate these four as the biggest advantages I have seen from using evergreen webinars (and I use them a lot)."}, {"type": "sentence", "content": "Evergreen webinars help you make “passive income” even while you sleep"}, {"type": "sentence", "content": "Evergreen webinars can be a great option when you plan to automate your marketing and create a passive income stream. You still have to do the same amount of work upfront to create your evergreen webinar, as you would with a live webinar, but after that initial time and effort investment, you can be free of content-creation-commitment."}, {"type": "sentence", "content": "You can focus on promoting the webinar better, which may be more productive of your time. A lot of solopreneurs I know, who like to follow Tim Ferriss’ “four hour work week” idea, usually have one or more evergreen webinars in their marketing arsenal."}, {"type": "sentence", "content": "Evergreen webinars help you nurture new and existing subscribers"}, {"type": "sentence", "content": "Every now and again, you may like to liven up your subscriber community’s energy and engagement levels with a webinar on a popular topic. It’s one form of prospect-nurturing combined with event-based selling. It adds variety to your brand recognition efforts while also creating a lot of buzz."}, {"type": "sentence", "content": "You could choose to create evergreen webinars to help your subscribers upgrade on fundamentals or even explore new ideas. Or you could pick up a small set of the topics most popular with your subscribers for “deep-dive sessions”. Having a set of 5–6 automated evergreen webinars with you always is a great way to ensure you can spice up your contact points with your fans and followers every so often."}, {"type": "sentence", "content": "Your objective should be to make attendees walk away with a better understanding of what you provide, while also feeling like you have opened a new door of opportunity for them."}, {"type": "sentence", "content": "Evergreen webinars boost social sharing before, during and after events"}, {"type": "sentence", "content": "Beyond just delivering evergreen content, your evergreen webinar should aim to deliver evergreen content that’s shareworthy. When someone signs up for your webinar, and you give them strategies to succeed with, in their own life or business, they must want to share their experience on social media with their friends and peers."}, {"type": "sentence", "content": "Automation can help with this too. Just add a line in your “thank you” email to attendees, after your webinar, suggesting that they share their experiences and gains on social channels of their choice. Make it easy to do so by providing share icons they can simply click, prepopulated with complimentary thoughts about your webinar."}, {"type": "sentence", "content": "Evergreen webinars can and should be SEO optimized"}, {"type": "sentence", "content": "As with all other types of content, evergreen webinars too must be carefully SEO optimized. Make sure the topic of your webinar is built around a set of keywords that have a high popularity and low competition. Look up searched questions in AnswerThe Public or in Quora around topics you have shortlisted. Get the pain-points that people want answers for, and wouldn’t mind spending time to get the answers in detail from an expert."}, {"type": "sentence", "content": "Once you’ve built your evergreen webinar around an SEO keywords strategy, use the same keywords to promote your webinar. Spread the excitement and buzz around on social media, and through your mailing list. Create YouTube trailer videos with the same SEO theme."}, {"type": "sentence", "content": "Make sure to get a unique hashtag created using the same keywords. Splash this around liberally in all social media including even Pinterest and Instagram (yes, I’ve had a lot of webinar subscribers from Pinterest and Instagram!). The more your hashtags get some air, the more places they are seen in, the faster your evergreen webinars energy-fields magnetize new and old subscribers."}, {"type": "subtitle", "content": "b. Five Best Tools For Creating Evergreen Webinars"}, {"type": "sentence", "content": "The top five tools for creating your evergreen webinars are these:"}, {"type": "sentence", "content": "EverWebinar"}, {"type": "image", "content": "https://miro.medium.com/max/1300/0*eILG_4cG_T9p8htu.jpg"}, {"type": "sentence", "content": "EverWebinar is by far the best automated webinar solution that exists. It offers the environment that feels most “real” for attendees. You can upload any video you have to EverWebinar — and turn it into an automated webinar. It allows very flexible customizing of the “live” environment. You get to decide how many “attendees” will be shown during the webinar, or even simulate the conversation going on in the “live chat”. While all this may seem a tad deceptive, remember this. The more “live” an evergreen webinar feels, it leads to higher conversion rates."}, {"type": "sentence", "content": "EasyWebinar"}, {"type": "image", "content": "https://miro.medium.com/max/1300/0*gNPG5MKv9vcQQ4_Z.jpg"}, {"type": "sentence", "content": "EasyWebinar allows you to accomplish a little bit of everything you need in an evergreen webinar. It’s perfect if you need to host live webinars later, but first want to play around with automated webinars, without much concern for conversion at this stage. There are two negatives, though. One, it is more expensive. And two, the automated webinar solution is a bit limited. They don’t allow many types of customizations as EverWebinar, which can affect conversion rates."}, {"type": "sentence", "content": "Demio"}, {"type": "image", "content": "https://miro.medium.com/max/1300/0*SwZEDctFTlHdqKgJ.jpg"}, {"type": "sentence", "content": "Demio is quite similar to EasyWebinar. It allows you to hold both live webinars and automated webinars. But wait … it’s the most expensive of all the tools listed here. Nevertheless, the user interface is well constructed, and very easy and fun to use. However, Demio is a choice that you have to budget for. Unless you are sure of getting the ROI from it, within a reasonable time frame, it is among the costlier tools for creating your evergreen webinars."}, {"type": "sentence", "content": "Stealth Seminar"}, {"type": "image", "content": "https://miro.medium.com/max/1300/0*q0G8ai7ynRRLUDmY.jpg"}, {"type": "sentence", "content": "Stealth Seminar is yet another tool that offers automated webinars. One good thing is that it allows you to split test entire events, videos or offers. It also allows automated delay reset time. This keeps people from immediately coming back to your event and seeing it count down again. This is a very useful feature if you don’t want people knowing it’s a pre-recorded webinar with the same content and chat simulations you’ve seen before."}, {"type": "sentence", "content": "ClickFunnels"}, {"type": "image", "content": "https://miro.medium.com/max/1300/0*_K-76GCKnGbo2pjp.jpg"}, {"type": "sentence", "content": "ClickFunnels is actually a landing page software tool, that also allows you to create an evergreen webinar “funnel.” To that extent, you don’t just get to create a webinar, you also have a host of funnels that can complement the webinar — like Lead Capture Funnels, Sales Page Funnels, Membership Sites Funnels and so on. You have to look at the whole package and see if that’s what you want."}, {"type": "subtitle", "content": "c. How To Create An Evergreen Webinar With Everwebinar (Video)"}, {"type": "sentence", "content": "No prizes for guessing that EverWebinar is my all-time favorite for creating my own evergreen webinars. How did I learn to use EverWebinar? I watched this video below, and after that life was uber-easy."}, {"type": "sentence", "content": "This video, from Ferdy Korpershoek, is 40 minutes long … but it covers top-to-toe of how to set up and use EverWebinar. Go through it fully, is what I’d advise. That’s all you need to know to get going!"}, {"type": "subtitle", "content": "In Summary …"}, {"type": "subtitle", "content": "Do you need routes to quicker financial success in Knowledge Commerce? Who doesn’t?"}, {"type": "sentence", "content": "Visit my website, course, library and consulting services. And do also check out my new book."}, {"type": "sentence", "content": "Originally published at https://solohacks-academy.com."}], "topic": "marketing"}