{"title": "What Will a Post-Pandemic World Look Like?", "data": [{"type": "subtitle", "content": "On automation and flame wars between nations"}, {"type": "sentence", "content": "I I have stopped writing for the past two months on Medium, because I needed time to think, and process. The world has been in a state of information overload, with news of depression, unemployment, and human tragedies dominating the headlines. Still, I believe we have entered a stage where one can attempt to speculate on a post-pandemic world, and the ramifications of COVID-19 in the long run."}, {"type": "sentence", "content": "In this essay, I’ve approached the question from two perspectives — one of automation (more specifically, Industry 4.0), and one of international relations, or rather the deterioration thereof. These are thoughts that have been swirling in my mind for a while now under quarantine and serve as interesting points of departure in analyzing a post-pandemic world."}, {"type": "sentence", "content": "For further reading, I would recommend simply Googling Industry 4.0, as many consultants have written way more in-depth than I have. I would also recommend this article on US-China relations by Kevin Rudd, the former Aussie prime minister."}, {"type": "subtitle", "content": "Humans Need Not Apply"}, {"type": "image", "content": "https://miro.medium.com/max/8640/1*tsT8YagPRKba29iy4Ivd1Q.jpeg"}, {"type": "sentence", "content": "IIndustry 4.0, at its simplest, refers to large-scale automation of our current means of production. Factories will be staffed by tech experts in single digits, instead of hundreds of human hands laboring on production lines."}, {"type": "sentence", "content": "And COVID-19 will drastically hasten the adoption of industry 4.0, at the potential cost of mass structural unemployment."}, {"type": "sentence", "content": "Industry 4.0 was already in vogue before the pandemic. The allure of a fully automated production line, with increased efficiency and decreased labor cost, is undeniably strong to multinationals focusing on their bottom lines. In an event organized by French Tech Beijing in late 2019, I was crammed in a small room together with seasoned professionals from Intel, Huawei, and Microsoft, as execs from Siemens and Schneider Electric on stage extol the endless virtues of Industry 4.0, and their vision of a fully automated factory employing “as few as one overseer on standby for maintenance.”"}, {"type": "sentence", "content": "What they presented was a fully automated web of production. Robots will endlessly churn out products, assisted by sensors and neural nets preprogrammed to respond to any contingency imaginable. Unmanned robotic trucks will set out for global distribution centers, their cargo spaces filled by smaller robots shuffling endlessly between neatly labeled shelves. Everything from manufacturing to supply chains will be automated, with humans entirely out of the picture."}, {"type": "sentence", "content": "The COVID-19 pandemic has already decimated global supply chains and forced closures of factories worldwide. It will not take Olympic-level mental gymnastics for execs to realize the potential of Industry 4.0 in disruption-proofing their operations, with the added benefits of improving their bottom lines."}, {"type": "image", "content": "https://miro.medium.com/max/15904/1*VX3CmoAqxCiqYdZTdCCJ4g.jpeg"}, {"type": "sentence", "content": "It should be noted that, the widespread adoption of Industry 4.0 will not only impact big multinationals but will have broad ramifications for small businesses as well. An article from Assembly Magazine pointed out that small businesses are ill-prepared for Industry 4.0, where large manufacturers may demand more data and integration from their smaller upstream partners. Large manufacturers will either take over their upstream partners for supply chain consolidation or switch to partners better equipped in the Industry 4.0 arena. Either way, the coming storm of Industry 4.0 will wipe out small businesses and lead to further structural changes (and potential structural unemployment) in the small business sector."}, {"type": "sentence", "content": "And just to be clear, Industry 4.0 is not solely applicable to manufacturing and supply chains, but represents automation as a whole of the means of production that sustains our economy. AI is already poised to take over repetitive tasks in call-centers and HR departments worldwide. As more tools become available, businesses will surely decrease their reliance on human labor to cut costs and disruption-proof their modus operandi, and COVID-19 will only accelerate this trend as employees are forced to sequester themselves at home, and business owners panic over their bottom lines. As one analyst at Forrester points out: “as companies have recovered their revenues and reopened their supply chains, they have increasingly invested not on rehiring the workforce but on automation and on reducing their dependence on manpower.”"}, {"type": "sentence", "content": "At the French Tech event, I asked the execs: “what will happen to the manufacturing jobs that will certainly get wiped out from the adoption of industry 4.0?” To which, the speaker from Schneider responded that it is not their responsibility, but that of the governments’, to construct adequate social nets and policies to mitigate potential structural unemployment; then, almost as an afterthought, he added that companies would, of course, assist the relevant authorities in establishing training programs for those affected."}, {"type": "sentence", "content": "He is right, of course. Governments should take a central role in constructing social nets for those affected by the coming storm of Industry 4.0 and automation. The COVID-19 pandemic has already decimated the American labor force, with 20.5 million jobs wiped out in April alone. Facing the prospects of a tumultuous path to recovery, combined with potential seismic shifts that come with Industry 4.0 and automation, we must be prepared for severe structural changes to our economy and our way of life."}, {"type": "subtitle", "content": "A Fractured World"}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*Y6BStPWKiOthgqVlKaEQJA.jpeg"}, {"type": "sentence", "content": "The post-cold war honeymoon is over. The COVID-19 pandemic has severely damaged America’s credibility internationally and has halted China’s grandiose plan of regional supremacy. A post COVID world will face more uncertainties when it comes to diplomacy and trade, accompanied by a sharp rise in protectionism and isolationism."}, {"type": "sentence", "content": "American diplomatic overtures during the COVID-19 pandemic has been disastrous. From the administration trying to establish exclusive control over a vaccine being developed in Germany, to federal attempts to ban the export of masks to Canada and Latin America, the US has styled itself as a petulant child on the international stage. Further, the US, as the self-proclaimed “leader of the free world,” leads the world indeed in both COVID-19 case count and death toll, reflecting the government’s immense failure in adequately addressing the COVID-19 pandemic, winning the US no points in confidence on the international stage."}, {"type": "sentence", "content": "On the other hand, China is bracing for the upcoming storm of international backlash over its initial failure to contain the pandemic. The US, UK, and Germany have joined a chorus of nations demanding accountability and transparency from the Chinese regime, as the pandemic sweeps across the globe. Even China’s regional partners in Africa are questioning their relations with the emerging global superpower over government-sponsored displays of racism and discrimination in Guangzhou against African ex-pats. The Belt and Road initiative that was meant to strengthen China’s global supply lines and lend further legitimacy to China’s power status internationally has been decimated by the COVID-19 pandemic, with nations walking away from unsustainable projects under the strain of pandemic-induced economic depression."}, {"type": "image", "content": "https://miro.medium.com/max/9448/1*ksEG8x80BrWmVu7BbI6ztg.jpeg"}, {"type": "sentence", "content": "With the US-China trade war intensifying, and ideological warriors from both sides rallying up nationalistic fervor with no de-escalation in sight, the post-pandemic world will prove treacherous to navigate, for both nations on the sidelines and businesses operating internationally. Further, the United Nations has shown itself to be a paper-tiger, with the security council in deadlock and the organization unable to mount a coordinated international effort in combating the COVID-19 pandemic. The WHO, the supposed shining beacon of global health, has been de-legitimized in the eyes of many, with the US halting funding to the organization and the administration accusing it of lacking transparency and showing favoritism to China."}, {"type": "sentence", "content": "In short, the COVID-19 pandemic will become a milestone in international relations, marking the beginning of an era where protectionism and isolationism will dominate the international stage, with increased probability for conflicts and confrontations, and weakened international bodies unable to arbitrate due de-legitimacy and hostile foreign policies. “The end of history,” as political scientist Francis Fukuyama proclaimed at the end of the cold war, is over, and I fear the 2020s will be more tumultuous than ever."}], "topic": "economy"}