{"title": "Protecting workers protects us all: What we need to return to work — safely", "data": [{"type": "sentence", "content": "On March 25, 1911, 146 workers were trapped and killed in the Triangle Shirtwaist Company fire in New York City. More than a century later, the same callousness that led the owners of that company to lock exits and risk workers’ lives reverberates again across our nation. Millions of workers are returning to work with inadequate or nonexistent protections from a deadly virus that has already killed nearly 100,000 people in the United States."}, {"type": "sentence", "content": "It is no coincidence that a disproportionate number of the essential workers required to be in their workplaces and highly exposed to the coronavirus — healthcare workers, grocery workers, delivery drivers, and bus drivers — are people of color. Their pay and benefits are generally modest, and they have little power to pressure their employers to improve their conditions. Low-income workers of color also are among the main victims of the coronavirus recession and COVID-19."}, {"type": "sentence", "content": "Barely more than one-half of U.S. adults — 51.3 percent — are working, the lowest employment rate on record since the Bureau of Labor Statistics began tabulating that statistic in 1947. Ironically, average pay in the United States rose in April because most of the jobs lost are on the lower end of the income scale. The longer the U.S. economy is shut down, the more costly it will be to the economy and to these workers."}, {"type": "sentence", "content": "But in order to get back to work safely, we must contain the coronavirus. Otherwise, we risk its further or resumed spread and not only more deaths, but also an even longer and more painful recession. If we contain the virus, then we can put our economy on a new path to economic growth that is strong, stable, and broadly shared."}, {"type": "sentence", "content": "Yet the Trump administration wants to open without serious containment. Its approach? Let’s all cross our fingers and hope for the best. Indeed, this administration’s lack of effective management to contain the virus has been breathtaking. Leaders failed to rapidly acquire the supplies needed to run an effective testing and tracing program or ensure an adequate supply of equipment, including personal protective equipment for healthcare and other essential workers. Indeed, President Trump is suspicious of testing, as it increases the number of proven COVID-19 cases, which he sees as a political liability."}, {"type": "sentence", "content": "Reasonably certain containment requires a comprehensive program of testing and contact tracing. Ideally this program should be national. But the Trump Administration, remarkably, is unwilling to take on this responsibility. So states have had to establish their own regimens. Will these very dispersed efforts work? As a bipartisan group of distinguished former public health officials and leading academics wrote in an April 27 letter to congressional leaders:"}, {"type": "sentence", "content": "Equally important is for workers and consumers to have confidence that they can stay safe as they go about America’s business and engage with the economy for themselves and their families. It seems obvious that most consumers won’t take unnecessary risks. Struggling businesses can’t survive if large numbers of people won’t leave their homes to shop and seek out restaurants and entertainment."}, {"type": "sentence", "content": "As for workers, who have less choice in the matter, they have a right to that confidence and genuine safety. The Trump Administration and some governors have been extraordinarily cavalier about this. We can’t end the health crisis and the economic crisis without addressing safety at work. This concern has been overlooked, and not only in this crisis. For too long, workplace protections have been seen as a nice-to-have, not a must-have. Our nation’s health and safety systems for workers are tattered, and our workers’ compensation system is failing."}, {"type": "sentence", "content": "Here’s how we can address these issues."}, {"type": "sentence", "content": "First, everyone who is sick needs to be able to stay home without fear of losing their jobs or paychecks. Lower-income service employees are the least likely workers to have paid sick days. A critical part of the Families First Coronavirus Response Act, enacted in March, was its paid leave provision. This measure provides job-protected emergency family leave and paid sick leave for employees unable to work because of the coronavirus pandemic. It ensures that employees do not suffer economic hardship as a result of taking the necessary steps to protect themselves, their families, and their communities from devastating harm. Likewise, the provision in the Coronavirus Aid, Relief, and Economic Security, or CARES Act passed in late March that permits those at high risk of becoming infected with COVID-19, such as those with diabetes, heart disease, or immune deficiency, to not return to work should be retained."}, {"type": "sentence", "content": "Second, every essential worker needs personal protective equipment — all employers of essential personnel should be required to provide masks, gloves, and any other appropriate protective clothing or equipment. Many essential workers — medical personnel, personal care aides, cashiers, childcare workers — are among the workers at greatest risk of contracting the coronavirus while doing their jobs. They also have the greatest potential for spreading it."}, {"type": "sentence", "content": "Third, of all the failures of the federal government to protect the American people from this pandemic, among the worst, and least discussed, is the utter failure of the U.S. Occupational Safety and Health Administration to protect essential workers — and those workers are paying the price. Lack of personal protective equipment and infection control procedures have caused major outbreaks and fatalities among staff and inmates in prisons, as well as among workers in healthcare, meatpacking, transportation, warehousing, and other sectors of the economy."}, {"type": "sentence", "content": "Under this administration, OSHA has generally been rendered toothless, and the pandemic displays the agency’s current weakness in glaring relief. In the face of death, sickness, and ongoing safety threats, the federal agency tasked with protecting workers has been silent."}, {"type": "sentence", "content": "As former agency director David Michaels explains, there are a number of actions the agency could take, including issuing an emergency temporary infectious disease standards, as well as reminding workers and the public of existing safety standards. Instead, OSHA has limited itself to providing information about the coronavirus, which is helpful but extremely weak at a time when workers are dying. This does not have to be hard — or expensive. By one estimate, a single OSHA press release publicizing how workplaces violated health and safety regulations was equivalent to 210 additional agency inspections in terms of improving safety compliance."}, {"type": "sentence", "content": "The decline in unionization over the past half century has exacerbated this silence, as unions have been shown to supplement worker safety standards and help ensure safer workplaces."}, {"type": "sentence", "content": "An increase in collective action was a direct response to the Triangle Shirtwaist Company fire more than a hundred years ago. Today, worker voice can also play a critical role in ensuring effective workplace safety standards. In a recent Roosevelt Institute issue brief, Sharon Block, Suzanne Kahn, Brishen Rogers, and Benjamin Sachs propose worker representation at the sectoral level and in workplaces when determining safety standards."}, {"type": "sentence", "content": "The fourth action the Trump administration could take is to make more extensive use of the Defense Production Act. In times of crisis, this law gives presidents the power to direct manufacturing of needed equipment. It is a critical tool that has been invoked all too sparingly during the pandemic. Healthcare workers, in desperate need of basic medical supplies and equipment, urged President Trump in March to use the DPA to allow them to care for their patients with some measure of safety. Instead, the Trump administration has dragged its feet on using this law to protect essential workers, leaving private businesses to step up and states to compete among themselves and with the federal government, driving up prices and causing financially strapped states to overpay for the limited supply of personal protective equipment."}, {"type": "sentence", "content": "Tragically, President Trump in March invoked the DPA not to protect workers but to endanger them, forcing meat processing plants to remain open despite rising numbers of plant worker deaths and illnesses due to COVID-19. The administration could change course. The law could still be invoked to make sure essential workers have the right gear to help others and protect themselves, even though this should have happened months ago."}, {"type": "sentence", "content": "Finally, policymakers also need to make sure that those who are exposed to COVID-19 at work are protected under the Workers’ Compensation program. The program, especially in some states, has been weakened over time to provide fewer protections to injured workers. Now is a time when states need to step up and support front-line workers. Governor Jay Inslee of Washington has set a good example by clarifying the rules of his state’s program to ensure that exposed workers who need to self-quarantine are covered. So, too, has Governor Gavin Newsom of California, by making it easier for workers who contract the coronavirus to qualify for benefits. Other governors should follow these examples."}, {"type": "sentence", "content": "It’s really quite simple: Protecting the most vulnerable workers protects public health. Exposing them to disease endangers us all. Ensuring that our workers are safe promotes the general welfare. And promoting the general welfare is the president’s job, per the Constitution. The health and well-being of the American people and our economy depend on it."}, {"type": "sentence", "content": "Heather Boushey is President and CEO of the Washington Center for Equitable Growth and the author of the book Unbound: How Inequality Constricts Our Economy and What We Can Do About It."}], "topic": "economy"}