{"title": "It is cheaper to fix a mistake before you make it", "data": [{"type": "subtitle", "content": "How to bring your team on a lean experimentation journey using paper-prototyping."}, {"type": "sentence", "content": "The popularity of design thinking in recent years has brought about renewed interest in paper prototyping — the use of simple paper sketches to communicate and test ideas with users. In fact, prototyping is one of the fundamental steps in popular methodologies such as design thinking, design sprint, and agile design. Don’t feel overwhelmed by the buzzwords — it is easier than you think."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*s9D709wdgQJDGxD1.jpg"}, {"type": "sentence", "content": "When a leading insurance company partnered us to rethink their car insurance application, their apps had poor reviews, and customers complained about usability issues. We decided to leverage the power of prototyping."}, {"type": "sentence", "content": "Despite the abundance of prototyping tools available nowadays, paper prototyping is still one of the cheapest and fastest ways to make ideas tangible, testable, and get the entire team to reflect and act on customers’ insights."}, {"type": "sentence", "content": "When we started this project we all had different opinions on what the most useful functionality was. No one mentioned the “find your car”. We could have had an endless discussion, instead, we based our decisions on evidence. This process helped us focus on what users want, not on what we think they want."}, {"type": "sentence", "content": "How does paper prototyping work in practice? The following case study provides an example of how useful and accessible this technique can be."}, {"type": "subtitle", "content": "Case study: adding value to car insurance"}, {"type": "subtitle", "content": "Thinking about the target audience"}, {"type": "sentence", "content": "Before starting, we thought about who we were designing for. We identified three categories:"}, {"type": "image", "content": "https://miro.medium.com/max/1736/1*QYVlt-o8DlbXKYSD05Xrtw.png"}, {"type": "image", "content": "https://miro.medium.com/max/1716/1*mYz8BfSKP0wbVSKDYdahAQ.png"}, {"type": "sentence", "content": "For each category, we associated a photo (photo credits: Pexels) and a name. During the all ideation process we kept asking questions like “Would this help Laura to monitor her son’s car’s usage?”, “Would Elly consider this an efficient way to manage the company cars?”."}, {"type": "subtitle", "content": "Analyzing information about the current service"}, {"type": "sentence", "content": "Designers and developers sat together to understand what information we could surface to users without creating additional technical work. We identified the existing APIs and used technological constraints to inform our design."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*lAj2wrxaPNPH7tWX.png"}, {"type": "subtitle", "content": "Finding out what customers think"}, {"type": "sentence", "content": "We read hundreds of reviews to understand what was working and what wasn’t. We grouped the reviews into categories, dividing the technical problems from the usability ones and trends started to emerge."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*yyCUIH5FUCW-jJlg.png"}, {"type": "subtitle", "content": "Getting feedback from real users"}, {"type": "sentence", "content": "We used what we learned from the reviews to craft a script and we interviewed 10 potential users. At this stage, we had an initial idea of what people liked and disliked about the app. With the interviews, we were after uncovering the Why behind certain comments in the reviews."}, {"type": "sentence", "content": "We focused on learning why people appreciated the Car Finder functionality and we discovered more about their behaviors:"}, {"type": "sentence", "content": "We also investigated how people feel about sharing their data and we learned that:"}, {"type": "subtitle", "content": "Generating ideas with the whole team"}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*K6rNHYRgkaRBT1VE.png"}, {"type": "sentence", "content": "The most reliable way to come up with a good idea is to start with many. Fueled by the insights from the customers, we spent a few hours generating ideas with everyone in the team: stakeholders, developers, subject matter experts, analysts, data scientists."}, {"type": "sentence", "content": "My role was to facilitate the ideation session so everyone could contribute. The co-creation session agenda started with sharing insights from customers. Participants had the time to visualize their ideas with paper-prototyping and present them to the group for input. Ideas become stronger, fed by rounds of feedback and inspiration from other participants' prototypes."}, {"type": "subtitle", "content": "Encouraging a human-centred approach with storyboards"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*zApR1dTs_lehQGxN.jpg"}, {"type": "sentence", "content": "The Scenes Kit by SAP provides printable images of devices, environments and characters that can be arranged into storyboards. Breaking down the user experience into a sequence of scenes forces the team to visualize how users would behave at any given moment, what they would say and think. Reflecting on these micro-moments can really make the difference in crafting the user experience by uncovering opportunities to delight customers that could otherwise be overlooked."}, {"type": "subtitle", "content": "Crafting paper prototypes with the best ideas"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*s9D709wdgQJDGxD1.jpg"}, {"type": "sentence", "content": "The team shortlisted the best ideas and crafted the prototypes. For the first round of testing, our focus was to check if our solution was solving the most common customer problems. We drew multiple versions of the key functionalities and screens. Alongside the prototype, we crafted a narrative and some questions to get the most out of our interaction."}, {"type": "subtitle", "content": "Showing the prototypes to potential customers"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*T5No6C6YfBj7gOc_.jpg"}, {"type": "sentence", "content": "There is nothing as powerful as showing a prototype to potential customers to uncover new powerful insights. For the first round of testing, we showed the prototypes to six people. Each session was run by 2 people and lasted about 30 minutes, one person conducting the interview and one taking notes. We kicked off each session by sharing context on our project and goals, and we asked questions on the user’s habits. The majority of our time with potential customers was spent reviewing the prototypes. To prompt the conversation, we asked open questions, and we listened carefully. In the end, we left time for any questions the customer might have."}, {"type": "sentence", "content": "Elena, an entrepreneur, said “My company has 5 cars. For me, it is easier to remember the car model than the plate number”. This comment triggered us to include the car model as an identifier along with the plate."}, {"type": "sentence", "content": "Andrea, a shop assistant, said: “I park my car on Friday night and on Monday morning I can’t remember where it is”. People that share the same car with a relative or that park often in different places could use some help to find their car."}, {"type": "subtitle", "content": "Evolving the prototype through round testing"}, {"type": "sentence", "content": "Iterations are at the core of the agile design. To ensure that everyone in the team was exposed to the customer feedback first-hand, we created a rotation system. After running testing, the insights were shared with the rest of the group. The team listened carefully and shared ideas to evolve the prototypes accordingly. The most critical screen of the entire app was the dashboard. Tom, a student, told us “I monitor what I eat, my fitness activity, and my finances easily from my phone. I want to do the same with my car.” We asked potential customers to rate what information and activities they were likely to read or do more often. We used the top-rated info to craft the dashboard."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*GArJyCCUBdrGxP9t.png"}, {"type": "sentence", "content": "At each round, the prototype was increasingly meeting the users’ needs. We went from an “assumption-based” prototype to an “evidence-based” one. Everyone in the team was able to validate and motivate our design decision by quoting users or describing their behaviors. Our prototype was getting closer to fit our target user’s needs."}, {"type": "sentence", "content": "“I love this dashboard, I can clearly see when and where I have used my car!” said Nithya, receptionist, at the 4th iteration of the dashboard."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*0k6f-3S3xlvmfCou.png"}, {"type": "subtitle", "content": "Takeaway"}, {"type": "sentence", "content": "In summary, the key benefits of prototyping are:"}, {"type": "sentence", "content": "In particular, the added value of paper-prototyping is:"}, {"type": "sentence", "content": "In one sentence:"}, {"type": "sentence", "content": "Looking back, where could you have utilized paper prototyping?"}], "topic": "ux"}