{"title": "A Customer-Service Approach to Freelance Writing for Clients", "data": [{"type": "subtitle", "content": "If you address their unstated needs, you’ll have a longterm client"}, {"type": "sentence", "content": "Customer service is my life. I’ve been helping people as long as I can remember. If someone asks me for help, I would rarely say No. If I don’t know how to help, I will go find out how to help them."}, {"type": "sentence", "content": "It’s what got me in customer service management for more than ten years. Since starting Freelance writing and blogging, I’ve always thought about finding ways to incorporate my customer service skills to my freelance services."}, {"type": "sentence", "content": "When we trained our customer service staff, we would teach about the customer’s ‘Stated Need’ and ‘Unstated Need.’ For example:"}, {"type": "sentence", "content": "So yes, you can change the package, and the customer will be satisfied. But if you build a rapport and find out that he’s into sports, you can make changes that will be cost-effective, yet following his instructions."}, {"type": "sentence", "content": "That will blow a customer’s socks off."}, {"type": "sentence", "content": "All your experience can be integrated into your new work, even if it’s somewhat unrelated. I made a significant change when I received work from a freelance writer I hired, when you put yourself in your customer’s shoes — literally — your perspective changes."}, {"type": "subtitle", "content": "My Old Approach to Freelance Writing Clients"}, {"type": "sentence", "content": "When I started writing for clients, I would complete the research, write the article, do some editing, and submit."}, {"type": "sentence", "content": "I would format with the relevant H1, H2, H3 tags. As I got more experienced, I spaced things out more, used bullet points, etc. Still, the content submitted looked a bit like this:"}, {"type": "image", "content": "https://miro.medium.com/max/1750/1*WqVTFJT8waZTCa6lfTsqIQ.png"}, {"type": "sentence", "content": "Not bad."}, {"type": "sentence", "content": "For the most part, clients were content with the content (lol)."}, {"type": "sentence", "content": "After all, I addressed the ‘Stated Need.’"}, {"type": "sentence", "content": "But freelance writing clients have an unstated need as well:"}, {"type": "sentence", "content": "Content does not go into a filing cabinet after submission."}, {"type": "sentence", "content": "It needs to be formatted and published on a website."}, {"type": "sentence", "content": "When I hired a freelancer to complete an urgent assignment, I was low-key disappointed to get large blocks of text with poor editing."}, {"type": "sentence", "content": "The freelancer was highly rated, and I paid more than I would for the job."}, {"type": "sentence", "content": "Now, I don’t blame the freelancer at all. He’s not a mind reader."}, {"type": "sentence", "content": "I could have been more transparent with my expectations."}, {"type": "sentence", "content": "But only when I received the content, I realized that my unstated need was to have it ready for submission."}, {"type": "sentence", "content": "I took so much time editing and formatting the content. I probably should have done it myself."}, {"type": "sentence", "content": "Since then, when I submit for my clients, I make sure to think about how I can help them past the words on a page."}, {"type": "subtitle", "content": "My New Approach to Freelance Client"}, {"type": "sentence", "content": "Now, once I complete an article, I add a few more steps to help the client. It also helps to find out from the client the publishing details. You can then look at a finished product and try to format it as close as possible to the finished work."}, {"type": "sentence", "content": "First, all my content goes through Yoast SEO Real-Time Content Analysis."}, {"type": "image", "content": "https://miro.medium.com/max/1900/1*Cb4bqUT13rC-5K-BXlpPtQ.png"}, {"type": "sentence", "content": "If you’re familiar with Wordpress, Yoast is a plugin that helps you optimize your blog post for SEO."}, {"type": "sentence", "content": "You can use this webpage rather than an active Wordpress site."}, {"type": "sentence", "content": "Once you paste in the content, Yoast prompts for things like passive voice, transition, readability, and sentence length."}, {"type": "image", "content": "https://miro.medium.com/max/1316/1*k0UoQUFB4yiYKf8hTsDPxw.png"}, {"type": "sentence", "content": "From there, you can format your content accordingly."}, {"type": "sentence", "content": "Next, I add in a Slug, Meta Description, and check the SEO title length."}, {"type": "image", "content": "https://miro.medium.com/max/1296/1*vPsLZGnxUR7qIhrg4jFZ_Q.png"}, {"type": "sentence", "content": "If the client sent a headline already, that Yoast does not recommend, would suggest a couple of headlines, making sure to pass them through the Headline Analyzer from Co-Schedule."}, {"type": "sentence", "content": "Next, I add a relevant image from Unsplash, Freepik, or Pixabay, making sure to update the Alt text with the keyword. Maybe they’ll use it. Perhaps they won’t. But it’s there."}, {"type": "sentence", "content": "There’s a separate section for external links, and I put in some internal links, too, if I know about the client’s website."}, {"type": "sentence", "content": "Finally, I make sure my content goes through the paid version of Grammarly for one final cleanup and plagiarism check."}, {"type": "sentence", "content": "Now a submission looks like this:"}, {"type": "image", "content": "https://miro.medium.com/max/1538/1*J7ch0mUKbvH3DQlaLK6dNA.jpeg"}, {"type": "sentence", "content": "Some experienced clients ask for this information. Those who don’t will have an unstated need that will make them happy clients."}, {"type": "subtitle", "content": "Try Adding these Steps and Compare Results"}, {"type": "sentence", "content": "Does it take a little more effort?"}, {"type": "sentence", "content": "Yes."}, {"type": "sentence", "content": "Do other freelancers charge for these services?"}, {"type": "sentence", "content": "Absolutely."}, {"type": "sentence", "content": "But with hundreds of thousands of writers around the world, you need to do something to stand out. And for new freelancers, word of mouth is the best kind of Marketing you can get."}, {"type": "sentence", "content": "Chances are you will get a great testimonial if you ask for it."}, {"type": "sentence", "content": "And that client will recommend you to his peers should they need a writer."}, {"type": "sentence", "content": "Your reputation is more valuable than the few extra dollars you can gain per article by charging for these services. And if you have a reputation for going the extra mile, you’ll have an easier time closing clients and thriving in your writing business."}], "topic": "freelancing"}