{"title": "Five Habits That Quickly Boost Productivity", "data": [{"type": "subtitle", "content": "Use them to perform better."}, {"type": "sentence", "content": "Some days, your body feels heavy. Time moves slow. The couch feels magnetic. You can’t move. Even the bathroom feels far away."}, {"type": "sentence", "content": "Lazy days are the worst when you actually have work to do. Evolution wired us to conserve energy, waiting for our next hunt. Blame Darwin."}, {"type": "sentence", "content": "Productivity is misunderstood, overthought, and rarely implemented correctly. The best way to improve your output is to use easy tools that produce quick, noticeable effects."}, {"type": "subtitle", "content": "1. Give a commitment to someone"}, {"type": "sentence", "content": "Even when nobody is asking for one, say, “I’ll get this to you by EOD ____.”"}, {"type": "sentence", "content": "I’m a writer and do this frequently, telling pub owners a specific time I’ll have a draft to them by."}, {"type": "sentence", "content": "Committing is a great way to hold yourself accountable. It puts your reputation on the line."}, {"type": "sentence", "content": "It creates a sense of urgency. If you care about your integrity, you’ll get the task done."}, {"type": "sentence", "content": "Always treat your word as gold. Be the person who does what they say they’ll do."}, {"type": "sentence", "content": "Secondary challenge: what if you don’t work with anyone?"}, {"type": "sentence", "content": "Find someone to hold you accountable. I frequently ask my girlfriend to check in with me. For example, I recently had her ask, “Did you call the DMV like you said you would?” The last thing I want to do is be seen as a flaky dude."}, {"type": "sentence", "content": "Accountability advances productivity."}, {"type": "subtitle", "content": "2. Make a shortlist of mandatory tasks each morning"}, {"type": "sentence", "content": "This is the fastest acting trick in this article. I do it every day."}, {"type": "sentence", "content": "Each morning, write down 3–4 non-negotiable tasks. Treat them as sacred. You’ll feel mission-driven and start your day with purpose."}, {"type": "sentence", "content": "Put the list in a place you frequent. If you see it, you’ll be more likely to do it. I keep mine by the keyboard (I’m a writer)."}, {"type": "sentence", "content": "Remember to cross off each item when you are done. It adds to the sense of accomplishment and reinforces a task-oriented brain."}, {"type": "sentence", "content": "You need goals. For example, who would you bet on?"}, {"type": "sentence", "content": "A: “I hope I get stuff done today.”"}, {"type": "sentence", "content": "B: “I have three things I must get done today.”"}, {"type": "sentence", "content": "You can’t just wander through life. Write them down. Do them. Cross them off. Repeat."}, {"type": "subtitle", "content": "3. Play to your energy levels"}, {"type": "sentence", "content": "It is often preached that we should push past weakness and fatigue. This is certainly true to some extent, achievement requires grit."}, {"type": "sentence", "content": "But there are limits to this perseverance philosophy. If you try to march forward indefinitely, your efficiency will decline and you’ll lose morale."}, {"type": "sentence", "content": "A better option:"}, {"type": "sentence", "content": "The most productive person I know rarely does more than an hour of work at a time. He takes lots of small breaks and still outproduces all of his peers."}, {"type": "sentence", "content": "He’s also able to maintain a better attitude. The grind doesn’t ruin his mood."}, {"type": "subtitle", "content": "4. Leverage incentives and limitations"}, {"type": "sentence", "content": "To develop discipline, one of the best things you can do is practice saying no to yourself. To take it even further, begin dangling tasks that make you earn something you really want."}, {"type": "sentence", "content": "For example, I’d love to have a coffee right now. That’s all I’ve been thinking about while typing. But I’m not letting myself have it until I finish this dang article. That’s the incentive."}, {"type": "sentence", "content": "You can do this with anything. Decide what you really want. Then put a task in front of it."}, {"type": "sentence", "content": "You’ll be doing two things:"}, {"type": "sentence", "content": "Practicing restraint will give you a sense of control over your life. You won’t feel like some wild animal that’s at the mercy of passing urge."}, {"type": "subtitle", "content": "5. Use The 2-minute Rule"}, {"type": "sentence", "content": "Procrastination is the loving bedfellows of laziness. The future becomes a highly appealing place for all those tasks."}, {"type": "sentence", "content": "Solution: deploy David Allen’s 2-minute rule."}, {"type": "sentence", "content": "The rule: if it takes less than 2 minutes to do — do it now."}, {"type": "sentence", "content": "I use this all the time. It allows me to pick off straggler tasks and piecemeal the day's work."}, {"type": "sentence", "content": "You can do a lot in 2 minutes: wipe down furniture, sweep a room, load the dishwasher. This drill often starts with me being a lazy bum —and turns into me seeing how much I can get done in 2 minutes."}, {"type": "sentence", "content": "It’s a great way to create momentum on those slow days."}, {"type": "sentence", "content": "Also, many large projects can also be broken down into smaller units. The workload will feel lighter. Your productivity will stack up under the weight of tiny gains."}, {"type": "sentence", "content": "Even if you do just two or three of these, you’ll get a huge boost in productivity. They work great in conjunction."}, {"type": "sentence", "content": "Quick Recap:"}], "topic": "productivity"}