{"title": "Most Emails Sound More Negative than Intended", "data": [{"type": "subtitle", "content": "Here’s how to find the appropriate tone"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*WbkkEUjKk3vxSrjW38AM3Q.jpeg"}, {"type": "sentence", "content": "With tools like Grammarly or even emojis and GIFs, it seems like we should have enough options out there to easily convey a nice, friendly tone in written communications — something desperately needed during stressful times. However, a study shows that e-mails generally tend to be misinterpreted as being more emotionally negative or neutral than intended."}, {"type": "sentence", "content": "Now on top of that, let’s take a look at the linear model of communication. While it’s a pretty basic, non-interactive model from the early days of communication theories, it still works for the distribution of an e-mail:"}, {"type": "image", "content": "https://miro.medium.com/max/4996/1*RgXwA_ZxSGUq8LEpo_rgUQ.png"}, {"type": "sentence", "content": "In such a model, the computer screen is the “noise”."}, {"type": "sentence", "content": "Because of that noise, the recipient won’t perceive the tone you hear and emotions you feel while writing alone at your desk."}, {"type": "sentence", "content": "Conveying the right emotions and coming across as positive in written communications should be anybody’s concern. Especially if these can impact your business relations. Even more so, if your relatives cringe at your e-mail — or worse — your texts."}, {"type": "sentence", "content": "In that context, here are a few things to help you sound more human and less robotic in your next e-mail:"}, {"type": "subtitle", "content": "Avoid sounding self-centered"}, {"type": "sentence", "content": "Think of the reader first and imagine reading your own e-mail as another person. Does it come across as warm? Does it sound too bossy? Or, might it even be perceived as ice-cold?"}, {"type": "sentence", "content": "Reading it aloud could be even better since, in your head, emotional cues might still feel obvious to you. This will help you adjust punctuation and phrasing accordingly."}, {"type": "sentence", "content": "If you still doubt whether you’ll come off as negative or indifferent, a good idea is to count the number of times you used the first person (e.g. “I think it’s best that…”). This can help indicate whether you’re overly focused on yourself, and not enough on the person you’re e-mailing."}, {"type": "subtitle", "content": "Dig deeper in your emotions"}, {"type": "sentence", "content": "First, realize what sort of emotion(s) the e-mail you just wrote is going to evoke. When you stop to pause this way, you might realize you don’t sound like the nice person in your head that you know you are. Adapting your words and phrasing to fit a kinder tone might then be in order."}, {"type": "subtitle", "content": "Consider the following examples:"}, {"type": "sentence", "content": "At first glance, example 1 may sound fine. But what if Andrew’s feeling very anxious about tomorrow’s presentation? Wouldn’t that type of phrasing put more pressure on him? On the other hand, example 2 is basically conveying the same message, but comes off as less stern and emphasizes solidarity."}, {"type": "sentence", "content": "Reviewing your phrasing, adding a well-placed adjective, or even reaching out and asking a question can go a long way in giving your writing a kinder tone."}, {"type": "subtitle", "content": "Dial down the exclamation points"}, {"type": "sentence", "content": "Punctuation helps a lot with conveying the right tone or emotion in writing. However, if you overuse the exclamation point on your keyboard, you might come off as too eager or overly excited. This might be great if you’re RVSPing to your cousin’s birthday party, but not that appropriate if you’re replying to Brad from accounting."}, {"type": "sentence", "content": "Using the exclamation point as a way of bailing out from putting a little more effort in sounding friendly and positive also just seems lazy. Even worse, it could make you sound fake and/or sarcastic — something you might want to avoid, depending on how well the recipient knows you. Now, even if you take care of all these aspects, sometimes the situation simply doesn’t warrant a friendly response. Just remember: being firm doesn’t imply being rude and mean."}, {"type": "sentence", "content": "So, if you find yourself in such a situation, here’s a bonus tip on how to be firm without being rude:"}, {"type": "subtitle", "content": "Be straightforward"}, {"type": "sentence", "content": "Don’t understate the issue at hand. If you have something to say to a subordinate or a colleague, say it. If you need to give bad news to your superiors, by all means do it. Try to be as honest as possible if the expected results weren’t met."}, {"type": "sentence", "content": "Sugarcoating the content of your e-mail and hoping that people won’t notice is just a recipe for further disaster and broken trust. So, if you need to be firm without being nice, remember to be honest. Lay out the facts. Your business relationships should at least recognize your efforts and appreciate your straightforwardness."}, {"type": "sentence", "content": "As for sharing bad news with friends or relatives, I think we can all agree that a face-to-face meeting will always be better than an e-mail."}, {"type": "sentence", "content": "Do you have any takes on how to show more compassion and empathy when writing to professional connections, as well as friends or relatives? I’d be happy to get more ideas from you in the response section below!"}, {"type": "sentence", "content": "Source:"}, {"type": "sentence", "content": "Byron, K. (2008). Carrying too Heavy a Load? The Communication and Miscommunication of Emotion By Email. Academy of Management Review, Vol. 33, №2, 309–327. url: https://www.researchgate.net/publication/252671620_Carrying_too_Heavy_a_Load_The_Communication_and_Miscommunication_of_Emotion_by_Email"}], "topic": "business"}