{"title": "7 Steps to Stay Productive When You Control Your Own Schedule", "data": [{"type": "subtitle", "content": "How to stay motivated as lock-down continues"}, {"type": "sentence", "content": "What day of quarantine is this? Most days I wake up unsure of the time, day, or month and fall into the same routine:"}, {"type": "sentence", "content": "Wake up. Scroll through emails and Instagram for much too long. And at some point in the day, try to get out of bed and out of my pajamas. However, that is no longer a necessity given the state of the world."}, {"type": "sentence", "content": "As with many of my peers, I am at a unique stage in my life where my schedule is no longer determined by meetings and classes. The end of graduate school came to an abrupt stop in March followed by, “well, that’s all folks”. I am not someone accustomed to a few free hours in a week let alone 24/7 free time. Perhaps this is why so much of my Instagram feed is filled with pictures of sourdough and banana bread. Seems that none of us truly know what to do with the extra free time that lock-down has afforded us."}, {"type": "sentence", "content": "After wallowing for a few weeks and catching up on years of sleep deprivation, I decided it was time to figure out how to return to self-motivation and try to designate a schedule for the foreseeable future. Though much trial and error, I have determined a few key rules."}, {"type": "subtitle", "content": "1. Designate a time to wake up."}, {"type": "sentence", "content": "A set time to get up every day gets easier with repetition. When left to my own devices, I would stay on my laptop watching Netflix until 3 am and then roll out of bed just in time for lunch. Waking up early to an alarm was difficult for the first few days but then became a sense of habit. I needed to set multiple alarms at first and recognized that I needed a 20 minute buffer between waking up and getting out of bed. Setting an alarm for 7:40 am was the perfect sweet spot so I could start my day at 8 am."}, {"type": "subtitle", "content": "2. Schedule meetings early in the morning."}, {"type": "sentence", "content": "After rolling out of bed, my motivation had still not kicked in for the day. I found that finding friends that were also struggling to be productive and setting webcam meetings with them first thing in the morning was a great motivator to brush my teeth, comb my hair, and get dressed for the day. It also forced me to stick to my early morning wake-up time so I would not disappoint my friends."}, {"type": "subtitle", "content": "3. Create a general plan for the day."}, {"type": "sentence", "content": "I was struggling with the lack of structure that I had each day and found that even with waking up early, I have an extreme knack for procrastination and distraction. Planning when I would eat my meals and a general layout for the day ensured I built-in relaxation time as well as work time. Knowing that I had to read a certain amount in a day and complete a certain number of flashcards and practice questions ensured that I would end each day feeling like I had been productive. I was not strict with the timing of each item and instead found that setting a quantitative amount to finish in a day was more helpful."}, {"type": "subtitle", "content": "4. Build in free time."}, {"type": "sentence", "content": "In order to stay productive, I need to know that I also have time for relaxation. I use my meal times to catch up with my family and my study time to see some friends. Apart from that, I plan time each weekend to catch up with different friend groups and leave a few hours at the end of the day to watch some reality tv shows and truly shut off from the day."}, {"type": "subtitle", "content": "5. Try to exercise."}, {"type": "sentence", "content": "I am still trying to work on this one. Luckily, many apps are giving free workout classes to help with the lack of gym access at the moment. I recently downloaded the Down Dog Yoga app to attempt to get my body moving and bought some compression socks to try to convince myself to put them on and go running. Maybe tomorrow…"}, {"type": "subtitle", "content": "6. Fuel your body."}, {"type": "sentence", "content": "Eat to try to nourish yourself. Food is fuel but also a source of comfort. I have spanned the spectrum of eating junk food to eating really healthy. I found this is about balance. Food supply is restricted in some areas and trying to go to the grocery store just once a week has made for some interesting meals. I have been trying to cook a bit but some days I do not want to deal with the time and the number of dishes that need to be washed. It happens."}, {"type": "subtitle", "content": "7. Give yourself a break."}, {"type": "sentence", "content": "This is unprecedented time. We are all navigating restrictions and schedules that we have never had to before. It is okay to take days off, skip exercise and eat junk food. If you need it, do it. I find that after I have given myself a day or two, I try to figure out what is bothering me and how I can work to fix it or handle the emotion behind it. I am a work in progress. And that is okay."}, {"type": "sentence", "content": "Now go forth and enjoy that new at-home work setup and sourdough. Breath tiger, this is temporary."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "productivity"}