{"title": "Digitalization and Agility: Joining Forces Against Silo Thinking", "data": [{"type": "subtitle", "content": "Digital transformation is not about technology and agile transformation is not about processes. Both are rather about culture and above all a cultural fight against silo thinking."}, {"type": "sentence", "content": "Agility thrives on short feedback loops. Usable product increments are delivered in rapid succession and the insights gained from the use of these increments subsequently influence further development. Agility is in principle a control loop consisting of experiment and validation or falsification. The faster this control loop is run through, the faster it can be checked whether one is on the right track and the lower the risk of running in the wrong direction."}, {"type": "sentence", "content": "Agility and digitalization are interdependent. On the one hand, digital products and processes facilitate agility, because in digital and virtual reality the delivery of new product increments is possible much faster than in the physical world. And of course it also makes a big difference when it comes to validation, whether it takes the form of a customer survey by a call center or whether acceptance of a new function of the software is just a matter of A/B testing."}, {"type": "sentence", "content": "On the other hand, the digital transformation of organizations, their products and their business models is predestined for an agile approach due to the uncertainty that comes with it. Agility helps to keep the risks of digitalization under control. And last but not least, digitization also means rethinking and relearning, and this joint learning journey works much better in an agile way."}, {"type": "subtitle", "content": "Fighting the Silos"}, {"type": "sentence", "content": "Traditional hierarchical organizations consist of functional departments that divide areas of responsibility, allocate power in the form of budget and staff, and subdivide value creation. This results in silos, the walls of which become thicker every year thanks to appropriate evaluation and reward systems."}, {"type": "sentence", "content": "Due to this established structure, agility and digitalization are in great danger of running aground within these silos. An agile project within a department does not make much of a difference because the department itself is only a tiny part of the value chain and therefore the feedback on the department’s contribution is only available at the end of a long series of handovers."}, {"type": "image", "content": "https://miro.medium.com/max/1448/0*tULpwv5TTrCN_m3k.jpeg"}, {"type": "sentence", "content": "Agility therefore always implies a form of interdisciplinary collaboration to reduce precisely these handovers and thus to shorten the control loop of experiment and validation. An essential feature of agility is to work across silo boundaries along the value chain in an interdisciplinary team. However, this is not provided for in the organization and is usually not welcomed by the respective princes of the silos."}, {"type": "sentence", "content": "The same is true for digitalization. In the end, digitizing the processes and artifacts in a few departments will make little difference — especially not if the handovers in between take place with Excel at best. Or in the words of Thorsten Dirks: “If you digitize a shitty process, then you have a shitty digital process! That’s why digitalization also has to bridge and dismantle the silos. On the one hand, culturally in the sense of an open handling of data, but also technically in the sense of software architectures that do not simply reproduce the silos according to Conway’s Law, but offer open interfaces for easy integration."}, {"type": "sentence", "content": "Culture follows structure, as Craig Larman summarizes. Silos lead to silo thinking. Agility and digitalization necessarily shake these very foundations of hierarchical organizations. For it to be effective, any such transformation must break down the silos, at least temporarily and selectively."}, {"type": "sentence", "content": "Originally published at https://fuehrung-erfahren.de on May 20, 2020."}], "topic": "leadership"}