{"title": "Assassins Teach History", "data": [{"type": "subtitle", "content": "Learning history by living it — virtually"}, {"type": "sentence", "content": "I remember being drawn to Ubisoft’s Assassin’s Creed franchise as a teen. It wasn’t due to the greatness of the gameplay, but rather, the history I learned from within these virtual worlds. Assassin’s Creed broadened my perspective about history and philosophy. It also helped me to empathise and connect with others as well, especially those from other countries."}, {"type": "sentence", "content": "Assasssin’s Creed takes you back in time, enabling you to walk in the shoes of people living through different time periods. The franchise has explored numerous epochs, from the crusades through to the rise of Egypt. The latest game — Assassin’s Creed Valhalla — takes us deep into the world of the ancient vikings."}, {"type": "sentence", "content": "Regardless of the particulars of each game, you’re always playing as an assassin. In this role, you’re embodying a person who opposes tyranny and oppression by governments all over the world. Essentially, you’re fighting for the freedom of the people. At least, that’s the initial premise; each game explores, with great nuance, the geopolitical goings on of their given setting."}, {"type": "sentence", "content": "This is where the history lesson starts."}, {"type": "sentence", "content": "The genius of these games is that they make us feel like we are there. Ubisoft has implemented every possible detail of the various ancient cities and towns, breathing life into them, imbuing them with extraordinary realism. From the people living there and going about their business, to the internal and external structure of the buildings."}, {"type": "sentence", "content": "The attention to detail extends to the culture of the people themselves, which the developers need to be particularly careful about. It’s for this reason you’ll see this disclaimer at the beginning of each game:"}, {"type": "sentence", "content": "The development team evidently conducts extensive research for each title to ensure they are representing these ancient (and sometimes not so ancient) cultures appropriately, in a way that is true to history."}, {"type": "sentence", "content": "For example, when they were building Assassin's Creed 3, the developers had to meet native Indians and went to their language and cultural center to learn about the tribes avoid making errors about their histories and cultures. Amazing, isn’t it?"}, {"type": "sentence", "content": "And although there’s a legitimate place for textbooks, the truly awesome thing about Assassin’s Creed as a series is that it allows us to visit these historically important places and interact with historical figures. We can explore historical buildings that have been rendered with great care and attention to detail. We are quite literally given a virtual tour around these locales as they likely existed during the relevant historical periods."}, {"type": "sentence", "content": "Assassin’s Creed has become the definitive historical RPG."}, {"type": "sentence", "content": "Thanks to Ubisoft’s massive success in merging history and interactive entertainment, there are teachers who are now building on their work to make teaching history more engaging. Ubisoft has reported that they’ve received numerous teachers’ comments, indicating they are using the game for their classes — admittedly, though, the violence in these games limited their use in some cases."}, {"type": "sentence", "content": "I think one of the key differences between Assassin’s Creed and a typical textbook isn’t just the obvious fact that one is an interactive, multi-sensory experience. It’s actually that the video game makes history both interesting and simple to grasp because there are engaging narrative threads weaved throughout. This extra bit of fiction makes the experience more appealing to play while still remaining true to historical events."}, {"type": "sentence", "content": "We are drawn to stories — it’s why we love movies and novels as well. In fact, you can make your own writing more interesting if you have a story to tell (here’s a piece I wrote about it, if you’re interested)."}, {"type": "sentence", "content": "So, narrative and characters are important. But so is setting. The design teams at Ubisoft really took the time to ensure accuracy when it came to depicting a wide range of historical structures in the time period where they were still relatively new and being actively utilized. The fact that you interact with these buildings on such a granular level as well (by climbing all over them), indicates the importance of this detail."}, {"type": "sentence", "content": "You may have seen reports at Ubisoft’s models and designs being leveraged in the Notre Dame reconstruction project. This was in the context of various companies jumping in and offering to support reconstruction efforts after the devastating fire on 15th April 2019."}, {"type": "sentence", "content": "Assassin’s Creed is arguably more than a video game. Even if you aren’t usually interested in playing games, what you’ll find here is an almost unparalleled history simulator. Where else can you run around the Giza Plateau and get some sense of what it was like thousands of years ago in its heyday?"}, {"type": "sentence", "content": "I hope you learn something here."}, {"type": "sentence", "content": "If you like this article, be sure to follow me for more and go ahead subscribe to my newsletter to be the first to see the articles."}], "topic": "travel"}