{"title": "Why EQ Is Essential to Corporate Leadership", "data": [{"type": "subtitle", "content": "A strong indicator of success."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*3iteH3Zhj-YzRudz.jpg"}, {"type": "sentence", "content": "By Jennifer Longmore"}, {"type": "sentence", "content": "Emotional intelligence (EQ) is one of the most important skills a leader can have. Often, the EQ of a team’s leader is the difference between those employees showing up to get their paycheck and employees showing up completely engaged in their projects, ready to give their all."}, {"type": "sentence", "content": "Your emotional intelligence determines how you relate to and understand other people. Are you able to put yourself in someone else’s shoes or see things from their perspective? Are you able to see the different angles of a situation and pinpoint which choices will have the most significant impact? Can you tell how your team members respond to different forms of praise, motivation, and feedback?"}, {"type": "sentence", "content": "To build a team that will follow your lead, you have to have the emotional intelligence to build relationships founded on trust, loyalty, and meaning."}, {"type": "subtitle", "content": "Trust"}, {"type": "sentence", "content": "Emotional intelligence is one of the key ingredients for building trust in relationships. For example, think about the importance of onboarding someone new onto the team. You have a new team member who doesn’t yet know the rules, may not have any friends, and can feel like an outsider."}, {"type": "sentence", "content": "How are you going to bring that person into the fold? Are you introducing them to key players who will make sure they’re taken care of? Are you checking on them throughout the day? Are you asking them questions about how they like to be spoken to or how they like to receive feedback? All of these things show your new hire that they’re welcome on the team and that their voice matters."}, {"type": "sentence", "content": "When you show your team that they’re important to you, you build more trust."}, {"type": "sentence", "content": "Other ways to build trust with your team are to:"}, {"type": "sentence", "content": "Trust is the first step to building loyalty."}, {"type": "subtitle", "content": "Loyalty"}, {"type": "sentence", "content": "Turnover is rough. It affects team morale. It reduces productivity. It decreases profit margins. And most importantly, it makes scaling more difficult. The crazy part is that there’s a myth floating around that today’s employees — especially millennials — don’t like staying at a company for more than a couple of years. According to BuiltIn, “56% of millennials believe that employees should stay at the same company for over 20 years,” and, “94% of employees would stay in their current roles longer if they felt the company was invested in their professional development.”"}, {"type": "sentence", "content": "Building loyalty is, in the famous words of Jay Fiset, a game of “I’ll go first.” Thirty years ago, it was difficult to leave a position. Finding a new job often meant moving, remote positions were limited, and many people had to go to the library or break out the newspaper to look up openings. That meant leaders didn’t have to do anything special to keep their employees. Today, it’s different."}, {"type": "sentence", "content": "In order to keep your employees, make your company a place that your team wants to work. Generous benefits packages and great pay are just the beginning. What hits the home run in this scenario is the professional development of your employees. Investing in your employees builds their loyalty to the company. Your people want to grow. They want to contribute more. By giving them the opportunity to evolve, gain more skills, and use those skills in their positions, you’ll see those employees more committed to their work (and to you). By having a higher emotional intelligence, you’ll be able to see which trainings will best support your employees and which ones they’re most interested in."}, {"type": "subtitle", "content": "Meaning"}, {"type": "sentence", "content": "Being an emotionally intelligent leader means remembering that your employees are people. They have causes that they care about. There are events happening around the world that move them. When your team knows that their work is contributing to something larger than themselves, they’re more committed because there is more meaning in their work. According to BuiltIn, “employees are less likely to leave for a 10% pay raise elsewhere if their company’s purpose goes beyond profits.”"}, {"type": "sentence", "content": "Here are a few ways that you can create more meaning for employees:"}, {"type": "sentence", "content": "The more you engage your team as whole people — utilizing their physical, mental, and emotional capacities at work — the more they’ll give you their all."}, {"type": "sentence", "content": "—"}, {"type": "sentence", "content": "The story was previously published on The Good Men Project."}], "topic": "leadership"}