{"title": "Trying to Conquer Your Chattering Mind Is Futile — Do this Instead", "data": [{"type": "subtitle", "content": "It’s about observing, not conquering."}, {"type": "sentence", "content": "Most people on this planet are “stuck in their heads” most of the time. Thoughts about the past, worries about the future and just plain trivial BS dominate most peoples’ moments. That’s the bad news."}, {"type": "sentence", "content": "The good news is that past years have seen an upsurge in public awareness that this state of affairs is not a good thing. For millennia before this, people just accepted that their minds were who they were and didn’t see this as particularly concerning. The boom in meditation and mindfulness (MM) has the world trending in the right direction."}, {"type": "sentence", "content": "A common beginner mistake"}, {"type": "sentence", "content": "But many wading into the incipient stages of MM have a faulty understanding of what the true game plan is. They identify, correctly, that the mind and all of its injurious, involuntary thinking, is the main culprit. And they think, logically, that the way to approach this problem is to try and overcome, or conquer, this mind that has caused them so much grief throughout their lives."}, {"type": "sentence", "content": "How does this strategy manifest? In meditation, people say to themselves, “Okay, let’s focus on stopping my crazy mind from thinking…” This may work for a short while, but then the thoughts inevitably come charging back with a vengeance."}, {"type": "sentence", "content": "In practicing mindfulness it comes out when, for example, someone is out in nature and says, “Wow. What a beautiful sunset. Let’s just stop thinking and be present with it…” This also ends in frustration and increased thought traffic."}, {"type": "sentence", "content": "Observe, don’t conquer"}, {"type": "sentence", "content": "The point is that the human mind cannot be wrestled into submission by direct action. So what is the best strategy for slaying our noggin dragons? Simply learning how to observe your thinking mind. That’s it. Don’t conquer it, observe it."}, {"type": "sentence", "content": "What that requires is self-evident: You need to separate the real, conscious you from the egoic, thought machine you (i.e., the mind). You to need separate the subject (real you) from the object (not real you thinking mind)."}, {"type": "sentence", "content": "Unfortunately, doing this is difficult. Why? Because we’ve been stuck in our heads believing we are our thoughts for as long as we can remember. I can’t think of a harder habit to break than stopping myself from getting sucked into my thoughts. It happens so automatically for most of us that it’s hard to notice and therefore hard to prevent."}, {"type": "sentence", "content": "There’s a reason for the chattering mind"}, {"type": "sentence", "content": "It’s important to acknowledge that the mind produces all these thoughts for a reason. It is desperately trying to make things “okay” for us. It uses all of our past experiences as data points in determining what thoughts will result in an okay you. The problem is that the mind is almost always wrong."}, {"type": "sentence", "content": "Fine. So we’ve concluded that the chattering mind is injurious to our well-being, that trying to conquer it is futile and that the best solution is to observe it."}, {"type": "sentence", "content": "That leads to the inevitable question: How do you teach yourself to detach from and observe your mind? Answer: You do it by practicing meditation and mindfulness correctly."}, {"type": "sentence", "content": "The key: nonjudgmental observance"}, {"type": "sentence", "content": "Both of these practices at their essence are about nonjudgmentally observing what is happening in the present moment. In meditation that means following your breath, listening to that truck that just drove by and, most important for our purposes, noticing the thought I just had about my tennis match yesterday. The tennis thought is no different than the truck sound or the breathing. It’s just something that isn’t me appearing in my field of awareness soI treat it as such."}, {"type": "sentence", "content": "Fortunately, the more we meditate and just observe our thoughts as something that is as separate from who we are as a speeding truck, the quieter the mind becomes. It takes a while, but slowly and surely, it happens."}, {"type": "sentence", "content": "And as it does, you become calmer, less anxious, more focused and, best of all, more content."}], "topic": "mindfulness"}