{"title": "Lessons from Netflix, Ted Sarandos & Reed Hastings — Part I", "data": [{"type": "subtitle", "content": "From Founders to Content and Scale"}, {"type": "subtitle", "content": "Ted Sarandos"}, {"type": "sentence", "content": "Ted was one of those guys that didn’t rush to become super wealthy and successful. He always figured he would become a journalist. Pursuing this goal, he went to Glendale Community College for two years and later Arizona State University for journalism, and one day he had an epiphany. The epiphany was that he wasn’t good at writing. At the time, he was working at a video rental store in the evenings, so he dropped out of school to manage the store he was working."}, {"type": "sentence", "content": "Those days, in the late 80s, he would have all day to watch movies in the store. That wasn’t a problem since the rush hour was between 7 and 9 pm, after work hours when everyone had time to return movies and grab a fresh batch of movies and shows for the week. A job that likely gave him plenty of opportunities to recommend movies to customers. He progressively took on more and more responsibilities at the video store and, at some point, was managing eight stores in the chain. Then eventually, he became the regional sales and operations director, becoming responsible for 500 stores in the western states."}, {"type": "sentence", "content": "When Netflix founder Reed Hastings met Ted Sarandos in 1999, he was the guy who knew the ins and outs of the video rental business and as a bonus a deep-rooted passion and appreciation for movies and great storytelling. He joked once that he’s a human movie recommendation algorithm because he’s seen pretty much most films and shows and that he’s quite good at recommending."}, {"type": "sentence", "content": "Fast forward two decades at Netflix, and he runs in powerful circles of network executives and influential politicians. For a person who has been named the Times Magazine’s one of 100 most influential people, he has kept some youthfulness and sweetness as he’s matured. In interviews, he’s relaxed, humble, he seems to artfully deflect most compliments that come his way onto his team, sometimes luck or how they, Netflix, thought about the problem."}, {"type": "sentence", "content": "His primary job today is to keep a portfolio of content on Netflix that interests a wide array of people. A typical portfolio might have 10% horror, 40% comedy, 20% action, 30% long-tail interests. Choosing movies to fulfill a portfolio sounds simple enough. But keeping 160 million people satisfied with the content curation is an enormous task. Maybe even an uphill battle, as most news these days, about Netflix, is how people are running out of things to watch on Netflix. No matter how they curate and how many shows there are, people are always going to be unsatisfied with selection. If not variety, then some yet to be found reason. We’re good at that, finding a reason to be dissatisfied. It’s just in our nature to be this way. Every shiny new thing wears its welcome and becomes a bore. Even so, it’s Netflix’s number one goal to keep its viewers as satisfied as possible."}, {"type": "sentence", "content": "Or maybe their goal is to keep us just satiated enough that we don’t stop our monthly subscriptions, while they grow their user base to broader and broader viewing preferences and viewership. The economics of this workout so that Netflix’s current memberships help fund its expansion. One could argue that if Netflix used all of its resources to serve its existing viewers better, then the existing user would get much more content at better quality. But business doesn’t work like that, like all businesses Netflix needs to grow."}, {"type": "sentence", "content": "99% of Netflix’s revenue comes from subscriptions. Even if 10 to 20% of subscribers discontinue, it could be catastrophic to their bottom line. Starting and running a business is complicated work, and there are many metrics that businesses are told to monitor, however in startup philosophy, founders are often to told to ignore all the noise and focus on user growth as the ultimate signal. This philosophy couldn’t be more true for Netflix."}, {"type": "sentence", "content": "As opposed to Microsoft that has extremely spread out products and services and an equal amount of sources of revenue. In stark contrast, Netflix has only one singular service that caters to 160 or so million subscribers. If you’re trying to decide if this is diversified, whether you should look at it like one service, therefore risky or 160 million different customers watching wide array of movies and shows, thus less risky. There’s an argument for both."}, {"type": "sentence", "content": "This first quarter of 2020, Netflix saw its most substantial spike in sign-ups ever of 16 million new users, on top of its 160 million subscribers. If you consider the pool of users as a bathtub of water, “16 million new users” is adding a bucket of water to the tub. A bucket that’s estimated to be worth 5.75 billion USD. In the standard bathtub model of Netflix users, there’s an input stream of new user sign ups and an output stream of subscription stoppages."}, {"type": "sentence", "content": "Historically, every time some show touches on a controversial topic or Netflix announces a price spike, people stop their subscriptions and encourage others to do the same on Twitter. To keep the company’s share value, and the bottom line healthy, the difference between new users and user drop-offs should always be positive."}, {"type": "sentence", "content": "Netflix has a huge appetite for growth. Since a few years ago, the growth in the US has declined and has stayed at about 60 million, an equilibrium perhaps. Naturally this means the primary user growth needs to come from elsewhere. Netflix has six offices globally, and that gives us an idea of where the company would like to focus its growth efforts. There are offices in Japan and Korea, based on the population and the average income of the people there that makes sense. There is an office in the Netherlands, to maintain and grow its user base in Europe. And lastly, in India and Brazil, undoubtedly due to the large population size of those countries, there’s great potential there as well."}, {"type": "subtitle", "content": "Scale of Netflix"}, {"type": "sentence", "content": "When you google Netflix, you get 762 million results as compared to Prime Video, which has about 1980 million results, and Hulu and Disney at 106 and 1090 million results respectively. Netflix used to be the market dominator for quite some time. But with all the competing streaming services that are coming out from formidable companies, with their own set of branded content, it doesn’t look like Netflix will become a monopoly."}, {"type": "sentence", "content": "Yet Netflix’s peers have not entered colloquialism, as I have yet to hear “Let’s Prime Video and Chill”. In fact, some people seem to use Netflix as a verb now for all streaming — every founder’s dream. Of course, that could allude to the fact that Netflix has had around 2 plus decades of momentum, and a pretty catchy name to go with it. It’s interesting to explore what made this company succeed and find a profitable path forward when many others have failed. As we’re seeing video streaming is not a small-time play, all the successful entries into the market have been big names like Amazon, HBO, Apple and Disney. What’s different about Netflix is that it wasn’t a mega corporation before it went into streaming."}, {"type": "sentence", "content": "Part of their success is undoubtedly timing because it was able to become a video rental first and then slowly pivot into streaming, and slowly building up momentum and capital to produce originals. Whereas if a small startup wanted to start a similar business right now, it better have a 20 billion USD annual budget for several years. Companies like Apple and Disney have been dropping about that much for its initial line up of shows. Or maybe a pre-existing selection and ownership or exclusive licensing rights to widely appreciated movies and films as well as an army of engineers and business people. Still, it’s worth exploring Netflix’s history because it trail blazed the way for all the newcomers into the business of streaming movies and TV shows."}, {"type": "sentence", "content": "— Someone talking about Ted Sarandos"}, {"type": "sentence", "content": "As of 2019, Netflix has 154 million users globally, 60 million from the US and 6 million new free trial accounts and the rest from all over the world."}, {"type": "image", "content": "https://miro.medium.com/max/1066/1*eKhkwgY4efg5t_si2IGsCA.png"}, {"type": "sentence", "content": "Even though 60 million subscribers or only 18% of the US population has a subscription. It could be argued that almost everyone in the US has access to Netflix due to subscription sharing within family and friend circles."}, {"type": "image", "content": "https://miro.medium.com/max/1030/1*kmlZZtmO3JXnMjmy-KjL1w.png"}, {"type": "sentence", "content": "Some fuzzy ‘six degrees of Kevin Bacon’ calculation leads us to reason that if every paid member shared their account with one additional person, there could be 120 million users with Netflix. On the higher estimation, if a person shares it with four extra people, there could be 300 million people with Netflix access in the US. Why four additional people? Because Netflix offers max five profiles for each account. Although why stop there, if your group of friends watch Netflix only occasionally, ten, twenty people could just share an account."}, {"type": "sentence", "content": "The actual average is probably around 2 or 3, which gives us either 120 or 180 million people with access to Netflix. That number seems reasonable."}, {"type": "sentence", "content": "But the US really seems to be in an equilibrium of 60 million paid subscribers. If you apply this reasoning to say Canada, Canada has a population of 37 million then 1/5 of that would be 7.4 million subscribers in Canada, plus or minus 1 million."}, {"type": "sentence", "content": "As of 2019, Netflix did reveal its official Canadian subscriptions count to be 6.5 million, not bad for a guesstimate. But this kind of reasoning would start to break down as the language, culture and preferences of viewers move from American to Canadian to British to Australian to Mexican to … say Zimbabwean, on the America Index."}, {"type": "sentence", "content": "Netflix’s own outlook on the US market isn’t too optimistic either, they think it might be possible to get another 30 million households."}, {"type": "sentence", "content": "Another back of the napkin calculation gives us an estimation of Netflix’s annual revenue. If we assume average membership of 10 USD, monthly Netflix earns 1.48 billion USD — and annually Netflix earns roughly 17.7 billion USD. We’ll find out how accurate this calculation is and how Netflix reinvests its money, in the following sections. But to give you some perspective. The World Health Organization’s annual budget for 2019 was just over 4.2 billion USD."}, {"type": "image", "content": "https://miro.medium.com/max/922/1*WmeJpvAXI7_xTDOKCbCPOw.png"}, {"type": "sentence", "content": "Most people don’t think twice about the 10 dollars a month that Netflix and other subscription services silently take, yet in the summation, it becomes a significant amount. This perfectly illustrates the power of crowd-sourcing. If a similar amount of people donated the same amount of money into the WHO, we could quadruple their resources in their fight to eradicate horrible diseases and global emergency prevention and preparedness."}, {"type": "sentence", "content": "Netflix has 8600 employees by December 31, 2019 estimation, working from 6 different cities all over the world. The jobs are divided into 4 different categories: product, corporate, marketing and content. Glassdoor profile for Netflix shows about 1000 reviews of the company and the general sentiment is pretty good, people like the culture and they especially approve of their CEO, Reed Hastings."}, {"type": "sentence", "content": "Netflix is described as a media-services provider and a production company. So far we have mostly talked about how Netflix streams and makes money from streaming. But a significant portion of the business is the production side. It really has become a bifurcated company and the other side of the Netflix coin is just as interesting and complicated as the streaming side."}, {"type": "sentence", "content": "Netflix has had several important pivots and changes in strategy throughout its history of 22 years 8 months as of the date of this article. It started as a DVD sales and rental service, but the founders decided to focus solely on the rental side after a year. In 2007, Netflix announced that it would start streaming with a monthly membership inside the US. Around 2010, the streaming went international in select countries. Finally around 2012, Netflix started producing movies and series. The hugely successful first series House of Cards was available in its entirety, making it exponentially easier to binge, not just alcohol, food, sleep but TV as well."}, {"type": "sentence", "content": "After the initial success in the production side of the business, Netflix has invested more and more into production, every year. In 2019 alone, it has produced over 370 original series and films. In 2018, there were 240. A little bit of extrapolation gives us."}, {"type": "image", "content": "https://miro.medium.com/max/1064/1*ndOAo0DqWtZ1H0xNmKQiHA.png"}, {"type": "sentence", "content": "Our exponential curve of best fit yields the year 2017 to have had around 150 productions, the year 2016 around 100 and so on. Which brings the total to around 991 Netflix Originals in total. In one of Ted’s more recent videos from 2020, he mentioned there are around 1000 originals now."}, {"type": "sentence", "content": "The 2019 production quantity is just about ~1 produced title every day of the year. The Quartz article appropriately titled “Keeping up with Netflix Originals is a part-time job now” released in 2018. If the article had been released in 2019, it would have been titled “Keeping up with Netflix Originals is a full-time job now”."}, {"type": "sentence", "content": "The quantity is, of course, impressive, but the quality seems to be above average and ultimately increasing too. Given that in 2019, Netflix received 34 Golden Globe nominations, an increase of 260% than the previous year."}, {"type": "sentence", "content": "If in 2018, 5% of their produced titles were nominated, then 9% of their titles were nominated in 2019. It’s not just that they released more, it’s possible the company is getting better and more experienced at picking their projects and producing higher quality content. A lot of this credit goes to the long time head of content, Ted Sarandos."}, {"type": "sentence", "content": "Ted Sarandos took home a hefty 31.5 million in 2019, on par with most big studio executives. His job is very similar to those roles, except for one detail, in his own words. Tesla was able to design the car from the ground up, without the limitations of the internal combustion engine. The car’s center of gravity could be moved down, the previously used front of the car could become an extra trunk. The changed center of gravity made the car safer and handle better."}, {"type": "sentence", "content": "Ted and his team were able to slightly reinvent the movie business from the ground up, without the extra considerations that cable networks have with ratings, scheduling and ad spots. Netflix could focus on the bare essentials and make decisions on fewer considerations. For example, one of the early moves was to purchase “House of Cards” without any pilots, which was a risky move and something networks couldn’t do. The meta in cable networks has always been to review the pilot and see how that does. They proceeded if the pilot got good ratings otherwise, they would cut their losses. Since Netflix doesn’t have commercials, it didn’t need to do this."}, {"type": "image", "content": "https://miro.medium.com/max/1714/1*BxnRu3nrhcoVUi-N7ulbEQ.png"}, {"type": "sentence", "content": "The diagram above shows the management team’s salaries in millions, where the red is salary and black is equity. To give you an idea, Ted’s salary of 13.5M is on par with the rest of the studio chiefs in Hollywood, who commands about 5M to 15M. But Sarandos also gets 18M in equity, bringing his total wealth for the year to 31M, several standard deviations above everyone else with the same job in the industry."}, {"type": "sentence", "content": "In general, the 20 billion revenue of Netflix is divided up into salaries, production and costs. If you consider the 8900 employees to be well paid by tech and Hollywood standard, averaging about 200K a year, we get a payroll of about 1.78 billion USD."}, {"type": "subtitle", "content": "Side Note"}, {"type": "sentence", "content": "A side note on the “House of Cards” and other projects. Ted revealed that during this time, he very much wanted and needed the series, especially with David Fincher attached to it. Which illuminates the other side of the movie business. There are some up and coming directors who would kill to even be in a meeting with Ted Sarandos and pitch their idea. But there are also hot shot directors and hyped up scripts that all the networks and studios fight over."}, {"type": "sentence", "content": "There’s a limited number of talented creatives in the world. It maybe excellent writers, directors or actors. There’s also a limited amount of developed stories every year. Events need to happen and those events have to inspire writers to write them first. And the networks and studios want to obviously pick the best of the best. To be competitive as a network, you have to offer good money, creative freedom and a towering platform."}, {"type": "sentence", "content": "This is a competitive business. The executive from HBO said in one of his interviews, this is not a zero-sum game. Maybe he meant to disarm the other executives, maybe he believes that. But the game of picking projects is absolutely a zero-sum game. That’s a textbook definition of a zero-sum game. Marc Andreessen remarked in passing once that compared to tech, Hollywood is much more cut-throat. Whether that’s true or not is not too important, just that the industry environment has a huge effect on the behavior of its players."}, {"type": "sentence", "content": "Surely all the networks wanted “House of Cards”, considering that David Fincher was heading the series — this wasn’t that risky. If this particular series wasn’t risky, the business model of doing this with every show moving forward was. Ted and his content team at Netflix try to mitigate this risk by having complete access to the viewing habits of 160 million users, which they use to predict what people would want to watch."}, {"type": "sentence", "content": "Ted is good at recommending movies, but obviously he can’t cater to everyone nor should he. The company’s setup and his goal are very much to put his own taste aside as much as he can. It’s clear that Netflix now has multiple heads of content. Each head of content responsible for “Comedy & Documentary”, “Action & Adventure” and so on. Ted reassures people that each head of content has the power to green-light productions and he is not the final decision-maker. The final decision-maker, however, does seem to be the Netflix recommendation engine. This is where we get to move into Reed’s wheelhouse."}, {"type": "subtitle", "content": "Reed Hastings"}, {"type": "sentence", "content": "Reed is quite well-spoken and brand conscious. When pressed by journalists on interviewers, especially with tough questions, he doesn’t break out of character. He insists that Netflix is an entertainment business and often disarms politically driven questions, with the signature phrase “..we just wanna do great story-telling…”."}, {"type": "sentence", "content": "Many of the nimble pivots that Netflix executed were anticipated by Reed since it’s inception. Reed figured that the price of streaming movies and consumer electronics made it impossible for Netflix to make a profit in the late 90s and even the early 2000s. However, he anticipated that the rapid technologization would drive the price of streaming down, while the cost of sending out DVDs would steadily increase. And one day, these would intersect and Netflix could become a profitable streamer after point. That happened circa 2007."}, {"type": "sentence", "content": "In many ways, Netflix was a zero to one business, which contributed to its magnificent success. If Google invented its way from zero to one, Netflix seems to have waited for multiple external forces to align and then strike. That’s not to say that Netflix wasn’t innovative, it definitely was. Being one of the first entrants into the field, it had to figure out many problems for itself. There wasn’t anyone to copy from."}, {"type": "sentence", "content": "Netflix was the first company to offer an online catalog of content in the form of a website, in 1999 no one else was doing that. As mentioned before, the company started as DVD rental and sales. But ditched the sales effort to focus solely on rental after a year. Another first that Netflix has a claim to is the mailing of DVDs."}, {"type": "sentence", "content": "Initially, Netflix offered almost 100'000 films, they just needed to buy the DVDs, there were no streaming rights involved. These were much simpler times. Whereas in streaming, the content level is significantly lower. Worldwide Netflix has the rights to 13'000 titles, made worse by the fact that each country has only a subset of those. While the US gets around 5'000 titles at a time, Canada gets around 3'400 titles."}, {"type": "sentence", "content": "Netflix was the first to start streaming. It was the first to offer its original series. The truth is, Reed did have companies to copy. Netflix was an internet TV network, although the operator word here is “internet” and Netflix was the first of its kind. It still could copy the way traditional networks operate. Many networks, syndicate shows but they also always, always, always offer branded originals exclusives."}, {"type": "sentence", "content": "Netflix was the first company to offer a high level of personalization through data science. There was a little bit of hype around Netflix being able to predict what people want to watch. On this front, Netflix decided to forego with the traditional way movies are rated. Focusing much more on the revealed behavior of users than explicit ratings of movies. But the revealed behavior data and the regression models are not an all-knowing crystal ball that decides what Netflix produces. This was less data science and more astute observation."}, {"type": "sentence", "content": "According to both Ted and Reed, Netflix operates like traditional Hollywood companies in almost every way. And data science is just one of the many tools the company utilizes."}, {"type": "sentence", "content": "There are many innovations that Reed brought to Netflix that don’t get as much clout as Netflix’s recommendation algorithm. For one, Netflix’s comparison with Microsoft brought us to wonder if Netflix’s one service offer is a risky business setup. On his first job at Adaptive technology, in the early 90s, Reed noted that he learned from his CEO Audrey MacLean the importance of focus — specifically, the value of doing one product well rather than 2 products in a mediocre way. It seems that this Netflix focus on one service was intentional and it has worked out pretty well so far. But you can never rule out some long-tail event seriously messing up Netflix’s only revenue source. We will detail this out in the upcoming risk section."}, {"type": "sentence", "content": "His first venture Pure Software eventually went public, then merged with Atria and after six years at the company, he left with one important takeaway. That he needed to do better with his next company. There were issues with Pure Software that primarily came out of the company growing rapidly and Reed not having any experience managing a huge, expanding team. In many ways, there was a loss of control of the culture, the management and the company from Reed’s perspective. So he spent the next 2 years thinking of ways to avoid those problems with his next company."}, {"type": "sentence", "content": "The culture really seemed to be one of the most important features to get right in a startup. Most of the startup founders can’t stress this enough, the hiring and the culture being key for success. Brian Chesky says this, the founder of Zappos says this, the founders of YCombinator Paul Graham and Sam Altman repeat this. The companies that get culture right can avoid one of the big things that trip up companies, internal conflict. Avoiding this means everyone is focused on the goal and they find a way to resolve conflicts productively without imploding."}, {"type": "sentence", "content": "Chris Anderson asked Reed how come Netflix took down a controversial episode of the show Patriot Act on the Ted Stage, recently. There his reply was that Netflix is an entertainment company and it’s not in a position to tell people what’s right and what’s wrong, they’re just about great storytelling. A great stance to take if you’re trying to avoid drama and not get too political or moral."}, {"type": "sentence", "content": "On a more personal side, Reed Hastings is a philanthropist, he deems education reform in the US an important issue and donates heavily into education. After his undergraduate degree, Reed taught high school math for a few years in Swaziland. That’s possibly when he got his passion for the cause because he has been a long term advocate of charter schools, online learning and education reform. His non profit Hastings Fund started in 2016 with an initial capital of 100 million. In 2012, Reed and his wife Patty signed the Giving Pledge."}, {"type": "sentence", "content": "Another thing that seemed to go right for Netflix was the combination of Reed and Sarandos. It gets uttered often enough that it has become a cliche, but having 2 top people from different backgrounds is seems to be quite a potent recipe for a startup. Empirically we see this from Apple, Microsoft, Snapchat… Reed was technically more of an engineer, but someone who had honed the business side through experience, and Ted was the expert on content and in the early days, video rental business. Generally having different areas of responsibility leads to each person to trust the other’s expertise. Otherwise, two salespeople or two engineers end up disagreeing on how to do things, getting the “too many chefs” phenomena."}, {"type": "sentence", "content": "With this insight, you can get to two engineering founders, if they just accept their respective areas of responsibility. But a company still needs a salesperson, so unless you can recruit a third. It gets difficult. Reed seemed to be the rare person who does both well. We learned that Netflix was a bifurcated company with streaming and content, if Reed is responsible for the streaming side, then Ted is responsible for the content."}, {"type": "sentence", "content": "Ted mentioned in one interview that Reed had this hypothesis that eventually Netflix would stream since the early days when they were still shipping DVDs. In fact, many of the turns and maneuvers that Netflix did were anticipated years ahead by Reed Hastings. He would position the company for the upcoming changes and market forces with incredible foresight. He’s worth 4.7 billion today."}, {"type": "subtitle", "content": "Other Articles"}, {"type": "subtitle", "content": "Sources"}], "topic": "business"}