{"title": "Superteams: 4 Key Elements Your Team Needs to be Great", "data": [{"type": "subtitle", "content": "The key ingredients for building healthy and successful teams"}, {"type": "image", "content": "https://miro.medium.com/max/11232/1*vo_V1AtTTrT1H-MvxxWUbQ.jpeg"}, {"type": "sentence", "content": "Sir Alex Ferguson took over as manager of Manchester United Football Club in 1986. In 2013, he retired after 27 years at the club, winning 38 trophies in the process. He was not an overnight, immediate success."}, {"type": "sentence", "content": "To win 38 major trophies in a sport subject to so much chance — injuries, bad decisions, fluke, the ever-evolving nature of the game — you need to build world-leading teams that can overcome adversity to beat the odds."}, {"type": "sentence", "content": "To create great teams, you need committed leaders at the top of organisations. You also need great leaders among the crew who will galvanise their teammates to work towards collective aims. Together, the team must always seek to improve. A team which has just reached the top whose members think they have nothing left to achieve won’t stay at the top for very long."}, {"type": "sentence", "content": "Sir Alex Ferguson knew that great teams must always be looking to adapt, change and improve. So did Steve Jobs. In its ascent to the top of the personal technology industry, Apple had to adapt repeatedly."}, {"type": "sentence", "content": "As leaders, both Ferguson and Jobs had fiery tempers which became legendary. Jobs was infamous for his toddler-like temper-tantrums. Ferguson was famous for his bellowing “hairdryer” treatment he unloaded at half-time team-talks when the performances of his players were not up to his expected standards. Many people eulogise Ferguson’s and Jobs’s explosive passion as the key ingredient which enabled their teams to become so successful."}, {"type": "sentence", "content": "While passion and adaptability are important attributes great teams share, the reality is more complex. There is not one single dominant factor which the successes of great teams can be attributed to. So, here are 4 other key elements most healthy and successful teams possess."}, {"type": "subtitle", "content": "1. Open-mindedness and flexibility"}, {"type": "sentence", "content": "There is some irony to the way Steve Jobs forced Apple to be open-minded and flexible about its approach to product development. Walter Isaacson recounts many occasions when engineers who believed that something was not possible were fired by Jobs. His commitment to flexible, open-minded ingenuity was hard-headed, but it got results: it put computers on your desks and in your pockets, and his company put wireless AirPods in your ears."}, {"type": "sentence", "content": "Members of great teams listen to new ideas and experiment with new approaches to tackle problems. Tetlock explains that being prepared to take fresh ideas on board is critical to improve results. It’s easy to imagine how. People on teams all bring unique sets of experience and skills to the forum. When people come to work in the stubborn belief that their ways are the best ways, the whole team will struggle to benefit from their aggregate wisdom."}, {"type": "sentence", "content": "Take another example of a leader who has built an extensive and innovative team. With Tesla, Elon Musk is driving the development of electric cars in an industry still dominated by petrol consumption. It takes an open-minded and flexible team to create products for an embryonic electric economy."}, {"type": "sentence", "content": "Flexibility and open-mindedness are also important to avoid group-think. Group-think takes place when people follow the status quo rather than working towards what they truly believe in. If Musk let prevailing market trends shape Tesla, the company would be far less innovative."}, {"type": "subtitle", "content": "2. Shared goals"}, {"type": "sentence", "content": "Sir Alex Ferguson wanted his teams to get to the top and stay at the top. He needed to pull a group of players together who not only had the required skill set but who also had a winning mentality. There are examples of many gifted footballers who let club loyalty obstruct how much they won in their careers. Examples include Alan Shearer and Matt Le Tissier."}, {"type": "sentence", "content": "It was important for the prolonged success of Manchester United that the players there wanted to win every time they went to train, not just every time they stepped onto the pitch at the beginning of a match. There could be no passengers, nobody who would turn up and just go through the motions. Sir Alex Ferguson wanted players who shared his common goal of making sure Manchester United won trophies as regularly as possible. Look at the players who did the business for him: Roy Keane wore his heart on his sleeve every match. David Beckham single-handedly dragged England to the 2002 World Cup. Ji-sung Park routinely covered every blade of grass for the team."}, {"type": "sentence", "content": "Teams who have common goals demonstrate collective unity and work towards a clearly-defined vision. At a time when personal computers were ugly abominations, Jobs wanted Apple to show the world that they could be beautiful objects too. He needed to create a team who not only shared this vision but believed it was possible. He needed engineers who had the skills to create computers, and the belief they could do so beautifully."}, {"type": "subtitle", "content": "3. Constructive criticism and feedback"}, {"type": "sentence", "content": "To get to the top and stay there, you need a team prepared to work hard to improve. Improvement requires candid, honest criticism and feedback. People must be prepared to dish out some tough love, and they must also be prepared to take it. This is a two-way street. Leaders must be prepared to take feedback from their teams on board. Teams must not fear to offer leadership criticism."}, {"type": "sentence", "content": "This point is linked with open-mindedness since there is little point giving criticism and feedback to someone who is not receptive to it. Both giving and receiving criticism are essential processes when driving positive change. If a player on the team has a bad game, they need to know what they did wrong. If a worker makes a mistake in a report, they need guidance for the future."}, {"type": "sentence", "content": "It’s simultaneously important to build teams full of people who actually want to improve and learn new skills. I cannot think of a working environment much worse than one full of people who already think they know everything. The best teams are made from people hungry to learn more, and eager to share what they already know. Criticism and feedback fuels growth."}, {"type": "subtitle", "content": "4. Patience and persistence"}, {"type": "sentence", "content": "By the early 1970’s, both Liverpool and Manchester United had each won 7 First Division titles and were stalwarts in English football. By the beginning of the 1990s, Liverpool had 18 titles, while Manchester United was still stuck on 7. Despite the club’s prolific history, Manchester United was embarrassed by their waning relevance in English football and the eminence of their biggest rivals. Sir Alex Ferguson was hired in 1986 to change their fortunes. By the time he retired in 2013, United had leapfrogged Liverpool with 20 titles to their 18 (though Liverpool by the end of 2020 will have 19)."}, {"type": "sentence", "content": "In the 1986–1987 season, Sir Alex Ferguson’s first in charge, the team came 11th out of 20 teams. In his second, the team finished runners’ up which looked like a positive improvement, but then in his third season in charge the club finished 11th again. This was his lowest ebb as Manchester United manager, and he was a whisker away from being sacked. He won the FA Cup in 1990, and won his first league title in 1992–1993. Under his management, the club then won another 7 top-flight titles in 9 seasons. Just imagine how different the history of English football would be, had the Manchester United board sacked him in 1989 rather than persevering with him."}, {"type": "sentence", "content": "As Sir Alex Ferguson’s example shows, it can take a long time to build a successful team. Most successful companies and organisations derive their results from experience, hard work and skill rather than masterstroke overnight genius. There may be moments of overnight genius along the way, but establishments take years to build. With Steve Wozniak, Steve Jobs formed Apple in 1976. The Apple I was the first personal computer they built together, and they made 200 units. You don’t become a household name by selling 200 computers. The initial release was a flop. They could have given up, but they didn’t. In 1977, they released the Apple II, which by 1993 had sold between 5 to 6 million units, making the pair both millionaires."}, {"type": "sentence", "content": "To achieve the successes their organisations managed to obtain, both Ferguson and Jobs had to assemble great teams. The people on their teams had to be great at what they did. People who weren’t good enough were sacrificed for the benefit of those who were. It would be a romantic fantasy to think there were no casualties along the way. Nevertheless, the people who remained had to be open-minded, they had to get behind the collective aims of the organisations they worked for, they had to take and give criticism, and they had to patiently persist at what they did. Neither Apple nor Manchester United would have achieved their successes without these elements."}], "topic": "leadership"}