{"title": "The Brain behind poison gas- Fritz Haber", "data": [{"type": "subtitle", "content": "Fritz Haber’s poison gas legacy haunts humanity even today. Also, he found the most effective way of synthesizing Ammonia helping humans to grow more food."}, {"type": "image", "content": "https://miro.medium.com/max/1472/1*qxRWGr2DxvLM0Fv2DJs2Qw.jpeg"}, {"type": "sentence", "content": "On 22nd April 1915, the German Army dug some pipes in the front line at Ypres, Algeria. Out of the pipes came the first poison gas, Chlorine. The German military emptied 5730 cylinders (each weighed 200 lbs) of Chlorine in just 15 minutes. The enemy troops, unaware of what had happened, screamed and ran in agony. The entire front line got covered with a thick yellow blanket of Chlorine. Thousands died that day, and many more will die in years to come due to poison gas attacks. The brain behind Chlorine gas, which killed millions, is responsible also for the growth of the human population by two-fold. He was Fritz Haber"}, {"type": "subtitle", "content": "Early Life:"}, {"type": "sentence", "content": "Fritz Haber was born to a Jewish family. His father, Siegfried Haber, ran a chemical dyestuff company in the city of Breslau. Haber was a bright student at school and continued his education at the University of Berlin. After one year of military service, Haber took up his family business but ended in a loss. Haber looked for a job and moved to Zurich, where he worked in two universities. After a few years, he moved to the University of Karlsruhe, where he would spend 17 years of his career. In 1892 Haber converted from Judaism to Lutherism and in 1901 married Clara Immerwahr, a fellow chemist at the University of Karlsruhe. The couple’s marriage was a rollercoaster ride of emotions. Clara was opposed to Haber’s idea of using science against humanity in warfare."}, {"type": "subtitle", "content": "Drive towards Science:"}, {"type": "image", "content": "https://miro.medium.com/max/4000/0*8FukhERx49NsUeqe.JPG"}, {"type": "sentence", "content": "Science was at the top of the priority for countries around the world at this period. Pasteur Institute in Paris and Rockefeller’s medical institute in the USA were few noted institutes that drove the field of research. Prussia (Germany’s ancestor) pushed the idea to establish a similar institute for research. The idea took shape in 1910 with the formation of the Kaiser Wilhelm Institute in an area of 50 Hectare. The mission of Prussia’s new venture was as “Wehrkraft und Wissenschaft”, which means knowledge and military power. Haber got the post as the head of Physical chemistry department in Kaiser Wilhelm Society"}, {"type": "subtitle", "content": "Ammonia synthesis:"}, {"type": "image", "content": "https://miro.medium.com/max/788/1*f-2veElOnN41MAKbvk92tw.gif"}, {"type": "sentence", "content": "In the 18th century, the need for Ammonia increased daily. Ammonia was used for manufacturing explosives and also as a fertilizer for plants. Ammonia was hard to synthesize as it needed 200 Celsius or 390 Fahrenheit in a 200 atm pressure. Even after such an arduous process, only a trickle of Ammonia came out. Haber, along with Carl Bosch, concluded that a catalyst is needed to make the process quick. Catalyst is a chemical component that can speed up a chemical reaction but will remain in its state even after the reaction was over. Haber, along with his team, tried out 4000 different catalysts. At last, he found that Iron, oxide of aluminum, calcium, and potassium are useful catalysts for making Ammonia. This process had remained the same until today."}, {"type": "subtitle", "content": "Poison gas legacy:"}, {"type": "image", "content": "https://miro.medium.com/max/1240/1*otGTwpeEY4nSJR3AqKq_Kw.jpeg"}, {"type": "sentence", "content": "World War I was a clash between superpowers in the European continent. The war ended up as a stalemate in the trenches along the border. Haber and Carl Bosch set up a partnership between IG Farben and the University of Karlsruhe to manufacture Ammonia for usage as explosives. Haber extended his research and proposed the use of poison gas on enemy soldiers, which was against the Hague convention of 1899. In Algeria, French troops saw inhuman torture when the German Army released Chlorine gas into the front line."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*gWpgtzTmfaV9DGwXdOhmWw.jpeg"}, {"type": "sentence", "content": "After the success of the operation, Haber got a promotion to captain in the German Army. To celebrate the promotion, he held a party at his home. His wife, Clara, committed suicide at this party after hearing the gas incident. A more potent Phosgene gas saw action against Russian troops in Galicia. The Phosgene gas choked the victim, caused a sensation of burn in the lungs, and led to death. Otto Hahn, a future Nobel laureate, worked with Haber in this project. Later in 1916, Haber discovered a poison gas that can penetrate gas masks."}, {"type": "subtitle", "content": "After War:"}, {"type": "sentence", "content": "After the end of the war, Haber escaped to Switzerland and concealed his identity. Against protests from the scientist community, Haber won the Nobel prize for his Ammonia extraction process in 1918. While his accomplice in the poison gas process Otto Hahn got a Nobel prize in 1944 and James Franck in 1925. Haber continued to supply poison gas to Spain, Morrocco, and the Soviet Union. Haber’s greatest legacy would be his discovery of Hydrocyanic acid used primarily as a pesticide but later was converted into the infamous Zyklon-B poison. Zyklon B was widely used in the mass killing of Jews after the Nazi party came to power."}, {"type": "image", "content": "https://miro.medium.com/max/5696/1*l2zSq1lFSEf-GqkdPNPH3w.jpeg"}, {"type": "sentence", "content": "Even in 1927, Kaiser, who was in exile, contacted Haber to manufacture gas bombs that can annihilate entire cities. Haber formed a committee of fellow scientists under Fulda manifesto. The manifesto argued that Germany didn’t like war but was forced into World War I. Haber marketed for the manifesto and got signature from supporters of his idea. Einstein formed a counter committee and went on a signature spree against Haber."}, {"type": "image", "content": "https://miro.medium.com/max/3000/1*V2j0I-dBayt5PRrT1SFckQ.jpeg"}, {"type": "sentence", "content": "As repartition of the war, the Haber Bosch process of Ammonia extraction was relieved of patent rights and was open for all. Versailles treaty imposed heavy sanctions on Germany that it had to pay almost 2/3 of world gold reserve as compensation. Haber set out on a new project to extract gold from seawater but found out its a costly business."}, {"type": "subtitle", "content": "Is science for good or bad:"}, {"type": "sentence", "content": "Haber died of poverty in 1934 just one year after Hitler came to power. His discoveries were a double-edged sword, which helped and derailed humanity at the same time. Ammonia, as a fertilizer world, was able to manufacture more food and made the earth prosperous. Ammonia alone had made the human population grow two folds. At the same time, his discoveries caused the death of 11 million troops in World War I and millions of Jews in World War II."}, {"type": "subtitle", "content": "Source:"}, {"type": "sentence", "content": "Hitler’s Scientists: Science, War and the Devil’s Pact-John Cornwell"}], "topic": "science"}