{"title": "How To Gain Your Advantage During Lockdown – UX and UI Tips", "data": [{"type": "image", "content": "https://miro.medium.com/max/4608/1*QIRaRA-0qxXx6sHfYcm41g.jpeg"}, {"type": "sentence", "content": "2020 has been interesting and we’re only a quarter of the way in. Currently, most of us are locked indoors (easy for the home bodies of course), streaming video content (or playing video games), reading books, being creative, reconnecting with loved ones, or simply doing nothing."}, {"type": "sentence", "content": "Some of us have more time on our hands simply because we are not commuting. This is not only valuable time we are saving, but also mental energy, by not being stuck in traffic on the freeway, or running late for the train."}, {"type": "sentence", "content": "I remember when I transitioned to working from home, I saved 2 hours of travel per day (including finding parking) and I had no idea what to do with the extra time. At first, I slept in. Can you blame me?"}, {"type": "sentence", "content": "What are you doing with this extra time? How do you value this extra time?"}, {"type": "subtitle", "content": "The Challenge"}, {"type": "sentence", "content": "The challenge seems to be staying positive, motivated, healthy (physically and mentally) and productive. Many people have dreamed about working from home or at least achieving some type of work-life balance. Now, more people understand, working from home is not that straightforward and in some cases, not very pleasant. It does have its downside."}, {"type": "sentence", "content": "Many Designers however are already comfortable working from home, but what if you’re currently studying or enrolled in a Design bootcamp?"}, {"type": "subtitle", "content": "Transitioning to Online Learning"}, {"type": "sentence", "content": "One of my UX classes was recently forced to transition to online learning, 2 weeks into the course. This wasn’t ideal but it was clearly the responsible move to make. The transition was actually quite positive and beneficial to students because it produced new opportunities and experiences, such as:"}, {"type": "sentence", "content": "This transition also led to new (or at least different) conversations. We began speaking about how students could begin to differentiate themselves considering the unique situation we are experiencing at the moment."}, {"type": "sentence", "content": "Remember, there are no rules here*. Designing for yourself as you go is the smart thing to do."}, {"type": "sentence", "content": "(*Obviously there are expectations, boundaries and standards, but no set rules)"}, {"type": "subtitle", "content": "Differentiate Yourself"}, {"type": "sentence", "content": "If you’re studying or building your personal brand, there is a unique opportunity now to differentiate yourself more than ever, simply because of the above mentioned points, where many other Designers may not be investing time into their education or personal brand."}, {"type": "sentence", "content": "They may not be planning for life after lockdown. They may not be able to get ahead of the curve. Or, maybe they are, only not approaching it from a remote-friendly angle (and in-turn, future-proofing themselves)."}, {"type": "sentence", "content": "(Remember, as an ambitious Designer looking to make a real difference in the world, we should always be evolving, differentiating, strengthening and redefining our personal brand, regardless of a lockdown or not)"}, {"type": "subtitle", "content": "Game Changer?"}, {"type": "sentence", "content": "There are also those people who predict that the way we work will change forever. I don’t think Design (in particularly UX and Product Design) will be affected as deeply as other industries, but hey, I’ve been wrong in the past. What will change however, in my belief, is how we present ourselves, our brand and especially, our skills. I believe this will mature and evolve over time."}, {"type": "subtitle", "content": "Gain Your Advantage"}, {"type": "sentence", "content": "You can gain an advantage by focusing on:"}, {"type": "subtitle", "content": "Remote study skills — Document and show these ‘new’ skills:"}, {"type": "sentence", "content": "Craft and publish a story around your remote learning experience. Tell the world about what you are doing, learning and how you are collaborating with other students and accessing users remotely."}, {"type": "subtitle", "content": "Remote work/project skills — Document your process and experience:"}, {"type": "sentence", "content": "Build a case study communicating your process and experience from a remote-friendly point-of-view. Show your versatility and project collaboration skills as well as how you communicated and managed stakeholders remotely."}, {"type": "subtitle", "content": "Experience using remote tools for collaboration (Slack, Miro, Trello, Maze, Zoom etc) — These tools will become the new Sketch and Figma (Ok, and Adobe XD):"}, {"type": "sentence", "content": "As above, share your experiences around picking up a new tool or how you used a familiar tool to work remotely."}, {"type": "subtitle", "content": "Experience conducting remote user research and usability testing — How did you access participants remotely?"}, {"type": "sentence", "content": "Communicate how you accessed, conducted, recorded and synthesized research and testing efforts. Where possible, show sketches, notes, images or screenshots of how you conducted research and/or of users participating in testing and share your thoughts and feelings."}, {"type": "subtitle", "content": "A remote-friendly personal brand — Add these skills to your CV and LinkedIn profile:"}, {"type": "sentence", "content": "Whether you were learning or working on a project during the lockdown, showcasing your activity will reinforce your dedication and time investment. It can also communicate to hiring managers that you are flexible and can adapt to new conditions."}, {"type": "subtitle", "content": "Your time management skills — Start building your portfolio behind the scenes:"}, {"type": "sentence", "content": "Make use of the time you’re saving by exercising, eating better, reading, listening to music, or investing time into your portfolio. Either way, you win."}, {"type": "subtitle", "content": "Your own thoughts and experience — Engage with the Design community on LinkedIn by:"}, {"type": "sentence", "content": "See below, but this is an investment into building your brand and more importantly, establishing yourself as an authority and expert. Remember though, consistency is key."}, {"type": "subtitle", "content": "Building your audience — You don’t need to be a superstar to have an audience:"}, {"type": "subtitle", "content": "Don’t sit & wait for this to pass"}, {"type": "sentence", "content": "No one knows when things will return to ‘normal’ because no one has a magic wand. Practice positive thinking so that at least your own mindset stays strong, ensuring that when we return to ‘normal’ in a week’s time, a month’s time or even a year’s time, that you can hit the ground running."}, {"type": "subtitle", "content": "Connect with people who are still working"}, {"type": "sentence", "content": "Wheels keep turning and if LinkedIn is anything to go by, people are still online and working in some capacity. At least, they are having conversations."}, {"type": "sentence", "content": "(A student of mine recently told me they have arranged “2 virtual coffee catch ups next week” with a recruitment agent and a Design Manager)"}, {"type": "subtitle", "content": "Apply for jobs"}, {"type": "sentence", "content": "Yes, apply for jobs. If they’re advertising, they’re hiring. You’ll notice a number of companies (especially on LinkedIn) are still hiring and it’s these companies who are already familiar with remote work."}, {"type": "sentence", "content": "Document your work. Publish content. Keep talking to the world. Get ahead of the curve."}, {"type": "sentence", "content": "We have new problems to solve."}, {"type": "sentence", "content": "Let’s connect! Follow me on LinkedIn. View my General Assembly profile. View my DesignLab mentor profile."}, {"type": "subtitle", "content": "A note from Plain English"}, {"type": "sentence", "content": "Did you know that we have four publications? Show some love by giving them a follow: JavaScript in Plain English, AI in Plain English, UX in Plain English, Python in Plain English — thank you and keep learning!"}, {"type": "sentence", "content": "Also, we’re always interested in helping to promote good content. If you have an article that you would like to submit to any of our publications, send an email to submissions@plainenglish.io with your Medium username and what you are interested in writing about and we will get back to you!"}], "topic": "ux"}