{"title": "Balance Sheets: Explained In 5 Mins", "data": [{"type": "image", "content": "https://miro.medium.com/max/2560/1*14XYTg_Eig4dgEWFpTGNeg.png"}, {"type": "subtitle", "content": "Fundamentals In Five Mins"}, {"type": "subtitle", "content": "For all that need to know!"}, {"type": "sentence", "content": "Today we’re talking balance sheets, and it’s about time you gave them at least five minutes of your time!"}, {"type": "sentence", "content": "Yes, your accountant is there to take care of this type of thing, but I’m sure she’d prefer not to continually hold your hand over the basics!"}, {"type": "sentence", "content": "There’s lots to cover so let’s get into it!"}, {"type": "subtitle", "content": "Balance Sheet TL:DR"}, {"type": "sentence", "content": "In short, the balance sheet helps us understand what the company owns and owes at a point in time."}, {"type": "sentence", "content": "It does this by listing out all of the company’s assets, liabilities and shareholders’ equity as at a specific point in time."}, {"type": "sentence", "content": "We then use this information in conjunction with our other financial statements, the income statement and statement of cash flow, to work out if the company is performing as it should be."}, {"type": "sentence", "content": "As founders, we need to know our way around the balance sheet so we can talk to our accountants, boards, and shareholders with a semblance of credibility about the company’s liquidity, asset performance and capitalisation structures."}, {"type": "sentence", "content": "That’s the tl:dr, now on to more of the brief detail. Let’s talk about the balance sheet equation."}, {"type": "subtitle", "content": "The Balance Sheet Equation"}, {"type": "sentence", "content": "There’s a very simple equation that defines the balance sheet."}, {"type": "sentence", "content": "This is:"}, {"type": "sentence", "content": "Assets = Liabilities + Owners equity."}, {"type": "sentence", "content": "It’s an intuitive formula that describes the reality of running a company. The things the company owns (their assets) must be funded by either taking on debt (liabilities), taking on investors (shareholder equity), or re-investing any profits earned (retained earnings)."}, {"type": "sentence", "content": "Put another way, the value of your business assets must balance to the sum to what have you have borrowed, raised or retained in the business to acquire them."}, {"type": "sentence", "content": "And that wraps up the balance sheet formula, easy eh? Now on to what’s on the balance sheet."}, {"type": "subtitle", "content": "What’s on the balance sheet?"}, {"type": "subtitle", "content": "1) Assets:"}, {"type": "sentence", "content": "A company’s assets are things, both tangible and intangible, that have realisable future value. This includes but isn’t limited to things such as cash, equipment, pre-payments, accounts receivable, IP and goodwill."}, {"type": "sentence", "content": "On the balance sheet, Assets are listed in order of their liquidity, or how quickly they can be converted into cash."}, {"type": "sentence", "content": "To help with this ordering, assets are categorised first as either current or non-current, where current assets are defined as those that can be converted into cash within a year, and non-current assets are those that cannot."}, {"type": "subtitle", "content": "2) Liabilities:"}, {"type": "sentence", "content": "A company’s liabilities are what the company owes to outside parties."}, {"type": "sentence", "content": "They are also categorised on the balance sheet as current and non-current and listed in order of when they are due."}, {"type": "sentence", "content": "Examples of current liabilities include but aren’t limited to A/c payable, interest payments, and examples of non-current liabilities include things like long term loans."}, {"type": "subtitle", "content": "3) Shareholder (owners) Equity:"}, {"type": "sentence", "content": "A companies shareholders equity is the value attributed what the shareholders (owners of the company) own. In other words, what’s leftover when the companies total liabilities are subtracted from their total assets."}, {"type": "sentence", "content": "On the balance sheet, shareholders equity is categorised as stock, which is the ownership vehicle for the investor, and retained earnings, which is the profit retained within the business from previous financial periods."}, {"type": "sentence", "content": "If not distributed in the form of dividends to shareholders, retained earnings are either retained by the company to re-invest in new assets, or pay down debt. In most startups, any profits are usually retained to fuel growth and very rarely will be distributed to shareholders."}, {"type": "sentence", "content": "And with that we’ve summarised what’s on the balance sheet, now it’s on to what the balance sheet is used for"}, {"type": "subtitle", "content": "Balance Sheet Uses"}, {"type": "sentence", "content": "The balance sheet provides the information necessary to evaluate three broad aspects of a company."}, {"type": "subtitle", "content": "Working capital & short-term liquidity:"}, {"type": "sentence", "content": "We compare current assets and liabilities to assess the company’s ability to cover it’s short term obligations."}, {"type": "subtitle", "content": "Asset performance:"}, {"type": "sentence", "content": "We look at how well assets are being utilised by the company to generate a return."}, {"type": "subtitle", "content": "Capitalisation structures:"}, {"type": "sentence", "content": "We look at debt to equity ratios, which gives us an insight into how the company is funding its operations."}, {"type": "sentence", "content": "What these measurements should be and what values they should have are context-dependent on the company in question and what it’s trying to achieve. In general, however, ratios and metrics relevant to each of these three categories are what most boards and shareholders analyse to assess a company’s performance."}, {"type": "sentence", "content": "And with that we’ve summarised what the balance sheet is used for, now it’s on to the balance sheets limitations."}, {"type": "subtitle", "content": "Limitations"}, {"type": "sentence", "content": "The main limitation of the balance sheet is that it only provides a snapshot of the financial position of the business at a single point in time."}, {"type": "sentence", "content": "It doesn’t provide any information on the changes in assets, liabilities, or equity between balance sheet periods."}, {"type": "sentence", "content": "This is why the balance sheet shouldn’t be viewed in isolation. We need the income statement and statement of cash flow to get around this limitation and help provide the insight necessary for a complete picture of the company’s performance."}, {"type": "sentence", "content": "And with that, we’re all done! The balance sheet summarised in under 5 mins."}], "topic": "startups"}