{"title": "The Federal Reserve Will Buy Stocks", "data": [{"type": "subtitle", "content": "If the Fed will do anything to keep the “Everything Bubble” from bursting, the next step is to buy stocks"}, {"type": "sentence", "content": "The Federal Reserve is in deep trouble. They have thrown everything, even the kitchen sink, at financial markets, propping up all the risky, speculative asset classes: stocks, corporate bonds, auto loans, mortgages, anything close to defaulting while the economy remains shuttered."}, {"type": "sentence", "content": "So when the stimulus inevitably wears off and asset prices continue to fall, the Fed will have exhausted their “conventional” toolbox: Fed officials have already dropped interest rates to zero, created an array of alphabet soup “asset relief” programs with exotic names like CPFF (Commercial Paper Funding Facility) and TALF (Term Asset‐Backed Securities Loan Facility), and executed yet another round of QE (quantitative easing)."}, {"type": "sentence", "content": "Though these actions support asset prices, printing trillions of dollars annihilates the purchasing power of savers while rewarding yield-thirsty investors that take high risks for high returns. But that’s the aim: the latest administration wants you to buy stocks, not to save money. It’s their way of saying you’re doing your part to support the economic expansion."}, {"type": "sentence", "content": "The “last hope” for the Fed to entice investors is a promise to buy stocks. If the stock market bubble starts to implode — and it will because it always does — the Fed’s final pump, their “full Kuroda,” will be to acquire various stock ETFs such as $SPY, $QQQ, and $DIA, exchange-traded funds tracking the major stock market averages."}, {"type": "sentence", "content": "The Fed has a history of implementing policies they condemn initially. They will denounce buying stocks as a realistic policy, performing an immediate 180 when stocks begin to plunge. If the central bank’s mission is to sustain confidence in a flawed system — inflation over deflation, subsidizing laziness, and punishing productivity — officials will say anything to get the job done. In 2006 it was “subprime contained” from Ben Bernanke. In 2015 it was “I don’t see a financial crisis occurring in our lifetime” from Janet Yellen. In 2019 it was the “repo crisis is contained” from Jerome Powell. As a rule of thumb, if Fed officials say it won’t happen, it will eventually."}, {"type": "sentence", "content": "The Fed, however, is not the first major central bank to buy stocks: The Bank of Japan (BOJ) started buying ETFs back in 2010. But they haven’t just dabbled: Recently, Governor Kuroda added ETF purchases within a huge stimulus package to “support the Japanese economy.” At the end of February 2020, NLI Research’s Ide estimated the BOJ owned 75% of the ETF market. That’s 29.6 trillion yen, roughly 4% of the Japanese stock market according to WisdomTree’s Koll."}, {"type": "sentence", "content": "As you might expect, buying ETFs has failed to support stock prices. The BOJ cannot fend off the economic stagflation that’s been plaguing the Japanese economy for decades. At this stage, Japan’s government might as well give the money they print directly to citizens as it’s more likely to hold its value there than in the Nikkei: Japan’s main stock exchange."}, {"type": "sentence", "content": "The Fed knows ETF purchases fail to support asset prices, but they will buy them anyway. They believe investors and trading algorithms hooked on cheap money and stimulus will beg for more, pumping the markets higher, adding a few points to major indices. But that’s all. The markets will plunge, submitting to economic gravity once again. Unless, of course, the economy recovers miraculously from the biggest economic crisis in a century."}, {"type": "sentence", "content": "If buying ETFs is the “last hope” for the Fed to keep stock prices high, it’s crazy to think the stock market will perform well in the distant future. After all, hope is an absurd reason to invest in anything. Expecting any asset class to skyrocket in value by the time you retire — whether that's gold rising to $5,000, house prices climbing 300%, or the S&P500 rallying to 10,000 — is crazy."}, {"type": "sentence", "content": "When the Fed faces the reality that buying stocks fails to hold up prices, their next move that “no one saw coming” will be to impose negative interest rates: the final frontier of flawed economic policy. Of course, the evidence shows going below the zero bound has adverse effects. Countries like Germany, Switzerland, and Japan have reached subzero levels with no benefit. Still, we’ll go through the same farcical parody: The market will rally on “hope” until everyone figures out negative rates destroy future growth."}, {"type": "sentence", "content": "Fed Chairman Jerome Powell has denied that the U.S will experience negative rates which means they are a certainty, “I continue to think, and my colleagues on the Federal Open Market Committee continue to think, that negative interest rates are probably not an appropriate or useful policy for us here in the United States,” he says."}, {"type": "sentence", "content": "But like Powell announcing that the central bank will buy ETFs, no one in the government, in the media, or within the Federal Reserve itself will tell you they saw it coming."}, {"type": "subtitle", "content": "Want more analysis and ideas? Subscribe to my mailing list."}], "topic": "economy"}