{"title": "Time of Your Life, Huh, Kid?", "data": [{"type": "subtitle", "content": "LGBTQ Fiction — Short Story"}, {"type": "subtitle", "content": "A teen’s movie obsession leads to first love"}, {"type": "sentence", "content": "It was my eighteenth birthday, the day my life changed forever. As I rounded the corner, my jaw went slack when I laid eyes on her. In the driveway, with the sinuous grace of a cat, sat a pristine 1983 Porsche 928 in the exact color combination Tom Cruise drove in my favorite movie, Risky Business. I peddled faster and flung my bike and backpack onto the fresh-cut lawn. Wow, Mom and Dad, you’ve outdone yourselves."}, {"type": "sentence", "content": "I removed my AirPods from my ears, last year’s birthday gift, and deposited them in my pocket as I approached her. Everything from that point moved in slow motion. Her immaculate metallic bronze finish glistened in the afternoon sun. As I caressed her curvaceous hind end, my pulse slowed, our souls connected. The driver’s door opened with the slightest of effort. I settled down into the smooth-as-melted-chocolate driver’s seat and closed the door with a luxurious thunk. The outside world all but disappeared. We were one."}, {"type": "sentence", "content": "My gaze fell across the word “Porsche” splayed across the center of the steering wheel in large font as if one needed to be reminded of the German masters that built such a work of art. I reached up and turned the key hanging from the dash. She took a breath and exhaled with a glorious deep-throated growl, idled back, and waited like a lioness on the prowl bedded down in the Saharan grass. She transferred a subtle vibration into my body through the seat, reminding me of our deep connection. I can’t wait to break you in, baby."}, {"type": "sentence", "content": "As I opened the center console, I chuckled and thought, They thought of everything. I examined its contents: a pair of black Ray-Ban Wayfarer sunglasses, a box of Tic-Tacs, an assortment of cassette tapes including the soundtrack from Risky Business, and, wait for it, a brand new pack of condoms. My cheeks burned hot as I envisioned what must be coming later this evening from Dad, the dreaded “talk” that I had been successful in avoiding until now."}, {"type": "sentence", "content": "I popped two Tic-Tacs into my mouth, removed the Risky Business tape from its case, and slid it into the Blaupunkt stereo. The player drew it in and moved it into place with a satisfying clunk. In no time, Bob Seger’s “Old Time Rock & Roll” filled the cabin. I cranked up the volume, eased the seat back, and closed my eyes, as Tom Cruise (a.k.a., Joel Goodsen in the movie) danced across his living room in his tighty-whities."}, {"type": "sentence", "content": "Our special moment was rudely interrupted by a forceful knock on the window. I opened my eyes to see my older sister leering at me. The door flung open, and she yelled, “What the hell are you doing in Joel’s car? Get out. Now!” I deduced the towering hunk behind her grinning at me was her boyfriend du jour. Of course his name is Joel, I thought as I switched off the engine, ejected the cassette, carefully returned the ancient artifact to its plastic abode with the same care a Louvre museum curator would take moving the Mona Lisa, and stepped out of his car."}, {"type": "sentence", "content": "“I’m…I’m sorry. I thought she was my birthday present — ” trailing off after I began hearing myself. As I backed away from the car, I took a hit from my asthma inhaler before the scene transitioned from just kind of embarrassing to a full-on trauma requiring lifelong therapy."}, {"type": "sentence", "content": "My sister huffed, “Your birthday present?” and gave me that all-too-familiar eye roll before storming off to the passenger side. Joel placed a hand on my shoulder, looked me square in the eyes, and said, “No worries, dude. Happy Birthday.”"}, {"type": "sentence", "content": "“Thanks, man,” was all I could muster as I watched him get into his car, put on his Ray-Bans, and fire her up. He slid the window down, slid his sunglasses to the edge of his nose, and deep-voiced, said, “Time of your life, huh, kid?”"}, {"type": "sentence", "content": "I nodded in utter appreciation of the reference, one bro to another, as I watched her slink out of the driveway and growl “Tschüss” to me. As she hastened away, I caught sight of a bumper sticker that read, “WTF = Freedom.”"}, {"type": "sentence", "content": "With that car, I would have had girls and guys standing in line for a ride. Feeling like a jilted lover, I spun around, retrieved my backpack, and sulked into the house, at least grateful to avoid “the talk” for a while longer. Suddenly, the bumper sticker message hit me, a reference to my favorite line of the movie."}, {"type": "sentence", "content": "With the house all to myself, and the message the universe so kindly beamed into my head, I took off my shoes and jeans, walked over to the living room mirror, and popped up my shirt collar. In my Star Wars boxers, I blasted “Old Time Rock and Roll” from Dad’s stereo and channeled Tom Cruise as I slid across the hardwoods, holding my mock microphone at the ready as the song’s piano intro played through. I bobbed my head to the beat, gyrated my hips, and lip-synced around the room. Mid-concert, I jumped on and off the sofa, spun around, and found Mom grinning at me from the entry hall. I froze."}, {"type": "sentence", "content": "“Don’t stop on my account,” she teased in a monotone."}, {"type": "sentence", "content": "With an outstretched hand, I dropped my fake mic, grabbed my stuff, and finished the performance in my bedroom."}, {"type": "sentence", "content": "Sometime later, after Dad arrived home from work, my parents celebrated my birthday with takeout from my favorite Chinese place and a cake. I could care less that my brat of a sister was too well to attend. My latest crush, Joel, however, would have been most welcomed. I made a wish and blew out the candles, trying my best not to spit on the cake. And, you know what I wished. Don’t even ask."}, {"type": "sentence", "content": "After cake, my dad handed me a set of car keys and said, “Happy birthday, son.”"}, {"type": "sentence", "content": "My eyes went wide, and I ran out of the front door. There, waiting in the driveway, was a new Mini Cooper convertible, its top down, ready for action."}, {"type": "sentence", "content": "“Oh my God, she’s amazing!” I said, as I ran toward her and touched her polished metallic black body. My eyes welled as I stepped into my car, sank into the baseball-glove-colored leather seats, and took in the new-car smell. Joel’s old POS lost that decades ago."}, {"type": "sentence", "content": "I yelled out, “I’m going to take her out for a spin. I’ll be back in a few.” A deep-throated rumble that didn’t quite match her diminutive size exited the dual exhausts as I started the engine. I paired my phone to the stereo, began playing the Risky Business soundtrack, and slipped on my Dollar General sunglasses. As I backed out of the drive, I gave a wave to my parents standing at the top of the driveway. They waved back with tears in their eyes, looking like they were sending me off to war."}, {"type": "sentence", "content": "A couple of blocks from my house, Ben Aldus, the most popular guy from my high school, was jogging towards me on the sidewalk. Team quarterback, homecoming king that dated the homecoming queen/head cheerleader, and hot AF. You get the picture. I was on the basketball team. Football and basketball players didn’t commingle at my school. The football players were higher on the food chain. I’ve known Ben since kindergarten, but he hasn’t uttered a word to me or even looked my direction since the infamous dodgeball incident in sixth grade. I swear, I lost focus from the game for only a second. Ben beaned me in the side of the face so hard I lost consciousness. When I came to, Ben was down on the ground hovering over me, apologizing, and asking if I was ok. The entire side of my face was bruised for a week; my ego never recovered. And, yes. Ben was already handsome in sixth grade. I knew right then and there, I liked guys too."}, {"type": "sentence", "content": "Ben looked my way as I approached him, our eyes locked. I thought, What the fuck? and made my move. I slowed down and waved. He surprisingly returned my wave and yelled out, “Hey, Jake. Nice ride.”"}, {"type": "sentence", "content": "The Ben Aldus knew my name. I slammed the brakes, lowered my sunglasses to the edge of my nose, and in my sexy voice, said, “Want a ride?” And would you believe it? He said, yes!"}, {"type": "sentence", "content": "Ben folded his muscular body down into the seat, stretched his arm out behind my headrest, and turned toward me. I fell into his hazel eyes and gasped. A roguish smile spread across his face as he took notice of my reaction."}, {"type": "sentence", "content": "“Happy Birthday, Jake.”"}, {"type": "sentence", "content": "I opened my mouth and closed it a couple of times before finally saying, “Uh, how did you know?”"}, {"type": "sentence", "content": "“I saw it on Facebook. What are you doing to celebrate?”"}, {"type": "sentence", "content": "“My parents just gave me this sweet ride. I’m taking her out for an inaugural spin and then heading back home to play a video game or something.”"}, {"type": "sentence", "content": "“No way. You’re not going to spend your eighteenth birthday alone. Why don’t you come over to my place? My parents are out of town. We can shoot some pool or watch a movie.”"}, {"type": "sentence", "content": "Play it cool, I thought, but failed to tamp down my excitement and exclaimed an octave too high, “That sounds great.”"}, {"type": "sentence", "content": "Ben laughed and said, “Cool.”"}, {"type": "sentence", "content": "I hit play on the stereo. Ben read the album name on the screen as “Old Time Rock and Roll” began to play, and said, “That’s like one of my all-time favorite movies.”"}, {"type": "sentence", "content": "“Mine, too.”"}, {"type": "sentence", "content": "“‘Who’s the U-boat commander?’” Ben asked, mimicking the tow truck driver from the movie."}, {"type": "sentence", "content": "I laughed and said, “Yeah. We won’t be driving this car anywhere close to the lake tonight. So, where to?”"}, {"type": "sentence", "content": "Ben glanced down at my lips and back into my eyes before saying, “Let’s ride around for a few. We can listen to some tunes while I cool off. Then let’s go to my house.”"}, {"type": "sentence", "content": "Wait. Did he just look at my lips? I nodded, pushed my glasses up, and floored it. As we launched, I said, in my loud announcer voice, “Mini Cooper. There is no substitute.”"}, {"type": "sentence", "content": "Once we arrived at his place, he got us both a beer from the fridge, and we headed upstairs. He left me in the den to play “Doom” and went off to shower. He conveniently left his beer on the end table and returned for it, wearing only a towel. I lost focus from the game and got my player killed. I obviously didn’t learn my lesson in sixth grade. While he showered, I texted my mom to tell her where I was so my parents wouldn’t send out an all-points bulletin."}, {"type": "sentence", "content": "We ended up watching Risky Business as his bulldog, Miss Vanjie, snored between us on the sofa. I reached out to pet her as we watched the scene when Joel and Lana make love on the empty train. The mesmerizing melody of Tangerine Dream’s “Love on a Real Train” played in the background as I felt my hand brush Ben’s, noting he didn’t flinch. I felt my heartbeat rise to my throat as I embodied my new mantra and placed my hand next to his and let it linger. He put his hand on top of mine and laced our fingers. I turned to face him."}, {"type": "sentence", "content": "Ben leaned over Miss Vanjie, placed his hand under my chin, and pulled me toward him into a kiss. As our lips touched, we both held our breaths from the shock of the initial impact. I explored Ben’s mouth with my tongue and felt his moan vibrate into me before his lips curved into a pleased smile. That kiss was added to my list of best things in life. I moved over and knelt in front of him. Ben’s legs fell open, and I settled myself between them. I combed my hands through his thick sandy blond hair as his gaze moved from my eyes to my lips. He grabbed my buttocks, pulled me against him, and followed through with another searing kiss, throwing his whole upper body into it. I buried my face into the nape of his neck and felt Ben’s thudding pulse. He smelled of an expensive cologne, earthy with a hint of citrus."}, {"type": "sentence", "content": "Ben took my hand and murmured, “You want to stay the night?”"}, {"type": "sentence", "content": "I replied using Joel’s line in the final scene of the movie, “‘I’d really like that. How much you got on you?’”"}, {"type": "sentence", "content": "Without missing a beat, Ben replied, using Lana’s line, “‘How much have I got on me? I’ve got $20.’”"}, {"type": "sentence", "content": "“‘$20, Lana? What are we going to do about this?’”"}, {"type": "sentence", "content": "“‘Well, can I send it to you?’”"}, {"type": "sentence", "content": "“‘Can you send it to me?’”"}, {"type": "sentence", "content": "We broke out in hysterical laughter that disturbed Miss Vanjie. She lifted her head in disgust, gave us side-eye, and flopped back down, causing us to laugh to the point where we were in tears. Ben pecked my cheek and switched off the TV. We left Miss Vanjie sleeping on the sofa, moved into his bedroom, and had sex while “Love on a Real Train” played softly on a loop in the background. I woke just before sunrise with Ben burrowed up against me, one of his legs and arms draped over mine, in a warm hug, nothing left untouched. Miss Vanjie was snoring on the far side of Ben. I added that feeling to my best-things-in-life list."}, {"type": "sentence", "content": "Much to the dismay of our girlfriends, Ben and I ended up spending the entire weekend together. Soon after, we hurtled into a top-secret romance and were inseparable through the remaining months of our Senior year. We even double-dated to the prom and ended up back at my place at two am after we dropped off our dates. Damn, we looked good together in our tuxes. To keep this G-rated, let’s just say it was a prom night for the ages. We started using the L-word with each other that night and came up with a secret handshake we used in public that meant the same. We’re planning to interrail around Europe over the summer and will be making love on a real train before heading off to the same university."}, {"type": "sentence", "content": "Isn’t life grand? And to think a message on a bumper sticker led to all of this. I’ll leave you with this valuable tip. Memorize this simple phrase: “What the fuck.” When you need it, and you’ll know when, just say it to yourself, then make your move. You’re welcome."}, {"type": "sentence", "content": "My name is Jake Thompson. I deal in human fulfillment. I landed the hottest guy at my high school in one night. Time of your life, huh, kid?"}, {"type": "sentence", "content": "Risky Business, directed and written by Paul Brickman, featuring Tom Cruise and Rebecca De Mornay, released by Warner Bros., August 5, 1983."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*uQ5fFocCJMCFQucJJnXUlA.png"}, {"type": "sentence", "content": "This story is a response to Prism & Pen’s writing prompt, Love and New Beginnings."}, {"type": "subtitle", "content": "Other stories so far —"}], "topic": "fiction"}