{"title": "How To Conquer Math and Science", "data": [{"type": "subtitle", "content": "Self Help for Struggling Students"}, {"type": "image", "content": "https://miro.medium.com/max/600/1*aVXWmMfc75fW4_OU2ubiug.png"}, {"type": "sentence", "content": "Over the years, I have tutored many people in subjects like math, chemistry, and fundamental physics. While most people struggle with and hate these subjects, I find them fascinating and exciting. Every problem is like an adventure to me. Figuring out the solution to the problem was never as fun to me as the journey of getting to the solution. I have found that I am the exception and not the rule."}, {"type": "sentence", "content": "I want to start off telling you that it is most likely not your fault that you hate these subjects. Although there are some exceptions, I have observed that the vast majority of teachers at the elementary and middle school levels lack a passion for math and science as well."}, {"type": "sentence", "content": "Again, while you may find exceptions and shining examples of the teachers who love these subjects, most of them struggled with it just like their students. Then suddenly, the system graduates them to teach a subject where they lack passion for problem-solving."}, {"type": "sentence", "content": "I have cringed as students from middle school through college have told me horrible stories of being taught “shortcuts” before they understand the fundamentals. Jedi mind tricks are for masters and not beginners. I want to reveal to you the best way to conquer your math and science fears so that you can learn the fundamentals. Once you understand the fundamental patterns, you can conquer the more complex ones. Learning math and science is a vertical climb where what you learn today will be put to use tomorrow."}, {"type": "sentence", "content": "You will not conquer chemistry or physics until you understand some complex math concepts. And you will not conquer complex math without a solid understanding of the simple processes that make up the more complicated equations. It’s just that simple. Learn the basics, then put them together to learn the complex."}, {"type": "sentence", "content": "So, where do you start?"}, {"type": "subtitle", "content": "Stop Pursuing the Solution"}, {"type": "sentence", "content": "The first thing I want you to do is to give up on finding solutions. I know that sounds a little off, but let me explain. Most people’s anxiety, as I have observed, it has come from finding the “right answer” to the problem. They start with this obsession. As they stare at the page confused at what to do, they begin thinking, “What is the answer?” In their state of confusion, the panic kicks in, and they become overwhelmed. There is no way that you will be able to solve any problem in this state."}, {"type": "sentence", "content": "What you should do instead is take a deep breath and relax. Close your eyes and tell yourself, “This problem has an answer. I will find it.” Confidence is your friend here. And instead of trying to figure out the solution, ask yourself, “What is the next step?” That’s it. You solve a complex problem by breaking it into a series of small steps. It’s just like playing a video game. You complete one task after another to get you where you want to go. Same here. Stop thinking about the final solution and replace your thinking with “What is the next step?”"}, {"type": "subtitle", "content": "Start Small and Build Up"}, {"type": "sentence", "content": "No one would ever crank up a video game and start playing at level 10. We all understand that you need to start at Level 1. And on some more complex games, they have “training” that will help you learn the basic moves you need to know to survive."}, {"type": "sentence", "content": "Well, learning math and science is the same way. You will not conquer algebra unless you understand basic arithmetics. You will not understand calculus without being able to do algebra. And you will not conquer differential equations until you understand calculus. Again, these things build onto one another, just like the levels in a video game."}, {"type": "sentence", "content": "So, always start with easy problems. Real easy problems. Build up your confidence that you know and understand how to work those simple problems. You may have to pull out some old material that you thought you learned before. Unfortunately, most people think you can just learn this stuff in 8th grade, and everything is new in 9th and 10th grade. Wrong!"}, {"type": "sentence", "content": "If you ever get stuck on what to do next, go back, and review the chapter until you understand."}, {"type": "subtitle", "content": "Work the Problems Already Worked"}, {"type": "sentence", "content": "I will repeat, your goal is not to find the solution. Your goal is to learn the patterns that you will repeat over and over again to solve the problem. One way to learn these patterns is to review problems that have been worked already. If your teacher solves problems in class, write down how she solved them (EXCEPT if she is teaching you Jedi mind tricks — ignore those!). Review your book and look at how they walk you through solving problems. Find problems posted on the internet that show the process of how they were solved."}, {"type": "sentence", "content": "Don’t worry about the answer. You need to understand the exact steps that were taken to solve the problem. Baby step yourself through it. Then grab a pencil and paper. Copy what you see. As you copy it step by step, ask yourself, “How did they get from this step to the next step?” This is what you want to learn. Focus on the steps."}, {"type": "subtitle", "content": "Focus on the Steps"}, {"type": "sentence", "content": "I can’t repeat this enough. As I have tutored people, I notice a tendency to be in a panic to find that solution. It’s almost like being on a long road trip somewhere and constantly asking, “Are we there yet?” No! Keep driving."}, {"type": "sentence", "content": "When solving math and science problems, you must not panic or keep insisting on finding the solution. The solution will find itself when you do the right steps in the correct order. It’s just that simple. This mindset is what you want to have at all times. Review worked problems and figure out the steps. Stop pursuing the solution."}, {"type": "subtitle", "content": "Do Practice Problems"}, {"type": "sentence", "content": "You will never learn math or science if you don’t DO it. Just like learning to play a video game or an instrument, you must practice over and over until the understanding of how to do it becomes natural. People who hate math usually avoid doing problems. This is why you struggle."}, {"type": "sentence", "content": "The best thing you can do is open your textbook and work all of the odd problems at the end of the chapter. ALL of them. Why, “odd problems?” That’s right, and the answers are in the back of the book. So, you can stop worrying about the solution and just work the problem, knowing that you can check the answer later."}, {"type": "sentence", "content": "Or you can check the answer now. Yes, just go ahead and look at the answer before you start working on the problem. Again, your focus is on “How did they get from this problem to that answer?” See if you can figure it out. Look at some of your worked problems and see if you can figure out, “What should I do next?”"}, {"type": "sentence", "content": "Remember that you will solve the problem by completing a series of steps. Baby step yourself through the process. Once you have one worked out successfully, do it again. And again. Put it on repeat."}, {"type": "subtitle", "content": "Put It on Repeat"}, {"type": "sentence", "content": "The only way to get better at problem-solving is to practice solving problems. It is just that simple. Unfortunately, most people allow the confusion of how to do things defeat them. They say, “It’s hard” and stop doing the work that is necessary to learn the subject."}, {"type": "sentence", "content": "If you have ever learned how to play an instrument or video game, you know everything you need to know to conquer any math or science subject. You understand the value of PRACTICE. You learn the piano by playing the piano over and over and over again. Sometimes, the same song over and over and over again."}, {"type": "sentence", "content": "Well, it’s no different when it comes to math and science. You must do problems over and over again. Did you surprise yourself and figure out how to do a problem? Great. Do it over. I recommend you do it at least three times. Again, look at the steps you took to solve the problem. You want to do this over and over until you know the steps."}, {"type": "sentence", "content": "Work the same problems over and over again. You are learning by repetition. When you begin thinking, “This is easy,” challenge yourself to do a more complex problem. Keep working until you hit “the stumper.”"}, {"type": "subtitle", "content": "Work “The Stumper”"}, {"type": "sentence", "content": "The other thing I have noticed is people’s tendency to declare understanding too soon. So, you did a few easy problems, and you feel like you understand. Make a habit of testing your understanding. Most textbooks order the problems at the end of the chapter from the easiest to the most difficult. If you work ALL of the odd problems (and not just the ones the teacher told you to work), you will eventually encounter what I call “the stumper.”"}, {"type": "sentence", "content": "This is a difficult problem designed to make you think. This is the type of problem you want to find…and conquer. Once you conquer this problem, you are good to go."}, {"type": "sentence", "content": "So, if you get stuck, go back to some of the easier problems you worked and rework them. What you are doing here is building up your confidence and reviewing the steps. Remember, ALL problems are solved by completing a series of steps, even this complex one. Your goal is to find that step that will crack the code of this problem."}, {"type": "sentence", "content": "And after you have done this, take a break! Reward yourself. You just conquered what probably defeated millions of others. You solved a complex problem!"}, {"type": "sentence", "content": "One of my favorite scenes in the movie “The Karate Kid” is when he is assigned the task of waxing cars. “Wax on. Wax off.” That’s his assignment. At first, he didn’t understand why he would be asked to do this when he wanted to learn karate. Later, the secret is revealed. “Wax on. Wax off.” was his training."}, {"type": "sentence", "content": "What I have revealed to you here is probably not your idea of “learning math and science.” But I can tell you it works. It is the “wax on, wax off” way of conquering math and science. Have fun and enjoy the journey!"}, {"type": "sentence", "content": "Do you have advice for people who struggle with math and science? Share your thoughts in the comments below."}], "topic": "education"}