{"title": "A Recent Investment History of Oil", "data": [{"type": "image", "content": "https://miro.medium.com/max/7252/0*9PpjkL9TUluW3nCw"}, {"type": "subtitle", "content": "Why The Price Of The Commodity Once Known As “Black Gold” Went Negative A Few Weeks Ago"}, {"type": "sentence", "content": "As recently as a dozen years ago, the average person had it in their head that the world was running out of oil. This idea even had a catchy name — Peak Oil, which stated that at some not too distant point in the future, the world would run out of cheap-to-produce oil. Coupled with growing demand from both developed and emerging markets, the increased cost to extract crude oil (from exotic places like deep beneath the Arctic Ocean) would result in higher and higher prices. The ultimate result would be significant diversification away from oil into other alternative sources of energy like solar and wind as well as lower and lower oil production (as various countries worked to break their addiction to super expensive oil)."}, {"type": "sentence", "content": "And things unfolded according to the Peak Oil story for a while. Countries like China and India massively increased their oil consumption as their economies caught up to the developing world. Exxon Mobil and Chevron invested billions and billions of dollars in exotic offshore oil projects and oil sands projects that were only economical with oil at $120. All this created an epic boom in oil prices from the early 2000s through 2008. I distinctly remember how the price of a gallon of regular gasoline went from $1.50 in 2002 to more than $4 in 2008."}, {"type": "image", "content": "https://miro.medium.com/max/1728/1*H4d2mW7z2UJKqyVS6F90TQ.png"}, {"type": "sentence", "content": "Then last month, on 4/20/2020, the unthinkable occurred — the price of a barrel of crude oil went negative. At its worst, the price dropped all the way down to negative $37. What does that even mean? So if I had a barrel of oil that I urgently needed to sell, I would not only receive no money for it, I would actually need to pay someone else $37 to take it off my hands? Pretty much."}, {"type": "sentence", "content": "Part of the reason is obviously coronavirus and how it’s absolutely obliterated crude oil demand. Another reason is that the quoted price of crude oil is a futures (a futures is a type of derivative) price not a spot price — much more on this later. But the seeds of oil’s price swoon were actually sown many years ago."}, {"type": "subtitle", "content": "The Shale Revolution"}, {"type": "sentence", "content": "Just as the conventional side of the energy industry was fully buying into the theory of Peak Oil, a group of upstarts was perfecting the techniques that would prove to be the theory’s demise — horizontal drilling and hydraulic fracturing."}, {"type": "sentence", "content": "An ideal oil field like the giant ones in Saudi Arabia is deep with high flow. That means you can drill a bunch of vertical wells and the oil (and the dollars) start freely flowing. Imagine a water filled balloon as big as your house. Now imagine poking several metal straws into that giant water balloon. Because there is so much water in the balloon, water will flow easily from those straws for a long, long time. That’s how the best oil fields are."}, {"type": "sentence", "content": "But as of the 2000s, the vast majority of U.S. oil came in the form of something called oil shale. Oil shale is, for lack of a better description, rock that contains oil. The U.S. has massive deposits of oil shale (in the trillions of barrels). But for the longest time, these deposits were uneconomical to produce. That’s because oil shale deposits are extremely wide (sometimes covering thousands of square miles) and shallow relative to traditional fields. The previous generation of drilling technology faced two primary challenges when attempting to extract oil from shale:"}, {"type": "sentence", "content": "So basically oil shale deposits are exactly the opposite of an ideal oil field."}, {"type": "image", "content": "https://miro.medium.com/max/1566/1*XEEGhuGu2FSilnkWazcrjg.jpeg"}, {"type": "sentence", "content": "The aforementioned upstarts like Mitchell Energy and Chesapeake Energy solved these challenges using horizontal drilling and hydraulic fracturing. By drilling horizontally through the oil rich rock, the shape of the well could much better align with the shape of the oil shale deposit (the blue line in the above figure). The flow issue was fixed with the perfection of a technique called hydraulic fracturing. By pumping, at a very high pressure, a mix of water, sand, and thickening agents into the oil shale, well operators could increase the amount of fractures and cracks in the oil shale. The oil trapped in the rock could then flow more freely through these newly opened cracks, significantly increasing the flow and yield of the well."}, {"type": "sentence", "content": "The U.S.’ massive shale deposits that were once thought to be impossible to extract suddenly became a significant and globally competitive supply of crude oil. U.S. oil production, which had been in a multi-decade swoon since the 1980s came back with a vengeance (see figure below)."}, {"type": "image", "content": "https://miro.medium.com/max/1728/1*H3mtL7nYLKmTb3swWOhy7w.png"}, {"type": "sentence", "content": "The shale industry became a major driver of U.S. economic growth drawing in investment capital from all over the world and employing millions. It also put a cap on how high oil prices could go (barring a major disruption like war) as oil shale wells could be brought online and connected to the existing pipeline infrastructure (for moving the oil to refineries or to be exported) relative quickly. So any time prices went up, more dollars poured into shale, more wells were drilled, and large amounts of supply hit the market (bringing the price back down)."}, {"type": "sentence", "content": "Shale was great for U.S. economic growth as well as consumers and corporations that consumed a lot of oil and natural gas, but not everyone was pleased with this suddenly booming industry."}, {"type": "subtitle", "content": "Saudi Arabia Attempts To Suffocate The Shale Industry"}, {"type": "sentence", "content": "In my above plot of oil prices, you can see three major declines. The first was 2008 — the global financial crisis brought with it a massive recession, which among other things, caused demand for crude oil to fall off a cliff. But once the world’s economies began to recover, you can see that oil recovered with it until 2014 (the second decline) when it nosedived again."}, {"type": "sentence", "content": "That was when OPEC (the consortium of 13 major oil producing countries that for the better part of the last 40 years dominated the market for crude) led by Saudi Arabia flooded an already oversupplied market with even more oil in a bid for market share."}, {"type": "sentence", "content": "Saudi Arabia, by virtue of owning the world’s largest and most efficient oil fields, traditionally played the role of swing producer — meaning it increased or reduced its oil production to keep prices where it desired them to be. This meant that typically in times of oversupply, it would reduce its own production (and therefore market share) so that oil prices did not fall too drastically. But this time it had other ideas. It argued that it didn’t make sense why the world’s most efficient oil producer (Saudi Arabia) had to sacrifice market share and profits when less efficient producers continued to flood the world with oil. So instead of being the swing producer and reducing production, this time Saudi Arabia decided that it would engage everyone in a breath holding competition."}, {"type": "sentence", "content": "Saudi Arabia’s gamble was that as the lowest cost producer, it could tolerate low prices longer than everyone else, especially those pesky American shale oil producers. It was confident because it knew that many shale oil producers were heavily indebted, having borrowed in order to lease the land and drill the well (energy projects typically require large upfront spending before gradually producing cashflow). As Saudi Arabia locked into its position and the oil glut went from big to massive, crude prices dropped from more than $100 to $45 in the span of just a few months."}, {"type": "sentence", "content": "The gamble backfired. Yes, some shale producers did go bankrupt. But the price war forced the survivors (helped by an abundance of cheap capital and rock bottom borrowing rates) to consolidate, increase efficiency, and learn to turn a profit at oil prices where previously it was thought to be impossible to make money. Ultimately, shale producers emerged leaner and stronger and in 2016, Saudi Arabia waved the white flag."}, {"type": "sentence", "content": "Ironically, oil’s high price for much of the last 15 years was in itself a major catalyst for its eventual decline — as it drew massive amounts of investment and research into both better extraction technology and substitutes (electric vehicles and renewable energy)."}, {"type": "subtitle", "content": "The Current Pandemic And Its Impact On Oil"}, {"type": "image", "content": "https://miro.medium.com/max/1440/1*CfkK3G8sGmxA9SC9DNfZRw.png"}, {"type": "sentence", "content": "Throughout all of the oil market’s twists and turns, there has never been a crisis that’s impacted it as much as the current one, hence the negative price. To understand how that happened, we first need to understand a bit about how oil is used and priced."}, {"type": "sentence", "content": "Crude oil has been a popular energy source for many generations. It’s reasonably energy efficient and easy to transport (it’s a liquid so it can be piped over thousands of miles). It’s major applications are:"}, {"type": "sentence", "content": "Cool, how’s it priced? The oil price that the news quotes us is actually based on the futures price. A futures is a derivative — meaning it’s a financial contract where the buyer agrees to pay the seller a predetermined price in return for delivery of the underlying asset at a set time in the future. What’s that in English? Let’s use an example:"}, {"type": "sentence", "content": "The hypothetical situation that I just described is quite common. Oil is a widely used commodity and is a major expense category for many companies (like airlines). These companies will often use the futures market to procure oil well in advance as part of their expense management process, which is fine during normal times."}, {"type": "image", "content": "https://miro.medium.com/max/1338/1*zoLloYIEbjSLQKbUDhN3eg.jpeg"}, {"type": "sentence", "content": "In the previous example, I could have avoided delivery by entering an offsetting contract with someone else (see chart to the left), provided I am able to find such a person. In this case, I’ve basically offloaded my obligation to take delivery onto someone else. Note that I would still take the loss of $10,000 (the clearinghouse that manages futures contracts marks my contract to market everyday and makes careful note of the dollar amount I must pay or receive to exit my position)."}, {"type": "sentence", "content": "Now imagine that the world has absolutely shut down in terms of demand for travel and transport (and therefore fuel). At the same time, there are thousands upon thousands of companies (and speculators) who own contracts set to expire in a day. That’s millions and millions of barrels about to be delivered when there is no need or want for any of them."}, {"type": "sentence", "content": "That’s exactly what happened on 4/20/2020. All the contract holders that were obligated to take delivery the next day attempted a mad dash for the exits. But there was absolutely no liquidity (available buyers) on the other side. What happens in a market when sellers overwhelm buyers? The price drops and drops. And in this case, the price went negative — contract holders had to basically bribe other people to take the contract off their hands."}, {"type": "sentence", "content": "Why didn’t the price drop halt at $0? If someone offered me a free gold bar, I would surely take it. But flammable commodities like crude oil incur a hefty storage cost as well as an insurance cost — I can’t just dig a hole in my backyard and store it there. Thus at any given time, there is a finite amount of storage capacity; and available capacity was running perilously close to zero (thanks to another Saudi Arabia price war, this time with Russia, that occurred in March of 2020). So those intrepid souls that agreed to take delivery were taking on substantial risk and deserved to be paid for their efforts."}, {"type": "subtitle", "content": "What Now?"}, {"type": "sentence", "content": "As of this writing (5/19/2020), the front month contract for crude oil (WTI) is set to expire today. Happily for investors in energy, its price is holding steady at around positive $30 (I find it hilarious that I need to specify the sign) without any of the unprecedented volatility we observed a month ago — helped by optimism over the gradual reopening of the economy and increased appetite for risk."}, {"type": "sentence", "content": "On the other hand, the current pandemic may shift people’s attitudes towards working remotely and travel potentially permanently at the same time as competing sources of energy keep getting better and more cost-effective. Demand for oil is likely to remain capped for years to come."}, {"type": "sentence", "content": "The shale oil industry will likely see waves of defaults especially if our economy enters a recession and a much tighter lending environment. This will hurt U.S. economic growth, but help to restrict the supply of oil (perhaps Saudi Arabia will finally get its wish after all). However, this time around, the ongoing glut is much more of a demand side issue — and it’s one that we have no easy answers for."}, {"type": "sentence", "content": "While it remains a critical commodity, the days of Peak Oil and $100 a barrel black gold are probably gone for good."}], "topic": "economy"}