{"title": "Revisit GDP to secure a green economic recovery", "data": [{"type": "image", "content": "https://miro.medium.com/max/4204/1*-wTZVEfph3HdlxtQVTPz9A.jpeg"}, {"type": "sentence", "content": "If you ask a random stranger about economics — as you do — chances are, they won’t know much. They will probably be able to tell you that economic growth is important, recessions are bad, and they are likely to have heard of Gross Domestic Product, or GDP."}, {"type": "sentence", "content": "The economy consistently ranks among the top issues for voters, even if it is a somewhat nebulous concept. For example, according to YouGov polling, it was the second most important issue in the 2017 UK election and the third most important in 2019 (excluding Brexit). In practice, voters are likely to view ‘the economy’ as shorthand for career opportunities and financial security. In a similar vein, GDP is viewed as shorthand for the economy."}, {"type": "sentence", "content": "GDP represents the total market value of a nation’s final goods and services produced over a defined period. Simon Kuznets developed the concept of GDP for a US Congress report in 1934 and it has been widely used as the go-to tool for measuring the economy for decades. Kuznets, however, warned that the measure is an oversimplification with significant limitations and should not be used as a measure of economic well-being. His caveats have not stopped leaders using it for that very purpose."}, {"type": "sentence", "content": "Politicians are fixated on GDP, because they know it is important to voters. In turn, the media and public focus on GDP, because it is so widely adopted and seems important — in part, GDP is famous for being famous."}, {"type": "sentence", "content": "When GDP is growing, politicians brandish their sound economic management credentials; when it isn’t, they chalk it up to external factors outside their control. Currently, we’re in the latter state."}, {"type": "sentence", "content": "While the measures taken to respond to the COVID-19 pandemic have saved millions of lives, they have come at considerable economic cost. The International Monetary Fund’s (IMF’s) April outlook report projects a 3% contraction in GDP over 2020, with advanced economies to be hit harder. If the projection bears out — or turns out to be understated — it would be the sharpest contraction since the Great Depression of the 1930s."}, {"type": "sentence", "content": "For now, the public’s focus is on suppressing the virus and minimising deaths — rightly so. Leaders of countries with effective responses have seen a boost in their approval ratings. However, there will inevitably come a time when the public shifts their attention to the state of the economy. When that happens, citizens of poorly performing economies are likely to punish their leaders."}, {"type": "sentence", "content": "Leaders are understandably nervous and will do everything they can to achieve a quick ‘V’ shaped recovery. In all likelihood though, the recovery will be drawn out and is highly dependent on how quickly — or indeed whether — an effective vaccine can be developed and rolled out. In April 2020, The Economist magazine, presented the concept of the ‘90% economy’ — an ‘almost, but not quite’ world where continued social distancing measures and residual anxiety prevent a speedy full recovery. Such a situation would inevitably result in a range of additional significant stimulus measures being deployed."}, {"type": "sentence", "content": "Preempting the reaction of governments, several think tanks have called for a ‘green recovery’, where stimulus measures are focused on transitioning to a low-carbon economy and addressing biodiversity loss. There has been a groundswell of support for this concept. In May, over 150 global corporations worth over US$2.5 trillion signed a statement urging governments to align their recovery packages with the latest climate science."}, {"type": "sentence", "content": "A green recovery makes a lot of sense — it would ensure stimulus funds are used to tackle the current crisis as well as the longer-term climate and biodiversity crises. However, just because the concept is logical, advocates should not assume it will happen naturally — they will need to fight hard. Governments are more likely to default to the quickest and easiest way to restore GDP, which could involve relaxing environmental standards and further entrenching fossils fuels in the economy, as has happened after previous economic shocks."}, {"type": "sentence", "content": "The myopic focus on GDP by governments, central banks and the media alike, will not help. The environment is poorly represented by GDP. Looking at green stimulus options through the lens of traditional GDP, will therefore not cast these measures in a flattering light — other measures may appear quicker and more effective by comparison."}, {"type": "sentence", "content": "In order to improve the chances of a successful green recovery, nature and sustainability should be embedded in economic metrics. Doing so will give policymakers greater confidence to adopt green stimulus measures, as they will be better positioned to reap the benefits."}, {"type": "sentence", "content": "The problem with GDP"}, {"type": "sentence", "content": "GDP serves a purpose. It is widely adopted and easily communicated, partly because it manages to summarise something as complex as the economy into a single number. It has significant limitations, however, and so politicians should not rely on it too heavily to measure economic well-being and set policy — not that this stops them."}, {"type": "sentence", "content": "This article focuses on the limitation that GDP does not value the environment nor penalise its destruction. GDP is a flow metric (e.g. a revenue item), rather than a stock metric (e.g. value), so it reflects goods and services extracted from the nature, but does not allow for any associated adverse impact on the environment."}, {"type": "sentence", "content": "For example, unsustainable extraction of resources, such as over-fishing, will have a positive impact on GDP in the short term, yet no adjustment is made for the associated environmental degradation. Often, by the time GDP suffers as a result of severe degradation, it is too late to change course."}, {"type": "sentence", "content": "Similarly, GDP does not allow for the adverse impacts of pollution and climate change. Perversely, environmental disasters, like a major oil spill, typically improve GDP, due to the activity generated by the clean-up effort."}, {"type": "sentence", "content": "Rutger Bergman, author of Utopia for Realists, sums up the issue well: “Environmental pollution even does double duty: One company makes a mint by cutting corners while another is paid to clean up the mess. By contrast, a centuries-old tree doesn’t count until you chop it down and sell it as lumber.”"}, {"type": "sentence", "content": "In an essay in Nature Magazine, Sir Partha Dasgupta — Frank Ramsey Professor Emeritus of Economics at the University of Cambridge — lamented the apathy towards the environment shown by traditional economists. “Economists, of course, might acknowledge nature’s existence. But most deny its worth… Economists assume that nature is a fixed, indestructible capital asset… The problem with the notion that nature is indestructible is this: it is wrong. Once economists accept that they are mistaken on this count, it could revolutionize the way in which we calculate economic progress.”"}, {"type": "sentence", "content": "Dasgupta goes on to provide historical examples of how the depreciation of nature has led to adverse economic consequences in the long run. He concludes by making the case for the inclusion of nature when measuring economic growth."}, {"type": "sentence", "content": "Illustrative example — Sven and fishy economics"}, {"type": "sentence", "content": "To illustrate the impact of ignoring nature in GDP, let’s consider a simple example. It is oversimplified to explain the concept — the kind of example that economists adore."}, {"type": "sentence", "content": "Sven, a fisherman who relishes the simple life, is the president and only resident of a tiny lake bound Nordic country called Sven Lake (sadly, the Bolshoi Ballet are yet to respond to his multiple invitations to perform there). The GDP of Sven Lake consists solely of the value of Sven’s catch of trout, which he sells to neighbouring countries."}, {"type": "sentence", "content": "The lake’s trout population is around one million. Sven catches around 3% of the population per annum (p.a.) and the fish stock regenerates at 3% p.a. Sven Lake is in equilibrium and life is good, if not a little dull. The economy of Sven Lake is stagnant."}, {"type": "sentence", "content": "One day, Sven’s son Pyotr, comes to visit. He’s on a summer break after completing his first year of university. Pyotr achieved a good result in Macroeconomics 101 and imparts his wisdom. ‘You need to be more ambitious, Dad. Increase your catch by 1.5% of the lake each year and the economy will prosper’, he says."}, {"type": "sentence", "content": "Sven works hard in 2021 and increases his catch to 4.5% of the population of trout. The GDP of Sven Lake increases by 50% — an economic growth miracle. Several online news websites run clickbaity articles with titles like: ‘the fastest growing economy you’ve never heard of’. Sven is proud, if he had a bottle of champagne, he would have popped it."}, {"type": "sentence", "content": "Sven works even harder in 2022, increasing his catch to 6% of the trout population. Sven Lake’s GDP grows by just over 30%. Still impressive, but a lower growth rate than in 2021. By 2028, despite working harder than ever, the economy is in recession. The problem keeps getting worse (as illustrated in the chart below). In 2030, after a deepening recession, Sven contacts his son."}, {"type": "image", "content": "https://miro.medium.com/max/1504/1*B6kklywR9Tqyc628BBOr9Q.png"}, {"type": "sentence", "content": "Pyotr, who now works as an economist for an NGO, immediately sees the problem. He does not remember the advice he gave a decade ago and assumes the strategy was cooked up by his Dad."}, {"type": "sentence", "content": "‘You’re over-fishing. The fish stocks can’t replenish fast enough.’"}, {"type": "sentence", "content": "‘But you told me I need to keep increasing my catch to increase GDP.’"}, {"type": "sentence", "content": "Pyotr explains that the GDP growth experienced previously was artificial, in the sense that it was unsustainable. He creates an adjusted GDP metric, which takes into account the depletion of fish stocks via a negative depreciation adjustment. Any income generated by excess fishing is offset by depreciation of the value of the fish stock. Further, persistent over-fishing reduces adjusted GDP over time, as the starting value of the fish stock diminishes each year (i.e. a compounding effect). The chart below illustrates the adjusted GDP metric. Under this metric, the Sven’s error would have become apparent far sooner."}, {"type": "image", "content": "https://miro.medium.com/max/1516/1*Qug_SKkQkl8p-FsEPpflow.png"}, {"type": "sentence", "content": "‘Sorry Dad, but it was a red herring. You should never have exceeded the capacity of fish stock to regenerate.’"}, {"type": "sentence", "content": "Pyotr suggested other ways to increase GDP, like selling Tom Sawyer style experiences online, where people pay for the pleasure of doing Sven’s work."}, {"type": "sentence", "content": "Back to life, back to reality"}, {"type": "sentence", "content": "Admittedly, Sven Lake is an extreme and overly simplified example. However, sadly, it is not completely detached from reality. According to the UN FAO, like Sven, we are over-fishing 30% of fish stocks and a further 60% are fished at the maximum sustainable level. And the problem doesn’t stop there."}, {"type": "sentence", "content": "Whilst global GDP has more than quadrupled[1] since 1970, nature has suffered immensely. The population of wild vertebrate species has declined by 60% since 1970, primarily as a result of habitat destruction. The rate of extinction in recent decades is as high as 1,000 times the natural background rate. Scientists believe that these observations indicate that we are at the start of the Earth’s sixth mass extinction event[2]. Climate change will accelerate the decline of nature, making the planet less habitable for all life, including humans."}, {"type": "sentence", "content": "The Global Footprint Network produces a metric called ‘Earth overshoot day’, which measures our consumption relative to the natural capacity of the planet. In 1970, we were just about breaking even. In 2019, we were consuming the equivalent of 1.75 Earths."}, {"type": "sentence", "content": "By ignoring the value of nature, decisions are not being made based on a full set of information and they are proving to be unsustainable. The result is that we are currently living beyond our means and are racking up a large planetary debt, which future generations will pay dearly for."}, {"type": "sentence", "content": "How to incorporate nature in economic metrics"}, {"type": "sentence", "content": "To incorporate nature into GDP or other economic metrics, it must be valued — this concept is referred to as natural capital. As nature is priceless, the problem is typically broken down into the value provided by a set of tangible ecosystem services."}, {"type": "sentence", "content": "Ecosystem services represent the contributions that nature makes to human well-being, including: pollination of crops, regulation of air and climate, decomposing waste and recycling nutrients, regulating diseases, controlling erosion and providing materials. The value of these services can be estimated by determining the cost of replacing them. For example, what would it cost to pollinate crops if the bee and insect population collapses? What would it cost to desalinate water if freshwater systems breakdown or are squandered?"}, {"type": "sentence", "content": "A seminal paper by Costanza et al. in 1997, attempted to put a value on benefits provided by the world’s ecosystems. It estimated the value of tangible benefits provided by just 17 ecological systems to be US$33 trillion per year (on average). In 2014, the study was updated for data up to 2011 and the estimate was revised upwards to US$125 trillion value per annum, which exceeds global GDP of c. US$85 trillion in 2018."}, {"type": "sentence", "content": "Some criticise the approach of valuing ecosystems as being anthropocentric. While this may be true, ascribing a value is markedly better than no value for economic measurement purposes, provided limitations are noted."}, {"type": "sentence", "content": "Once a methodology is in place for calculating natural capital, GDP can then be adjusted for the negative impacts of environmental degradation, pollution and climate change."}, {"type": "sentence", "content": "The discipline of environmental economics is more developed than you might think, given that it receives little publicity. Significant progress has been made, particularly since the late 1990s. A number of prominent economists have devised robust methodologies and have proposed ways of adjusting GDP or alternative metrics. An international framework for environmental accounting is in place — called the UN System of Environmental and Economic Accounting (SEEA) — although reporting is piecemeal, obscure and the degree of implementation varies widely across countries."}, {"type": "sentence", "content": "Despite the wealth of research and sound basis for the concept of an adjusted GDP, such a metric is yet to achieve widespread adoption. Perhaps it is because leaders do not like the results."}, {"type": "sentence", "content": "China, under the leadership of Hu Jintao, embarked on a project to measure performance against a Green GDP metric, which was adjusted to reflect the cost of pollution. The first results based on 2004 data were published in 2006 and showed a cost of pollution of 3.05% of GDP. Although this estimate is lower than most independent estimates, people still baulked at the figure and by 2007, Green GDP was quietly dragged into the shadows and put to rest."}, {"type": "sentence", "content": "At the 2012 Earth Summit (also known as Rio+20), a new metric was launched called the Inclusive Wealth Index (IWI). Inclusive Wealth is defined as the total value of a nation’s stock of: natural capital; produced capital (e.g. infrastructure, buildings, equipment); and human capital (e.g. knowledge, education, skills). Changes in IWI provide a more complete and sustainable view of a nation’s progress over time."}, {"type": "sentence", "content": "The 2018 Inclusive Wealth Report found that 44 out of 140 countries have experienced a decline in inclusive wealth per capita since 1992 despite almost all recording positive GDP growth per capita. This result is mainly driven by a significant decline in natural capital. While the IWI has the potential to be a powerful tool for policymakers, it has not received the attention it deserves."}, {"type": "sentence", "content": "There have been some positive signs that countries are warming to the idea of placing greater emphasis on economic metrics that incorporate nature. In 2019, HM Treasury in the UK commissioned Dasgupta — the critical economics professor mentioned earlier — to perform a review of the economics of biodiversity. The review will explore the interaction of humans with nature, the economic costs of biodiversity loss, and ways to simultaneously enhance biodiversity and economic prosperity."}, {"type": "sentence", "content": "In April 2020, the Dasgupta Review interim report was released, which sets out a framework for assessing the economics of biodiversity. It is well worth a read. The report emphasises the importance of nature to the economy and advocates the use of Inclusive Wealth as a measure of sustainable growth."}, {"type": "sentence", "content": "The interim report highlights that a central weakness of GDP is that it does not allow for the depreciation of capital. Dasgupta proposes an adjusted metric called Net Domestic Product (NDP), which equates to GDP less depreciation of natural capital, produced capital and human capital. NDP can easily be tied back to Inclusive Wealth — the change in Inclusive Wealth is equivalent to NDP less aggregate consumption. If the change is positive, the economy is growing sustainably."}, {"type": "sentence", "content": "The Dasgupta Review final report, will cover the arguably even more interesting part of the scope — examples of success stories and practical options. We can only hope that it is not destined to gather dust on a desk in Westminster."}, {"type": "sentence", "content": "There is no better time for change than today"}, {"type": "sentence", "content": "We are living through unprecedented times. Traditional GDP has plummeted, so it is natural and appropriate to take this opportunity to pause and reconsider. Rebasing GDP now to Dasgupta’s NDP metric, or similar, would almost certainly have a negative initial impact. However, the difference will be clearly explainable and any adverse reaction will be somewhat dampened by the abundance of other negative news."}, {"type": "sentence", "content": "Rebasing GDP to incorporate the environment and other factors would provide a more appropriate tool to measure sustainable economic growth. Importantly, an adjusted metric would better reflect the benefits of green stimulus measures, thus improving the chance of the green recovery succeeding."}, {"type": "sentence", "content": "To stick with traditional GDP is to continue to measure economic progress on a basis that is unsustainable. Further, it will put politicians in a bind. When faced with immense and growing pressure to restore economic growth, leaders are likely to forget the warm and fuzzy sentiment around a green recovery. They will opt for the quickest and easiest option and it will not be green, judging by previous economic recoveries. Best not to leave politicians to their own devices."}, {"type": "sentence", "content": "Notes:"}, {"type": "sentence", "content": "[1] World Bank national accounts data, and OECD National Accounts data files. GDP (constant 2010 US$)."}, {"type": "sentence", "content": "[2] For more information, I recommend reading Elizabeth Kolbert’s book titled “The Sixth Extinction: An Unnatural History”."}], "topic": "economy"}