{"title": "How the Growth Mindset is Based on the Power of Failure", "data": [{"type": "image", "content": "https://miro.medium.com/max/4608/0*cqkn6AEtvM2UNV64"}, {"type": "sentence", "content": "From an early age, I had the idea that I was smart and would eventually go to college ingrained in my mind. I even recall many car rides to school with my mother in which she told me that I was going to Harvard or an Ivy League School. Unknowingly, my mother was implementing a fixed mindset, the idea that intelligence is a fixed trait, within my life."}, {"type": "sentence", "content": "Although she was a builder in this construction, she wasn’t the only one. My second elementary school reinforced this mindset also unknowingly, or at least I hope. Within the first week, they had decided to test me for “giftedness.” This was simply a way for the school to separate their students into classes: the smart kids and the not so smart kids. This schema was designed to challenge those who were smart and encourage those who weren’t. However, all they did was further establish a fixed mindset in the minds of the “smart kids.”"}, {"type": "sentence", "content": "This predicament happened again at my third elementary school. It took the teachers one day to realize my potential and then they moved me to the “gifted classroom.” They were trying to accomplish the same objective as my second elementary school, to separate out by intelligence, but they only further ingrained a fixed mindset. The last school to do this was my first high school. They had just started a program that was designed to separate STEM classes from the regular core courses. However, just like the “gifted programs,” all that it did was reinforce a fixed mindset by making us feel smarter than the average student."}, {"type": "sentence", "content": "It wasn’t until I moved to Missouri, where I went to my second high school, that I developed a growth mindset. This mindset included the idea that intelligence is learned. Part of this was due to my father, who had a Ph.D. in English, and a school that didn’t have enough money to distinguish “smart kids” from “not so smart kids.” My father, being well-versed in teaching and research, strived to ensure that I developed a growth mindset rather than a fixed one. He also encouraged self-directed research, as well as self-learning, to further push for the growth mindset. For example, he challenged me intellectually, even enrolling me in college courses while I was in high school."}, {"type": "sentence", "content": "With this change in thinking, I began to question the institutions that I had previously attended. They weren’t intentionally trying to implement a fixed mindset. Ironically, they were trying to encourage a growth mindset. However, they failed because they didn’t have the correct strategy or even a good strategy. They were trying to accomplish the goal of challenging every student. This failed because not every student finds something difficult or finds the same things challenging. Trying to find a middle ground that challenges everyone is like winning the lottery. It’s nearly impossible. By separating the students, they were trying to create challenging environments for every student."}, {"type": "sentence", "content": "This strategy is problematic. For example, I don’t agree with this method because it causes students to feel stupid in contrast to the smart kids. In addition, the smart kids start to develop a fear of failing. I even recall a kid in my class who would pull his hair out when he got a ninety-six on a test. To everyone else, this is a good grade and something to be proud of. However, the fixed mindset had been so ingrained in his mind, that the thought of anything less of perfection was inconceivable. This drive for perfection is detrimental. In the case of my peer, he did not want to fail. However, the same applied to the kids who were grouped into the class with “dumber” kids. They believed they were gonna fail anyway, so they simply gave up."}, {"type": "sentence", "content": "In order for students to learn from their mistakes, so as to promote a growth mindset, we must normalize failure. In other words, when we use a challenging curriculum for all students and normalize mistakes and failure, then these actions are not actually “failures.” Instead, these mistakes provide a learning experience. As a result, the best strategy for establishing a growth mindset in the classroom is to allow students to make mistakes and teach them the value of these missteps."}, {"type": "sentence", "content": "It is important to note that the most common thing many students face is the fear of failure. For many college-bound students, their entire life-long dream hangs in the balance. For example, if they can’t pass an English course, their aspirations to become an engineer might seem a far reach. However, for those aspiring for higher education and those who are not college-bound, failing in school often means fearing they will fail in life generally. School teaches students that if they don’t achieve scholastically, they might, in essence, have their dreams wash away, perhaps even causing them to be homeless or hating their lives."}, {"type": "sentence", "content": "However, this perception isn’t the fault of the students themselves. It is embedded in the structure of our school system. This is because “avoiding and ignoring mistakes at school appears to be the rule in American classrooms” (Eva). This approach is extremely toxic in the classroom. It illustrates a fixed mindset and directly feeds into the anxiety of failure. As a consequence, students may believe in such dichotomies as achieving life-long dreams vs. homelessness."}, {"type": "sentence", "content": "This type of system further amplifies this anxiety by praising correct answers. For example, in some classes teachers will grade your work based on correct answers instead of rewarding correct processes. The reason this method is problematic is that it praises being right and belittles being wrong. This forces students to see failure as a bad thing, rather than an opportunity for growth. However, if those teachers instead grade the process, content, or critical thinking, rather than simply information recall, there will be a more positive result: intellectual growth. In turn, students can see where they made a mistake without perceiving their faults as leading to drastic before-mentioned consequences."}, {"type": "sentence", "content": "(As an aside, I have seen in my own education how an emphasis on intellectual growth rather than correctness can be executed. For instance, in my experience taking Music Theory, I have found that some instructors will separate out the different aspects of a particular musical piece into individual points. So, if on a specific problem you miss the name of the chord, you only lose one point instead of being marked off for the entire problem.)"}, {"type": "sentence", "content": "This growth mindset relies on the notion that the most important thing a teacher can reinforce is to “Fail first, then learn” (Eva). By failing, a student can learn a lot. These students can understand why they missed a particular point and, in the future, they can catch their mistakes in other types of problems. For example, this type of problem-solving can be seen most commonly in math. If someone were to mistakenly multiply a 1:4 matrix with a 1:4 matrix, they could learn that it’s actually supposed to be a 1:4 multiplied by a 4:1 by getting feedback on the particular problem."}, {"type": "sentence", "content": "This process of learning from one’s mistakes is called productive failure. Eva tells us of a study conducted in Singapore that tests this idea. In this study, they had two groups: productive failure group and the direct instruction group. The direct instruction group did exactly what we see in American classrooms, in which teachers walk students through certain problems. The productive failure group, in contrast, gave students problems to work with and, when they failed, the teachers stepped in and helped the students to see their mistakes. The result led to the productive failure group to complete more complex problems than that of the direct instruction group. The results of this study illustrate why failure is so important. Failure produces a growth mindset in students, who in turn “spit in the face of adversity” rather than back down in fear of it."}, {"type": "sentence", "content": "Although failure needs to be normalized, students still need to learn from failure. For instance, when a business files for bankruptcy, it doesn’t necessarily mean the end of that business. In fact, businesses have been known to bounce back stronger than they were before. In other words, in essence, what doesn’t kill you makes you stronger. Failure gives you the possibility to regroup, learn, and grow from your mistakes."}, {"type": "sentence", "content": "Life with a growth mindset is never simply about success or failure, but rather growing over a period of time. For example, McDonald’s, before it was the multinational corporation it is today, had a few roadblocks that prevented its growth. The first being the founders. The initial owners of McDonald’s hired someone to help them expand their business beyond just one “burger joint.” However, this industry had many restrictions. The guy they hired found ways around these like buying up the land and franchising it out to new McDonalds. The money he acquired from this bypass allowed him to take the brand right from underneath the original founders. What this guy did was not back down when it seemed like he was faced with certain failure. He could have just given up and quit trying all together. However, he learned from his first failed attempt and instead found another way."}, {"type": "sentence", "content": "The first thing, with a growth mindset, that students need to understand is that “failure is not a bad thing” (Lenz). It’s actually one key element in the learning process. For example, if a toddler puts her hand on a red hot stove and burns that hand, she is less likely to do it again. The same follows for any endeavor. It’s natural to fail; it is part of how we learn things. Thus, “when reframed as a good, constructive, and essential part of learning, failure is a master teacher” (Lenz). In other words, if we don’t have failure, we can’t learn."}, {"type": "sentence", "content": "As an example, look at the behavior of a dog. In order for dogs to learn that if they sit it is a good thing, they must first make the mistake of not sitting on command. Although the process might be more complex, the same sentiment follows for human beings. This can be seen in how, in order for us to learn how to use punctuation correctly, we must first use it incorrectly. These examples show why failure is so valuable. Making errors is the root of our learning. In turn, because we fail at something doesn’t mean it is the end. It means it’s the beginning of learning. This mindset shows why businesses are able to bounce back from bankruptcy or why toddlers are able to know not to touch the stove when it’s red hot."}, {"type": "sentence", "content": "Another idea that follows this same aspect of learning from mistakes is revision. When someone writes the first draft of an essay, it is a rough draft. It’s something that still needs work. When the teacher responds to this draft with criticism, they aren’t saying “you lose” but rather that you need to “revise” or “you can do better.” Lenz reinforces this idea when he states that failure is saying “you can do better” rather than “you lose.” It’s a plug and chug process. If one answer fails you, don’t quit, instead, you set it to the side and plug in another. This is why failure and revision are so valuable. They are the beginning of growth and of learning. By understanding this value, students can acquire a growth mindset and grow as students."}, {"type": "sentence", "content": "Teachers should establish this strategy if they wish to encourage a growth mindset in their students. One way instructors can do this almost immediately is with the rough draft. Instead of grading the rough draft like you would a normal paper, they should instead make it participation-based, in that they get full credit for simply completing it. Then, by giving individual feedback to each student, instructors can address the places where these students made mistakes or used failed strategies. By doing this simple task, these instructors will help normalize failure without putting pressure on the students to get it right the first time."}, {"type": "sentence", "content": "The best way for instructors and teachers to instill a growth mindset into students is to normalize failure and show them the value of it. By accepting that it is normal to fail or make mistakes, students can then learn that it is not an ending. Rather, it is the beginning of learning. So the best strategy that a teacher can use is to allow students to make mistakes. When they do, they will produce students that not only have a growth mindset but are also critical thinkers. Instead of having that student who pulls his hair out over a grade of ninety-six, we have a student that uses that grade as an opportunity for learning. All educators and students can then learn the power of failure that results from a growth mindset."}], "topic": "education"}