{"title": "Why You Should Take Linkedin Seriously As A Freelance Writer", "data": [{"type": "subtitle", "content": "These are the 3 areas you should focus on"}, {"type": "image", "content": "https://miro.medium.com/max/2100/1*wLgwt3zMPC96KF5L0fsWsA.jpeg"}, {"type": "sentence", "content": "I started using Linkedin seriously January this year, and the growth I’ve experienced since then has been really impressive. People have reached out to me for writing gigs, I got hired by two Copywriting agencies to join their team, and I got a $1000 monthly retainer from a client — all in 5 months."}, {"type": "sentence", "content": "It all happened because I took the platform seriously and improved my engagement on the platform."}, {"type": "sentence", "content": "Here are some strategies that helped me and would also help you."}, {"type": "subtitle", "content": "Create Consistent Value"}, {"type": "sentence", "content": "No matter the platform you use, to gain attention, you have to see value creation as a norm. On Linkedin, the more value you create, the higher your chances of a prospect reaching out to you for work."}, {"type": "sentence", "content": "Putting out one helpful post, once a week is not going to help you as much as posting everyday will. Although, most times, you might not have anything to write. When this happens, I just search for a quote on writing or marketing or whatever I feel would be helpful and post."}, {"type": "sentence", "content": "At times, I read articles here on Medium in search of what I’ll post there. When I’ve seen something nice, I post it there."}, {"type": "sentence", "content": "Linkedin has a provision for articles. That’s a way for you to shine. Your articles aren’t meant for Medium alone — once a week, pick one article from your draft and publish on Linkedin. It helps to make potential clients see you as someone that knows their stuff."}, {"type": "sentence", "content": "What kind of content should you write? It depends on your target clients. But usually, since business owners use your writing services, try to write in the lines of Entrepreneurship, Productivity, Marketing, and Writing. Then, you should also talk about things related to your niche. Let’s say you’re in the Health niche, talk about the latest topics in your field — Let them see that you’re wholly invested in what’s going on around your niche. It would make them trust you more."}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*2N1dH2tRj9Bg9fSXQx5rIA.jpeg"}, {"type": "subtitle", "content": "Connect with the Right People"}, {"type": "sentence", "content": "What is the point of Linkedin if you’re not boosting your professional network. There are two kinds of people on Linkedin: The people that believe they should only connect with people they know and the other types of people who understand that Linkedin is for growing your network and connecting with new people that you could potentially do business with. As a writer, you should connect with"}, {"type": "sentence", "content": "These people should make up your network. Founders need writers for their blog posts, emails, and landing pages. When they keep seeing you producing value, they would want to reach out to you. You would even have them reaching out to you because you’re positioning yourself as an authority."}, {"type": "sentence", "content": "The same thing goes for Head of Content/Head of communications and CMOs. When they see that you give value, you would be headhunted for roles when there’s a need. I’ve gotten a couple of interview requests from head of communications, which simply happened because I give out value frequently."}, {"type": "sentence", "content": "You must be wondering why Web designers are on the list, right? Web designers need writers for their website content. After they build any website, they can put in a good word for you to the client, and you would get the gig — it’s that basic."}, {"type": "sentence", "content": "Talent Acquisition specialists are in charge of recruiting the right talent for companies — If they see you as someone that knows what you’re doing through the value you create, they will reach out to you when there’s a need for a writer. Why? Because you provide consistent value."}, {"type": "sentence", "content": "It’s necessary to have Writers on your team because of the insights and the industry news they share. It nice to have people like you on your team because the value they give out would help you."}, {"type": "subtitle", "content": "Your Bio is essential"}, {"type": "sentence", "content": "In my Linkedin guide for Freelance Writers, I talked more about how to optimize your header, profile picture, and write your headline properly. But one very important thing in your bio."}, {"type": "sentence", "content": "Your bio is your first impression. It makes people have an idea of what you’re like."}, {"type": "sentence", "content": "There are words that you should generally avoid like:"}, {"type": "sentence", "content": "Best • Amazing • Expert • Hard-Working • Sincere • Dedicated • Capable • Smart • Competent • Efficient • Gifted"}, {"type": "sentence", "content": "These words are cliche and are tiring to read. It’s important to show than to tell. If I were to hire you, I would think twice about your competence if you had those words on your profile."}, {"type": "sentence", "content": "Also try to take in the first person, rather than the third person. Avoid writing summaries like:"}, {"type": "sentence", "content": "“Tochukwu is a content writer who has excelled in all the areas of content marketing, and He has worked with several B2B brands. He works hard under pressure and is result-oriented .”"}, {"type": "sentence", "content": "This is wrong and impersonal. You have to add more personality to your bio. You’re a writer, so you should write like one. Try something like this."}, {"type": "sentence", "content": "“I started Content writing in 2015, and at that time, I’ve been able to work with over 400 brands, and I’ve helped about 70% of my clients cross the 7 — figure mark. I have transitioned into several areas of Content marketing from the Content writing position I held as of 2015. I have excelled at many things, and right now, I have a successful YouTube channel with over 2 million unique monthly views, and I have a podcast of over 600 thousand listeners. My work has been featured in HuffPost, Inc Magazine and CNBC. I help businesses in the health niche with • Blogposts • Emails Sequences • Landing pages • Setting up Sales Funnels"}, {"type": "sentence", "content": "When I’m not writing or talking about writing, I like to lay in bed watching Netflix If you’re interested in working with me, Reach out to me via my inbox.”"}, {"type": "sentence", "content": "This bio is simple, shows your accomplishments, and gives off bits of who you are — Netflix."}, {"type": "sentence", "content": "It also includes keywords that help you rank when people search for writers on Linkedin."}, {"type": "sentence", "content": "These are the basic knowledge you would need to excel on Linkedin — value, your connections, and a catchy bio."}, {"type": "sentence", "content": "If you can keep giving out value and actually using the platform, people would start to reach out to you, no doubt."}, {"type": "sentence", "content": "Thank you for reading."}, {"type": "sentence", "content": "Read the first chapter for my Linkedin Guide Here"}], "topic": "freelancing"}