{"title": "5 Things Productive People Do Before Sleeping", "data": [{"type": "sentence", "content": "Adopt some new daily habits to become more successful every day"}, {"type": "image", "content": "https://miro.medium.com/max/9856/0*Use9MzWpB_TWTgD3"}, {"type": "sentence", "content": "I’m not someone that looks forward to bedtime. I am truly a night owl but have had to force myself to adapt and become some semblance of a morning person. I am generally like a giant toddler resisting sleep. I’m not sure why I’m like this but I have been for as long as I can remember."}, {"type": "sentence", "content": "I work from home, for myself, and for a long time I didn’t really have a night routine or ritual of setting myself up for success the next day. I didn’t think that I needed to do so as a way to improve my life. But that’s just not true for me. People that are most productive and successful take advantage of the evening time to set themselves up for success. The following are five things that productive people do before sleeping."}, {"type": "sentence", "content": "Turn the Page"}, {"type": "sentence", "content": "I talk about reading a fair bit in my articles because it’s simply one of my favorite things to do. I’ve been a voracious reader since I was very little so incorporating it into my evening routine was no problem for me."}, {"type": "sentence", "content": "Many great leaders and successful people are also voracious leaders. In 2009, former President Barack Obama told the editor of Newsweek that he reads for half an hour or so before bed most nights. Bill Gates is also a voracious reader."}, {"type": "sentence", "content": "Productive people know that reading is the best way to expand your mind, keep up to date, and understand the world better. Another benefit of feeding your mind with books is that it can improve the health of the brain long-term."}, {"type": "sentence", "content": "Plan your Look"}, {"type": "sentence", "content": "By taking the time before bed to plan out your clothing you will definitely improve your productivity in the morning, especially if you work outside of the home. It improves your productivity in the mornings partly because it eliminates decision fatigue and wasting precious moments digging through your closet."}, {"type": "sentence", "content": "If you are a morning exerciser, like me, try laying out your exercise clothing the night before. The very last thing that I want to do in the mornings is to figure out what I’m wearing. Sometimes that one decision leads to me skipping workouts. Throughout my fitness journey I have done this and it has absolutely led to more productivity in the morning. My routine is much smoother."}, {"type": "sentence", "content": "Blue Light Blues"}, {"type": "sentence", "content": "Most of us know that blue light from our devices is detrimental to sleep, as well as causing depression and even vision problems. The blue light from our computers, tablets, and phones mimics the sun. This tells the brain to stop producing melatonin which is a hormone that regulates your circadian rhythm This tells your body when to go to sleep and when to wake up."}, {"type": "sentence", "content": "Some productive people completely ban cell phones and other devices from their bedrooms as a way to protect their sleep. Some even completely ban cell phones from their bedrooms at night. This helps people fall asleep and stay asleep better."}, {"type": "sentence", "content": "Plan Away"}, {"type": "image", "content": "https://miro.medium.com/max/5248/0*OuZBUJJUDimjcQwq"}, {"type": "sentence", "content": "A way to be productive before sleeping is to plan out your whole next day. Whether it’s creating a to-do list for the next day, reviewing appointments, productive people know that this is crucial to the success of the next day. Whether you like a paper planner or planning on digital devices, reviewing your day before bed will help you hit the ground running the next morning."}, {"type": "sentence", "content": "Also, planning for the next day will also improve your sleep as any concerns or thoughts that you have will not be in your headspace when trying to fall asleep. Productive people also take the time to reflect on the day before going to bed."}, {"type": "sentence", "content": "Whether it’s reviewing goals, deadlines, or simply thinking over the events of the day, reflecting on the day can help you realize where and how you are spending your time."}, {"type": "sentence", "content": "Sleep it Off"}, {"type": "sentence", "content": "In our very busy world, many people are running on a sleep deficit, which can harm your health, as well as your productivity. Highly productive people know that protecting their sleep and having a consistent sleep routine is key. Everything suffers when we are in a sleep deficit, including productivity. Going to bed and waking up at the same time each day, even on weekends, is what sleep experts recommend."}], "topic": "productivity"}