{"title": "My First Trip Abroad Broke My Lifelong Dreams of Travel", "data": [{"type": "subtitle", "content": "I had to overcome PTSD to resurrect them."}, {"type": "sentence", "content": "My coal-town childhood was an unending reverie of escape. I was generally more content to sit in my bedroom than to play in the sunshine because my favorite “toys” were picture atlases, phrasebooks, and the world-band radio my parents had given me for my 8th birthday. I resolved very young that someday I’d see the sights from these atlases in person. Someday I’d need the words from these phrasebooks. And someday — I liked to imagine (because what little girl doesn’t hope she grows up pretty?) — I’d be an impossibly beautiful, exotic creature, captivating strangers without effort while I moved about my daily life far away."}, {"type": "sentence", "content": "As it turns out, that last dream did come true, in a way — as a nightmare."}, {"type": "sentence", "content": "I chose Ecuador to study abroad in my second year of college, lured by a combination of my love for mountains and my lifelong interest in indigenous American cultures. I was thrilled to see my dreams taking shape so young: I was only 19, and here I was, already beginning to see the world. The future felt so wide, so early."}, {"type": "sentence", "content": "Ecuador’s just the beginning, I thought. Maybe I’ll spend a semester in Spain next. And then I’ll finish my Spanish major, and I’ll find a job abroad — and keep exploring new places whenever I can."}, {"type": "sentence", "content": "But my Mediterranean curves and hip-length, dark-honey curls were rare and compelling in the Andes. It didn’t matter that I dressed like a tomboy and felt more awkward than attractive; I couldn’t escape male attention there. (Probably not a coincidence that subsequent years saw me gaining 35 mystery pounds and losing aggressive amounts of hair.)"}, {"type": "sentence", "content": "I came home with PTSD."}, {"type": "sentence", "content": "No single incident was responsible for breaking me. The PTSD was largely just the result of a holistic miasma of fear."}, {"type": "sentence", "content": "Being sexually assaulted in broad daylight sucked — both times. But so did being followed by a police motorcycle for weeks for no reason. As did being summoned to the post office for a suspicious “package” that never existed at all (amidst a backdrop of warnings from locals about the possibility of false drug arrests and cautions about how foreign women, especially, seemed vulnerable to them)."}, {"type": "sentence", "content": "The fact that I got catcalled — if not also followed — once per minute each time I walked anywhere outside my house didn’t help either. Nor did the stories from friends about their own assaults, which reinforced the notion: Danger is everywhere."}, {"type": "sentence", "content": "To add insult to injury, I went home each day to a homestay where the housekeeper was a man whose attentions toed the line of impropriety. There was no place in Ecuador where I felt fully at ease because everywhere I turned, someone thought I was beautiful — and because many of the people who thought I was beautiful decided they were entitled to that beauty in some way: to comment on it or follow me in the hopes they might possess it, or even just reach out and grope me on a Sunday afternoon or dry-hump me on their morning commute."}, {"type": "sentence", "content": "Many, many things made me feel unsafe, constantly, and I started to feel like I was safe nowhere in the world. Because anywhere I went, I’d have to bring my body with me… and my body was apparently the most dangerous place of all to inhabit."}, {"type": "sentence", "content": "Thus, when it was all over and I heard Lee Ann Womack on the radio during the ride home from the Philadelphia airport — “I hope you never fear those mountains in the distance, never settle for the path of least resistance…” — I started sobbing. I did fear those mountains now. And I’d settle for the path of least resistance for a very, very long time."}, {"type": "sentence", "content": "Back at home, as I began re-acclimating and had space to process my trauma, I realized something crushing:"}, {"type": "sentence", "content": "I needed to find new dreams."}, {"type": "sentence", "content": "I still wished I could travel, but suddenly I couldn’t imagine feeling safe in any far-flung corner of the world without a man by my side. I’d learned that some things simply aren’t safe for women to do, and it had nothing to do with being a damsel in distress type who “needed” a man, nor was it about “drawing attention to yourself.” It was just life."}, {"type": "sentence", "content": "I resigned to finishing out my Spanish major (I couldn’t afford to switch to a new one) and tried not to let myself wonder:"}, {"type": "subtitle", "content": "At age 22, I started therapy."}, {"type": "sentence", "content": "I was tired of the vivid flashbacks that kept bringing me back to Quito, and of the fact that a single dream about being in the Andes could depress me for an entire week. Counseling was slow (PTSD can be tricky), but even as the flashbacks became less frequent, I spent my early 20s making unfulfilling choice after unfulfilling choice: I’d long ago given up on my old dreams of future semesters or summers abroad, and I took a teaching job at my alma mater after graduation, partly to avoid taking a risk on a new place… even though my town bored me to tears."}, {"type": "sentence", "content": "Next, I joined a Ph.D. program as a compromise: I would study the world and its people from the distance of the ivory tower, as an untouchable observer — even though I knew in my gut that I wouldn’t be happy… and I declined the opportunity to work on a research project abroad."}, {"type": "sentence", "content": "Of all the reasons for neglecting my dreams throughout my early-20s, my trauma was probably the biggest. Because even when money wasn’t an obstacle, even when I was free of a controlling ex-boyfriend, and even when I realized I felt deeply unfulfilled… I stayed put."}, {"type": "sentence", "content": "I knew I wanted something else out of life — I knew I’d always wanted something else out of life — but it just didn’t make sense to reach for it anymore. Why would I ever try again, if just a single reach had been enough to shatter me?"}, {"type": "sentence", "content": "This was how I lived for half a decade until a very unexpected encounter."}, {"type": "sentence", "content": "At age 25, I met someone who reminded me of the old—as in, the real—me. A kindred nomad soul who hadn’t been broken by his own adventures. And as I listened to his reveries about the many places he’d explore, the magic he would alchemize someday for this world from all his far-flung inspirations… I recognized my own forgotten dreams in his words. I didn’t know how I’d find the courage to fly again, where I’d go, or even how I would extract myself from the lifestyle I was stuck in… but I promised myself that I would."}, {"type": "sentence", "content": "Because suddenly the loss of my true self had become unbearable. And I knew I’d never feel complete until I found my way back to her. No matter how justified I was in abandoning her in the first place."}, {"type": "sentence", "content": "A combination of soul-searching and synchronicity helped me move forward from there."}, {"type": "sentence", "content": "At age 26, I had the opportunity to visit friends in East Asia, and while stalling with anxiety on booking my flights, a glitch on a ticketing website made me believe I’d missed the window of affordable opportunity and that now I’d never get to take the trip. My stomach abruptly sank, and I think I was reminded of a quote I’d loved since high school: “…you will be more disappointed by the things you didn’t do than by the ones you did do.”"}, {"type": "sentence", "content": "The lead weight in my gut told me all I needed to know about how much I truly wanted to travel again — and how ready I was to try. Luckily enough, I refreshed the search and the bargain prices reappeared. I booked without hesitation. And the trip helped me heal. The following year, I moved to Shanghai. Then, later, to Berlin. The international life I lead right now is totally unrecognizable compared to anything I was daring to dream just a decade ago."}, {"type": "sentence", "content": "It took a lot of therapy, a lot of reflection, and a lot of testing the waters to get comfortable with reclaiming my inner nomad, and I definitely “tweaked” my old dreams in the process; they aren’t the same shape as they were before Ecuador."}, {"type": "sentence", "content": "I’ve learned to research destinations with respect to the prevalence of gender violence, and there are some places I simply won’t go. (At least not without a man.) I also recognize that there are certain things I can’t (personally) feel comfortable doing when I travel alone as a woman, no matter how “safe” the destination supposedly is: I won’t allow myself to get drunk or hit up nightclubs alone, go to beaches without a buddy, book arrivals or departures at certain times of night, or stay in neighborhoods where female reviewers say they’ve felt uneasy (even if men, in the same places, feel fine)."}, {"type": "sentence", "content": "Sometimes I lament my limitations: I wish I could get drunk alone, sunbathe or swim alone, come and go at any hour, and not have to spend extra for a gender-specific sense of security in my accommodations… but as long as I travel without a companion, that’s how I roll."}, {"type": "sentence", "content": "I also wish I had less fear than other women — women who haven’t been stalked or assaulted in their travels — but the reality is that I was stalked and assaulted in my travels. So I accept that my fears are justified, and I try not to judge myself for being cautious."}, {"type": "sentence", "content": "Yet even within the constraints of the boundaries I’ve drawn, I still have far more freedom and feel far more fulfilled than if I’d never dared to venture back out in the world and make good on my lifelong dreams at all."}, {"type": "sentence", "content": "So if you can relate to any of this — if you’ve ever abandoned a dream after it burned you, and you’re wondering whether you should dust off your wings and try again — here’s what I’d say to you:"}, {"type": "sentence", "content": "There’s no tried-and-true method of reclaiming the life you always wanted, so I won’t pretend to be able to give you “The” Steps To Take towards healing. I do know that you need to give yourself time to mourn the loss of your dream, and of the attendant aspects of yourself, even if that loss is only temporary. I can also tell you that having a counselor helps. Beyond this, though, everyone’s journey is individual."}, {"type": "sentence", "content": "But here’s what I can tell you far less ambiguously, from any experience where I’ve felt bruised by my own misadventures and considered abandoning a dream. There’s a question far more fundamental than: How can I make it work? Two questions, actually."}, {"type": "sentence", "content": "Those are:"}, {"type": "sentence", "content": "Can I be content living the rest of my life without incorporating this dream, in some form, into my future, ever again?"}, {"type": "sentence", "content": "and"}, {"type": "sentence", "content": "Can I be fully me without incorporating this dream into my future ever again?"}, {"type": "sentence", "content": "Because if you want to be fully happy in your life, you have to be fully present in it. And if you’re shutting out a piece of yourself for any reason — for doubt, for lack of information/training, or even for trauma — you’re limiting just how much of YOU is participating in your own life experience. And if “you” aren’t fully present in your life, then how, really, can you be happy?"}, {"type": "sentence", "content": "So if your answer is “no” to the above — no, I can’t be content giving up this dream forever, and no, I can’t even be fully me without trying — then you have your fuel: it’s that soul-born certainty that it’s worth it to try again."}, {"type": "sentence", "content": "And that conviction will help you find the way."}, {"type": "sentence", "content": "Here’s a full-circle moment from my healing process:"}, {"type": "sentence", "content": "And a more uplifting story about my time in Ecuador:"}], "topic": "travel"}