{"title": "Superman Does Scenario Planning (A Tool for the New Normal?)", "data": [{"type": "image", "content": "https://miro.medium.com/max/260/0*YClIgTqBdAye3kdi.jpg"}, {"type": "sentence", "content": "In The Art of the Long View, Peter Schwartz describes a powerful business tool called scenario planning, designed to help leaders navigate the future without having to predict it."}, {"type": "sentence", "content": "I first wrote this post during the dark days of the 2008 financial meltdown and thought it might be worth reposting in 2020, when the new normal makes the usual tools of strategy seem inadequate."}, {"type": "sentence", "content": "“In a scenario process,” Schwartz writes, “managers invent and then consider, in depth, several varied stories of equally plausible futures. The stories are carefully researched, full of relevant detail, oriented toward real-life decisions, and designed (one hopes) to bring forward surprises and unexpected leaps of understanding.”"}, {"type": "sentence", "content": "Scenario planning was first used by the military in WWII, but the classic case demonstrating its value was undertaken by Pierre Wack, a planner in the London offices of Royal Dutch/Shell. In the early 1970s, Pierre and his colleagues in the Group Planning department were looking for events that might affect the price of oil — which had long been a steady, dependable commodity. That’s when they proposed a set of scenarios, each one a plausible story of the future, but radically different in their outcomes."}, {"type": "sentence", "content": "I’ll spare you the details except to say, between OPEC and the Yom Kippur War, the energy crisis that followed caught the oil industry off-guard — with the exception of Shell. From one of the weaker of the “Seven Sisters” oil giants, Shell became one of the two largest and, arguably, most profitable."}, {"type": "sentence", "content": "Schwartz tells us, “The purpose of scenarios is to help yourself change your view of reality — to match it up more closely with reality as it is, and reality as it is going to be. The end result, however, is not an accurate picture of tomorrow, but better decisions about the future.”"}, {"type": "sentence", "content": "Superman Does Scenario Planning"}, {"type": "sentence", "content": "Here’s a quick example of how scenario planning works, designed for a superhero."}, {"type": "sentence", "content": "Suppose you are Superman. Your workday is filled with urgent, very urgent, near-death, and mankind-saving activities. Over coffee one morning you wonder if, maybe five years from now, you will be able to retire. As you ponder, there are two things that seem especially troubling and difficult to predict."}, {"type": "image", "content": "https://miro.medium.com/max/432/0*7JrV-Df8O1KAzngf.jpg"}, {"type": "sentence", "content": "One is kryptonite. The only piece you know about is safely locked away, but The Daily Planet reports that an evil genius may have come up with a way to synthesize kryptonite. It’s a troubling rumor."}, {"type": "sentence", "content": "The other thing that worries you is the crime rate, which seems to be declining in Metropolis but increasing in Gotham City, where that half-wit Batman is perpetually struggling. Again, nobody really knows which way the future trend will head in either city — only that there seems to be no end to the appearance of weird bad-guys."}, {"type": "sentence", "content": "So, unable to predict the future around these two especially fraught issues, you decide to devise some scenarios. To do that, you look at two sets of extremes:"}, {"type": "sentence", "content": "Now, you’re in a good position to look at four different scenarios:"}, {"type": "image", "content": "https://miro.medium.com/max/800/0*0x_GAvQSdtL19FZN.jpg"}, {"type": "sentence", "content": "Remember, you’re not trying to predict the future — just tell plausible stories about what might happen in order plan appropriately."}, {"type": "sentence", "content": "Can you think of any strategic initiatives that might make sense under most or all of the scenarios?"}, {"type": "sentence", "content": "How about partnering with Batman? You may be able to take him with one arm, but kryptonite doesn’t slow him down. Also, it sounds like he could use some help over in Gotham City, which might influence the High C scenarios. And even in the Easy Street scenario (Low K/Low C), it would be nice to have a buddy to go fishing with."}, {"type": "sentence", "content": "Remember, you’re still not trying to predict the future. But you are finding initiatives — like partnering — that make you stronger in every, or almost every scenario."}, {"type": "sentence", "content": "Sometimes in scenario planning there are some eye-opening findings."}, {"type": "sentence", "content": "For example, why not marry Lois Lane and start a family, like you’ve been putting off for 70 years? Maybe your son or daughter becomes the Kid of Steel, unfazed by kryptonite (from his/her mother’s side of the family)? Having a third superhero on the block might reduce the likelihood of a High C outcome, as well."}, {"type": "image", "content": "https://miro.medium.com/max/524/0*D91jGmJQrFd9ReaA.jpg"}, {"type": "sentence", "content": "That’s how it works? Four scenarios. Not a single one likely to occur exactly as described. But all useful in generating strategic options and new ideas."}, {"type": "sentence", "content": "Schwartz adds a few additional considerations.Beware of settling on three scenarios, because the one “in the middle” is often treated as the “most likely.” This undermines the advantages of multi-scenario planning. And avoid assigning probabilities. Also, remember to use names that telegraph the scenario logic. Make them vivid and memorable."}, {"type": "sentence", "content": "Some of us are superheroes and some of us are STEM people, but we are all Story People."}, {"type": "sentence", "content": "Finally, Schwartz closes by saying, “You can tell you have good scenarios when they are plausible and surprising; when they have the power to break old stereotypes; and when the makers assume ownership of them and put them to work. Scenario making is intensely participatory, or it fails.”"}], "topic": "leadership"}