{"title": "The Three Things You Need to Be A Productivity Machine", "data": [{"type": "image", "content": "https://miro.medium.com/max/6000/1*NppFYU9QuY-7I8XuXwr9jQ.jpeg"}, {"type": "sentence", "content": "Wherever you are in life, it is the result of your habits. Good or bad, habits make up who we are. It is our habits that form our neuropathways and ultimately shape who we become."}, {"type": "sentence", "content": "In order to unleash the productivity machine we all have inside of us, it is important to understand how to manage our routines."}, {"type": "sentence", "content": "Who are you? What’s the first thing you do when you wake up? How do you handle adversity?"}, {"type": "sentence", "content": "There are habits that can make you a millionaire. And then, there are habits that can put you into our fight or flight response."}, {"type": "sentence", "content": "Here are three things you can do today to become a productivity machine."}, {"type": "subtitle", "content": "The Eisenhower Quadrants"}, {"type": "image", "content": "https://miro.medium.com/max/2320/1*1pVQGpSxCSrKdgJgMRzcog.jpeg"}, {"type": "sentence", "content": "As president of the United States and a war general, you could only imagine the number of decisions he faced on a day to day basis."}, {"type": "sentence", "content": "Whether it was meeting with other world leaders, or deciding whether to bomb the Germans during WWII, Eisenhower had a system for his decision making."}, {"type": "sentence", "content": "In fact, his decision-making ability is so supreme, Stephen Covey’s “The 7 Habits of Highly Effective People” dedicates a whole section to adopting this principle in your day to day life."}, {"type": "subtitle", "content": "How to Use the Eisenhower Quadrants"}, {"type": "image", "content": "https://miro.medium.com/max/2424/1*EZ8e7lnAQucbYBkjDUmAcA.png"}, {"type": "sentence", "content": "Before beginning your day, write out all your tasks you have to do, whether it is attending a meeting or something as simple as brushing your teeth."}, {"type": "sentence", "content": "Once you have everything written out, it’s time to bring this piece of inspiration out. When it comes to prioritizing your tasks, we can all agree some things are just way more important than others."}, {"type": "sentence", "content": "The Eisenhower Matrix relies on two things: Urgency and Importance."}, {"type": "sentence", "content": "Quadrant I: Tasks that are urgent and important"}, {"type": "sentence", "content": "Quadrant II: Tasks that are not urgent but important"}, {"type": "sentence", "content": "Quadrant III: Tasks that are urgent but not important"}, {"type": "sentence", "content": "Quadrant IV: Tasks that are not urgent and not important"}, {"type": "subtitle", "content": "Your Time is Valuable"}, {"type": "image", "content": "https://miro.medium.com/max/9392/1*r2AfUxE1gzAspEB99k5T7A.jpeg"}, {"type": "sentence", "content": "Prioritizing your tasks can only take you so far."}, {"type": "sentence", "content": "When do I do each task? How long is going to take me? Do I just wing it?"}, {"type": "sentence", "content": "Now what?"}, {"type": "sentence", "content": "This is where time-blocking comes into play. once you have all your tasks in your Eisenhower matrix, it is important to know when you are going to commit to each task as well as how much time."}, {"type": "sentence", "content": "Here’s a great way to use time blocking:"}, {"type": "image", "content": "https://miro.medium.com/max/5758/1*PHufuphtMW3n1fHKmGK4_A.png"}, {"type": "sentence", "content": "In this example, I used time blocking to create a morning ritual that works for me. Once I have all my tasks in my quadrants, I use time blocking to know when I am going to do these tasks and for how long."}, {"type": "subtitle", "content": "Focused Execution: The Pomodoro Method"}, {"type": "image", "content": "https://miro.medium.com/max/7776/1*6ziWDxr7hDNmqWU0p8eAfg.jpeg"}, {"type": "sentence", "content": "Once you have your tasks prioritized and time blocked, it can be a little challenging focusing and executing."}, {"type": "sentence", "content": "Thanks to the internet and social media, our attention span is apparently at the worst its ever been. We are in an age of instant notification and gratification."}, {"type": "sentence", "content": "Francisco Cirillo developed the Pomodoro technique for time management back in the 1990s. Although the internet wasn’t as popular, Cirillo created this method to blow by any task you put your mind to."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*kMBwxcPmTFsTJWWJAwniuQ.png"}, {"type": "sentence", "content": "For longer working cycles, Cirillo advises taking 15–30 minutes breaks."}, {"type": "sentence", "content": "Apparently he came up with the name because his timer was in the shape of a tomato (Pomodoro = tomato in Italian)."}, {"type": "sentence", "content": "It is not the smartest who are the most productive. Or the ones with great communication skills. Or a college diploma."}, {"type": "sentence", "content": "The most productive people are the ones who know how to manage their time the best and relentlessly execute."}, {"type": "sentence", "content": "If you’re not making the progress you hoped for, reflect on these three principals and see your life change overnight."}], "topic": "productivity"}