{"title": "How the JFK Assassination Bullets Were Digitally Preserved at NIST", "data": [{"type": "image", "content": "https://miro.medium.com/max/1706/0*cB7UoO8d2oO82N71"}, {"type": "sentence", "content": "Robert M. Thompson, Senior Forensic Science Research Manager, National Institute of Standards and Technology (NIST)"}, {"type": "sentence", "content": "They were long, round-nosed rifle bullets. Their copper metal jackets had the dull color of a worn penny, giving testimony to their age. The gun-barrel rifling impressions on their sides were typical of a bullet fired from a military weapon: four grooves and the resulting ridges called lands — all these marks twisted toward the right by the barrel’s internal rifling. Alongside the bullets were bullet fragments that revealed the contorted deformation of the lead and jacket metal when they expended a huge amount of energy upon impact."}, {"type": "sentence", "content": "These items were very typical of firearm evidence that I examined in my 30 years as a forensic scientist. However, what was not typical, and somewhat alien for me, was the setting: a secure room at the National Archives and Records Administration (NARA) in College Park, Maryland."}, {"type": "sentence", "content": "Although the fired bullets were not unusual looking, they were extraordinary historically. These were the bullet artifacts from the John F. Kennedy assassination."}, {"type": "sentence", "content": "My former crime-laboratory supervisor at the Bureau of Alcohol, Tobacco, Firearms and Explosives recommended me and our NIST forensic research team to help NARA preserve the JFK assassination bullets — by transforming them into a virtual form."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*WxNA-uU7UwD-mENC.jpg"}, {"type": "subtitle", "content": "A Bit of International and Personal History"}, {"type": "sentence", "content": "I distinctly remember where I was when I heard that President Kennedy had been assassinated in Dallas on Nov. 22, 1963. My family found out about it the next day via a Voice of America radio broadcast where we lived in West Germany. My father was in the U.S. Air Force and was stationed at a USAF-NATO airbase. I was 8 years old, and my family lived in a village just outside the base."}, {"type": "sentence", "content": "President Kennedy was revered by the German populace, primarily due to the U.S. response to East Germany building the Berlin Wall in 1961. It was typical to see his portrait in German households. Thus, the outpouring of grief was probably as strong in Germany as it was in the U.S. My own sadness was paired with the anxiety and sadness of my father and mother, who were concerned that the assassination might have been perpetrated by an enemy nation, and, if so, the NATO base where my father worked might be called upon to send out its fighter-bombers in retaliation."}, {"type": "sentence", "content": "Little did I know how intimate I would someday become with the physical objects that ended the president’s life."}, {"type": "image", "content": "https://miro.medium.com/max/2286/0*49Yv35Ss32x1ufXB.jpg"}, {"type": "subtitle", "content": "A Preservation Conundrum"}, {"type": "sentence", "content": "In addition to many other items collected during the investigations that followed the assassination, the bullet and two bullet fragments that killed Kennedy and injured Texas Gov. John Connally are housed at the National Archives in a secure and climate-controlled environment. These items are closely controlled by NARA experts, as are a bullet that the assassin Lee Harvey Oswald fired from the same rifle seven months earlier in his attempt to assassinate retired Maj. Gen. Edwin Walker and the two bullets that the FBI test-fired from Oswald’s rifle after the Kennedy assassination."}, {"type": "sentence", "content": "Researchers or investigators sometimes inquire about seeing the assassination bullets, but NARA officials rarely release them for physical examination. Instead, photographs of the bullets have been made available to researchers. However, the technology was now available for an improved means of dissemination and preservation: creating virtual copies of the bullets and bullet fragments. If the actual ballistic items were accurately measured in 3D, then the National Archives could release the virtual copies for examination without risk of damage to or loss of the originals."}, {"type": "sentence", "content": "NIST had the instrumentation and metrological expertise to produce such virtual copies — virtual copies that can be rotated on a computer screen and viewed from any angle, with detail down to the microscopic level that couldn’t be seen even if one were holding the actual bullets. But how were we to accomplish this, since it would be impossible to move our huge research microscopes to the National Archives to scan the bullets? The answer was to have NARA officials bring the artifacts to NIST and witness the measurements being carried out."}, {"type": "sentence", "content": "And that is what happened."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*UpO028dfKDSLq99w.jpg"}, {"type": "subtitle", "content": "The Work"}, {"type": "image", "content": "https://miro.medium.com/max/732/0*grEiHbhN0yr150nH"}, {"type": "sentence", "content": "Prior to the artifacts ever coming to NIST, our team carried out dry-run preparations for many weeks so that we would be well prepared for scanning the actual specimens. I had previously acquired similar ammunition and a 6.6x52 mm Carcano rifle from the firearm collection of the Bureau of Alcohol, Tobacco, Firearms and Explosives. This was the kind of rifle the assassin used in the shooting. Because I had already closely examined the actual bullets and bullet fragments at NARA, I was able to fire the Carcano rifle at the ATF forensic science laboratory in Beltsville, Maryland, to produce a similar collection of test-fired bullets and fragments. We used these items as training sets that mimicked the actual Kennedy bullets that we would be working with. Employing these samples, we refined our methods and solved instrument challenges well before the actual artifacts arrived. These early efforts would prove invaluable for the work that would ensue."}, {"type": "sentence", "content": "In addition, the NIST team designed a special apparatus made of a soft material to gently, but firmly, hold a bullet or fragment so no marks would be added to its surfaces during the 3D topography measurements."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*V9i4fGvAZUQBxmeC.jpg"}, {"type": "sentence", "content": "Initially we estimated that it would take less than two weeks to scan the forensically relevant surface areas of the assassination bullets and test-fired bullets. We based this estimate on the existing photographs of the bullets and on visual examination of the bullets. However, when the items arrived and we viewed them using a 3D surface-topography microscope, we could see that the fragments and bullets had twice the surface area we had estimated. As with many plans using cutting-edge technology, the first timeline had to be tossed, and the “few days” expanded into several months. Compounding the challenge, advances in 3D topography technology were made during this time, allowing for an even more realistic virtual capture of the artifacts. So, the NIST and NARA teams decided to carry out yet another series of scans."}, {"type": "image", "content": "https://miro.medium.com/max/960/0*4AUX5Tp-nuHWsuKF.jpg"}, {"type": "subtitle", "content": "Why NIST?"}, {"type": "sentence", "content": "The field of forensic science has recently undergone tremendous technological advances. In the field of firearm identification, which determines which gun may have fired a particular bullet, 3D surface-topography microscopes represent the next-generation way to measure the “ballistic signature” of fired bullets and cartridge cases. These measurements are subjected to powerful mathematical algorithms to numerically quantify the similarity between the marks on a crime-scene bullet imparted by the rifling of the gun barrel compared with the barrel-rifling marks on a bullet subsequently test-fired from the gun suspected to have been used in the crime."}, {"type": "sentence", "content": "Many forensic experts recognize the NIST Forensic Toolmark Analysis Project (FTAP) research team as the world’s leader in the development and validation of these techniques. It was probably because of that reputation that I was contacted by my former crime-laboratory supervisor to assist NARA in preserving the JFK assassination bullets."}, {"type": "sentence", "content": "Through the expert work of NIST’s FTAP team, NARA now possesses virtual 3D “clones” of the actual ballistic artifacts, which it has shared with the public and interested researchers without the risk of damaging or losing the originals."}, {"type": "sentence", "content": "Through NIST’s work on these bullets, we have gained knowledge and developed methods for performing 3D surface measurements on some of the most technically challenging ballistic-evidence surfaces encountered in forensic casework. We’ve already started sharing that knowledge and those new methods with the forensic science community."}, {"type": "sentence", "content": "As with any undertaking of this magnitude, several NIST scientists from across NIST’s laboratories worked together to make this project successful: namely, Brian Renegar, Alan Zheng, Hans Soons, Mike Stocker and Rick Silver. I was constantly impressed by their expertise, ingenuity, care and perseverance in what was a historic undertaking. I am proud to have taken part in it with them."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*n1wkFFtJFBEtE3Im.jpg"}, {"type": "sentence", "content": "If you’d like to learn more about the work my colleagues and I did, and also get some historical context for this unique project, check out the article “Kennedy Assassination Bullets Preserved in Digital Form” and the video below."}, {"type": "sentence", "content": "This post originally appeared on Taking Measure, the official blog of the National Institute of Standards and Technology (NIST) on May 5, 2020."}, {"type": "sentence", "content": "To make sure you never miss our blog posts or other news from NIST, sign up for our email alerts."}, {"type": "sentence", "content": "About the Author"}, {"type": "image", "content": "https://miro.medium.com/max/294/1*gMMIx6zLFOc8VwlSf45GVg.jpeg"}, {"type": "sentence", "content": "Robert M. Thompson is a senior forensic science research manager and has been with the Special Programs Office-Forensic Sciences at the National Institute for Standards and Technology (NIST) for 12 years. Mr. Thompson has a master of forensic science degree from The George Washington University and a BS in forensic science from the California State University in Sacramento."}, {"type": "sentence", "content": "Prior to joining NIST, Mr. Thompson worked as a forensic examiner with the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), the Washoe County Sheriff’s Department, the Oregon State Police, and the GeneLex Corporation. He is a court-accepted expert in several disciplines and has testified as an expert witness in numerous federal and state courts. He is a member of and presents in regional, national, and international forensic science societies. He has numerous publications in international forensic science journals."}], "topic": "science"}