{"title": "A High Resolution Glimpse Inside the Brain", "data": [{"type": "image", "content": "https://miro.medium.com/max/1400/0*xNT_19v9J6usH9UC"}, {"type": "sentence", "content": "Imagine a future where we could “see” inside the human brain at stunning high resolution, detecting the earliest signs of tumors or neurodegenerative disease. While this diagnostic technology is still a way off, researchers are a step closer, with a new 3-dimensional (3D) imaging technique that provides a window into the anatomical structures of the brain at unprecedented clarity."}, {"type": "sentence", "content": "The 3D observation and analysis of organ systems has been common practice in biomedical research for over 100 years, and continues to bridge our classical knowledge of anatomy with today’s systems biology. Optical imaging techniques often combine the use of glowing fluorescent tags, which enable researchers to view these internal structures microscopically. A stumbling block to this technique, however, is the fact that tissues are opaque — masking the fluorescent signal and diminishing the quality of the images produced. Innovative tissue-clearing chemistry aims to circumvent this problem, revealing the previously-hidden intricate architecture of anatomical structures."}, {"type": "sentence", "content": "Imaging scientists at the RIKEN Center for Biosystems Dynamics Research have developed a novel technique for imaging internal structures from specific organs to entire organisms. By first immersing biological samples in a special tissue-clearing gel, followed by incubations with a mixture of tissue dyes and fluorescently-labeled antibodies. This helps them to identify specific cell subpopulations and intricate tissue structures within organs. The scientists validated their new protocol using brains isolated from mice and marmosets."}, {"type": "sentence", "content": "The researchers reported their findings in Nature Communications, showcasing the unprecedented capabilities of their newly-developed technique. 3D renderings of scanned images from the brains of the two species revealed never-before-seen similarities in their neural vasculatures. On top of that, the team demonstrated an unprecedented method of labeling multiple molecular targets in the mouse brain simultaneously."}, {"type": "sentence", "content": "The technique was also applied to image a whole organism (an infant marmoset) as well as a small sample of a human brain, showcasing the potential for it to be used as a research or perhaps even a diagnostic tool in the future."}, {"type": "sentence", "content": "Originally published at https://www.labroots.com on May 5, 2020."}], "topic": "neuroscience"}