{"title": "Oh, What a Time to Be Alive", "data": [{"type": "subtitle", "content": "A love letter to graduates and the year, 2020"}, {"type": "image", "content": "https://miro.medium.com/max/6016/1*F6h4Kpol2kflxvQ2IK5XnQ.jpeg"}, {"type": "sentence", "content": "Dear 2020 Graduates, Students, and Comrades,"}, {"type": "sentence", "content": "In Zora Neale Hurston’s, Their Eyes Were Watching God, she wrote: “There are years that ask questions and years that answer.”"}, {"type": "sentence", "content": "There are so many questions you have right now, but in the subterfuge of questions, lies an answer. You may not have an answer today, but that’s okay."}, {"type": "sentence", "content": "In this moment, we are living and loving in The Age of Corona. “Times is hard and things are a-changin’,” but our love remains the same. While fashion effects, hair concoctions, the tap of the drum, and artificial intelligence will change style and evolve, the art of conversation and connection never shall."}, {"type": "sentence", "content": "Those triple coffee and junk-food-laden-middle-of-the-night excruciating study sessions seemed they would never end, but they did, and you’ve graduated to your next stage in life. You’ve graduated from pre-school, from a return to school, from nursing and doctoring to the front lines, from culinary school, and with diplomas, Associates, Bachelors, Masters, and Doctorates abound, juggling all that life has thrown at you. You came to get what was yours, you’ve secured the bag, and you did it in the wake of adversity and grave tragedy."}, {"type": "sentence", "content": "We enter the schoolhouse building and classroom, the edifice, not only to graduate, but to edify ourselves. There’s always some living and some learning to do and you’ll continually hone your craft as you move towards your beloved aspirations. We enter the edifice: To challenge ourselves. To make our parents proud. To make our sons and daughters and siblings proud. To do it for our ancestors. To honor our martyrs. To do it for the culture. And at times, to do it because someone said you could not."}, {"type": "sentence", "content": "In this surreal moment, take your moment. Meditate, take stock, and ruminate on your goals so that one day you will give people a reason to remember your name. We are counting on the blueprints you’ll leave behind for future generations to use for their own edification, using the intelligent and culture-shifting contributions you will undoubtedly make. This moment of sheltering and pausing is hitting us all so differently and disappointing media stories can drain our will to see beyond the pale, but your overcoming is some good news. This is some very good news with a good story."}, {"type": "sentence", "content": "Aren’t we all so grateful to you content creators who keep us laughing with your Instagram Lives, TikToks, free fitness classes, and meditations? It is in the smiling that we release baggage, tension, and our full selves to the onlooker. I’m a broken record in my classroom when I say it, but it’s true, we gotta laugh to keep from cryin’. Iyanla Vanzant says to hug each other, because if we don’t hug each other, we’ll get ugly. That’s true, too. Yet, we are fighting the ugly and creating new ways to virtually hug up on each other because we miss each other. We miss touch. We miss connecting through eyes. Still and all, the emotions are there, yet we figured out a Band-Aid for the meantime, in between time, that ensures our connection endures. In this year, you would’ve been covered and dripping in hugs, leis, and love, but the thing is, you still are, because our love don’t have to change, as John Legend beckons."}, {"type": "sentence", "content": "Becoming intimate and overcoming your emotions is your strength right now. Sometimes, I find it quite nice, quite revealing to sit in a feeling — no matter how happy — no matter how melancholy. Sitting in a feeling makes it familiar so you know what to do with it when it arrives again. And trust, it will arrive again. You learn how to move through it — closer to your dreams. And after you’ve sat with it, you’re either casting it away or using it as your amulet. That is your power now — the endurance and courage you have displayed to rise up and pull out all the stops — all things considered — in the midst of it all."}, {"type": "sentence", "content": "When I finished my college degree, one of my best friends, Shanelle, was a co-chair on the African Graduation planning committee and our class voted on Goapele’s, “Closer,” for our recessional."}, {"type": "sentence", "content": "Her name, Goapele, signifies moving forward."}, {"type": "sentence", "content": "For so many moments in life, I’ve returned back to those transcendent words in “Closer.” I hope it provides some refuge for you, too. Truly, we’re always journeying aren’t we: careening, crashing, wafting, upending, and rising all over again, no? You’ve been launched into a spinning spiral it may seem, yet you are still closer to your dreams. This is not a dream deferred; it is just different than you imagined. Your Senior Week looks differently, you’ve danced to DJ D-Nice, Doja Cat, and Dua Lipa in your makeshift living room proms, and the day of pomp and circumstance with boisterously proud family members shouting your name with blasting horns from the rafters, no matter the annoyed gazes, is not your exact story, but perhaps…"}, {"type": "sentence", "content": "You’ve got something else — a story to tell, a mythology, a tale of endurance, a hero’s journey, your golden goblet and fleece, and a piece of history — that will last you a lifetime. This is not your swan song, it is still your rite of passage."}, {"type": "sentence", "content": "This is your story."}, {"type": "sentence", "content": "You get to mark it for yourself and make it mean something. And isn’t that something so very grand? And do understand, this is not an altruistic sermon or hard advice, but a morsel of food, for thought. These are not the sagest words because I am not yet the eldest. I am journeying with you, but I’ve picked up a few things along the distant years from my college graduation. One of those pickings to consider, “One monkey don’t stop no show,” as my Bigmomma has told me when I’ve had to come to terms with abrupt realities."}, {"type": "sentence", "content": "Honor yourself because you’ve completed what you thought was unthinkable. So, for what it’s worth, I say: Oh, what a time to be alive. You are not only a witness, but you are completing your dreams and graduating in a historical moment in the making."}, {"type": "sentence", "content": "You, we, and me, are in the making."}, {"type": "sentence", "content": "We joke that the year has been cancelled and to throw the whole thing away, but really, the year’s just been diverted. It’s still here, and sadly some of us are not, but thankfully many of us are. This year, 2020, is a year that is asking us all some hard, hard questions, providing the litany and rhetorical essay on our humanity. I so look forward to the culture and world you create when you fill in the blanks of the forthcoming years — with the answers."}, {"type": "sentence", "content": "And with that, adieu, happy commencement, and so very many congratulations."}, {"type": "sentence", "content": "Onward, and upward, Professor M.A. Brock"}], "topic": "education"}