{"title": "The Two Ways To Grow Your Audience: Do More or Do Less", "data": [{"type": "subtitle", "content": "How to figure out which holds you back and what to do about it."}, {"type": "sentence", "content": "I know why you struggle to grow an audience."}, {"type": "sentence", "content": "It’s one of the following two things:"}, {"type": "sentence", "content": "Based on the thousands of conversations I’ve had over the years with creators of all types, I’ve realized every creator who struggles to attract an audience falls into one of those two categories."}, {"type": "sentence", "content": "But that leads to two obvious questions:"}, {"type": "sentence", "content": "How do you figure out which problem you have and what can you do to solve it?"}, {"type": "sentence", "content": "You’re about to find out…"}, {"type": "subtitle", "content": "Why Not Doing Enough Is A Problem"}, {"type": "sentence", "content": "Let’s start with the most common reason creators struggle to grow their audience — they don’t do enough."}, {"type": "sentence", "content": "This issue can take many different forms."}, {"type": "sentence", "content": "Maybe you don’t create enough things, maybe you don’t share enough of your creations with the public, or maybe you don’t spend enough time on your work."}, {"type": "sentence", "content": "But the root problem and its solutions are the same."}, {"type": "sentence", "content": "Not doing enough stunts your audience growth for several reasons."}, {"type": "sentence", "content": "You need reps to get better."}, {"type": "sentence", "content": "Your 10th screenplay will be better than your first."}, {"type": "sentence", "content": "If you play guitar every day, you’ll be better than if you play once a week."}, {"type": "sentence", "content": "The more you use Twitter, the better you’ll get at Twitter."}, {"type": "sentence", "content": "Improvement depends on doing. And doing a lot."}, {"type": "sentence", "content": "You need data to iterate."}, {"type": "sentence", "content": "The more you “do,” the more information you get about what resonates with an audience and what doesn’t."}, {"type": "sentence", "content": "This data can inform future creations and speed up improvement."}, {"type": "sentence", "content": "The more you do, the more data you get, the more you learn what your audience wants, and the better you’re able to deliver it to them."}, {"type": "sentence", "content": "You can’t predict what’s going to work."}, {"type": "sentence", "content": "You need swings of the bat."}, {"type": "sentence", "content": "The more shots you take, the greater your chance of success."}, {"type": "sentence", "content": "If you release one thing a month, you’re only taking 12 shots a year."}, {"type": "sentence", "content": "Not enough."}, {"type": "sentence", "content": "Assuming you can now see why you need to “do” a lot to grow your audience, it leads to another obvious question:"}, {"type": "sentence", "content": "How do you know if you’re not doing enough?"}, {"type": "subtitle", "content": "Signs That You’re Not Doing Enough"}, {"type": "sentence", "content": "If you’re not getting better, you’re not doing enough."}, {"type": "sentence", "content": "If your work isn’t consistently improving, you’re not doing enough of it."}, {"type": "sentence", "content": "No matter what you make, you’ll improve if you create enough of it."}, {"type": "sentence", "content": "You may not become great, but you’ll become better."}, {"type": "sentence", "content": "If you’re not doing it every day, you’re not doing enough."}, {"type": "sentence", "content": "Audience growth is a DAILY pursuit."}, {"type": "sentence", "content": "You don’t need to publish something to the world every day, but you need to work on your craft in some way every day."}, {"type": "sentence", "content": "Even if it’s just learning and studying others."}, {"type": "sentence", "content": "If you don’t have a consistent schedule, you’re not doing enough."}, {"type": "sentence", "content": "Release a video every Monday."}, {"type": "sentence", "content": "Publish a newsletter every Thursday."}, {"type": "sentence", "content": "Build a habit."}, {"type": "sentence", "content": "Consistency is key to audience growth and if you can’t hold yourself to a schedule, you’re not doing enough."}, {"type": "sentence", "content": "If the above signs of not doing enough sound familiar, don’t worry —here are three specific steps you can take to do more."}, {"type": "subtitle", "content": "How To Do More"}, {"type": "sentence", "content": "Measure output, not outcomes."}, {"type": "sentence", "content": "You can’t control the growth of your audience, but you can control the volume of your output."}, {"type": "sentence", "content": "Commit to a daily blog post."}, {"type": "sentence", "content": "Or the release of a weekly song."}, {"type": "sentence", "content": "Or to email your creation to 5 people a day who you think will enjoy it."}, {"type": "sentence", "content": "Judge yourself on what you make — not on what you get from what you make."}, {"type": "sentence", "content": "Keep it 💯."}, {"type": "sentence", "content": "This has nothing to do with that saying or the emoji."}, {"type": "sentence", "content": "It’s a reference to two concepts I’ve previously shared that are both systems designed to help you increase your production, consistency, and resilience."}, {"type": "sentence", "content": "My 100 in 100 content plan is a step-by-step strategy you can follow to publish 100 pieces of content in 100 days. Don’t get scared — it’s easier than it sounds."}, {"type": "sentence", "content": "My 100x Method is a simple structure that explains how you’ll benefit from only doing things that you’re willing to do 100 times."}, {"type": "sentence", "content": "You can find links to details on both strategies at the bottom of this post in the related resources."}, {"type": "sentence", "content": "Make a public promise."}, {"type": "sentence", "content": "When you decide to “do” more, tell people."}, {"type": "sentence", "content": "Announce you’re going to blog every day, release 10 weekly episodes of a podcast, or whatever you’re setting out to do."}, {"type": "sentence", "content": "Tell your friends, family, followers, and enemies. Or team up with another creator who’s setting out to do something similar."}, {"type": "sentence", "content": "Put a stake in the ground you have to live up to — the harder you make it for yourself to quit, the less likely you’ll be to do so."}, {"type": "sentence", "content": "Accountability works."}, {"type": "sentence", "content": "The above advice should be plenty to help you identify if you’re not doing enough and take action to correct that issue and start to grow your audience."}, {"type": "sentence", "content": "But…"}, {"type": "sentence", "content": "What if your problem isn’t that you do too little, but rather that you’re doing too much?"}, {"type": "sentence", "content": "Don’t worry, I’ve got you covered on that front too."}, {"type": "subtitle", "content": "Why Doing Too Much Is A Problem"}, {"type": "sentence", "content": "If you’re motivated, hard-working, and put out a ton of work but still struggle to grow your audience, the chances are you’re doing too much."}, {"type": "sentence", "content": "Here’s why…"}, {"type": "sentence", "content": "The more you do, the less well you do it."}, {"type": "sentence", "content": "You have limited time, effort, and resources, so each additional “thing” takes those elements away from other things."}, {"type": "sentence", "content": "The more you do, the more difficult it becomes to promote yourself."}, {"type": "sentence", "content": "Let’s say someone watches your video and enjoys it."}, {"type": "sentence", "content": "What are you asking them to do at the end of the video?"}, {"type": "sentence", "content": "If you ask them to follow you on six platforms, post a comment, tag a friend, join your email list, and call your mom, do you know what they’ll do?"}, {"type": "sentence", "content": "Nothing."}, {"type": "sentence", "content": "The less you ask your audience to do, the more likely they are to do it."}, {"type": "sentence", "content": "This also means the less you do, the more successful your promotional efforts will become."}, {"type": "sentence", "content": "To help you wrap your head around this, check out my One-Action Strategy outlined in one of the links at the bottom of this post in the related resources."}, {"type": "sentence", "content": "The more you do, the more confusing it is for an audience or industry to “get” what you do."}, {"type": "sentence", "content": "You paint, sing, write novels, and do stand up comedy."}, {"type": "sentence", "content": "Good for you."}, {"type": "sentence", "content": "But…"}, {"type": "sentence", "content": "If you don’t have a clear main “thing,” it makes it difficult for others to spread the word about you and tougher for your audience to grow."}, {"type": "sentence", "content": "As someone who often does too much myself, I’ve suffered from this scenario."}, {"type": "sentence", "content": "I once had someone tell me they loved my work, but had no idea who to recommend me to or how to list me in their recommended vendors book."}, {"type": "sentence", "content": "That’s not good."}, {"type": "sentence", "content": "Now let’s talk about how to figure out if you’re doing too much."}, {"type": "subtitle", "content": "Signs That You’re Doing Too Much"}, {"type": "sentence", "content": "If you’re missing self-chosen deadlines, you’re doing too much."}, {"type": "sentence", "content": "If this happens, you’re probably overextending yourself."}, {"type": "sentence", "content": "It’s not hard to make a video once a week if that’s all you do."}, {"type": "sentence", "content": "But it’s REAL hard to do so if you also create 20 other things every week."}, {"type": "sentence", "content": "If you don’t have a single main goal, you’re doing too much."}, {"type": "sentence", "content": "If getting more YouTube subscribers, email list subscribers, website page views, and customers are of equal importance to you, then you’re doing too much."}, {"type": "sentence", "content": "Pick one thing that matters most."}, {"type": "sentence", "content": "Optimize accordingly."}, {"type": "sentence", "content": "If you’re doing a lot but not building any momentum, you’re doing too much."}, {"type": "sentence", "content": "Focused effort builds momentum."}, {"type": "sentence", "content": "The creative process gets easier, quality gets better, and your audience gets more engaged."}, {"type": "sentence", "content": "If that’s not happening, you’re spread too thin."}, {"type": "sentence", "content": "So what do you do once you realize you’re doing too much?"}, {"type": "subtitle", "content": "How To Do Less"}, {"type": "sentence", "content": "Make a list of what’s working, what you love doing, and what’s truly creating value for your audience and yourself."}, {"type": "sentence", "content": "Stop doing everything that’s not on that list."}, {"type": "sentence", "content": "Seriously."}, {"type": "sentence", "content": "At least hit the pause button on it. You can always go back to it at a later point."}, {"type": "sentence", "content": "I made a list of what created value for me and my audience a couple months ago and it made a huge difference."}, {"type": "sentence", "content": "I cut everything except these things:"}, {"type": "sentence", "content": "It was life changing."}, {"type": "sentence", "content": "Pick one or two social media platforms to use and ignore the rest."}, {"type": "sentence", "content": "You may think you get value out of using six platforms, but the truth is you’d get more value out of using less."}, {"type": "sentence", "content": "Because it will free up time to focus on them and build relationships on them."}, {"type": "sentence", "content": "It’s fine to have profiles on all the platforms (and you should), but only actively post on a couple at most."}, {"type": "sentence", "content": "I did this back in March and decided to focus on my personal Twitter account only."}, {"type": "sentence", "content": "Here’s what’s happened since then (and we’re only 20 days into May!):"}, {"type": "sentence", "content": "Dive deeper."}, {"type": "sentence", "content": "Rather than focus on creating quantity, cut back on the volume and increase the quality."}, {"type": "sentence", "content": "Instead of a daily 1-minute video, what would happen if you made a weekly 5-minute video?"}, {"type": "sentence", "content": "Chances are as the quantity of your output drops, the quality will rise."}, {"type": "sentence", "content": "And that quality will lead to more audience growth than the quantity."}, {"type": "sentence", "content": "(Reminder: This advice is for creators who are doing too much, not the ones who use “quality” as an excuse to not do enough.)"}, {"type": "subtitle", "content": "The next steps are up to you."}, {"type": "sentence", "content": "So there you have it — my take on the only two things that could prevent you from building the audience you want."}, {"type": "sentence", "content": "Whether you decide you’re not doing enough or doing too much, you can adjust accordingly and you will see progress."}, {"type": "sentence", "content": "You just have to decide to do it (or stop doing it)."}, {"type": "sentence", "content": "Good luck."}, {"type": "sentence", "content": "Get more tips on how to produce, promote, and profit from your creations:"}, {"type": "sentence", "content": "Join the 25,000 people who get my For The Interested newsletter."}, {"type": "subtitle", "content": "Related Resources:"}], "topic": "marketing"}