{"title": "There Are Always a Million Distractions. Here’s How to Silence the Noise and Pay Attention.", "data": [{"type": "image", "content": "https://miro.medium.com/max/5000/0*jcGqvreh48jixsm1"}, {"type": "subtitle", "content": "Interruptions are the enemy of productivity."}, {"type": "sentence", "content": "It just may be the crime of the century. Our minds, thoughts and chief productivity tool — attention — are being stolen by a thief operating with absolute impunity: incessant, unbounded interruptions. An ever-growing volume of intruders — e-mail, texts, apps, phone calls, social media alerts — combined with assaults from increasingly time-panicked humans, are leaving few places safe for chirp-, chime- or ding-free concentration."}, {"type": "sentence", "content": "Information overload, which includes the recovery time from unnecessary interruptions, cost the U.S. economy $997 billion in 2010, according to Overload!: How Too Much Information is Hazardous to your Organization by Jonathan B. Spira. An Intel study found that lost productivity from information overload alone would cost $1 billion per year for a company its size."}, {"type": "sentence", "content": "Chronic intrusions shrink attention spans, drive stress by burning up mental and emotional resources and trigger mistakes. An interruption averaging 2.8 seconds — say, one of those blinking notifications in the corner of your computer screen — can double the risk of error, a study by researchers at Michigan State University and the U.S. Naval Research Laboratory found. Increase the duration of the interruption to 4.4 seconds, and you triple the chance of a mistake."}, {"type": "sentence", "content": "Interruptions play havoc with working memory, and they undermine intellect. A study that measured the effects of forced interruptions on resident surgeons performing a simulated laparoscopic cholecystectomy (gallbladder removal) found that surgical mistakes occurred 44 percent of the time with the distractions, and only about 6 percent without. Interruptive questions triggered the most errors, followed by sidebar conversations."}, {"type": "sentence", "content": "There’s a reason airline pilots have mandatory no-interruption zones just before takeoff and landing: Federal regulations prohibit any activity — from nonessential conversations with crew or others in the cockpit to reading nonessential publications — that could distract a pilot during critical phases of the flight."}, {"type": "sentence", "content": "So, what are the main sources of intrusion, how do they affect us, and what can be done to curb them?"}, {"type": "subtitle", "content": "Digital Disturbances"}, {"type": "sentence", "content": "The average businessperson receives and sends about 109 e-mails per day, and that rate is growing each year by 7 percent, according to studies by technology market research firm The Radicati Group. Instant messages are increasing 11 percent, and texting, once confined to the nonwork realm, is bombarding offices, with 67 percent of professionals saying they text for business, according to messaging service HeyWire Business. How interruptive is this? Mobile Marketing Association reports that 90 percent of all texts are read within three minutes."}, {"type": "sentence", "content": "“It’s a huge problem,” says Dr. Edward Hallowell, a Massachusetts psychiatrist and co-author of Driven to Distraction, which chronicles the siege on attention. “It’s the newest addiction. There are in-patient centers now for people with technology addiction. Marriages break up.”"}, {"type": "sentence", "content": "“There’s a thrill to it,” adds Winifred Gallagher, author of Rapt: Attention and the Focused Life. “Your texts and e-mails are like video games. There’s a stimulus and rewards.”"}, {"type": "sentence", "content": "The surge of texts and social media notifications in recent years may be leading to a tipping point of terminal distraction and always-on availability. Michael Salem, co-founder and CEO of Vorex, a Plano, Texas-based provider of cloud-based professional services automation software, says he gets 1,000 messages per day. “I’m overwhelmed,” he admits. “Responding is a daily thing, 24 hours a day.” For a while, he says, he barely slept, taking calls from global users of his product from his bed. His health started to suffer; he gained weight and became anxious from the never-ending assault."}, {"type": "sentence", "content": "“I counted recently,” says Matthew Bellows, CEO of Boston-based Yesware, an e-mail productivity service for salespeople. “I have 22 inboxes, from e-mail to LinkedIn. The idea that I’m supposed to monitor and troll through these is absurd. I get hundreds of e-mails a day. Interruptions and distractions are the biggest drain on productivity for the modern office worker.”"}, {"type": "subtitle", "content": "The Battle in the Brain"}, {"type": "sentence", "content": "The volume of intrusions today is unsustainable by any metric: productivity, engagement, physiology or common sense. So what can we do about it? The first step is to understand the impact of constant interruptions on our brain neurons."}, {"type": "sentence", "content": "Out of all the things your brain could focus on right now, your attention at this moment is on this sentence. This is because you are implementing what’s known as top-down attention, in which you choose what to take note of. You set the terms of engagement, giving you control and concentration — that is, if you can block out the distractions of the other kind of attention: bottom-up, which is dictated by something or someone else. Bottom-up attention is part of our survival equipment. When you hear a siren or a car backfire, your attention instantly shifts to the potential threat. The cavalcade of electronic noisemakers — e-mails, texts, IMs, phone calls, notifications — are all bottom-up intruders. They arouse defenses and hijack concentration."}, {"type": "sentence", "content": "It’s a battle that’s daunting but winnable. “You are the boss of what’s in your head,” Gallagher points out. “Attention is a tool, and you can take charge of it. It’s a matter of knowing when you want to use your top-down attention, and then you have to suppress the bottom-up stimuli. Otherwise, you become a victim of stimuli.”"}, {"type": "sentence", "content": "Interruptions trigger detours that tax working memory and increase the time it takes to accomplish tasks. When an intrusion occurs, “it sets off a chain of random events, with people switching activities,” explains Gloria Mark, professor of informatics at the University of California, Irvine, and co-author of a study on the subject. On average, she says, “you work on two intervening tasks before you get back to the original task.” For example, you might be at work on a marketing project one minute, then shift to an e-mail from a customer, then off on a trip to LinkedIn."}, {"type": "sentence", "content": "Mark followed 35 managers, engineers and project leaders for three days. She found that the average time people spent on a single task before being interrupted or switching to something else was a whopping three minutes. The amount of time they worked on a device before switching was two minutes, 11 seconds."}, {"type": "sentence", "content": "The interruption blitz is held in place by fallacies that the human brain is an inexhaustible well that can be crammed with an unlimited amount of information, perform multiple functions simultaneously and switch tasks without decrease in output. The shocking truth is that our gray matter has limits, from working memory to data volume to neural channels that permit us to perform only one high-cognitive task at a time."}, {"type": "sentence", "content": "Interruptions undermine effortful control, which reflects the ability to regulate impulse control. The more interruptions one has, the more they erode the self-regulation equipment. Feel like you have to check your e-mail even though you just checked it five minutes ago? That’s your impulse control and attention span on the blink. Interruptions shred the ability to self-regulate everything from checking e-mail to consuming Häagen-Dazs or Jack Daniel’s."}, {"type": "sentence", "content": "This is why technology is so addictive. It can destroy the ability to control impulsivity, which means more frequent message checking and web browsing and shorter attention spans. That, in turn, leads to more distractibility and less ability to see tasks through to completion — exactly the sort of symptoms psychiatrist Hallowell began to see in the ’90s in patients who thought they had attention-deficit disorder."}, {"type": "sentence", "content": "But people with true ADD are born with the condition. So Hallowell’s patients’ fractured attention was a byproduct of something else — an affliction that mimics ADD, set off by interruption and information overload “filling our heads with a cacophony of mental noise” until the brain “loses its ability to attend fully and thoughtfully to anything,” Hallowell notes in Driven to Distraction. He dubbed the condition “attention deficit trait.”"}, {"type": "sentence", "content": "Once high-producers, people with this condition flit from one thing to the next and find themselves falling behind in their work, which in turn increases time panic and anxiety as they try to catch up. Thus the constant disruptions feed a fear of being overwhelmed and not being able to cope, a signal to the ancient brain to set off the stress response."}, {"type": "sentence", "content": "“I can feel my heart racing,” says Karen Swim, who launched her Sterling Heights, Mich.-based public relations firm, Words For Hire, 10 years ago. She used to be able to manage the electronic flood, but she says the increase in texting over the last couple of years has pushed her coping resources over the edge. “There are days when I feel I have to stop and breathe. It feels like you’re on a treadmill that keeps speeding up, and you can’t keep up.”"}, {"type": "subtitle", "content": "The No-interruption Zone"}, {"type": "sentence", "content": "Everyone knows the volume of intrusions is counterproductive, but attempting to moderate the flow strikes fear in the hearts of business owners and managers. It shouldn’t."}, {"type": "sentence", "content": "More entrepreneurs would crack down on interruptions if they knew how much it was costing them, says Dan Adams, CEO of Woburn, Mass.-based New England Network Solutions, which provides computer services to small and midsize companies. “Business owners don’t know how much time is being lost to these distractions,” says Adams, who installs firewalls to track and monitor internet and social media use."}, {"type": "sentence", "content": "As relentless as the siege is, entrepreneurs and employees don’t have to throw up their hands. There is a range of tools available to control the onslaught and improve productivity."}, {"type": "sentence", "content": "Strategies range from curbing e-mails to limiting personal pop-ins from colleagues. U.S. Cellular, Intel and professional-services giant Deloitte are among large firms that have attempted no-e-mail days — not mandating a complete shutdown of electronic messages, but encouraging in-person or voice communication, especially among co-workers — which may cut down on unnecessary distractions."}, {"type": "sentence", "content": "“Without uninterrupted time you can’t listen to someone, write good code or think,” says Yesware’s Bellows, who once spent a year at a Buddhist retreat meditating for hours a day. “Those tasks take concentration and focus that is quickly taken away by devices.”"}, {"type": "sentence", "content": "Bellows is trying to stem the tide of interruptions. Instead of interrupting one another with questions, Yesware employees send messages via a HipChat.com intranet page that colleagues can review on their own time, when they have a break in the action. Bellows blocks out uninterrupted time on his calendar to think, urges everyone to close laptops and not check messages during meetings and reads and responds to his e-mail in designated chunks a few times a day."}, {"type": "sentence", "content": "The latter strategy in particular can dramatically reduce interruptions. If your e-mail automatically checks and feeds you messages every five minutes, that’s a potential of 96 interruptions over an eight-hour day. However, if you manually check it every 45 minutes, that cuts the total to 11. Researchers at Oklahoma State University say the most productive checking schedule is four times per day. UC Irvine’s Mark recommends that you plow through as much e-mail as you can in three scheduled periods per day; the rest of the time, it should be turned off."}, {"type": "sentence", "content": "Other interventions aim to block off no-interruption zones. Leslie A. Perlow, Konosuke Matsushita professor of leadership at Harvard Business School, developed the “quiet time” program, which walls off all intrusions during certain times of the day."}, {"type": "sentence", "content": "She deployed the method at a software company whose engineers were having trouble creating products without working nights and weekends. After a period of investigation, Perlow discovered that the engineers were being interrupted so often they didn’t have time to think and couldn’t get enough done during regular hours. With everyone falling behind schedule, a crisis mentality developed, in which people felt entitled to interrupt anyone at any time."}, {"type": "sentence", "content": "Perlow’s solution was to set aside a certain portion of the day, before 11 a.m. and after 3 p.m., for uninterrupted work. (Normal interruptions could take place during that four-hour window.) The results: 59 percent of engineers reported that their productivity increased in the morning interruption-free zone, and 65 percent said the same for the afternoon. With heads cleared, 41 percent even reported that their productivity jumped during the interruption portion of the day."}, {"type": "sentence", "content": "Harman Singh likes the idea of quiet time. The founder and CEO of WizIQ — who gets upward of 200 messages each day — says he’s been thinking about the need for rules to control the flood at his online education company. “It’s gotten crazy,” he says. “I don’t get enough time to think. It’s a menace.”"}, {"type": "sentence", "content": "His most frustrating distraction: mobile messaging via WhatsApp. He has considered getting off the app but is concerned about how investors who contact him that way might react. As with most thoughts of managing interruptions, there is fear. Would they respect boundaries? But Singh believes that ultimately his investors would rather have him engaged in productive thought and running his company than buried in social media and needless communication."}, {"type": "subtitle", "content": "One Thing at a Time"}, {"type": "sentence", "content": "It’s not just others who are at fault; 44 percent of interruptions are self-inflicted, according to Gloria Mark, professor of informatics at the University of California, Irvine. The self-distraction habit has plenty of causes, but there’s one problem at its root: multitasking."}, {"type": "sentence", "content": "As studies at the University of Michigan and Vanderbilt University have detailed, you may think you are accomplishing two tasks simultaneously when you’re talking on the phone and writing an e-mail at the same time, but you’re not. You are switching back and forth — and self-interrupting. Each time you switch, it takes time for the brain neurons to figure out where they left off on that task, slowing performance by 50 percent or more, according to University of Michigan psychology professor David Meyer."}, {"type": "subtitle", "content": "Focus, People!"}, {"type": "sentence", "content": "The answer to the interruption gauntlet is simple: boundaries. Without them there is anarchy, like a city without traffic lights. Boundaries restore order to an unmanaged world. Sensible perimeters on electronic and human interruptions allow for space to think and marshal concentrated effort. With focus, you accomplish more in less time."}, {"type": "sentence", "content": "Here are a few interruption-management strategies to help block out distractions and build attention."}], "topic": "productivity"}