{"title": "I Never Thought I’d Write a Love Song", "data": [{"type": "subtitle", "content": "Life can change forever in a moment. (Fiction Friday)"}, {"type": "sentence", "content": "Clara sat on the porch, making a daisy chain. The lake was in front of her, glittering with the morning summer sun."}, {"type": "sentence", "content": "“All finished,” she murmured, picking up her cutesy notepad––the sacred place where she drew up ideas in some form or another. “Spring came early again this year.”"}, {"type": "sentence", "content": "With that thought, she clammed."}, {"type": "sentence", "content": "Remembering the past spring made Clara’s stomach turn somersaults. She had gone to a party filled with classmates she didn’t know, appeasing her sentimentality."}, {"type": "sentence", "content": "It had been the end of her last college year, with time mostly spent being a shut-in. Of course, there were fantastical things about being alone––excellent grades and time to sew as many vintage-style dresses as she wanted––but for every hour of enjoyment, there were two hours of staring at the ceiling, filled to the brim with a rare sense of unbearable loneliness that stalked and lingered like a villain."}, {"type": "sentence", "content": "After endless minutes of pacing, biting her nails, and trying not to burn her fingers while curling vanilla tresses with shaking hands, Clara left her room and headed towards the blaring music on campus."}, {"type": "sentence", "content": "Once she opened the door, lights flashed in shades of flowered purples and wine-colored reds."}, {"type": "sentence", "content": "The walls began to close in on Clara, causing her to sweat and breathe with a quickened shudder. She stopped at the base of a staircase, her skin plagued with goosebumps and her brain fizzed."}, {"type": "sentence", "content": "I haven’t spoken to anyone here since the fall, she thought, trying to hide her face within the banisters, I shouldn’t have come. Seriously, no one’s gonna even know who I am, and it’s all my fault."}, {"type": "sentence", "content": "She caught sight of someone––a mystery girl Clara wished she was like––personable, well-liked…a social butterfly in every sense of the word. Everyone clamored for the green-eyed girl’s attention."}, {"type": "sentence", "content": "Looking away, Clara buried her head between her knees. In five minutes, I’m outta here. I’m so tired of––"}, {"type": "sentence", "content": "“Whoa! I’ve always wanted a dress like that…”"}, {"type": "sentence", "content": "“Huh?!” Clara yelped, thoroughly petrified."}, {"type": "sentence", "content": "“Sorry…I, uh, didn’t mean to scare you. I’m Senna,” She said with cool confidence, waving with a small wink that could charm a deadly snake, “are you from the sister school?”"}, {"type": "sentence", "content": "D-Did she notice me staring?! “C-Clara,” she stuttered with a gulp, staring down at her flowered dress. “And no…I go here.”"}, {"type": "sentence", "content": "Nodding her head slowly, Senna smiled, “Well, anyway, cool dress! Where’d you get it?”"}, {"type": "sentence", "content": "“I–I actually made it myself.”"}, {"type": "sentence", "content": "Green eyes widening, Senna spoke a little softer, “Seems like no one makes their clothes anymore. Weird…”"}, {"type": "sentence", "content": "Clara felt tears swell up."}, {"type": "sentence", "content": "“Weird in a good way! Can you teach me how to make something like this?” Senna whipped out her phone, showing Clara a beautifully-embroidered jacket."}, {"type": "sentence", "content": "Blinking and gently peering at the picture, Clara scratched the back of her head, “Y-You actually wanna make it? Why not just buy it?”"}, {"type": "sentence", "content": "“I don’t know…maybe ’cause it would be special if I made it myself. Isn’t that why you make clothes?”"}, {"type": "sentence", "content": "Her heart swelled, “Yeah…I-I have a sewing machine in my room! I-If you want to borrow it.”"}, {"type": "sentence", "content": "“Sure! I have an exam tomorrow morning, so can I come over in the afternoon?”"}, {"type": "sentence", "content": "Clara nodded."}, {"type": "sentence", "content": "They exchanged numbers, and Clara left the party earlier, racing back to her dorm, scribbling down lyrics and piano chords that flowed through her brain and sparked a sense of joy not felt in years:"}, {"type": "sentence", "content": "I never thought I’d write a love songBut my heart grows when I see your faceMy mind becomes too strong to breakA daisy in the springThe wind taking me awaybut I’m no longer yearning…for something I thought I’d have to fake…"}, {"type": "sentence", "content": "Tears fell, staining the pages and causing the ink to bleed, and soon thereafter, Clara slept soundly for perhaps the first time that year."}, {"type": "sentence", "content": "In a flash, the lake was in front of Clara again, and she stared down at what she had just written."}, {"type": "sentence", "content": "If I had never gone…we would have never met, Clara had scribbled on her little bear-themed notepad, gazing at Senna, who sat next to her in the spring breeze in her new jacket of blues and reds."}, {"type": "sentence", "content": "The feeling scared her and warmed her heart all at the same time. She almost let her fear control her and take away something dear."}, {"type": "sentence", "content": "The pair smiled, and the daisy chains adorning their heads like crowns never wilted."}], "topic": "fiction"}