{"title": "How the illusion of an objective reality creates time travel paradoxes", "data": [{"type": "subtitle", "content": "Quantum information theory resolves the grandfather paradox but questions our belief in an objective reality."}, {"type": "image", "content": "https://miro.medium.com/max/792/0*jsKruKpLD543ieXs.jpg"}, {"type": "sentence", "content": "While quantum mechanics has been one of the most successful theories of all time, much of its description reflects the philosophy of one man in particular, the great Niels Bohr, the Danish physicist who helped found it. Bohr believed in a single, objective reality where human observation and interaction were responsible for determining that reality. He opposed Albert Einstein famously who did not want human involvement in reality at all. Einstein wanted all reality to be set in stone eternally. Bohr was more flexible, but he still imposed his classical notion that there could be only one reality shared by all people. Quantum information theory, however, has proven that not to be the case. Instead it had shown that Bohr’s philosophy is inconsistent with experiment and that objective reality is an illusion."}, {"type": "sentence", "content": "Recent quantum experiments have shown that the paradoxes Bohr’s philosophy introduces into time travel, for example, are resolved at the expense of having a single reality. These paradoxes include the grandfather paradox in which a time traveler prevents her own birth by traveling back and killing her own grandfather. A less bloody version can be done with particles that shows that quantum information theory must move beyond Bohr to understand time travel. In this article I discuss the two possible interpretations: the Many Worlds of Everett and David Deutsch and Quantum Bayesianism which is the quantum successor of the philosophy of Frank Ramsey pictured above."}, {"type": "sentence", "content": "Popular culture has been divided on the question of time travel from Star Trek and Back To The Future to DC’s Legends of Tomorrow. One of my favorite series to read as a child were the Time Traveler books. They were a great way to learn about history. Similar to Choose Your Own Adventure books, they had one twist. You were a time traveler and there was, usually, no way to die in them. Instead, if you were ever in danger, you could always jump away to another time. This would often lead to your jumping to a part of the book you’d already read, but you had the opportunity to make a different choice than you did last time. They were a lot like a maze where you could always back track but also end up going in circles. Since the novels were historical, you often interacted with historical figures. Usually, your quest was to determine some lost historical fact. Interfering in history was prohibited and you would often be forced to jump away in time if you were ever likely to change the past. After all, you wouldn’t want to change the future. Or would you?"}, {"type": "sentence", "content": "Time travel is replete with paradoxes, however. The most notorious is the “grandfather” paradox which I have mentioned above. As long as time is seen as a one-way street of cause preceding effect, such paradoxes will arise. As soon as effect precedes cause, it seems, you can have contradictions. Quantum experiments have already shown that effect can precede cause. Therefore, we already, to some extent, live in the era of time travel paradoxes, but it doesn’t look anything like we might have imagined in fiction. Instead, what we get is an indefinite causal order where we cannot say if effect preceded cause or cause preceded effect. This means that paradoxes are resolved, not by enforcing causal order, but by hiding it."}, {"type": "sentence", "content": "When causal order is clear, grandfather paradoxes are observed. While we may not be able to send people back in time, we can place particles that cause paradoxes in quantum superposition. As experimenters showed in 2014, Closed-Timelike Curves (CTCs) can be simulated in quantum informatic experiments. In their experiment, they simulated a particle going back in time and flipping a quantum switch which causes the machine that generates it not to generate it. This paradoxical situation, they showed, is possible because the state of the particle being emitted or not and the machine producing it or not have a probablistic state, not fully true or false but half true and half false."}, {"type": "sentence", "content": "While CTCs seem to have more to do with General Relativity and Einstein’s theories than quantum information, General Relativity has an enforced causal order while quantum mechanics does not. Quantum information travels back and forth in time regularly, but it travels under a cloak of probabilistic wavefunctions that allow events to be true and false at the same time. This is why such paradoxes can both exist and be resolved. If you are both not born and born, then you can easily go back and kill your grandfather because he will be both dead and alive. It is very much the case of Schroedinger’s cat having matricidal kittens."}, {"type": "sentence", "content": "Problems with the resolution of the paradoxes arise, however, when you replace a particle with a conscious being. These problems go back to Niels Bohr and the founding of quantum mechanics when it was believed that sentient lifeforms have a special place in the quantum universe, causing universal wavefunction collapse when they observe the outcomes of quantum experiments. A human being in a CTC, according to this notion, could not be in superposition, and, hence, the grandfather paradox would be unresolved."}, {"type": "sentence", "content": "While Bohr, one of the fathers of quantum mechanics, championed the idea that reality was objective and shared by everyone, experiments have implied that he was wrong. These experiments attempt to resolve the Wigner’s Friend paradox and similar ones. Wigner’s Friend thought experiment, named after Eugene Wigner one of the greatest scientists in the history of quantum mechanics, involved Wigner’s friend observing the outcome of a quantum experiment, say, whether a particle was spin up or spin down. Wigner is outside the lab observing both his friend and the lab as a single quantum system. The hypothesis is that if conscious observers are special then the conscious friend observing the outcome of the experiment will collapse the wavefunction for herself and Wigner so that Wigner only sees one outcome. If conscious observers are no different than particles, the wavefunction will collapse for Wigner’s friend but not Wigner. While current experiments only involve particles and not human beings, there is no reason to suppose that a conscious being could not be in superposition with itself. To believe otherwise would be to introduce more paradoxes into quantum mechanics. You and I can experience different realities that, while consistent within the framework of quantum physics, do not agree in what we observe. Thus, Niels Bohr was wrong. There is no objective reality."}, {"type": "sentence", "content": "Once you accept that there is no objective reality, you still have two options available to you: many objective realities or a subjective reality unique to you. Many objective realities or the Many Worlds hypothesis of Hugh Everett and championed as the resolution of Grandfather Paradoxes by David Deutsch indicates that each of us can exist in one or more worlds. Reality exists “out there” somewhere; hence, it is objective. In the Many Worlds interpretation of time travel, information can travel from the future of one world to the past of another world and affect it. Thus, reality works like a series of interconnecting highways. You can get off of one and, while you can’t get onto the one you were on at an earlier time because your own experience of time is linear, you can get on a different one that looks like yours at an earlier time and have a whole new set of experiences. Causal order is enforced within a world but cause and effect can occur between them. The born me can enter a world and kill my grandfather making it a world with a not-born me. These two worlds may be in superposition to an outside observer just as in the experiment with the particle that turns off the machine that produces it. Thus, Wigner’s Friend meets Grandfather paradox."}, {"type": "sentence", "content": "The alternative explanation is that there are no objective realities but only your subjective reality. Frank Ramsey, Oxford mathematician, philosopher, genius by all accounts and contemporary with Bohr, was one of the early proponents of the idea that probability is a subjective game where our beliefs, the knowledge we have available to us, determines what is real. The very idea of things existing and ascribing logical values such as true, false, or probabilities to such things as coin flips is entirely a mental exercise. Instead, what you observe in a coin flip is a cacophony of sense impressions that your mind orders into logical statements such as heads and tails. The probability of either one is likewise all in your mind. Although he was no quantum physicist, his ideas were at odds with the predominant, Bohr/Einstein viewpoint of a single objective universe. His work has led to a major modification of the Bohr hypothesis to create Quantum Bayesianism (QBism), a subjective interpretation of quantum mechanics that does not invoke additional universes but also does not indicate we have a single objective reality either."}, {"type": "sentence", "content": "In a QBist or Ramseyan quantum universe, reality is composed of a set of beliefs and information that you hold in your mind. Out there, outside the mind there is no reality, no true, no false. Thus, having realities that are inconsistent between different people, even paradoxical, is entirely possible, even the norm. All probable outcomes are the results of bets that each individual makes with the universe. God doesn’t play dice with the universe. You play dice. In a Ramseyan interpretation, reality is more like a virtual reality game that your mind generates for you from sense impressions. You make bets on what will happen and then interpret the results based on what you bet. The idea that you might have different objective realities based on different probable outcomes is nonsense because you created those outcomes in your head in the first place. Going back to the highway analogy, if you get off your highway and get onto another in your game and change things, even if it looks like you are changing your own past, it is still all just your own personal experience. There is no possibility of paradox because your own life is a linear progression of bets, one after another, and likewise for everyone else. The only reality is your reality and any observation of reality you make is a quantum measurement (according to the universality of quantum physics) but is subject to your interpretation. To quote Christopher Fuchs of Quantum Bayesianism:"}, {"type": "sentence", "content": "What this means is that, we cannot, by communicating with one another what we observe either with words or actions (including passing on our DNA by reproduction), reconcile our realities together into a single objective reality. Your grandfather can experience living a full life and having children and grandchildren while you can experience killing him. Each is just a different roll of your individual dice. It only appears there is a paradox because we assumed reality was objective."}, {"type": "sentence", "content": "In Ramsey’s quantum physics, statements, not multiple realities, are in superposition. Even true and false statements like “I am alive” or “I am dead” or “my grandfather is alive” or “my grandfather is dead” are in your mind. Philosophically, the reason why is because what we think of as objective reality is really a mish-mash of subjective perceptions with no intrinsic or essential nature. We cannot ascribe probabilistic statements to a mish-mash. Instead, we must first order reality with mental constructs about which we can make logical statements, delineating observations into categories like true and false. If we subjectively ascribe to outcomes of quantum experiments categories with logical values such as true and false, then it stands to reason that before we make those observations we are also ascribing categories and logical values to those outcomes which are in superposition. That it is quantum mechanical makes no difference."}, {"type": "sentence", "content": "While we can communicate the results of our observations with others and even agree on what we observe, those observations are still subjectively our own. Even the observation of another person agreeing with us is a subjective experience that is added to our mental universe. Going back to the grandfather paradox, if I observe you in superposition with yourself, born and not born, your grandfather alive and not alive, those are bets I am making in my mental image of you and your grandfather as a system. They are bets that take the superposition of states into account but again that is a superposition of my logical statements not of reality, which has no essential nature of its own. As soon as I make an observation, one or the other reality will be made manifest in my mind."}, {"type": "sentence", "content": "When it comes to changing the past, we may not be able to change the one we have because we have already observed it. Thus, we have made our bets on this reality and won or lost. All those science fiction shows and books where time travelers go back and change reality are, in some sense, just fiction. It is only when we can still hold multiple realities, multiple pasts in superposition, that we can make a bet on which one is the true reality. You cannot make reality what you want it to be. To do so would be madness. All you can do is choose and roll the dice. When the dice stop rolling, you are stuck. In a Many Worlds interpretation, your only hope might be to try to enter a different world yourself, leaving others behind. Killing an evil dictator in the past won’t “save” the future you left. You’ll just be changing your own future. In a Ramseyan interpretation, however, there is no future to leave behind. There is only your future. If you do go through with the assassination and return to a future that is better than the one you left, then you’ve won the bet and don’t need to feel like you’ve abandoned the future you left behind because there isn’t one. In either case, time travel like that is a long way off and perhaps completely impossible. For now, the only way to change reality is to make good choices in this world before it is too late."}, {"type": "sentence", "content": "Fuchs, Christopher A. “Notwithstanding Bohr, the reasons for QBism.” Mind and Matter 15.2 (2017): 245–300."}], "topic": "science"}