{"title": "The Racist, Bestselling Brand of Toothpaste You’ve Never Heard Of", "data": [{"type": "subtitle", "content": "It’s still being sold to over a billion people"}, {"type": "image", "content": "https://miro.medium.com/max/1760/0*NuvqMG7NUwAGXPkb.jpg"}, {"type": "sentence", "content": "The first time I saw one of the main brands of toothpaste in Taiwan I knew something was off. The image reminded me of something wrong that I couldn’t quite place my finger on."}, {"type": "sentence", "content": "A simple black and white photo of a man in a tuxedo and top hat. Nothing inherently wrong with that. A bit outdated for a modern brand, sure. The lemon yellow and forest green were also remnant of a 70’s product."}, {"type": "sentence", "content": "But who was I to judge? This was Asia and I was new to it. So I asked a friend what the Mandarin on the cover said."}, {"type": "sentence", "content": "“Oh, that’s Black Person Toothpaste.”"}, {"type": "sentence", "content": "“WTF?”"}, {"type": "subtitle", "content": "Darlie (or “Darkie” As It Was Originally Branded)"}, {"type": "sentence", "content": "It was first created by a company called Hawley & Hazel Chemical Company in 1933. Originally a product of Shanghai, China, it was launched as a “play” on a popular American comedian at the time, Al Jolson."}, {"type": "sentence", "content": "This guy:"}, {"type": "image", "content": "https://miro.medium.com/max/1600/0*FCE-qDFfGGoBYDRH.JPG"}, {"type": "sentence", "content": "Or, as he was more famous for at the time:"}, {"type": "image", "content": "https://miro.medium.com/max/1354/0*zuvZdzy_4lZN5Sfl.JPG"}, {"type": "sentence", "content": "Not cool."}, {"type": "sentence", "content": "The Shanghai owners of Hawley & Hazel distastefully thought the contrast between the blackface and his sparkling white teeth would be a great brand image. Unfortunately, these racists were right."}, {"type": "sentence", "content": "“Darkie,” as the brand was called, made headway in Asia becoming one of the bestselling toothpaste brands to ever exist there. The even more messed up thing? It’s still for sale. And it’s still number one."}, {"type": "subtitle", "content": "It Gets Even Worse"}, {"type": "sentence", "content": "Fast forward to 1985 America. A full 21 years after the Civil Rights Act was passed. You know, the one that “banned discrimination based on race, color, religion, or national origin.” I suppose no one thought to tell Colgate-Palmolive that maybe, just maybe, buying a company who’s main seller was an absurdly racist brand of toothpaste might be a bad business decision."}, {"type": "sentence", "content": "Their first response to a letter of demand to stop selling the product in 1986: “No plans…exist that would extend marketing and sales efforts for this product… beyond this (Far East) area.”"}, {"type": "sentence", "content": "PR was a different beast back then, wasn’t it? I wish I could say they learned their lesson after that and made a change. Well, they did make a change. But not the one you’d want or expect."}, {"type": "sentence", "content": "Colgate’s CEO Ruben Mark finally issued an apology in 1989, a full four years after owning and selling it."}, {"type": "sentence", "content": "The spokesperson of the partner company in Hongkong, Ms. Mary Quon, stated: “The old name represents offensive racial stereotyping.”"}, {"type": "sentence", "content": "Finally, they were starting to understand the enormity of the problem. Or at least it seemed like they were. Colgate rebranded the product to “Darlie” and changed the image to that of a white person in a black hat. What a drastic change, right? But there was one thing they didn’t choose to modify."}, {"type": "subtitle", "content": "Packaging"}, {"type": "sentence", "content": "Here’s what the packaging looked like over the years:"}, {"type": "image", "content": "https://miro.medium.com/max/1760/0*cN64i2hqm2lNMtuH.jpg"}, {"type": "sentence", "content": "And here’s what it looks like today:"}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*Nh0KKmwnAnpIOP2nQ4qUDw.jpeg"}, {"type": "sentence", "content": "That was a picture I just took at a local grocery store in Taiwan. The English name was changed. But the name in Mandarin? Not so much."}, {"type": "sentence", "content": "“Be the change you wish to see in the world,” was obviously not the company slogan. It still shocks me whenever I see the brand taking up 25% of the toothpaste shelves here. It shocked me, even more, when I saw it in many countries I visited throughout Asia."}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*SiaF5IkY4fvq4llb9ydTjw.jpeg"}, {"type": "sentence", "content": "Six countries: China, Thailand, Hongkong, Vietnam, Singapore, Malaysia, all still have this brand prominently displayed on their shelves. And it’s either 1st or 2nd place in sales in all of the above countries. That’s the main brand that 1.64 billion people are potentially buying every day of the week."}, {"type": "subtitle", "content": "Unacceptable"}, {"type": "sentence", "content": "It’s completely unacceptable for a brand in this day and age to still have a fully racially charged brand out there. After all of the prominence of the battle for racial equality, all of the struggles, all of the inequities and controversies that we’ve seen over the past centuries, how can a brand like this still exist?"}, {"type": "sentence", "content": "The point is especially amplified after a forced rebranding because it was finally considered so racist. So why the hell did they retain the original name in another language? Perhaps this Hongkong advertisement from 1990 can help answer that question:"}, {"type": "sentence", "content": "This video, which came out in the year after the rebranding strives to reassure the buying public that: “Black Person Toothpaste is still Black Person Toothpaste” So they rebranded to appear non-racist and within less than a year spent thousands on branding themselves as still being racist. This is just Marketing 101."}, {"type": "subtitle", "content": "Money Rules"}, {"type": "sentence", "content": "It’s the one language we all understand. The fact that Colgate and its partner company Hawley & Hazel have been earning millions upon millions from a racist brand is ridiculous."}, {"type": "sentence", "content": "Colgate hoped, seemingly successfully, that as long as it didn’t bring the product over to America that it’s racist name would be overlooked. Hey, as long as the English name isn’t racist, who would notice right?"}, {"type": "sentence", "content": "Well, if you’re still with me reading this, you noticed. And if you’d like to help Colgate re-notice their blatant racist profiteering, here’s some handy little info for you: their website contact page."}, {"type": "sentence", "content": "And their Twitter, Facebook, and Instagram."}, {"type": "sentence", "content": "It’d be a damn shame if their social media feeds suddenly filled up with “Colgate sells racist toothpaste” remarks, wouldn’t it?"}], "topic": "business"}