{"title": "Introducing the World’s smallest Microelectronic robot", "data": [{"type": "image", "content": "https://miro.medium.com/max/2800/0*Zv8bivnKp3yj102M.jpg"}, {"type": "subtitle", "content": "This breakthrough invention would pave the way for the use of autonomous microbots in targeted medicinal delivery"}, {"type": "sentence", "content": "Tiny robots are nothing new to the world of technology, but this recent invention claims to be the smallest of them all. Nanobots are hypothesized solutions of the future, which can deliver targeted medication within a human body. If this idea eventually gets materialized, it would be the first such step in that direction. The team of international researchers working on this novel concept was led by Prof. Dr. Oliver G. Schmidt, Chair of the Professorship of Material Systems for Nanoelectronics at Chemnitz University of Technology."}, {"type": "sentence", "content": "Researchers on the team claim they have created the smallest Microelectronic robot of the world — more importantly, one which is propelled by “jet engines.” Dr. Schmidt, a pioneer in the field of micro-robotics and micrometers, along with his three colleagues conceived the idea of the smallest man-made jet engine in 2010. He received the Guinness World Record for his amazing invention."}, {"type": "sentence", "content": "Building on the decade-old research, Schmidt along with this fellow researchers at the Technical University of Dresden and the Chinese Academy of Sciences Changchun have now come up with a microelectronic robot which is 0.8 mm long, 0.8 mm wide and 0.14 mm tall — for context, a one-cent coin has a diameter of around 16mm."}, {"type": "sentence", "content": "The flat-bodied microbot is extremely flexible, mobile and equipped with various functionalities. One of the most special features of this invention is the on-board energy system — on top of this, the system is also maneuverable in a water solution and can be controlled remotely. Additional features include a light source and a micro-arm, which can be powered remotely as well."}, {"type": "sentence", "content": "It can be steered remotely by a wireless transmitter, which sends an electrical signal causing the induction coil in the center of the robot to heat up one of two rolled-polymer tubes —running lengthwise along either side of the top of the bot (video above)."}, {"type": "sentence", "content": "These rolled-up microtubes, generate thrust by the ejection of pressurized oxygen bubbles from the rear end of the tubes. It works by first continuously sucking in a hydrogen peroxide/water solution, after which a small amount of platinum inside each tube causes a catalytic reaction to produce the oxygen bubbles. Heating one of the tubes to varying degrees enables the steering of the microbot in varying directions."}, {"type": "sentence", "content": "The micro-arm equipped with the system, which is in the form of an actuator composed of a thermoresponsive polymer. Applying various amounts of heat can cause the appendage to open & close to grasp tiny objects. In fact, the complete microelectronic system was designed from a combination of polymer-based nanomembranes, giving it high mechanical flexibility."}, {"type": "sentence", "content": "Researchers used the principle of induction to transmit energy remotely — this is something similar to how a cell phone is charged wirelessly. Although the concept is not a new one, this is the first it has been used at the micro-scale."}, {"type": "sentence", "content": "Science fiction has become a science fact with the development of this fully controllable and steerable microelectronic robot and this can, in fact, be a milestone for Healthtech, where the use of autonomous microbots for targeted medicinal delivery can soon become a reality."}, {"type": "sentence", "content": "However, the idea still needs further polishing, since the current fuel used in the form of hydrogen peroxide would be poisonous for the human body. This is indeed the next phase of development that the team is working on. Nevertheless, ten years of research is coming to fruition."}, {"type": "sentence", "content": "Complete Research was published in Nature Electronics."}, {"type": "subtitle", "content": "Stay informed with the content that matters — Join my mailing list"}], "topic": "science"}