{"title": "Plan or Be Planned For", "data": [{"type": "subtitle", "content": "The alternative to prioritizing your day is for somebody else to prioritize it for their own benefit."}, {"type": "image", "content": "https://miro.medium.com/max/11200/0*hz64kUwZB3BAjfvg"}, {"type": "sentence", "content": "How often do we hear ourselves talk about our need to better prioritize our day, week, or month?"}, {"type": "sentence", "content": "It is common for people to want to work toward their goals, and this often translates into scheduling time focused on what we really value."}, {"type": "sentence", "content": "However, how often do we find ourselves getting to the end of the day, still with an idealized plan intact and ready to go, yet now we are 8 or 10 hours past it, and none of what we so bravely prioritized in the morning was accomplished?"}, {"type": "sentence", "content": "Where did the day go, and more importantly, what happened to those carefully-crafted plans?"}, {"type": "sentence", "content": "Here I am speaking about ‘we’ and ‘us’, but let’s focus this more on what really matters to ‘you’ in particular!"}, {"type": "subtitle", "content": "Other People’s Priorities Overpowered Yours"}, {"type": "sentence", "content": "You know what you need to accomplish today to move you toward your goals. After all, they are your goals, so likely you have a notion of how to get there, right?"}, {"type": "sentence", "content": "However, when other people take over your day and make their priorities your priorities, they are effectively taking your power from you."}, {"type": "sentence", "content": "Rather, you are freely giving your power over to them, as nobody can really manipulate and make you do things on their behalf if you are are not really an active participant in the process."}, {"type": "sentence", "content": "I am not talking about little kids being made to work, people being bullied in the workplace, or henpecked spouses trying to get the other to do something different. These are real situations, but they are on a different level from what I mean."}, {"type": "sentence", "content": "I am also not talking about the workplace, where our supervisors at times re-prioritize our efforts due to organizational shifts. These things happen, but usually not on a daily or constant basis."}, {"type": "sentence", "content": "This also does not refer to those times when the unexpected arises, such as a health emergency, unplanned power outage, or something similar really beyond our control. Life happens, but most times it is just us trying to do our thing."}, {"type": "sentence", "content": "I am talking about how many times we have planned the day, only to make it to 5:00pm or 7:00pm or even 9:00pm and wonder how we got nothing that was planned actually done. This is what happens when we look up and feel we have been on a conveyor all day yet nothing of value is accomplished."}, {"type": "sentence", "content": "Ever have the feeling you spend all your time putting out fires and never any times preventing them? This is the heart of the matter."}, {"type": "subtitle", "content": "Others dismiss our plans"}, {"type": "sentence", "content": "This is when other people take our plans and dismiss them as less important than their own plans for us. I see this done all the time with people who I have coached, when they set their own daily priorities yet somehow manage not to get any of them accomplished."}, {"type": "sentence", "content": "So, what can we do about this?"}, {"type": "subtitle", "content": "3 Asks to Take Back Our Day"}, {"type": "sentence", "content": "There are three things we can do when faced with this reality, and by the way, we have all faced this experience."}, {"type": "subtitle", "content": "1. Ask: Who gains when I lose?"}, {"type": "sentence", "content": "If I take the time to prioritize my day and make sure I accomplish what is really valuable to me, then I really need to question how or why somebody else makes demands from me to deviate from my plans."}, {"type": "sentence", "content": "If I change what I planned to do today based on the demands of others, what are they gaining from me by my change, and more importantly, what am I losing?"}, {"type": "sentence", "content": "Others gain when we shift our priorities to match theirs. But ours often go unrecognized. We lose our agency to set and achieve our goals if we do not prioritize our day to dedicate time to accomplish them."}, {"type": "sentence", "content": "After all, whose goals are these, anyway?"}, {"type": "subtitle", "content": "2. Ask: Why is your unplanned task more important than my planned one?"}, {"type": "sentence", "content": "If a task is important, we schedule it and then prioritize it. However, if unscheduled tasks keep appearing, then we have to ask if those things we planned really are our priorities, and how can everything else that suddenly appears be somehow more important?"}, {"type": "sentence", "content": "After all, how can there be so many things that are unplanned for that suddenly come up? If they continue, then we really need to wonder how everything else is so much more important than me?"}, {"type": "sentence", "content": "This does not lead us to a good place if we devalue all our plans and priorities, so I encourage us to think about how important our plans are, and as a result, ask why somebody else’s unplanned task is suddenly my priority?"}, {"type": "sentence", "content": "Just because somebody else did not plan, why am I the one who has to throw off my priorities to deal with your lack of planning?"}, {"type": "subtitle", "content": "3. Ask: What are the consequences of my not moving my goals forward?"}, {"type": "sentence", "content": "Most importantly, when I move my prioritized efforts toward accomplishing my goals to deal with somebody else’s goals, what is the ultimate consequence?"}, {"type": "sentence", "content": "Right . . . it is that I do not accomplish what I set out to do."}, {"type": "sentence", "content": "Yeah, I do not accomplish my goals this way. You get yours, but mine are somehow not valuable."}, {"type": "sentence", "content": "When we take time to set holistic goals to accomplish something in our lives, we need to recognize that they will not be accomplished unless we really dedicate time and effort to meeting them. If we can’t meet them or don’t want to meet them as they really are not our own deepest goals at all, then there is no consequence involved."}, {"type": "sentence", "content": "However, my guess is that you would not have continued reading this if it did not speak to your experiences, right? So, your goals and priorities for today really are important, so the consequences of our getting sidetracked and not accomplishing them is really not something that is acceptable at all for us to consider."}, {"type": "subtitle", "content": "Next Steps . . ."}, {"type": "sentence", "content": "The next time we prioritize our day, don’t give in so easily if other people make demands of us and try, even unconsciously, to sidetrack us. It is far too easy for us to give in and regret it later than to hold our ground."}, {"type": "sentence", "content": "After all, if we do not strive to protect our time to work to accomplish the priorities we set for ourselves, who else will?"}, {"type": "sentence", "content": "Certainly not those who have taken our time and energies to help move their own priorities along!"}, {"type": "image", "content": "https://miro.medium.com/max/600/0*__A0l8koZRe6TBby.png"}, {"type": "sentence", "content": "I am interested to hear your thoughts on this, and welcome your input on how you have made this your own and will maintain your own priorities!"}], "topic": "productivity"}