{"title": "Where Are We All Going to Work Now?", "data": [{"type": "image", "content": "https://miro.medium.com/max/3840/1*-ungTRSzGY5l9bOGG2opWA.jpeg"}, {"type": "sentence", "content": "Yahoo! turned a lot of heads in the tech world in 2013 when the company decided scrap its remote working policies. In an industry where flexible office hours had become common, the decision under then-CEO Marissa Mayer went beyond a casual ask for many employees, in some cases requiring that they relocate in order to keep their jobs."}, {"type": "sentence", "content": "The memo that announced the changes explained the reasoning thusly:"}, {"type": "sentence", "content": "Flash forward to May 2020; CEOs are making hard shifts in the opposite direction. Double-CEO Jack Dorsey’s companies Square and Twitter both green-lighted future full-time remote work. Facebook CEO Mark Zuckerberg, meanwhile, announced that his company will be “the most forward-leaning company on remote work at [its] scale,” with half of its employees working remotely a decade from now."}, {"type": "sentence", "content": "So what happens if Facebook opens the gates to let tens of thousands of employees redistribute themselves and other tech companies follow suit? Are we about to see diasporas of Silicon Valley expats cropping up across the nation (or world)? Or is this just the beginning of a new cycle that will echo IBM’s full-circle journey from telecommuting pioneer to born-again believer in in-person collaboration? It’s important to remember that companies have tried these experiments before and ultimately changed their minds."}, {"type": "sentence", "content": "Alphabet and Google CEO Sundar Pichai seems to be conscious of these pitfalls historically and expressed cautious skepticism in a recent interview where he was asked if he might follow in Zuckerberg’s footsteps."}, {"type": "sentence", "content": "“How productive will we be when different teams who don’t normally work together have to come together for brainstorming, the creative process?” he replied recently when Wired posed the question to him. “We are going to have research, surveys, learn from data, learn what works.”"}, {"type": "sentence", "content": "That’s a fair response — and one that takes into account past findings at other organizations. There’s an argument of techno-optimism to be made that collaborative online tools are better than they ever have been before; perhaps the widespread implementation of work from home policies will give way to corporate epiphanies, leaving downsized and vacant office spaces as far as the eye can see. In that scenario, companies could save money on overhead; they might even save on compensation if they implement pay cuts when people move to areas with lower costs of living (as Facebook is doing)."}, {"type": "sentence", "content": "Dorsey envisions a Silicon Valley exodus along these lines."}, {"type": "sentence", "content": "“Our concentration in San Francisco is not serving us any longer, and we will strive to be a far more distributed workforce, which we will use to improve our execution,” he said in Twitter’s February earnings call. If you take him at his word, he clearly sees something inevitable in play. And the kind of population shift he envisions isn’t new; it’s already happening."}, {"type": "sentence", "content": "Between April 1, 2010 and July 1, 2018, San Francisco basically saw a net gain of 52,066 people, according to the U.S. Census Bureau. However, that margin of gain was buoyed by international immigration; if you look at American nationals alone, the area had a net loss of 2,976 people. And people are still looking for exit plans. As of the beginning of 2020, 47 percent of Bay Area residents were interested in leaving, according to a survey done by the Bay Area News Group and the Silicon Valley Leadership Group. The same survey showed 10 percent of respondents already had departure plans in place."}, {"type": "sentence", "content": "I don’t want to get too off topic and deep into immigration here. However, it is worth noting that immigrants from around the world are part of the lifeblood of U.S. entrepreneurship. (Just see the 2018 study from the National Foundation for American Policy that found that 55 percent — or 50 out of 91 — of the $1 billion startups in the U.S. had an immigrant founder or co-founder.) I bring that up just to underscore the value of international immigration in the Bay Area."}, {"type": "sentence", "content": "As for whether Dorsey and Zuckerberg are correct in their long-term forecasts, I want to get back to a key word in Brian Chesky’s quote from the top of this Medium post: flexible. When remote work succeeds, it’s because culture and individual work ethics within an organization enable it to succeed. When implemented correctly it trusts and empowers employees to manage their personal lives and works lives while still hitting milestones and goals. Pichai seemed to recognize that nuance in his response from the Wired interview; after all, it’s entirely possible that fully remote work could reveal cultural fractures or shortcomings on a team-by-team basis that would pose obstacles to success. (Or maybe he will discover the opposite, which could be great!)"}, {"type": "sentence", "content": "Whatever the case may be, remote work in the COVID-19 era could be a valuable experiment for many companies that hadn’t considered such things before. For some heads-down positions where the freedom to be left alone to complete coding or other projects is paramount, sure, full-time remote settings could be great. But for those who thrive in environments where networking, corporate ladder-climbing, and other types of jockeying for resources or status are what keep them going, it’s difficult to see a future where everyone willingly heads off into the sunset to work from home all the time."}, {"type": "sentence", "content": "Moreover, as long as coronavirus risks are elevated and systems for containing, preventing, or treating it are works in progress, flexibility offers options for managing that risk, as well as the anxieties that come with it. In a time of uncertainty when we don’t know how soon a vaccine will be available, it makes sense to declare flexibility to be standard operating procedure to ensure that employees have permission do what they need to feel safe while getting their work done. If that can be achieved, then any company should be willing to celebrate the win."}], "topic": "business"}