{"title": "The Couch", "data": [{"type": "subtitle", "content": "Before she went to sleep, she’d kiss me good night, and ask how much longer until I came to bed."}, {"type": "image", "content": "https://miro.medium.com/max/9100/1*AdStNwqp3tGmKWiPs8pWTQ.jpeg"}, {"type": "sentence", "content": "“When I first saw the couch, I hated it.”"}, {"type": "sentence", "content": "“I told her I didn’t want it. We didn’t need it, either, considering our new apartment was the size of a shoebox and my brother let me keep the loveseat when I moved out. So with her coffee table and two arm chairs, adding the couch would leave, like, two feet of walking space. But she insisted, saying it would balance our apartment’s feng shui — whatever that meant — and she’d pay for it. So I succumbed because when Ashley sets her mind on something, there’s no going back. I mean, that’s how she was raised, stubborn, indignant, her parents spoiled her rotten, so of course — ”"}, {"type": "sentence", "content": "“We’re not going to call Ashley names. Let’s slow down,” Cole’s therapist interjected, firm, but gentle, like a school teacher. She jotted a note onto her yellow pad."}, {"type": "sentence", "content": "“You hated the couch when you first saw it. Why?”"}, {"type": "sentence", "content": "“It was suede and ivory. Like a gross oatmeal color, and the pillows were paisley-printed. Weird. Like most of her taste, though. But the couch also didn’t match our new apartment. My loveseat was black leather and our furniture was all brown and burgundy. I mean, it fit the atmosphere; we lived in downtown Manhattan, not Florida. But Ashley believed the couch would brighten our apartment.”"}, {"type": "sentence", "content": "“Did it?”"}, {"type": "sentence", "content": "Cole paused. “I guess in contrast with everything else, yeah. It was also the biggest thing in our apartment, so it was first place your eyes jumped after entering.”"}, {"type": "sentence", "content": "“Let’s stop here.” Cole’s therapist marked another note."}, {"type": "sentence", "content": "“So Ashley wanted the couch. You did not, so Ashley paid for the couch herself. Correct so far?”"}, {"type": "sentence", "content": "“Yes.”"}, {"type": "sentence", "content": "“You and Ashley broke up three months ago. When she moved out, she took the couch with the rest of her belongings. Correct?”"}, {"type": "sentence", "content": "“Yes.” Cole knew where this conversation was going."}, {"type": "sentence", "content": "“But you miss the couch and feel like you were entitled to keep it.”"}, {"type": "sentence", "content": "“It sounds stupid when you say it like that,” Cole mumbled."}, {"type": "sentence", "content": "Cole’s therapist sat patiently, a silence enveloping the room. She wouldn’t speak until Cole elaborated. He knew this trick."}, {"type": "sentence", "content": "“Ashley and I lived together for two years.”"}, {"type": "sentence", "content": "More silence. Cole glanced at the oak grandfather clock propped on the table. Thirty minutes remained. This session felt longer than jury duty."}, {"type": "sentence", "content": "“I can’t believe I’m talking to a shrink because I miss my fucking couch.”"}, {"type": "sentence", "content": "“Do you miss Ashley?”"}, {"type": "sentence", "content": "“No! Why would I miss that bitch?”"}, {"type": "sentence", "content": "“Cole, we said we’re not going to call Ashley names.”"}, {"type": "sentence", "content": "“I came home to her fucking her stupid friend on the couch. I repeatedly told her I didn’t like their friendship because he was clearly in love with her, but she always denied it. So what does she do? Cheats on me with him. And now they’re dating. So no, I do not miss Ashley.” Cole snarled. Her name tasted like sulfur."}, {"type": "sentence", "content": "Cole’s therapist cocked her head. “Why would you want to keep the couch if she had sex with another man on it?”"}, {"type": "sentence", "content": "“Because it was mine!” Cole exclaimed. “She’s spiteful. She wanted revenge and needed a reason for us to break up. She planned for me to walk in and lose my shit. Too much of a coward to dump me like a fucking adult.” He clenched his fist around his coffee mug."}, {"type": "sentence", "content": "Cole’s therapist wrote another note. “Why do you believe she wanted revenge?”"}, {"type": "sentence", "content": "“Her career wasn’t flourishing like mine. She was jealous of my success.”"}, {"type": "sentence", "content": "“What behaviors led you to believe this?”"}, {"type": "sentence", "content": "Cole slouched. “Everything changed when my website took off.”"}, {"type": "sentence", "content": "“Changed for whom?”"}, {"type": "sentence", "content": "“Changed for me. Well, changed for her, too. But those were my changes; nothing in her life was changing, so she resented me because she had yet to experience her own changes. I’ve said the word “change” too much.”"}, {"type": "sentence", "content": "“But you haven’t said what changed.”"}, {"type": "sentence", "content": "Cole took a deep breath. “We moved to Manhattan with nothing other than our dreams and each other. So our dreams weren’t “real,” because they didn’t exist outside our head. The only thing that was “real” was our relationship. Does that make sense?”"}, {"type": "sentence", "content": "Cole’s therapist scribbled furiously in her notepad. Her cursive danced across the page like music notes."}, {"type": "sentence", "content": "“We were both busy. I worked for a sports marketing company and started my own sports blog. Ashley taught acting lessons and auditioned whenever her agent presented an opportunity. She booked a few interesting gigs — a toothpaste commercial, played Glinda in an off-Broadway production of The Wizard of Oz, spoke a line in several movies. But no big break.”"}, {"type": "sentence", "content": "Cole took a sip of his coffee, which now tasted like bathwater, and paused, the cup an inch away from his lip."}, {"type": "sentence", "content": "“Actually, she almost did. She landed the lead role in a potential sci-fi series. They filmed the pilot and everything. She was super excited about it…” Cole’s voice trailed."}, {"type": "sentence", "content": "He remembered when she called to tell him the news, and he surprised her with a celebratory carrot cake, her favorite. She smeared her fingers in the cream cheese frosting and grabbed Cole’s cheeks. The two massacred the cake and then had sex on the couch."}, {"type": "sentence", "content": "Cole smiled faintly."}, {"type": "sentence", "content": "“The show was never picked up. She was heartbroken. By some inexplicable coincidence, that was the week one of my blog articles went viral. Several athletes shared it, and my website received ten thousand more views a day. I interviewed on podcasts and sports TV channels. That was when our relationship really started to decline.”"}, {"type": "sentence", "content": "“So what changed?”"}, {"type": "sentence", "content": "“I just told you.”"}, {"type": "sentence", "content": "“No, you told me what changed in your lives. I’m asking what changed between you two.”"}, {"type": "sentence", "content": "“Oh. Well, I had to work more. On weekends and after my day job. Meanwhile, she was doing less; she felt burnt out from the perpetual disappointment.”"}, {"type": "sentence", "content": "Silence. His therapist nodded slowly."}, {"type": "sentence", "content": "“I was up here, rising,” Cole held his left hand at eye level, “and she was down here,” he finished, holding his right hand near his stomach. My dreams were manifesting to reality, while hers became even more distant. She said maybe that’s all they’d ever be. Dreams, I mean.”"}, {"type": "sentence", "content": "Cole stared into his muddy espresso. It was the color of her sad brown eyes."}, {"type": "sentence", "content": "“How did this affect your relationship?”"}, {"type": "sentence", "content": "“Before she went to sleep, she’d kiss me good night, and ask how much longer until I came to bed. I’d tell her as soon as I finished what I was working on. Most nights… I’d be up until 3AM… and I’d end up passing out on the couch.” Cole hesitated. “She fell asleep and woke up alone. That bothered her.”"}, {"type": "sentence", "content": "“You knew she felt this way.” His therapist didn’t ask; she stated."}, {"type": "sentence", "content": "“No. I mean, yes. I knew. We argued a lot in the beginning. She said she missed how things used to be, when we went to museums, tried new restaurants, explored the city. You know, “lived,” according to her. But I no longer had the time nor spending money. I reinvested everything I made into my business. I had to, though. What did she expect?”"}, {"type": "sentence", "content": "Cole crossed his arms. “She said I was self-absorbed. I said she was selfish.”"}, {"type": "sentence", "content": "“So this was the beginning of the end. Then what?”"}, {"type": "sentence", "content": "“Within our last month, nothing. She stopped picking fights. Stopped begging me to come to bed. I thought we were fine. That she’d come to terms with my schedule. But in retrospect…” Cole’s voice cracked. “She’d given up.”"}, {"type": "sentence", "content": "“What did you — ”"}, {"type": "sentence", "content": "“I don’t know how I didn’t notice,” Cole blurted. “In the end, we were like roommates. She stopped leaving me breakfast before she left. She used to text me sweet messages during the day. Saying she missed me. And couldn’t wait to see me later. I didn’t even notice that she stopped sleeping at home. I think that’s when she started hooking up with her friend.”"}, {"type": "sentence", "content": "He leaned his elbows on his thighs and cradled his head in his hands. “I don’t know how I didn’t notice.”"}, {"type": "sentence", "content": "Cole’s therapist studied him like subtitles on a movie screen."}, {"type": "sentence", "content": "“And no one understands,” Cole continued, his voice heightening. “My friends say I won. I’m the one whose dream came true. I’m the winner and Ashley’s the loser. But why does it feel like the opposite? She’s the one who stole my couch with her new boyfriend. I’m the one who walked in on her violating my couch, my bed, the place where I grew my business from nothing. I’m the one who’s alone.”"}, {"type": "sentence", "content": "Cole’s heart beat like a mallet. “I’m the one who alternates between sleeping in fetal position on my cold loveseat and sleeping on a cheap air mattress, which deflates in the middle of the night and wakes me with my back against the floor.”"}, {"type": "sentence", "content": "Cole’s therapist glanced at her clock. Her next appointment began in two minutes. She cleared her throat."}, {"type": "sentence", "content": "“Goddammit,” Cole cried, slamming his mug. “I miss that stupid couch!”"}], "topic": "fiction"}