{"title": "11 Skills That Teachers Need to Leave Teacher Education With", "data": [{"type": "subtitle", "content": "A survey from a high school English teacher"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*Yxha8iXFAh417vSNk54VUg.jpeg"}, {"type": "sentence", "content": "Higher education has long argued what the role of teacher education programs are. In an evolving society, an increasingly more diverse population of students, and in the midst of a digital overhaul for education, it is most important to listen to teachers, on the frontlines, on what they wish they knew before having a classroom of their own."}, {"type": "sentence", "content": "Teacher education underprepares — and in some instances — completely neglects the core skills for teaching, and unfortunately, for many teachers, a lot of classroom time in the beginning is spent brainstorming and seeking out colleagues for gauges and resources as to equip ourselves."}, {"type": "sentence", "content": "From my own experiences and recommendations that come from new and veteran colleagues, the following is a wish list that teacher education would adopt for the future of teachers and in promotion of greater outcomes for students."}, {"type": "subtitle", "content": "Practical lesson planning"}, {"type": "sentence", "content": "While programs teach types of lesson plans, most teachers never learn how to create the concepts within them until having classrooms of their own. Do we need courses on creativity? No. Do we need direction as to how we create material in the pursuit of knowledge, what kinds of questions to ask, and the implications and conditioning we indirectly impose by way of that questioning? Yes."}, {"type": "subtitle", "content": "Knowing how to talk about race, gender and identity"}, {"type": "subtitle", "content": "What’s our role in that conversation? How do we best support students?"}, {"type": "sentence", "content": "Inherent to culturally responsive pedagogy are conversations that unsettle some. Race and gender being one and two. We’re not taught how to navigate these conversations or even encouraged to engage in them. Is it our responsibility or not? The curriculum prompts these discussions, as do our real world experiences in and outside of school."}, {"type": "sentence", "content": "I’m a black male English teacher — I don’t really get a say on whether I want to talk about race. So, naturally I think it’s a responsibility. My non-black colleagues might disagree. Nonetheless, teacher education has to do a better job here."}, {"type": "sentence", "content": "As far as gender goes, my credential program just a handful of years ago did not equip us with the skills to inform and navigate these conversations. And for teachers who will most likely not receive relevant professional development to fill in these gaps, the role of teacher education is of utmost importance."}, {"type": "sentence", "content": "I don’t remember talking about the premise of race or gender related conversations once in my credential program."}, {"type": "subtitle", "content": "Basic level counseling psychology"}, {"type": "sentence", "content": "I am not a school psychologist. I don’t play like one and I don’t get paid enough to pretend to be one. But, all teachers have to put this hat on to solve crises of little and extremely traumatic proportions."}, {"type": "subtitle", "content": "Importance of mental health and self-care"}, {"type": "sentence", "content": "This job takes, takes, takes and takes. Don’t get me wrong, I love it more than anything. But, it constantly drains our cup and ultimately, we suppress our less desirable feelings so we can function. Teach teachers to value themselves and their mental health enough to seek out resources and regularly perform self-care."}, {"type": "sentence", "content": "Students, too, struggle with this. If teachers understood the value of this, not only might it lengthen the careers and increase retention for teachers, but it would equip us to have conversations with our students in meeting the natural demands of school and life."}, {"type": "sentence", "content": "We need this education, rather than stigmatizing time off, therapies and performing self-maintenance."}, {"type": "subtitle", "content": "Real, isolated, unsupported teaching experience"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*aCylM7ybOuFr8gndEaHIFw.jpeg"}, {"type": "sentence", "content": "Student teaching is unpredictable. Master teacher “vetting” doesn’t really exist, so the experience and support of the student teacher is wildly uncertain. In addition, teaching with any other adult in the room, sharing the workload and not fully being able to participate in some of the more demanding mechanisms of teaching, does not provide new teachers with the reality check they need to understand the job."}, {"type": "sentence", "content": "This learning curve is rough for many, evident by 44% of teachers leaving within their first five years, in addition to other issues encountered."}, {"type": "subtitle", "content": "How to empower, promote and teach student agency"}, {"type": "sentence", "content": "We’re not teaching robots. We’re teaching hopeful, meaningful contributors and change makers to society. Standing and delivering renders the student a receptacle. We know this, and we know that direct instruction does have value. It always has. But, teacher education does not help teachers to discover healthy practices in their content area that promote student agency and make students active in their learning experiences."}, {"type": "subtitle", "content": "Endurance for rejection"}, {"type": "sentence", "content": "You’re going to see a lot of it. Yes, teacher education, we need to have this pep talk, too."}, {"type": "subtitle", "content": "Grading"}, {"type": "sentence", "content": "I spent 18 hours in my first weekend. I’m a pro now — as much as the next teacher. But, there are a lot of questions teachers have about this in the beginning."}, {"type": "subtitle", "content": "How to implement curriculum"}, {"type": "sentence", "content": "What does teaching look like from a teacher’s perspective? We have plenty of examples as students. But we get so few with a teacher’s framework and scope. Inevitably, it’s different dependent upon who you watch, all the more reason to observe as many examples of it as possible."}, {"type": "sentence", "content": "Once in your career, sometimes you get lucky and establish relationships with folks who don’t mind you sitting in on their class just to get ideas on how they do things. Most of us are closed off and bury ourselves in our ways and in our rooms, forgetting that this resource is right next door and forgetting what it means to be part of a community."}, {"type": "subtitle", "content": "How to balance professional and personal"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*hc-TT5onuCn5qm7viq5-rQ.jpeg"}, {"type": "sentence", "content": "This is purely a product of guilt. When can we turn it off and when do we keep it on? Work always makes its way home, but tell us what we’re getting ourselves into, especially for parents who are teachers."}, {"type": "subtitle", "content": "How to respect student’s cultures and create culturally responsive pedagogy"}, {"type": "sentence", "content": "It’s unfortunate that I even have to say “respect” students’ cultures, but so much of our identities get tied up in how we interact with students, their contexts and cultures and how we enable them to feel about themselves through empowerment or dismissal."}, {"type": "sentence", "content": "Yes, teachers are capable of disrespect and much more culpable of it than we realize. This disrespect is only intensified with a lack of material that reflects the backgrounds and cultures of the student demography and allows them to interact with multiple images of themselves and engage with their histories."}, {"type": "sentence", "content": "There is much more that can be said about teacher education. But, by and large, teachers have not been heard. The barriers to entry are tedious, but not always rigorous and not always informed and this leaves new teachers swimming in the deep end, with no help in sight."}, {"type": "sentence", "content": "This is about providing the best for our students, and ultimately, the way in which teacher education programs tell teachers to be teachers, sets the precedent for how we expect students to be students."}], "topic": "education"}