{"title": "Why top CS schools may still be a reasonable investment", "data": [{"type": "subtitle", "content": "OPINION"}, {"type": "subtitle", "content": "Let’s talk about the benefits the educational giants of MIT, Stanford, Berkeley, and CMU can bring to the virtual-table."}, {"type": "sentence", "content": "Everyone knows the value proposition for universities took a nosedive in the last few months, so I am here to talk about why you should still consider going. I’m not going to focus on credentialism or any of the pipeline benefits from going from high school, to a good university, to a great job. I am here to talk about how these universities make networks and people who can build value in teams."}, {"type": "subtitle", "content": "Centralization of talent"}, {"type": "sentence", "content": "The best students have been going to the best schools for years. This pipeline is still going to continue. Those students who are not first years already have started to get this benefit and I think they should stay it out. Foster the network."}, {"type": "subtitle", "content": "Aggregation, networks, and camaraderie"}, {"type": "sentence", "content": "For students in high school deciding on a gap year or no schooling, I would say to tread carefully. The online programs I have seen give you a single track path of education. The most valuable pieces of higher education are the people you meet and the ability to work in teams. I call this the CS network effect — there are no positions where building alone is the optimal path."}, {"type": "sentence", "content": "Software engineering positions are all about sharing code snippets, building together, and profiting from the marginal scaling of digital work. A solo education does not teach you have to adjust your coding styles to the sum of collaborative work is greater."}, {"type": "sentence", "content": "If you’re interested in learning more, there are many essays on the gain in social capital from higher education. I definitely have a biased view here, but my friends have changed my life. (Sources 1, 2, 3, 4)."}, {"type": "subtitle", "content": "Getting a job"}, {"type": "sentence", "content": "Big companies recruit from big schools. The internship programs are a trial period for future employees. The crazy pay rate is akin to a retainer for future services. This pipeline is still moving in the era of coronavirus and is implicitly part of the decision to go to a top CS school."}, {"type": "sentence", "content": "Degrees can get you a look from a recruiter. Facebook has years where it hires more than half of its new employees from the top 10 schools (source). That’s one data point, but it’s not alone."}, {"type": "sentence", "content": "As workforces become remote, educations become dispersed, and individuals become diverse, having a stable piece of value in your application can be a big win. Utilize the online availability of learning to specialize and make yourself so valuable the companies can’t look away. I think there’ll be plenty of people who decide not to finish their education and regret it."}, {"type": "subtitle", "content": "Financial stability and ability"}, {"type": "sentence", "content": "Endowments are a powerful tool (and a safety net from permanent closing). The schools have the means to accommodate students and evolve their programs. The investments (of the endowments) will continue to make money. None of Berkeley, MIT, Stanford, CMU, etc. are at risk of not existing, and they’ll be moving slowly and deliberately to improve their education systems. They will continue to attempt to deliver value to their students. I expect the fall to continue to innovate. This section is mostly conjecture, but virtual education over a sustained period of time is an existential threat to universities, and that drives change."}, {"type": "sentence", "content": "For example, I watched the course staff for Intro to AI at UC Berkeley make an online test tool with randomization and multiple anti-cheating measures. This was in less than a week. The cumulative pressure of change will bring about good things (eventually)."}, {"type": "sentence", "content": "Most of the benefits sound like residual benefits from the inertia of society — that is, people are used to going and therefor going to these schools has implicit benefits. These institutions are here to continue to take advantage of these themes. There have been other disruptions to higher education in the past."}, {"type": "sentence", "content": "While a new school would struggle to get going now, I think it’s worth remembering what got the universities to where they are and which parts of the value proposition still exist. Luckily, a computer science degree still can be a valuable investment in these times. Some lucky few have dropped out of their programs, but making decisions on that is immensely nearsighted and they are a successful minority."}, {"type": "subtitle", "content": "Limitations"}, {"type": "sentence", "content": "I need to acknowledge how the costs fit into this picture. I am done putting out tuition payments, so this is all easy for me to say."}, {"type": "subtitle", "content": "Direct cost"}, {"type": "sentence", "content": "Bureaucracy, cost, the inertia of practices, cost, and cost. After paying $30k a semester, going to a big university will give you a lot of overhead in little deliverables, planning years and fulfilling varied degree requirements, dealing with outdated practices, and more. I think these types of unnecessary logistical burdens will be some of the make or break pressure points for schools. Online education can be much smoother. Paying to do logistics seems backward."}, {"type": "sentence", "content": "The people. The cost of going from a university group learning environment to individual track is a huge amount of isolation. You can still gain the skills, but it’ll be harder to place it in the bigger picture. See some of these sources 1, 2, 3, 4."}, {"type": "subtitle", "content": "Indirect cost"}, {"type": "sentence", "content": "An indirect cost of these changed policies is that underrepresented members will be filtered out more from schools. When students go home, they don’t all have access to study space — both physical and emotional. I want to see schools bringing in their endowment to help normalize student experience. Pay for part of rent for remote study students. Send them a laptop like technology companies do for new employees. Institute sweeping telemedicine therapy for students."}, {"type": "sentence", "content": "The schools that thrive will be the ones who take drastic action to make sure this new form of education is fair to fall. We who have space need to be vocal on this topic. Another essay on the topic, and some more sources:"}, {"type": "image", "content": "https://miro.medium.com/max/4096/1*fRuum7Pj1o7KfMvgO0iHew.jpeg"}, {"type": "sentence", "content": "The main drawback I don’t address is the cost. I don’t have a good way to balance the advantages I discuss verses the obvious financial burden, but that’s where the individual comes in. If you will go in substantial debt, maybe not worth it."}], "topic": "education"}