{"title": "Meeting Sol-Luz (fin.)", "data": [{"type": "image", "content": "https://miro.medium.com/max/1000/1*QvUTITjqa3Q3_OM3FhnpGg.jpeg"}, {"type": "sentence", "content": "Adebayo Ogunleye hated hospitals. She hated the persistent pacing of people as they waited for news from doctors who buzzed around with bloodshot eyes and coffee-scented breaths. She hated the fluorescent light that gave her deep dark skin a sickly glow. She hated being ignored when she tried to speak to someone in scrubs or a white coat. And she especially hated hospitals because her girlfriend, Sol-Luz Santiago was there."}, {"type": "sentence", "content": "When she received the call from Sol-Luz’s mother, Señora Santiago, that she and her husband were at Jamaica Hospital Medical Center in Queens because Sol-Luz was involved in a car accident, Adebayo travelled from Brooklyn to the hospital and arrived breathing hard after running from the station. She sat with Sol-Luz’s parents, her arm around Señora Santiago, cradling her tiny figure as she watched Señor Santiago’s tall figure pace back and forth, mumbling in Spanish. They spoke little English and Sol-Luz served as an unofficial translator in situations where their English didn’t suffice."}, {"type": "sentence", "content": "Sol-Luz taught Adebayo bits of Spanish, a word here, a phrase there until Adebayo understood a percentage of what Sol-Luz said to her. She hadn’t told Sol-Luz that she’d been studying on her own, using an app to teach herself, making notes of all the words and phrases she’d learned. It would be a birthday surprise, Sol-Luz turned twenty-five in a few weeks and Adebayo planned a private dinner in her house with candles and enough Spanish in a sultry voice for Sol-Luz to claim her as an unofficial Dominican."}, {"type": "sentence", "content": "She was grateful that she could communicate with Señora Santiago. When she questioned Señor Santiago for the third time on what the doctor said, he told her that Sol-Luz was in critical condition and in surgery."}, {"type": "sentence", "content": "They’d been there since the night before, and Adebayo had gotten there a few hours ago. She’d gone through an entire pack of gum, all 14 pieces, and had chewed her nails to painful stubs that left vicious marks on her arms when she scratched them."}, {"type": "sentence", "content": "They waited for hours, scrounging together a meal from the hospital’s cafeteria before returning to the waiting room. When a doctor approached them, they shot up out of their seats, hungry for news. Bilingual, he explained that Sol-Luz was still in surgery and didn’t know when she would be out, that they should go home, rest and return the following day. The Santiagos were adamant about staying but were convinced when the doctor said that Sol-Luz would need them rested when she came out of surgery."}, {"type": "sentence", "content": "The Santiagos drove Adebayo to Brooklyn and when they dropped her in front of her white two-family house, they thanked her for coming and said they’d keep her updated."}, {"type": "sentence", "content": "When Adebayo saw Señora Santiago’s name flash on the phone screen, she fumbled to answer the ringing phone, dropping her key ring. Sol-Luz’s mother called at night to update her on Sol-Luz’s condition, so for her to be calling early in the morning was worrying. Adebayo hadn’t been to the hospital in a few days, swamped with school and her job as an Assistant Manager at an uptown bookstore."}, {"type": "sentence", "content": "“Hola, Señora Santiago, que pasó?”"}, {"type": "sentence", "content": "She screamed Adebayo’s name and then started apologizing, “Lo siento tanto, Dios mío, lo siento.” I am so sorry, my God, I’m sorry. Her words shattered with deep, ragged cries."}, {"type": "sentence", "content": "Adebayo understood the words, but she didn’t understand why Señora Santiago called her early in the morning to apologize or what she was sorry for or why her voice shook as she struggled to say her next words."}, {"type": "sentence", "content": "“Adebayo,” she sobbed and made noises that resembled words but were unclear to her. She groaned and Adebayo could hear her sucking in mucus."}, {"type": "sentence", "content": "Adebayo leaned her body on the front door, scared that her knees would buckle under her. There was a tiny voice in her head counting down, 5, 4, 3, 2, 1."}, {"type": "sentence", "content": "“Hija, Dios mío, Sol-Luz is no longer here. Sol-Luz is gone.” She mustered."}, {"type": "sentence", "content": "Gone where? Adebayo wondered, drawing a blank. Something was wrong, but her mind didn’t put it together, “Qué? No entiendo. Dónde está Sol-Luz?” Holding the phone against her shoulder and ear, she threw her back-length box-braids into a bun on top of her head using the tribal print elastic from her wrist."}, {"type": "sentence", "content": "“Sol-Luz is-is-is,” her mother wailed, “¡Dios mío! No puedo! No puedo!” The phone clattered on something and the wails of Sol-Luz’s mother yelled out, “Está muerta! Está muerta!” Adebayo wrinkled her nose. Why was she saying that? A lot was happening in the back. She was screaming, crying and Adebayo heard people trying to console her as things crashed around. Her voice grew faint and Señor Santiago’s deep voice replaced hers."}, {"type": "sentence", "content": "“Adebayo,” Señor Santiago had the type of voice that sounded like he was seconds away from laughing, you could hear joy in his voice. When he said her name, there was no humor in his voice. “Adebayo,” he repeated. He took a deep breath, “Mi hija está muerte, Adebayo. Me entiendes? Sol-Luz no está aquí más.” He sniffled, his voice cracking."}, {"type": "sentence", "content": "The words Sol-Luz’s father said froze her as the feeling crept up her spine, she couldn’t even speak. She was choked up and when she opened her mouth to say something, a squeak came out. She shivered, the hairs on her arms stood and the phone shook in her hand."}, {"type": "sentence", "content": "“Tengo que ir. Voy a hablar contigo luego.”"}, {"type": "sentence", "content": "Please, don’t hang up. I don’t understand. Please, don’t say that, she tried to say it, but nothing came out."}, {"type": "sentence", "content": "He waited for a reply, then said, “Adios, mija,” He hung up."}, {"type": "sentence", "content": "Adebayo wanted to fling her phone in the street, wanted it to connect with a passing car and break into pieces. She clenched the phone, tempted, so tempted before relaxing her hand. She picked up the loaded keyring and dangled it between her fingertips."}, {"type": "sentence", "content": "This couldn’t be possible, Adebayo thought of the last time she’d seen Sol-Luz, like truly seen her. They hadn’t been on the best of terms when she’d stormed out of Sol-Luz’s apartment, but she’d planned on working it out, once she got over her anger. How was she supposed to know that Sol-Luz would end up in an accident the next day? Adebayo wished she hadn’t gotten mad; it wasn’t even that serious."}, {"type": "sentence", "content": "Her dark skin looked ashy and her body felt cold. She willed her mind to wiggle her fingers to make her feel something. Her feet didn’t move, and the toes in her black-and-white checkered Vans stayed still. Her body listened though and she sunk, her back against the door. She tried to remember the details of the last time she’d seen her, but all the moments they had together kept distracting her. The first time they kissed, every time they kissed, how happy she’d been. God, she hadn’t even kissed her bye. She’d ran out like a child, and she felt the same way she did as a child, alone."}, {"type": "sentence", "content": "Memories flashed through her mind, her brown eyes stuck on the wilting sunflowers in the front yard. The same sunflowers that grew from the seeds that Sol-Luz’s mother had given her one day, swearing they’d bring good luck. Some fucking luck. She should have included that the luck would only run its course if she took care of the plants. If she’d known that, maybe she wouldn’t have let them die. And maybe Sol-Luz wouldn’t be —"}, {"type": "sentence", "content": "She shook her head, unable to complete the thought. “Está muerta,” Señora Santiago yelled, Adebayo kept hearing the words in her head, she refused to translate it to English, it would make it real. Está muerta. Está muerta. Está muerta. She glanced around the yard, at the dying grass and the prickly, dried out shrubs surrounding the tree that grew. It was an apple tree, with long skinny branches that started low on the tree and spread out like a canopy as the tree rose, planted two decades ago by her mother and father, before she was born."}, {"type": "sentence", "content": "The tree didn’t bear any fruit, no matter how much fertilizer or special tree food her mother gave it. It was as if the tree knew that her parents hadn’t worked out and didn’t see any point in producing proof of their efforts."}, {"type": "sentence", "content": "It was one of the last things they did together. Before she reached a year old, her father left her mother, in the most unspectacular way, running off with another woman as if he was in his 20s with no responsibilities. Her mother lost her father, who hadn’t even given her the respect of a divorce and she lost Sol-Luz in the worst way, a dangerous way. She had to keep living, aware that she’d been spared in the game of life and Sol-Luz had lost."}, {"type": "sentence", "content": "Why didn’t she feel something when she left, why didn’t she know? Weren’t you supposed to feel a something change when someone you loved left? The earth didn’t shake, the heavens didn’t open up and her soul didn’t shock her or whatever bullshit was supposed to happen. Nothing happened. Maybe it wasn’t love, she thought."}, {"type": "sentence", "content": "No, that wasn’t true. She’d felt something from the first time she saw Sol-Luz. She’d felt something in every moment, every memory. She pulled her knees to her body, the memories weaving through her head."}, {"type": "sentence", "content": "The first time she saw Sol-Luz walk into the Poetry Workshop class they shared, in a baggy black flannel shirt with the sleeves rolled up, jeans and Doc Martens and a large Afro, there was the feeling that she had to know who Sol-Luz was."}, {"type": "sentence", "content": "When during the second week of class, Sol-Luz approached her and introduced herself, she saw that her brown eyes were framed by thick eyebrows that were a few hairs away from being a unibrow and that her light skin had freckles."}, {"type": "sentence", "content": "Through the countless times they met up at Sol-Luz’s house to bounce ideas off each other and critique the poems that came from those ideas, Sol-Luz opened up to her and she learned random information like how Sol-Luz had let kids use a permanent marker to play Connect the Dots with her freckles in third grade or how she’d eaten paint to see if she could make a rainbow grow inside her."}, {"type": "sentence", "content": "She learned that Sol-Luz knew she was gay since sixth grade and that her parents figured it out in ninth grade, that her trivial experiences with guys was just that, insignificant. Sol-Luz told her that she had a mental checklist when it came to girls; that she that she didn’t deal with girls who weren’t close to her 24 years, and especially couldn’t deal with girls who’d never been in a relationship with a girl or weren’t officially out. That she’d tried in the past and was left hurt when the girls decided that they’d had enough of experimenting. Her last girlfriend cheated on her with her ex because sex with a girl didn’t “compare to the real thing.” Adebayo silently cursed that girl when she heard the story, she was the reason she didn’t have a chance with Sol-Luz."}, {"type": "sentence", "content": "Which was why when Sol-Luz leaned her head in and kissed her, her lips reacted by themselves, but her eyes widened in shock. Sol-Luz removed her lips to ask if she was okay and Adebayo grasped the back of Sol-Luz’s neck, pulled her in and kissed her before she could wake up from what she thought was a dream."}, {"type": "sentence", "content": "They’d been in Sol-Luz’s room in the Queens apartment building she lived in with her parents. The dark purple fluffy blanket that had covered the bed was spread under them, the wooden floorboards creaking softly under their combined weight. Sharing poems with each other, it was Adebayo’s turn. She’d read a poem loosely based on Sol-Luz, but it was clear she was the muse. She hadn’t looked up from the paper until Sol-Luz said she loved it, her voice husky."}, {"type": "sentence", "content": "Then she kissed her. And that was when things changed between them. They didn’t stop kissing and Adebayo realized that she was the exception to Sol-Luz’s don’ts."}, {"type": "sentence", "content": "When they went out to karaoke or to a ramen place that Adebayo swore by or to smoke at one of Sol-Luz’s favorite spots in Central Park, they kissed when they felt like it. Sol-Luz was braver, kissing Adebayo on the lips before she slurped her ramen or after she’d sang a song off-key. Adebayo was weary of how it looked for two girls to kiss in public, even in New York and would give pecks or she’d kiss Sol-Luz on the cheek until Sol-Luz would suddenly turn her head and Adebayo’s lips would land on her lips. Sol-Luz didn’t push for me and for that, Adebayo was grateful."}, {"type": "sentence", "content": "When Adebayo slept over, they would kiss until their lips grew sore, take a break by watching Netflix, cooking or whatever idle task they could think of, but they’d soon be all over each other. Their kisses left the both of them taking deep breaths and swapping a cup of ice-filled water, so Adebayo could only imagine what would happen when they went all the way."}, {"type": "sentence", "content": "Weeks later, the kisses hadn’t stopped, and Adebayo had yanked off her shirt, revealing a double-D chest in a black lace bralette. She made a sheepish face and held the shirt to her chest, nervous that she might be going too fast for Sol-Luz. Sol-Luz smiled and pulled her T-shirt over her head and tossed it on a computer chair. Taking Adebayo’s shirt from her hands, she did the same. That night, they snuggled under the same blanket they’d first kissed on and traced on each other’s chest. Adebayo pressed her palm to Sol-Luz’s chest, wondering if she was freaking out as much as she was but it was hard to tell, Sol-Luz’s sports bra got in the way."}, {"type": "sentence", "content": "One night, Sol-Luz’s mother walked in on them in a compromising position: with Adebayo’s shirt off and her body pressed on top of Sol-Luz’s. When Señora Santiago opened the bedroom door and shuffled in in a red floral-print dress, matching chancletas on her feet and a laundry basket in her arm, Adebayo yelped and in a flurry of sheets, Sol-Luz rolled out from under her and shielded her with her body."}, {"type": "sentence", "content": "“Hola, Mami. ¿Que pasando?” Sol-Luz said, smiling awkwardly."}, {"type": "sentence", "content": "Her mother tilted her head and looked from Sol-Luz to Adebayo with amused eyes. She glanced around the room and picked up clothes tossed on the floor. Before she shuffled out, she asked, “¿Es ella quedarse para la cena?”"}, {"type": "sentence", "content": "Sol-Luz looked down at Adebayo, who clenched her eyes closed, waiting for her mother to leave so she could panic in peace. “Do you want to stay for dinner?” She whispered."}, {"type": "sentence", "content": "“Would it be weird?” The words rushed out and her eyes opened to slants."}, {"type": "sentence", "content": "“No, it wouldn’t be. Cuando hay comida, todo está bien.” Adebayo rolled her eyes, Sol-Luz thought food made everything better. Sol-Luz looked up at her mother and nodded."}, {"type": "sentence", "content": "“Bien,” she said and walked out, gripping the basket closer to her side and closing the door."}, {"type": "sentence", "content": "Sol-Luz rolled off her and balanced her body on her elbow."}, {"type": "sentence", "content": "Adebayo sat up and glanced at the floor, then grabbed a pillow and shoved her face into it as she fell on the bed."}, {"type": "sentence", "content": "She groaned loudly and said something, the pillow muffling her."}, {"type": "sentence", "content": "Sol-Luz brought her face closer, “What?”"}, {"type": "sentence", "content": "Adebayo repeated the groan, the pillow still on her face."}, {"type": "sentence", "content": "“Still can’t understand.”"}, {"type": "sentence", "content": "Pulling the pillow off her face, she repeated, “She took our clothes. Now she knows that we’re in your bed, under her roof, doing all types of shenanigans, plus she saw me naked.”"}, {"type": "sentence", "content": "“Under my roof too, I help with rent,” Sol-Luz interjected and grabbed a pillow and laid on her back, “And she didn’t even see you naked, you have your underwear on.” She pushed her face into the pillow and groaned into it."}, {"type": "sentence", "content": "Adebayo looked at where Sol-Luz’s face was and groaned again. “I’m going to need clothes.” She pulled the pillow back to her face and smiled to herself. Sol-Luz wasn’t scared about being caught and Adebayo was going to officially meet her parents."}, {"type": "sentence", "content": "She stopped smiling, she was going to meet her parents for real. More than the “buenas tardes, buenas noches” she said on her way to Sol-Luz’s room when they were in the living room. She groaned into the pillow, copying Sol-Luz."}, {"type": "sentence", "content": "Covering the table was a red tablecloth with a plastic sheet over it. In white, porcelain bowls, steam hovered over a mountain of arroz blanco, piles of fritos maduro — fried flattened plantains, frijoles rojos and stewed chicken. Dishes and utensils marked four spots."}, {"type": "sentence", "content": "The black t-shirt and biker shorts Sol-Luz gave Adebayo smelled of fabric softener, weed and coconut oil and it took a lot of willpower for Adebayo not to bring the shirt to her nose for a long sniff."}, {"type": "sentence", "content": "When the food was dished out and they’d been eating for some minutes, Señora Santiago started asking Adebayo questions. With Sol-Luz serving as a translator, Adebayo swallowed her nervousness and answered honestly. She wished she understood the words that were rolling off her mother’s tongue, she barely knew what was being said until Sol-Luz spoke."}, {"type": "sentence", "content": "Señora Santiago said something in Spanish and she and her husband laughed. Sol-Luz choked on her juice and rolled her eyes at her mother, speaking rapid Spanish back to her."}, {"type": "sentence", "content": "Adebayo caught the words, “better” “with” “clothes” but didn’t understand the rest. She kicked Sol-Luz under the table and when she looked at her, Adebayo wiggled her brows as she ripped the chicken meat off the bone with her teeth."}, {"type": "sentence", "content": "Sol-Luz rubbed on Adebayo’s thigh and whispered in her ear, “She said she likes you better with your clothes on.” Adebayo’s eyes widened and she pressed her lips tightly. Her dark skin flushed and she felt that the dark red could be seen by the whole table, but the Santiagos were whispering to themselves."}, {"type": "sentence", "content": "When they looked up and saw Adebayo’s face, they looked to Sol-Luz. She explained and they threw their heads back laughing."}, {"type": "sentence", "content": "Their laughs contagious, Adebayo soon joined in, followed by Sol-Luz. Señor Santiago’s laugh rumbled out from his stomach and he pounded his fist on the table, making the dishes rattle and clack."}, {"type": "sentence", "content": "Wiping tears from her eyes, Adebayo felt better. Her parents weren’t mad about a half-naked girl being in their daughter’s bed. Or about a girl being in her bed. She wished she could relate, her mother would probably freak out and call the pastor if she saw Sol-Luz in Adebayo’s bed naked."}, {"type": "sentence", "content": "Señora Santiago looked at both girls, back and forth slowly until she was satisfied. “Me gusta ella para ti. Es una buena chica,” she said."}, {"type": "sentence", "content": "Sol-Luz’s light complexion flushed. She turned her eyes to her plate and she replied in a low tone, “Mami, para.” Her eyes flashed to Adebayo, who scraped the remainder of food off her plate."}, {"type": "sentence", "content": "“Do you want to know what she said?”"}, {"type": "sentence", "content": "Adebayo shook her head, stood up and started clearing the dishes off the table, until Señora Santiago made a fuss and took her dish from her. She already knew what her mother said. It was as if Señora Santiago spoke slowly enough for Adebayo to catch every word."}, {"type": "sentence", "content": "And she did catch every word. Her mother liked her and thought she was a good one. She squirmed in her seat and twiddled the silver diamond rings she wore. Her lips stretched over her teeth. Her mother liked her and thought she was good for her daughter. And Sol-Luz hadn’t denied it or corrected her mother by telling her that they weren’t dating."}, {"type": "sentence", "content": "Sol-Luz pulled her hand into hers and played with her fingers. She pulled her up and they left the table and headed towards the dark hallway, her room, the last door in the hall. Adebayo didn’t even stress that she didn’t say goodnight to the Santiagos, she was too happy to care."}, {"type": "sentence", "content": "When Sol-Luz ended up between her legs, her fingers deep in Adebayo and her free hand tweaking her nipples, she claimed that she was happy to be with Adebayo, “whatever this is,” she joked. That part bothered Adebayo, but before she could make sense of it, Sol-Luz brought her to a climax. Her back arched off the bed as her eyes rolled back and guttural noises came from her. It was the first time Adebayo considered that this was the real deal. She’d never got this far with any other girl she messed around with in high school. What they had wasn’t experimenting, it was love."}, {"type": "sentence", "content": "As Sol-Luz Santiago made her drench the sheets with her tongue and tricks on her soul that no guy had ever done to her, Adebayo Ogunleye allowed herself to admit that she was in love with this young woman, really and truly in love."}, {"type": "sentence", "content": "Adebayo stopped anything else from happening that night, both tired and overwhelmed, but that night, she realized something: being in a bed, with another girl, both of them naked was nice."}, {"type": "sentence", "content": "The first time Sol-Luz slept at Adebayo’s house, Ms. Ogunleye was in a rush to leave the house for her night shift at the local hospital, where she worked as an OBGYN nurse. She’d barely had time to comment on why Sol-Luz she dressed like a man (Adebayo knew she’d do this if given the chance, she mentioned something whenever Sol-Luz came over) before she was shouting that there was rice and stew in the fridge and for Adebayo to lock the door."}, {"type": "sentence", "content": "In her room, Adebayo pressed Sol-Luz on the wall and kissed her slowly, cradling her face and letting her tongue dance over her lips, her teeth. There was no rush and Adebayo exhaled into the kiss and they shared a breath."}, {"type": "sentence", "content": "Sol-Luz took her shirt off, Adebayo followed. When she took her pants off, Adebayo peeled off her leggings, her thighs jiggling. Sol-Luz sat at the edge of the bed and beckoned Adebayo to come on top of her. She moved into her lap and wrapped her legs around her back. Sol-Luz traced her fingers on her back and Adebayo shivered at the touch. Sol-Luz admired the beauty marks scattered on different parts of her body. She found them on her arms, her chest, and a few on her inner thighs. Her panties matched her plain black bra. When her eyes came up, Adebayo breathing heightened and she could feel the goosebumps run over her body. She planted kisses on Sol-Luz’s neck."}, {"type": "sentence", "content": "Sol-Luz placed her fingers on Adebayo’s bra clasp. She twitched her eyebrow up for permission and Adebayo nodded."}, {"type": "sentence", "content": "She unclasped the hooks. The straps fell from her shoulders and Sol-Luz did the rest. The bra went to the floor, along with their clothes."}, {"type": "sentence", "content": "Adebayo held her shoulders back, her hands gripping Sol-Luz’s muscular thighs. Sol-Luz looked down from her eyes. Her breasts were large, full with a sag to them. The dark brown areolas housed small pebble-shaped nipples. She had a large outline of Africa on the right chest and where the country Nigeria was, a black heart. Falling into her cleavage was two silver chains: one with Adebayo’s name in dainty script and an Africa pendant surrounded with diamond. Sol-Luz took a finger and rubbed against her nipples, making Adebayo squirm."}, {"type": "sentence", "content": "Seeing that she was the only one basically naked, she snapped the band of Sol-Luz’s grey sports bra. In a blink, Sol-Luz took it off and Adebayo cupped a breast, which was small enough to fit into her palm. The both sides of her chest held tattoos; on the left was an outline of the Dominican Republican, on the right was a giant sunflower, with yellow and orange on the petals and dark shading around the lines. She ran her fingers over the lines, then kissed them, first one side then the other."}, {"type": "sentence", "content": "Sol-Luz exhaled hard and flipped her, Adebayo was on her back. She held herself up using her forearms and kissed her, the gold chain dangling on Sol-Luz’s neck tickled Adebayo’s throat."}, {"type": "sentence", "content": "Even though they’d done things before, Adebayo felt like she’d officially lost her virginity with a girl when her hands, and eventually her face ended up between Sol-Luz’s legs. The fear pulsed through her when she thought that she’d be bad, and Sol-Luz wouldn’t have the heart to tell her. She was so wet, and Adebayo was happy to know she was the cause of it. “Just like that, fuck,” Sol-Luz said. The wriggling and arching of Sol-Luz’s body soothed those fears more than Sol-Luz’s words could have."}, {"type": "sentence", "content": "They didn’t feel like sleeping until the sun came and wrapped in Adebayo’s silver duvet, Sol-Luz in front of Adebayo as the little spoon, they faced the windows, where the curtains had been pulled to the side and watched the room fill with light. Adebayo whispered I love you in Yoruba, her native language, kissing the words on her neck. Mo nifẹ rẹ. Sol-Luz asked her what she said, and Adebayo murmured that it was nothing. A few minutes later, Sol-Luz said it back, Te amo tambien."}, {"type": "sentence", "content": "And the last time she’d seen her before the accident."}, {"type": "sentence", "content": "They’d been in Sol-Luz’s room, their legs intertwined, talking about something. Adebayo couldn’t remember, just that she’d made Sol-Luz laugh and had watched her wipe tears from laughing so hard."}, {"type": "sentence", "content": "Her freckles danced when she laughed. No one else had ever said that to her, Sol-Luz said when Adebayo pointed it out to her."}, {"type": "sentence", "content": "Adebayo laid on top of Sol-Luz, stomach to stomach and used her finger to trace the Gemini constellation in her freckles. She and Sol-Luz planned on getting tattoos of their zodiac signs: Gemini for Adebayo and Aquarius for Sol-Luz."}, {"type": "sentence", "content": "When she stopped laughing, Adebayo sprung the question on her. She didn’t know why she’d chosen that moment to ask it but God, she wished she hadn’t. The title didn’t mean anything, she’d rather have Sol-Luz."}, {"type": "sentence", "content": "Her eyes closed, Sol-Luz walked her fingers on Adebayo’s bare thighs and rubbed against the orange lace panties stretched on her butt."}, {"type": "sentence", "content": "“Sol-Luz?”"}, {"type": "sentence", "content": "“Yeah?” Sol-Luz blinked lazily at her, her fingers moving back and forth on Adebayo’s thigh."}, {"type": "sentence", "content": "“I want to talk to you about something.”"}, {"type": "sentence", "content": "Sol-Luz made a noise in her throat, “Yeah?”"}, {"type": "sentence", "content": "“Are we going to make this official?”"}, {"type": "sentence", "content": "Her fingers stiffened on Adebayo’s thigh and her eyes closed, “Official as in?”"}, {"type": "sentence", "content": "“As in I’m your girlfriend and you’re my girlfriend. And this — ,” Adebayo gestured her hand between them, “ — isn’t just a “whatever this is,” but a relationship.”"}, {"type": "sentence", "content": "“Fuck.” Sighing, Sol-Luz sat up, gently moving Adebayo off her body. She fluffed out the flattened parts of her Afro and turned towards Adebayo, “Sabes que te amo, verdad?”"}, {"type": "sentence", "content": "Adebayo sat up and crossed her legs together. She nodded at Sol-Luz’s question and held her breath. This was sounding like the beginning of a bad rom-com. If the next thing that came out of Sol-Luz’s mouth was that she didn’t want anything to be official because she didn’t actually love her, she’d freak."}, {"type": "sentence", "content": "“Tú conociste mi Mami y Papi.”"}, {"type": "sentence", "content": "Adebayo stared intently at Sol-Luz’s mouth. Her vision was going blurry and her lips looked like two pinkish fuzzy caterpillars, wiggling around."}, {"type": "sentence", "content": "“Tú eres mi corazón, estoy muy contenta contigo pero — “"}, {"type": "sentence", "content": "Adebayo interrupted before any more words came out, “Speak English!” She blurted out."}, {"type": "sentence", "content": "“But you can understand me,” Sol-Luz said."}, {"type": "sentence", "content": "“That’s not the point,” she muttered, “What it sounds like you’re saying, I want to make sure I fully get everything.”"}, {"type": "sentence", "content": "“I’ve broken several rules that I set for myself because I couldn’t just fall back from you and I’m not complaining but a part of me feels like this could be an in-the-moment thing for you,” She grabbed Adebayo’s hand and rubbed the back of it, “And I can’t go through that again.” Sol-Luz sighed."}, {"type": "sentence", "content": "“Okay, but this is real, so I don’t get it.”"}, {"type": "sentence", "content": "“It feels like that right now — “"}, {"type": "sentence", "content": "“This is an in the moment thing — ”"}, {"type": "sentence", "content": "Sol-Luz gasped and placed her hands in her lap as her bottom lip disappeared behind her teeth."}, {"type": "sentence", "content": "Adebayo took her hand back and cradled it, “Listen, it is an in-the-moment but it’s an out the moment and an up and down the moment thing too.” She hoped Sol-Luz would crack a smile at her corniness."}, {"type": "sentence", "content": "Sol-Luz didn’t smile, nothing felt funny to her, “I knew this would happen. You’re saying that for right now! You barely know how you feel.”"}, {"type": "sentence", "content": "“Sol-Luz, I don’t think you understand. Being with you is real because I know what I feel.”"}, {"type": "sentence", "content": "“Adebayo, I’m telling you it’s for right now. It always is.” She mumbled the last part to herself."}, {"type": "sentence", "content": "“You must not understand the words coming out of my mouth, Sol-Luz.”"}, {"type": "sentence", "content": "“You’re younger than me, Adebayo.”"}, {"type": "sentence", "content": "Adebayo rolled her eyes at the quip about their age. Over the months, Sol-Luz mentioned how her 25 years to Adebayo’s 20 years was such a huge gap, one she wasn’t familiar with, “Too bad time machines don’t exist, I’d go back and tell my mother to have me sooner, just for you!”"}, {"type": "sentence", "content": "“That’s not what I mean. I don’t want to sound old, but you are young, you haven’t really had time to know what you want.”"}, {"type": "sentence", "content": "“Sol-Luz, I hate being judged by my age and how are you going to tell me that I don’t like girls when I’ve been fucking you for months?” She sticks her finger into Sol-Luz’s chest, “And clearly I like it. Or does that not count?”"}, {"type": "sentence", "content": "“God, yes, it counts. But I — “"}, {"type": "sentence", "content": "“No buts, I hate labels. I hate that I have to claim myself as something just to get people to take what I feel seriously.” Adebayo huffed out, “And you’re not supposed to be one of the people.”"}, {"type": "sentence", "content": "“To be honest, I’m not sure you like girls, I think I’m the exception. I just feel like this is a time-bomb and you’re eventually going — ”"}, {"type": "sentence", "content": "“Going to what?! Leave you? I thought we were past that. And what if you are the exception? You’re literally the first love, Sol-Luz. It means you’re special,” Adebayo said with an edge. She was growing annoyed."}, {"type": "sentence", "content": "Sol-Luz yanked on the curly strands in her hair, something she did when she was nervous or upset, “And what if I don’t want to be the fucking exception? What happens when you meet some guy that makes you question the exception?”"}, {"type": "sentence", "content": "“Then it’s time to start asking different questions.” Adebayo smiled a little."}, {"type": "sentence", "content": "“I’m not laughing right now.”"}, {"type": "sentence", "content": "“Do you want me to say I’m gay?”"}, {"type": "sentence", "content": "“No, I just don’t want to be the person you’re trying things with because you hate guys and don’t want to be straight anymore.”"}, {"type": "sentence", "content": "Adebayo made a face, crossing her arms, “Are you serious? After all this time, you’re questioning me if I like you?” They’d met in September and it was almost May, nine months of being with each other."}, {"type": "sentence", "content": "“You’re the same person who told me that you have a higher attraction to guys, and I don’t want history to repeat itself.”"}, {"type": "sentence", "content": "She shot Sol-Luz a glare, “You’re being irrational now, nothing is getting into your head and it’s unfair.”"}, {"type": "sentence", "content": "“You’re the one who started this.” Sol-Luz grabbed her phone from the dresser and scrolled."}, {"type": "sentence", "content": "“You keep saying I’ve never had a relationship with a girl. Well I want one with you. So be brave and want one with me too. Then I’d finally have the stupid resume you want. First thing on it: ‘Fucking a girl, November 2018 to present.’”"}, {"type": "sentence", "content": "Adebayo felt like crying, nothing she was saying was making Sol-Luz smile. Her freckles were stiff, and it seemed as if he lips was in a permanent pout. Adebayo didn’t"}, {"type": "sentence", "content": "They looked at each other quietly, Adebayo fingering her braids, her lips in a scrunched-up line, Sol-Luz tapped at her phone."}, {"type": "sentence", "content": "Adebayo broke the silence, “What do you want from me? I can’t go back in time and date every girl I ever had a crush on.”"}, {"type": "sentence", "content": "Adebayo didn’t like how this was turning out. She shouldn’t have said anything. People already assumed that they were officially together, and she claimed her as her girlfriend to everyone."}, {"type": "sentence", "content": "Sol-Luz crossed her legs together and dropped her phone in her lap, “I hate that I feel like this. I just don’t want to be an experiment. I can’t handle that.”"}, {"type": "sentence", "content": "All Adebayo had to was let Sol-Luz play with her skin as she played with her freckles and that day would have went differently. Before the day was over, she’d have had Sol-Luz purring as she gave her a scalp massage and they’d have ordered tacos and quesadillas and the night would have been perfect."}, {"type": "sentence", "content": "Adebayo’s eyes crinkled, “Tell me what you think I should do.”"}, {"type": "sentence", "content": "“You’re going to hate me if I do.”"}, {"type": "sentence", "content": "She shook her head, “I could never hate you.”"}, {"type": "sentence", "content": "Sol-Luz made eye contact and whispered, “Tell your Mom.”"}, {"type": "sentence", "content": "“You know I can’t do that. Out of all the things you could say, I don’t know why you’d say that.” Shaking her head repeatedly, Adebayo jumped off the bed and grabbed at her clothes from the floor. She yanked on her dark wash jeans, pulled the black sweatshirt over her white t-shirt, pulling her chains out and slipped her feet into her checkered Vans, “SoI- Luz, I’m leaving.”"}, {"type": "sentence", "content": "She slammed the bedroom door but stayed a few seconds with her ear against the door to see if Sol-Luz was in a hurry to chase after her, she heard silence. It hurt to know that Sol-Luz didn’t care, and she stomped out of the apartment, using the stairs instead of the elevator. She thought she heard Sol-Luz calling her name, but she ignored it. She didn’t relax her pace until she was blocks away from Sol-Luz’s building. She bent over, her chest caving in and out, forcing herself to hold back on the angry tears."}, {"type": "sentence", "content": "“Tell your Mom.” It was the last thing Sol-Luz said and she’d gotten angry at her for suggesting it, for even bringing it up. It had felt like a personal attack on her, that maybe she was more of a kid than she thought."}, {"type": "sentence", "content": "She stood up and jiggled the key in the door, climbing the stairs to the second floor. When she entered her home, Adebayo was welcomed with the smell of peppers, onions and fried meat in the air. The boiling sound of a pot of rice and her mother in the kitchen, singing along to the low, soulful Nigerian song playing from the television in the living room graced her ears.."}, {"type": "sentence", "content": "Her mother’s joyous voice came to a stop when she saw her daughter’s face. The knife cutting vegetables clattered as she rushed to Adebayo."}, {"type": "sentence", "content": "Adebayo stepped back before her mother’s arms could engulf her. Her sight blurred as tears fell. She licked her chapped lips, ignoring the dry feeling of her lips and met the worried look of her mother."}, {"type": "sentence", "content": "“Mo-mo-mommy,” She stuttered out, her voice cracked, “Mo fe so nkan fun yin.” I have to tell you something, she said in Yoruba. For the first time, the American accent that followed her Yoruba words and made her a joke amongst her family members was lost. She spoke the words with clarity, with an enunciation that would make any elder Nigerian proud."}, {"type": "sentence", "content": "Her mother had to know that this was the biggest news she’d ever tell her, she had to. Her Yoruba was never that perfect, that strong. Adebayo wiped her face with the sleeve of her sweatshirt. Her heart pounded in her chest and she could feel a slight throbbing at her temple."}, {"type": "sentence", "content": "Her mother would either snatch her up and hug her, patting her back awkwardly, unused to the gesture, but knowing it was what Adebayo needed at the moment or she would snatch her up and drag her to the African church a few blocks away, condemning her, hating her, yelling that the Devil had made a home in her. Or worse, she’d ignore her words, claiming that she was young and didn’t know what she was saying."}, {"type": "sentence", "content": "Her mother found peace in religion, spending hours on her knees, worshipping in the church, turning over a tenth of her paycheck for tithe and begging Adebayo to turn to God so she could be used in miraculous ways. When Adebayo would tell her mother about a friend’s parent that was gay, her mother would scoff and suck her teeth. She didn’t understand why “awọn gays” were like that, but she didn’t have hatred towards them."}, {"type": "sentence", "content": "Adebayo didn’t know what would happen, but she had to tell her mother about Sol-Luz. She had to tell her about what Sol-Luz meant to her, what she made her feel and in order to tell her that, to make her understand, she had to know who Sol-Luz was, who she really was. She’d have to admit that the girl that she had met on many occasions, that she liked because she had a serious look to her and took school seriously wasn’t just a friend to her. “Kini itumọ? O jẹ ọrẹ rẹ ti o dara julọ?” What do you mean? She’s your best friend?"}, {"type": "sentence", "content": "She could imagine her mother asking. “Mommy, sit down.” Her face crumpled up as she sobbed."}, {"type": "sentence", "content": "“Ọmọ mi, kilo sele si e? Ba mi sọrọ.” My child, what happened to you? Talk to me."}, {"type": "sentence", "content": "“Please, just sit down,” Adebayo said under her breath. And please, don’t hate me, she thought. She swallowed the ache in her dry throat, forcing it down. Her mother sat in her usual seat at the dining table, the laugh lines in her face deepened with worry."}, {"type": "sentence", "content": "Adebayo glanced up and squeezed her hand into a fist. She could imagine Sol-Luz next to her, clutching her hand as she whispered in her ear, reminding her that everything was fine, “Ta bien,” she heard Sol-Luz say. It’s alright."}], "topic": "fiction"}