{"title": "Two Reasons Why the S&P 500 is No Longer A Rough Gauge of Economic Health", "data": [{"type": "subtitle", "content": "Thus you should probably rethink using it as an indicator when to start investing."}, {"type": "sentence", "content": "In the first place, stocks, in general, are never an accurate indicator of the overall economic health of a country or even the entire world. This fact cannot be any more applicable to the current situation. While news of more unemployment and bankruptcies, as well as other negative news on the economy, continue to flood our online feed, the S&P 500 index continues to inch up as if the economy is recovering fine."}, {"type": "sentence", "content": "While the stock market prices tend to be forward-looking, many of us, however, know that things aren’t going to be that bright in the near future, at least for the mainstream Americans."}, {"type": "sentence", "content": "Even for the big boys, some of the supposed winners during this crisis, like Target, are still reporting significant losses for the past quarter earnings due to the pandemic crisis. Federal Reserve Chairman Jerome Powell himself had just warned everyone else a few days ago that we still have a long way to go to full recovery."}, {"type": "sentence", "content": "Yes, we know that we will get out of this crisis eventually. The question is, how long more? Meanwhile, recovery will be prolonged, and this alone will affect more mainstream Americans’ lives. The same applies to other countries trying to restart their economy again."}, {"type": "sentence", "content": "So why has the S&P 500 index been climbing like we are in the path of rapid recovery? The make-up of the S&P 500 largely explains why."}, {"type": "subtitle", "content": "Wall Street versus Main Street"}, {"type": "sentence", "content": "When we talk about Wall Street, we are referring to the financial markets and the publicly-listed companies trading on the exchanges in the US. When we specifically talk about common indexes like the S&P 500, we are referring not only to publicly-listed companies but the top 500 companies in the US."}, {"type": "sentence", "content": "On the other hand, Main Street, in layman terms, refers to the general economy, which consists of small businesses, private businesses, employees, and small-time workers like you and me earning income, borrowing small-time loans for expenditures like houses and school fees."}, {"type": "sentence", "content": "So what’s the big difference between the two that explains why the S&P 500 index is still going up while the entire US economy has just seeped into a recession?"}, {"type": "sentence", "content": "Among these top 500 companies, a growing proportion belongs to GIANT companies and tech companies."}, {"type": "sentence", "content": "They are far more global than a typical American private business — roughly 40% of the revenues of the S&P 500 are earned abroad."}, {"type": "sentence", "content": "Just Microsoft, Apple, and Amazon alone, they already accounted for one-fifth of the market value of the index. Much less to say when you include Facebook, Netflix, and Google. These are the very companies that are thriving during this pandemic crisis."}, {"type": "subtitle", "content": "The ones who are holding most of the stocks"}, {"type": "sentence", "content": "On top of that, it is the rich that are owning most of the stocks with the wealthiest top 10 percent owning about 84 percent of the value of all retail shares. In the first place, they are the ones who least likely to feel the pain of the downturn. They are the ones who can afford the risk of losing millions while we fear whether we can feed our family for the next few months."}, {"type": "sentence", "content": "Those who are owning the stocks are the ones who believe that last month’s crash has already accounted for even the second quarter’s devastating performance. They are positive that we will see the light at the tunnel soon and thus, expecting a rapid economic recovery as soon as the pandemic ends."}, {"type": "sentence", "content": "On top of that, the Federal Reserve’s quick response to injecting stimulus after stimulus to save businesses and the economy has given them confidence that the Fed will do what it takes to prevent the stock market from diving again."}, {"type": "sentence", "content": "So there you go — a rising S&P 500. And at this point of writing, it is almost hitting 3000, with only about 8% down from its February highs."}, {"type": "sentence", "content": "What are your thoughts on this?"}, {"type": "sentence", "content": "Meanwhile, thanks for reading and stay safe!"}], "topic": "economy"}