{"title": "Pay to Win Makes Some More Equal Than Others", "data": [{"type": "subtitle", "content": "The true technological terror of microtransactions"}, {"type": "sentence", "content": "It’s only fitting that the Empire embodies the final form of the pay-to-win formula: a collective that finds victory not through skill, dedication, or wit — but in buying bigger guns than the other guy. Yet there’s something far more nefarious about pay-to-win than simply leveraging cash to get one up on the Rebellion — and it speaks to something far more personal, far more intimate than topping a leaderboard."}, {"type": "sentence", "content": "Online games can be the great equaliser — they have the unrivaled ability to suspend the standards applied to our underwhelming corporal selves, if only fleetingly. It’s not difficult to see why someone might spend lots of time away from themselves — to become someone else, do something else, be somewhere else."}, {"type": "sentence", "content": "Companionship, entertainment, challenge — each one is escapism in different forms. That escapism doesn’t just include my experience, it includes myself. Height, weight, hairline — everything is subject to change in the virtual worlds we choose to engage with. The bump on my nose, that fading top mop, and those few extra pounds are negated in online games."}, {"type": "sentence", "content": "We’re all equalised, then. At least to a certain extent."}, {"type": "sentence", "content": "We aren’t in other ways, though. Digital worlds and connected communities introduce new standards — of knowledge, of skill, of behaviour — but at least we can choose to engage with these communities, to choose which standards we apply to ourselves."}, {"type": "sentence", "content": "We can do the same in real-life too, of course. We can decide to engage in hobbies and groups and professions, but that doesn’t save us from the judgement of others as we walk down the street, or drive that car many would consider state of the art — had you bought it fifteen years ago. If you don’t feel good about yourself, then, you need only choose an online community where those feelings not need apply. It’s those feelings, as dark and tragic as they can perhaps become, that are primed for exploitation in loot boxes and microtransactions."}, {"type": "sentence", "content": "Pay-to-win microtransactions: real-world money for in-game advantages. It’s here that the ‘equalising effect’ begins to wither under the might of excessive corporate want. Now, real-world standards and limitations are introduced into our make-believe reality and identities. Those thousands of hours spent developing that sick three-sixty no-scope are suddenly undermined by that guy who spent actual cash on that big-ass bazooka. That standard you opted for — to be judged by your ability to shoot things in the face — is now replaced by your ability to pay for in-game gear."}, {"type": "sentence", "content": "In other words: by how much you earn."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*q7tGdBhobfAIdZS1.jpg"}, {"type": "sentence", "content": "Microtransactions fundamentally break the barrier between fantasy and reality. For some, this won’t matter so much. But for people who’s real-world presence is restricted — be it by health issues or social anxiety — it’s not difficult to see how such an invasion might be devastating."}, {"type": "sentence", "content": "That doesn’t mean microtransactions are a psychological nuke, of course. More that they degrade our digital escape routes on a really, really bad day — or at a time when we might need to get through a difficult period in our lives."}, {"type": "sentence", "content": "This is why the practice seems so pernicious, and why pay-to-win feels so profoundly unfair. It fundamentally corrupts video games."}, {"type": "sentence", "content": "In this context, it’s easy to see why even cosmetic microtransactions — ‘the good ones’ — present a problem: they lock-off part of what people use to define their new online identities behind a real-world limitation. It brings this identity crashing back to reality once more — the exact opposite of what you and the developers presumably want to achieve."}, {"type": "sentence", "content": "And there’s countless reasons why we might want to adopt a digital persona. Illnesses, both mental and physical, can limit our time with people in the real world — with nothing said of geographical location, isolation or garden-variety loneliness. That’s not to say video games should be or are a cure for these things, but to say they can help make the intolerable briefly tolerable."}, {"type": "sentence", "content": "But you can’t digitally re-define yourself if that definition is locked by money you might not have."}, {"type": "sentence", "content": "Even cosmetic microtransactions strip meaning from online communities. That thing you’re wearing used to mean you beat the unbeatable. Now it means you got lucky on a random roll purchased with real-world cash. Even if it can be earned, your achievement is undermined by the very suspicion you might’ve paid for it."}, {"type": "sentence", "content": "Video games will never equalise everyone, but they allow those who feel they need that environment — which is likely most of us at some point in our lives — to choose the standards they want to gun for in a swift and immediate way."}, {"type": "sentence", "content": "And I’m not advocating for abandoning reality, either. I’m saying that reality has plenty corporate excess — and it’s difficult to see why the digital worlds we choose to inhabit should suffer from it, too."}], "topic": "design"}