{"title": "The Economy Is a Giant Vending Machine", "data": [{"type": "subtitle", "content": "An Introduction to Universal Basic Income"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*Wp1obIz0aF8kcdImlwR74w.png"}, {"type": "sentence", "content": "Picture the economy as a giant vending machine. We spend money into the machine, and it produces goods and services for us to consume. But the economy won’t sell us what we lack the money to buy. Instead, those delicious goods and services will remain inaccessible, staring at us from behind their glass pane. To prevent this outcome, the economy needs a way to ensure that we all have money to spend."}, {"type": "subtitle", "content": "Basic Income"}, {"type": "sentence", "content": "Also known as universal basic income, or UBI for short, basic income is an unconditional income for every person. It solves the problem of how to get money into the hands of consumers so they can buy things from the vending machine."}, {"type": "sentence", "content": "While this is not the only definition of “basic income,” it is the usual one. According to this definition, there is no such thing as a non-universal or non-unconditional basic income. Basic income goes equally to everyone — to all adults in the economy. The terms “basic income,” “universal basic income,” and “unconditional basic income” all describe the same concept."}, {"type": "sentence", "content": "It’s worth emphasizing that basic income does not have to be an amount of money that meets people’s basic needs. Such an amount may be both desirable and achievable, but it is not part of the definition. Basic income is “basic” only in the sense that everyone gets it. The income itself is basic — not what it buys."}, {"type": "sentence", "content": "People tend to make assumptions about what the amount of the basic income should be, or about what kinds of taxes or other policies would best go along with a basic income. Not everyone is careful about separating their desired parameters for basic income from the concept of basic income itself. This lack of precision can make basic income seem more complicated than it is."}, {"type": "sentence", "content": "So let’s get back to the basics of basic income. Basic income is just the same amount of free money for everyone. The amount could be small, or it could be substantial."}, {"type": "sentence", "content": "You don’t have to need the money. You don’t have to prove that something is preventing you from working. You just get it — even if you have a job or another source of income. You get it even if you’re rich."}, {"type": "subtitle", "content": "How to “Pay For” Basic Income"}, {"type": "sentence", "content": "Everyone asks how to pay for basic income. The answer is simple. There’s only one way to pay for it: by printing new money."}, {"type": "sentence", "content": "This assertion is less controversial than you might expect. Any time the government spends, they’re printing money. They are printing money in the sense that they’re adding money to a part of the economy that wouldn’t otherwise have that money."}, {"type": "sentence", "content": "Government spending adds new money to the economy regardless of whether taxation happens to be removing money from another part of the economy at the same time. Taking away money from one part of the economy doesn’t automatically make room for new money to another part of the economy."}, {"type": "sentence", "content": "For the government’s money to be able to buy something, the economy has to have something it wants to sell. For basic income to buy goods and services, those goods and services have to be available for purchase — there has to be something in the vending machine."}, {"type": "subtitle", "content": "Natural Level of Basic Income"}, {"type": "sentence", "content": "The right question to ask isn’t: Can we afford a basic income? The right question is: What’s the optimal level of basic income for our economy? How much basic income can our economy handle without causing inflation or other problems? To what extent will various taxes and other economic policies increase or decrease that amount?"}, {"type": "sentence", "content": "On its own, the concept of basic income is simple. It’s free money for everyone. But it can be hard for us to wrap our heads around how a simple basic income fits into our complicated economy. The good news is that basic income simplifies our economy for us. Much of our economy’s complexity stems from a lack of basic income. So, let’s explore how the economy works with a basic income. We can then work backward to understand the real world."}, {"type": "sentence", "content": "In this simple economy, people put money into the economic vending machine. The candy bars it spits out for them to consume are the economy’s products. To ensure consumers can buy all the candy bars, we provide them with a limited daily allowance of money to spend. That’s our basic income."}, {"type": "sentence", "content": "Let’s say the vending machine restocks itself every morning, but it’s only able to fit so many candy bars. In other words, our economy has limited resources; it only has the capacity to produce so many goods and services. If the amount of the basic income is too low, candy bars will remain unclaimed in the machine at the end of every day. If the amount is too high, then there will be a shortage of candy bars. Consumers will have extra money left over that they wanted to spend."}, {"type": "sentence", "content": "There’s exactly one level of basic income that allows consumers to claim the machine’s full contents every day without also causing a shortage — exactly one amount that allows consumers to buy all the goods and services the economy can produce for them. This sweet spot is the natural level of basic income for our vending-machine economy."}, {"type": "sentence", "content": "No amount of putting money into the machine is going to get consumers more candy bars than there physically are in the machine."}, {"type": "subtitle", "content": "Real Purchasing Power"}, {"type": "sentence", "content": "If the average price of the vending machine’s candy bars changes, then the natural level of basic income changes along with it. For example, if prices double, then people need twice the money. The natural level of basic income doubles."}, {"type": "sentence", "content": "Any given amount of basic income corresponds to a specific price level at which it is the natural level of basic income. If the basic income doesn’t match the general price level, we can adjust some combination of both to correct the difference. Let’s say that consumers receive enough basic income to buy all the candy bars twice over. We can bring the basic income to its natural level either by doubling the price of candy bars or by cutting the basic income in half."}, {"type": "sentence", "content": "When basic income is at its natural level, the number of candy bars in the vending machine is the only thing that determines how many candy bars consumers can purchase — the economy’s productive capacity determines what people can buy. Irrespective of the general price level, the natural level of basic income claims the same amount of goods and services — it represents the same amount of real purchasing power."}, {"type": "sentence", "content": "In our vending-machine economy, when we think about what a dollar is worth, we’re thinking in terms of how many candy bars it can buy. A stable dollar implies that the average price of candy bars doesn’t change. The price of a Snickers bar might go up, but it will never be the case that all the prices in the vending machine rise at the same time. There’s neither inflation nor deflation."}, {"type": "sentence", "content": "A stable dollar is ideal; it gives us an intuitive standard against which to measure the prices of everything else. Only by understanding that ideal, can we grasp the implications of deviating from it. In our vending-machine economy, a stable dollar means the average price of a candy bar can’t change. Inflation is always zero."}, {"type": "sentence", "content": "Of course, we can only legitimately assume away inflation if we also require the conditions that are necessary to maintain zero inflation. By disallowing inflation, we force ourselves to disallow the causes of inflation. To do anything else would be cheating."}, {"type": "sentence", "content": "For example, let’s say that the vending machine will automatically adjust its prices to sell all of its candy bars every day at the highest prices possible. A basic income higher than the natural level would cause inflation. A basic income lower than the natural level would cause deflation. There’s only one level of basic income that’s even possible: the natural level of basic income. If the basic income were at any other level, the machine would automatically change its price level — and that’s not allowed."}, {"type": "sentence", "content": "At the natural level of basic income, the average price of goods and services remains constant. There is no inflation. The same number of dollars flowing into the vending machine always corresponds to the same number of candy bars flowing out to consumers."}, {"type": "subtitle", "content": "A Growing Economy"}, {"type": "sentence", "content": "Imagine that we get a bigger vending machine that can hold more candy bars. The economy’s capacity to produce goods and services has expanded. Not only can we increase the basic income, but we must increase the basic income to bring it to its new natural level."}, {"type": "sentence", "content": "Because inflation and deflation are forbidden, the flow of consumer spending must continue to match the flow of economic output. If the economy can produce more goods and services for consumers, then consumers must spend more money to purchase those additional goods and services."}, {"type": "sentence", "content": "A change in the flow of candy bars implies a corresponding change in the flow of dollars. The flow of dollars and the flow of candy bars must remain equal and opposite. This balance must maintain itself whether the economy is growing, shrinking, or staying the same size."}, {"type": "subtitle", "content": "Jobs and Labor"}, {"type": "sentence", "content": "So far, our vending machine takes no inputs. It only produces output. It magically restocks itself every morning, and nobody has to do anything. Our economy’s money only flows only in one direction: from consumers’ pockets into the vending machine. Goods and services flow in the opposite direction: from the machine to consumers."}, {"type": "sentence", "content": "Let’s instead imagine that the machine requires some labor input to produce its candy bars. Before, people were just consumers. They were beneficiaries of the economic machine. But now we need at least some people to contribute their labor as workers — to act as inputs to the production process."}, {"type": "sentence", "content": "We can ensure that people contribute labor by withholding some of their basic income. We thereby create an incentive for people to earn their money back through jobs. Some people might choose to do the work while others happily accept the lower level of basic income. What matters is that the right total amount of labor is being contributed to fully restock the vending machine every morning."}, {"type": "sentence", "content": "The consumers who work can now buy more candy bars than the others. But that’s okay. That’s the reward that motivates them to operate the vending machine for the benefit of everyone."}, {"type": "sentence", "content": "Given that our real-world economy requires labor, the natural level of basic income is the level that’s low enough to activate enough labor to stock the vending machine but high enough to ensure that consumers can still buy all the candy bars."}, {"type": "subtitle", "content": "Consumers vs. Workers"}, {"type": "sentence", "content": "As the economy’s need for labor decreases, we can withhold less and less money from consumers. To put it another way, automation of production causes our economy’s natural level of basic income to rise. The less we have to work, the richer we can be. The less we have to be workers, the more leisure we can enjoy."}, {"type": "sentence", "content": "Workers are just inputs to the economic machine. When we create an identity around labor, we’re treating people as mere inputs. But people are more than just inputs. The economy is here to serve us, not the other way around. What matters is what we can get out of the machine. The people’s needs come first. Everything else is secondary."}, {"type": "sentence", "content": "The economy exists for the benefit of the people. The most crucial role that people play in the economy the role of “consumer,” not “worker.” Being consumers just means we’re receiving benefit from the economy. We’re here to eat the candy bars, not to toil away."}, {"type": "sentence", "content": "People need to participate in the making of the candy bars only to the extent that the candy bars wouldn’t otherwise get made. We need to reward workers only to the extent that it gives them an incentive to contribute useful labor."}, {"type": "subtitle", "content": "Money Accumulates"}, {"type": "sentence", "content": "The government prints the money, and consumers spend it into the vending machine. But where does that money go? If we want, we can try to tell a story in which the vending machine pays its workers using money that came from the sale of candy bars. But, unless the natural level of basic income is zero, there’s still a gap. Consumers spend more money on candy bars than workers receive in wages. Where does the rest of the money go?"}, {"type": "sentence", "content": "The answer is simple: Money accumulates — it doesn’t just keep circulating forever. Just because some people happen to be both producers and consumers, it doesn’t change the fact that money flows from consumers to producers while goods and services flow in the opposite direction. Producers are happy to accumulate money because they like getting rich. Meanwhile, the basic income must continually replenish consumers’ spending money."}, {"type": "sentence", "content": "If we pull back the curtain and look inside the vending machine, we see that it’s made up of a lot of different parts working together. It’s the workers and their labor. It’s the capitalists and their equipment. It’s the resources and materials. It’s the various automated production processes. All of these factors churn away to produce goods and services for our economy’s consumers."}, {"type": "sentence", "content": "The real-world economy is more like our giant vending machine than it is like a meritocratic system in which everyone gets out what they put in. An efficient economy does not pay workers based on some calculation of the “value” they contribute. It just pays them enough to get them to do the work."}, {"type": "sentence", "content": "As long as producers want to accumulate money, consumers can keep buying their products. Consumers can consume in excess of what they contribute. That’s what basic income facilitates."}, {"type": "subtitle", "content": "Private Sector Make-Work"}, {"type": "sentence", "content": "In the real world, we do have a vending-machine economy, but we don’t have a basic income. Does this mean that our economy’s natural level of basic income is zero? No. Instead, we try to compensate for our lack of basic income in other, less efficient, less effective ways. Rather than fund consumers directly, we use a combination of the financial sector and the labor market to funnel money to consumers."}, {"type": "sentence", "content": "No small number of economists are hard at work studying how to bring the economy to full employment. But what these economists are forgetting is that full employment is not the same thing as full output. Ideally, we’d want to maximize what we’re getting out of the economy rather than what we’re putting into it. Full employment just means we’re keeping everyone busy."}, {"type": "sentence", "content": "This problem has become all the more obvious in the Covid-19 crisis during which we explicitly want people to stay home from work. But because we never questioned the idea that people should depend on jobs for income, we have taken measures to protect those jobs and “stimulate” the economy, including something called the “Paycheck Protection Program.”"}, {"type": "sentence", "content": "In an efficient labor market, jobs only exist because we want the product of the labor and the only purpose of wages is to provide an incentive for people to perform that labor. But we don’t have an efficient labor market. Because we expect everyone to work for a living, we create and protect jobs as an excuse to pay people. And to the extent that we create jobs to push money to workers, it’s not because we actually want the product of the labor."}, {"type": "sentence", "content": "Employers are generally not, out of the kindness of their hearts, going to hire workers unless it is profitable to do so. As a consequence, we’ve had to use economic policy to make it profitable. We make it worthwhile for businesses to borrow cheap money to hire workers. The Paycheck Protection Program is just the latest example; our economy is rife with private-sector make-work."}, {"type": "sentence", "content": "It’s the whole economy. It’s everywhere. It’s big businesses. It’s small businesses. It’s restaurants, farms, etc. that wouldn’t otherwise exist without supportive tariffs, subsidies, and monetary policies. We do crazy stuff to protect American jobs and to keep people employed."}, {"type": "sentence", "content": "At the end of the day, some people can’t find jobs. But that’s okay. They never needed the jobs, to begin with. They needed the money from the jobs. Handing people money is easier and cheaper than trying to tweak economic conditions to make it profitable to hire everyone."}, {"type": "sentence", "content": "Which jobs are the useless jobs? I don’t know. It’s not even a per-job thing. It’s that the whole labor market is suffused with make-work. Pretty much every job is at least partly unnecessary."}, {"type": "sentence", "content": "We can’t point to a particular job and definitively identify it as make-work. We can’t know which jobs are useful until we calibrate the basic income to its natural level and achieve an efficient labor market. At that point, we can take a look around to see which jobs are still standing. Those will be the useful ones."}, {"type": "sentence", "content": "When we sent everyone home from work, it didn’t take long for skies to clear up over our cities. By forcing everyone to “earn” a living through a job, not only do we waste people’s time and other resources, but we also damage the environment. Jobs are bad for the environment."}, {"type": "sentence", "content": "Employing people is only worth it when the benefits exceed the costs. Giving people money is never the right reason to create jobs. That’s what basic income is for."}, {"type": "subtitle", "content": "Monetary Stimulus"}, {"type": "sentence", "content": "It gets worse. One of the biggest ways that we generate private-sector make-work is through monetary policy. The Fed is responsible for keeping the general price level stable. It’s their job to ensure that the average price of metaphorical candy bars stays the same."}, {"type": "sentence", "content": "They do this by encouraging or discouraging borrowing in the financial sector. When the Fed discourages borrowing, it’s called monetary tightening. When they encourage borrowing, it’s called monetary stimulus. Encouraging borrowing is equivalent to encouraging private-sector money-printing."}, {"type": "sentence", "content": "But the distribution of the new borrowing is uneven. The people who can borrow the most money are the ones who already have the most money. Monetary stimulus, therefore, causes fewer people to have more spending power."}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*cWVWWxDIsyk0UCI7dslQHw.png"}, {"type": "sentence", "content": "By skewing people’s spending power in this way, the Fed makes it more profitable for firms to produce fewer goods and services at higher prices. In other words, to prevent the general price level from falling, monetary stimulus makes it profitable for the vending machine only to partially restock itself every day."}, {"type": "sentence", "content": "The Fed succeeds in achieving a stable dollar using this method. But the result is that the economy under-produces and people are forced to spend their time doing unproductive work. Consumers lack sufficient money to buy all the candy bars the economy would otherwise be able to provide them. On the whole, people are over-worked and needlessly poor."}, {"type": "subtitle", "content": "Financial Instability and Recessions"}, {"type": "sentence", "content": "There’s another problem — one that might not seem so obviously connected to basic income: Continued monetary stimulus causes people and firms to borrow more and more money. Asset bubbles form. The interlocking web of private debt grows increasingly brittle with time. Eventually, we have a crash."}, {"type": "sentence", "content": "This is where most of our recessions come from. We get recessions every so often because, instead of funding consumers directly, we over-stimulate the financial sector to create jobs and prop up consumer spending."}, {"type": "sentence", "content": "It doesn’t have to be this way. With basic income calibrated to its natural level, recessions will only occur when there’s an actual hit to the economy’s real productive capacity. We might get a recession because of an asteroid strike, a natural disaster, or a pandemic. We will never see a recession caused by problems in financial markets."}, {"type": "sentence", "content": "In other words, a recession can only occur if something happens to the vending machine’s ability to produce the candy bars — not because people don’t have enough money to buy the candy bars."}, {"type": "subtitle", "content": "Calibrated Basic Income"}, {"type": "sentence", "content": "Basic income is commonly promoted as an amount of money that ensures a pre-determined minimum standard of living. But if we want consumers to reap the full benefit of what the economy has to offer and if we want to prevent future recessions, this is not enough. Instead, we must bring the basic income to its natural level."}, {"type": "sentence", "content": "The catch is that we don’t know our economy’s natural level of basic income ahead of time. To discover it, we will have to gradually feel for it. And because the natural level can change over time, we will have to continue to feel it out. Only by adopting an ongoing policy of calibrated basic income can we ensure that the basic income stays as close as possible to its optimal level."}, {"type": "sentence", "content": "In practice, this would mean starting the basic income at a modest amount and gradually increasing it while we pay attention to what the economy does in response. As the basic income increases, we should expect the Fed to tighten monetary policy and rein in the private financial sector. The more we fund consumers directly, the less need we have to prop them up using monetary stimulus."}, {"type": "sentence", "content": "Eventually, we’ll reach a point where further increases in the basic income no longer provide any additional benefit. Everybody is already buying all the machine’s candy bars. The economy has hit the limits of its productive capacity. Further monetary tightening would only serve to impede useful investment. The financial sector can be too big — like it is now — but it can also be too small."}, {"type": "sentence", "content": "Over time, we should expect the natural level of basic income to increase as we develop new technology and become more productive. Under a régime of calibrated basic income, humanity will automatically reap the benefits of technological advancement. Less labor will mean more leisure, not more poverty."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "When I first became interested in basic income back in 2011, the only thing I understood about it was that it was possible. We could afford to do basic income. For this reason, I never really had to justify basic income on moral grounds or anything like that. I just knew that if we could hand everyone free money, it would be silly not to."}, {"type": "sentence", "content": "There is no basic income today. And that’s a problem because people can’t buy all the things that the economy would happily sell them. Instead of directly paying people a basic income, our government indirectly tries to push money to consumers through monetary policies that facilitate private-sector job creation. We are already handing people money. We’re just doing it inefficiently and we’re hiding it behind the fact we’re also handing people jobs."}, {"type": "sentence", "content": "Without basic income, some people end up falling through the cracks. Other people are forced to do unnecessary work in order to “earn” enough money to survive. Meanwhile, the financial sector — Wall Street — becomes our government’s vehicle for pumping money out into the world. And because most of that money never actually sees the pockets of ordinary people, we compensate by over-feeding the financial sector to force money to trickle out to consumers through the labor market."}, {"type": "sentence", "content": "Lack of basic income is why our economy suffers from a repeated cycle of recessions. It’s why the global financial crisis happened in 2008. It’s why we were improperly equipped to handle the Covid-19 pandemic. It’s why we have poverty. Basic income is not a “nice to have” bonus kind of thing. It’s an “If we don’t have it, we’re in real trouble” kind of thing. We don’t have a basic income. We’re in real trouble. We have been for a while."}, {"type": "sentence", "content": "There are important problems that basic income does not solve. But the way we get people their money is broken, and basic income fixes that. This is a big deal. I don’t know how many of our society’s problems are caused by or exacerbated by a lack of basic income, but let’s find out."}], "topic": "economy"}