{"title": "How to Know if a Therapist Understands NPD Abuse Syndrome", "data": [{"type": "subtitle", "content": "It can make or break your recovery"}, {"type": "sentence", "content": "Maria still could not fathom how her life came to this. She was literally on the lam, running from her psychopathic ex-husband. The restraining orders did not stop him from placing dead animals in her mailbox or hacking into her email account. The obscene phone calls, the garbage littered at her front door, and other forms of episodic vandalism were chronic reminders of his menacing grip. Yet with no tangible proof implicating him she made the difficult choice to dodge his stalking by leaving her hometown. Settled in a new remote place, she desperately sought therapeutic help."}, {"type": "sentence", "content": "During an initial consultation the therapist inquired why she couldn’t just invite her ex for a cup of coffee to discuss their differences. Dumbfounded, Maria thanked her for her time and declined to schedule another visit. Unfortunately this was the third therapist Maria met for a consultation who failed to grasp the enormity of what she was dealing with. It wasn’t until she met with a clinician versed in treating complex trauma and narcissistic abuse, that she was able to initiate a solid plan for healing and recovery."}, {"type": "sentence", "content": "Luckily Maria had done enough reading and viewing of youtube videos to understand the horror of narcissistic abuse. Through her research she was well aware that many therapists were not privy to the surreal machinations of a malignant narcissist."}, {"type": "sentence", "content": "Enabled and encouraged by therapists to continue engaging with the narcissist’s false overtures and veiled manipulation, these victims of narcissistic abuse fail to break free. With the bizarre and often nuanced psychological abuse undetected, symptoms of cognitive dissonance and PTSD worsen as the weight of smear campaigns, gaslighting and intermittent rage, infidelity, and physical assault wreak havoc. Dependent on psychotropics and intermittently coping with alcohol or narcotics, the victim is further stigmatized and marginalized. The therapist, bewildered by the escalation of symptoms and the victims inability to simply end a ‘bad relationship,’ may persist with custodial maintenance, failing to see how the tormentor-redeemer dynamic has established a toxic addictive bond known as Stockholm Syndrome."}, {"type": "sentence", "content": "As a survivor of complex trauma and narcissistic abuse syndrome I spent many torturous years bewildered by how narcissistic abuse plagued me. Well-meaning seasoned therapists offered me respite and healing, but the critical shifts necessary to my recovery eluded them and me. Now, as a clinician who specializes in treating trauma and the ravages of NPD abuse I know how crucial it is for victims to be afforded specialized treatment that specifically addresses the singular nature of this insidious form of psychological trauma."}, {"type": "image", "content": "https://miro.medium.com/max/4790/0*z3bRez_HwoUsKR1P"}, {"type": "sentence", "content": "If you suspect you are reeling from the impact of being a source of narcissistic supply and are in pursuit of therapeutic guidance, finding a therapist who is able to specifically treat your condition is imperative."}, {"type": "sentence", "content": "Request a brief phone call to query the therapist prior to setting up an initial consultation. This will hep you surmise if this connection feels promising. A brief phone call can reveal the therapist’s competence with treating a subset of relational trauma known as narcissistic abuse syndrome, aka Echoism, popularized by Dr. Craig Malkin."}, {"type": "sentence", "content": "In a few minutes time you can inquire about the therapist’s awareness of gaslighting, smear campaigns, the narcissist’s militia of enablers aka flying monkeys, and the narcissist’s complete absence of empathy. This will determine if they understand narcissistic abuse syndrome. It will reveal if they are aware of the necessity of no to minimal contact or abide by contraindicated directives to ’negotiate’ differences."}, {"type": "subtitle", "content": "A seasoned therapist versed in NPD abuse will immediately know the lexicon of narcissistic abuse."}, {"type": "sentence", "content": "The seasoned trauma therapist versed in NPD abuse will know how critical it is to initiate no contact from your narcissistic abuser. No contact will ignite withdrawal. Regulatory techniques such as grounding, self care, daily focused support via web forums, groups and therapy to cut through the brainwashing and gravitational pull to return, are integral to riding out this challenging period."}, {"type": "sentence", "content": "As with any addiction the first three months of abstinence are the most excruciating. Within this early three month time frame, withdrawal from the narcissist becomes more excruciating as illusions are shattered and the realization that love was not real, sinks in."}, {"type": "sentence", "content": "Facing that only exploitation and sadistic degradation characterized the bond, threatens to nullify any hope that the narcissist cared. This is devastating. The victim is humiliated and feels reduced to nothing. Resisting this desolating truth is a natural inclination. The therapist specializing in treating narcissistic abuse understands the necessity of repeatedly breaking through the early stages of denial by serving as an observing ego that helps the victim stay tethered to this tragic reality. Staying the course is essential to guiding the victim to safety. The victim needs to accept that they were nothing more than supply."}, {"type": "sentence", "content": "As the victim enters the survival stage, therapy may move in the direction of exploring prior grooming in one’s family of origin. Early relational familial indoctrinations that set in motion over accommodating, over-functioning and deferring one’s personal power and guardedness are processed. Early neglect and traumas which incurred developmental disasters and subsequent victimization will need to be worked through, concomitant to recovery from narcissistic abuse."}, {"type": "sentence", "content": "Perspectives about romantic dynamics which glorify love bombing will be examined. Psycho-education regarding the narcissist’s application of mind control techniques will be addressed. The reality of human evil in the human condition will catalyze a dismantling of a world view steeped in the belief that there is good in all people. Cultivating discernment and discrimination will be integral to moving forward with greater agency and self protection."}, {"type": "subtitle", "content": "Treatment and recovery from narcissistic abuse syndrome is comprehensive and life altering."}, {"type": "sentence", "content": "Clearly the prognosis is very poor for a victim of narcissistic abuse if they are not under the care of a therapist comprehensively versed in treating complex trauma and narcissistic abuse syndrome. Do your due diligence and get the appropriate therapeutic help you need to heal and reclaim the life the narcissist tried to rob you of! Your recovery is the ultimate vindication and the only way to create meaning out of a catastrophic life altering experience."}], "topic": "mental-health"}