{"title": "Mommy Issues: Unlearning Inherited Pain", "data": [{"type": "subtitle", "content": "This Is Us"}, {"type": "subtitle", "content": "I come from a long line of mothers abusing daughters"}, {"type": "image", "content": "https://miro.medium.com/max/4244/1*Uq8fInwSeOea32JJX98Dvg.jpeg"}, {"type": "sentence", "content": "When I call my mother on Mother’s Day, we make mild conversation for 30 minutes. She asks about my job. I ask about the ducks. She complains about my father. We withdraw from the conversation as soon as good manners allow. This is, believe it or not, the healthiest our relationship has ever been. This is a victory, and it was hard-won."}, {"type": "sentence", "content": "My mother refused to give up her maiden name when she married. I have only ever known her as a conservative Irish Catholic woman, but by all accounts, she was a real wild card in her youth. I’ve seen the pictures of her bleached hair with red tips molded into liberty spikes all over her head. I’ve seen pictures of her in a leather jacket outside a theater, preparing for a live showing of Rocky Horror Picture Show. I’ve seen her tattoos, faded and aging alongside the rest of her. But this cool punk-rock mother has always been a stranger to me."}, {"type": "sentence", "content": "It was my father who filled my arms with books by Robert Frost and Walt Whitman the moment I could read. But my mother did like Sylvia Plath. The first thing she ever told me about Plath was that she stuck her head in an oven. She said this as only a Catholic could, with a particular disdain rationed toward speaking about suicide. But there was something else just behind that judgmental tone: a spiteful admiration."}, {"type": "sentence", "content": "Later, when I discovered the racism and anti-Semitism rampant throughout Plath’s work, I wasn’t too surprised. Growing up with my mother, I’d learned early that the boots snapping the necks of vulnerable women often belonged to other women."}, {"type": "sentence", "content": "My sister’s favorite poet has always been Emily Dickinson. We find our mouthpieces for pain in women whose pain resembles our own. Emily Dickinson suffered alone and quietly, like my sister. Sylvia Plath suffered emotionally and loudly, which is what makes her work enticing to loud and emotional women — something I inherited from my mother. But Plath was also unforgivably narcissistic and so blinded by her own hurts that she could not recognize the ways she hurt others."}, {"type": "sentence", "content": "Blind narcissism is easily contracted. If it wasn’t, prejudice borne from ignorance would not be nearly so widespread. It’s hard to see the pain of others when you’re so busy wallowing in your own. It is easy to poke and prod at your hurts and then feel betrayed when they do not heal. Consider a dog, scratching relentlessly at his own stitches until he reopens the wound. This is why we make them wear cones."}, {"type": "sentence", "content": "For ourselves, we pretend at self-discipline. An alcoholic says, “I can still go to the bar with my friends. I just won’t drink anything.” A cutter says, “I can still keep the knife by my bed. I just won’t reach for it.” An addict says, “I can still go to the party. I just won’t take what is offered.” Sometimes this works. Mostly it doesn’t."}, {"type": "sentence", "content": "In the novel Sharp Objects, Gillian Flynn writes, “Sometimes I think illness sits inside every woman, waiting for the right moment to bloom.” This can be physical illness, like the kind the protagonist’s mother forces on her daughters. And it can refer to mental illness, like the protagonist’s own, which manifests mostly in an overwhelming need to cut words into her skin."}, {"type": "sentence", "content": "Often, the illness waiting patiently inside each woman is a cyanide capsule put there by another woman. Pain passed down like an heirloom. In Sharp Objects, the protagonist, Camille, received hers from her mother, Adora, who received hers from her mother in turn. When I realized this, I set the book down to cry."}, {"type": "sentence", "content": "I thought of my abuse at the hands of my mother, who had been abused by hers. I used to cut words into my skin too. I carried a little CD case filled with pocket knives, razor blades, protractor needles, and thick shards of glass; I preferred glass shards because they cut on each end and their cuts burned longer. I kept this case for some time, even after I’d stopped cutting. Just looking at it was a comfort of its own."}, {"type": "sentence", "content": "There is a lot to be said about the inherent pain that comes with being a woman, especially generational trauma based in fear of sexual violence and lack of bodily autonomy, which our mothers, aunts, grandmothers, gave to us rather than questioned. The lost control and ownership over our own bodies is shared between generations of women, originally placed in our hands by men. We see this in women at salons, crying as their daughters cut or dye their hair."}, {"type": "sentence", "content": "From Tess Morgan, the pseudonym under which a mother wrote a whopping melodrama to The Guardian when her child had the indecency to get a tattoo: “I will never look at you in the same way again. It’s a visceral feeling. Maybe because I’m your mother. All those years of looking after your body.” She said “your body,” but really she meant “our body.”"}, {"type": "sentence", "content": "In Sharp Objects, when Adora sees the extent to which Camille has mauled her own skin, she treats this as an attack against her, because Adora cannot see Camille as anything but an extension of herself. My mother’s own reaction to my cutting was similar. When I had my lip pierced, she refused to speak to me for two weeks. When she discovered I was sexually active, she put me on house arrest and then disowned me. Mothers, as women, exist in a world that is increasingly wrenching more and more autonomy from them. And so in their search for control, they turn to their children’s bodies."}, {"type": "sentence", "content": "Of course, mothers who feel some sadness at watching their children change — or hurt — themselves are not automatically bad mothers. But sometimes this sadness becomes a seed that can grow into a manipulative grief and a malignant need to exert power."}, {"type": "sentence", "content": "We often neglect that women can exist beyond the parameters of our pain. Pain does not have to come with a purpose. It does not have to be dissected and examined and redistributed for the consumption of others. Your pain can belong to you only. You have that right."}, {"type": "sentence", "content": "I would love to see women discuss pain and feel pain and not simply accept the inevitability of it. This idea that when a woman is born she is gifted pain and she will always have this pain until she dies because she is a woman makes me weary. I would like to see women feel their pain but also recognize the causes and try to move forward and find happiness and self-fulfillment. Maybe the pain never dissolves, maybe it always exists inside us, but it can exist alongside a future that is painless. A scar is nothing but pain healed over."}, {"type": "sentence", "content": "I have never related so viscerally to a protagonist as I relate to Camille Preaker from Sharp Objects. Here is a woman in pain, a pain so inherent that she cannot remember ever not feeling it. She is not unkind, but she is not particularly kind either. She is not generous. She is not brave. She is not a good victim, but she is an easy one. She is a cutter. She is a fuckup. But she is trying, desperately, in a way that no one else can see. She is me in another life, with a different sister. Camille, who lost her sister at 13, imagines a world where Marian had not died. Would they have survived their mother? Would Camille have survived in a better way? As someone whose Marian did not die, I believe the answer is yes."}, {"type": "sentence", "content": "Camille represents a particular victim that I don’t often see: the female victim of a female abuser and — even more specifically—the child victim of a maternal abuser. Evil mothers written by men are usually propaganda. Evil mothers written by women are testimonials. Camille hates women because of what a woman has done to her, though of course she does not recognize that. And, what’s more, Camille does not recognize the multitude of ways other people, primarily men, have hurt her because the hurts they dealt have never been as devastating as the pain from her mother. “A child weaned on poison considers harm a comfort,” she says."}, {"type": "sentence", "content": "In one scene, Camille describes how as a blackout-drunk 13-year-old girl she was “passed around” four football players. She argues it wasn’t rape. She says, “Sometimes drunk women aren’t raped; they just make stupid choices — and to say we deserve special treatment when we’re drunk because we’re women, to say we need to be looked after, I find offensive.” She chose to go to those woods, she chose to drink, and she chose to put herself in that position. Whatever happened afterward, well, those are just the consequences of her actions. At least that’s what she’s been taught to tell herself."}, {"type": "sentence", "content": "Last summer, I went to a bar in Milwaukee with two other flight crew members I did not know well. I had four drinks, all mixed, none especially strong. I had eaten regularly throughout the day and ate again at the bar. I was not dehydrated. I am a regular drinker. I repeated these things to myself throughout the following day, as if I were my own interrogator. We arrived at the bar around 3 or 4 in the afternoon. We left around 9 or 10. I had four drinks over five or six hours. All of us went to the bathroom multiple times. My drink was left unaccompanied for many of them."}, {"type": "sentence", "content": "I came to consciousness around 1 in the morning, completely naked in the shower of a hotel room I did not recognize. I felt dizzy and confused. There was someone asleep in the bed, who I later realized was the other flight attendant, though without my glasses, I could not make her out. Wrapped in a towel and dripping wet, without my clothes, phone, glasses, or key card, I stumbled out into the hallway, only to realize I could not get into my own room. Another flight attendant woke up to me knocking on her door. She gave me my clothes, my phone, my key card. She explained that we had gone to our captain’s hotel room to watch something, and she wanted to leave but she didn’t want to leave me alone with him. I vaguely remembered she and I kissing in his room, though I was too drunk to really move at the time."}, {"type": "sentence", "content": "This was a situation I can feel righteous indignation about: I did not ask for drugs. No one offered me a choice. I did not drink enough to put myself in that position. And yet, I still feel a shallow amount of shame, like standing ankle-deep in dark water. I did go to the bar with people I didn’t know. I did leave my drink alone, even though I know better. “I know better,” the mantra that’s followed me from my childhood. “You know better” turned into “I know better,” but it’s still said in my mother’s voice."}, {"type": "sentence", "content": "A month later, while visiting Boston with my mother, I gave her a general summary of what happened. I’m not sure why I mentioned it, and I regretted it immediately. I don’t mean to keep testing my mother, offering these scraps of myself as feathered lures, hoping she might surprise me while knowing she never will."}, {"type": "sentence", "content": "She said, “Can you now understand why as your mother I have trouble trusting your choices that led to this?” Lure swallowed, she sank, and I still don’t know what I expected."}, {"type": "sentence", "content": "When I told my sister about the incident in Milwaukee, she held me close. She said she was glad I was alright and that she loved me. It should not seem remarkable to be treated with care by the people meant to love you."}, {"type": "sentence", "content": "I hated women for a long time because of what my mother did to me, though of course I didn’t recognize it for what it was. It was hard for me to empathize with women. The portraiture that became common during my late adolescence, of women as martyrs, women as plated heroes rising up against their own hydra, the patriarchy. Women as strong and independent warriors. These images hurt me. My own dragon was a woman, a self-proclaimed feminist even, and no matter how many times I cut off her head, there were always more. To me, all these towering, powerful women wore the face of my mother, who was a towering, powerful force of her own."}, {"type": "sentence", "content": "This was probably unfair given that the most positive figure in my life, my older sister, was also a woman. But the ways our minds interpret pain aren’t always fair. My abuser was a woman, and so I could not trust women. Underneath this was the fact that I also loved women — but in a way that was “wrong.” Thinking of women hurt me, but I could not stop. I thought about women as I had sex with men. I thought only about women when I watched romantic scenes between women and men. I thought about women in locker rooms, in shopping malls, in train stations. Because I could not think about them rightly, I made these thoughts mean. I imagined the girls I liked as I let men fuck me: Would she look like this? Would she let him do this to her? Would she be better than me? I was uncomfortable with my own lust, so I turned it into a competition. This was what I told girls when I kissed them. “Let’s see who can do it better.” By the end, I always announced that I’d won, though during the actual act of it, I would forget we were supposed to be competing."}, {"type": "sentence", "content": "I struggle to relate to womanhood as defined by heterosexual women. Mass-media-processed imagery of “girl power!” encourages us to acknowledge the loving deepness of friendship between women, which will always be stronger than marriages women find themselves falling into. “Not if you marry a woman,” I think to myself. “Not if you fall in love with your best friend.” Never mind the fact that the women penning these think pieces and articles were often the teenagers screeching, “Why are you looking at me? Are you a dyke?” at girls like me in middle school locker rooms."}, {"type": "sentence", "content": "When Camille Preaker goes back to her hometown, she is forced to reconcile not only what was done to her, but what she did to other people. Often, people who are hurting like to hurt. As a teenager, I had a specific response to whenever my mother would hurt me. After she was finished, I would go looking for something she loved. My mother always loved “things”: shelves filled with knickknacks and figurines and ceramic plaques and fragile pottery. I would take one of these things and I would break it. I would throw it at the wall. Smash it with a hammer. Stomp on it with my boots. I would shatter it however I could, and then I would bury it somewhere in the house for her to find. She always knew it was me. She would hurt me again, in punishment. And I would break another thing she loved. Rinse, repeat."}, {"type": "sentence", "content": "In this way, I was not a good victim, although I was easy. All children make easy targets, even the loud and spiteful ones like me. Children who are abused by a parent are more often abused by their mother. It makes sense in terms of access. In traditional mother/father households, mothers are commonly the primary caregiver. They are left alone with the child more often and for longer. In a single-parent household, the parent is usually the mother."}, {"type": "sentence", "content": "When I’ve written about my own experience with maternal abuse, I’ve had commenters encourage me to “try empathy” and “have a relationship with your mom.”"}, {"type": "sentence", "content": "Telling a victim of abuse to “try empathy” with their abuser is outrageous, but common. People cannot accept that a mother might abuse her own child without first having been a victim herself. And my mother was a victim, long before she decided to pass that pain along. And her mother had been a victim too, molested by her father while her mother allowed it to go on. I wonder if that brings my mother any comfort, if it helps her “try empathy” when she looks at the scars her mother gave her."}, {"type": "sentence", "content": "Gillian Flynn writes women who do horrible things, and she does not expect or even want us to forgive them. She writes women who hurt other women in poignant ways that cannot begin to compare to any crimes the men in her stories commit. The men in Flynn’s stories are inconsequential, easily supplanted by any other man. They hurt in the usual ways. Women expect men to hurt us. When women hurt other women, it is deep and lasting and influential. In Sharp Objects, Camille’s younger sister Amma says, “Sometimes, if you let people do things to you, you’re really doing it to them.” And sometimes you’re doing it to yourself."}, {"type": "sentence", "content": "When Camille drank her mother’s milk, even knowing it was poisoned, she was thinking, “Come on. Is that the best you’ve got?” As a teenager, I constantly pushed back at my mother, dared her to yell louder, to hit harder, to bruise more. One evening, my mother choked me in the kitchen, and as my vision began to blacken around the edges, I thought, “At least if she kills me, she won’t get away with it.”"}, {"type": "sentence", "content": "Last year, I spent 10 days visiting my sister in Okinawa. Most of my time was spent touring the island. We went to the beach, a pastoral painting of white sand and cotton sky and crystal-blue water, a color scheme I had not believed was based in reality. We went through the cities, architectural spiderwebs of coral roads and geometric buildings freckled with spots of sprawling forest gnawing at the red-tiled roofs."}, {"type": "sentence", "content": "My brother-in-law had several bottles of different kinds of sake for me to try. One of the bottles held the coiled body of a habu snake, mouth open and ready to strike. The habu snake is a type of pit viper, related to the rattlesnake and very venomous. Its sake, habushu, is made of crushed rice, koji mold, herbs, and honey. The snake is inserted into the liquid, and the aging process dissolves the venom, making it nonpoisonous. There are two methods for inserting the snake: Either the maker simply submerges the snake and lets it drown, in which case its body will not be coiled and posed, or they can freeze the snake. While frozen, the snake is gutted and bled and then sewn up again. As it thaws and gains consciousness just for a moment before succumbing to its injuries, the habu snake will coil and prepare to strike."}, {"type": "image", "content": "https://miro.medium.com/max/1048/1*z-ffPhER_4GGARAjflmGZg.png"}, {"type": "sentence", "content": "I held the bottled snake in my hands as my brother-in-law explained this. With each movement, some of the snake’s scales began to flake from its body. I tried to imagine the horror of waking up to find that, in your unconsciousness, your body had been so mutilated. Cut into, emptied, and sewn back together like nothing happened."}, {"type": "sentence", "content": "In Sharp Objects, Camille dreams that her mother has cut her open and taken everything out, sewing her initials into everything before putting it back in again, orderly and clean. A mother’s handiwork turned nightmarish. My own mother would often comb through my room while I was gone, or even sleeping, taking anything she thought I shouldn’t have, innocuous things like skirts and candy. And money, always money. When I asked her if she had seen the missing items, she blamed me. “You never take care of your things,” she scolded. Later, I would find them in the dumpster outside or hidden in the back of her hamper. These are the things you have to do, when you cannot trust the person who is supposed to care for you: Dig through dumpsters and dirty clothes, searching among the trash and filth for proof you aren’t crazy."}, {"type": "sentence", "content": "On my last day in Okinawa, my sister packed me a bento box to take on the plane. She filled it with golden kiwi, naan, and beni imo, an Okinawan sweet potato with flesh as purple as a cracked geode. She said, “I don’t want you to be hungry.” Food as an act of love, a statement of care, the sort of act a mother might perform. My sister, a mother, is the bar by which I compare all others. When my niece announced she wanted to shave her head of beloved auburn curls, my sister gamely fetched a pile of hairstyle magazines for her to thumb through and choose between. While my mother was teaching me that love is conditional, my sister was packing my lunch."}, {"type": "sentence", "content": "Anne Sexton wrote about the pain of womanhood and motherhood. Sexton sexually abused her daughter Linda for many years. She wrote: “Linda, you are leaving / your old body now, / it lies flat, an old butterfly, / all arm, all leg, all wing, / loose as an old dress.” She wrote this poem for Linda’s 18th birthday. To Linda herself, as a teenage girl attempting to place boundaries around her molested body, Sexton said, “There is no wrong way for a mother to love her child.”"}, {"type": "sentence", "content": "Sometimes there is a specific architectural pain built between mothers and daughters. These mouthpieces for womanhood have often wrapped their hands around the throats of other women. To deny this is to deny the victims their own voices, their own articulation and excision of pain."}, {"type": "sentence", "content": "I once had a dream so visceral that when I woke, I spent the morning believing it was a memory. In it, my mother and I lived together in an old house, and we knew each other in a way I now realize we never will. The dream itself was innocuous: We watched a movie. We made a pie. I fetched her pain medication for her knees and held her hand as she fell asleep. But the love and the trust that swelled between us was overwhelming. It was all I had ever wanted. On realizing it was not real, I began to wonder about that gentle dream mother who looked like mine. Had she had a mother who loved her too? This is always the question we ask ourselves when we are mistreated: What would have to change for them to love me?"}, {"type": "sentence", "content": "If my mother had been treated with love by her own mother, would my childhood have been different? If my grandmother had not been abused, would she have still held so much contempt for her own children? How high up on the ladder of familial abuse must I climb before I can finally see what brings a mother to hate her daughter?"}, {"type": "sentence", "content": "I have so much love and faith in women and in our ability to heal and help and grow. But first these things must be taught. They must be passed along in place of the worn-through fear and pain our grandmothers could not unlearn. We cannot erase these scars completely, but the skin can learn new memories."}, {"type": "sentence", "content": "My mother and I now have matching tattoos. Mine is on my shoulder blade, the same skin she once bruised. She kept laughing as I was getting it done because I couldn’t stop dancing to the music playing over the speakers. When I see it in the mirror as I undress for the shower, I no longer think of the pain of my adolescence, the fear of my mother’s shadow. I think about my mother’s laugh."}], "topic": "economy"}