{"title": "The anatomy of a perfect cold outreach message", "data": [{"type": "sentence", "content": "Whatever the medium, don’t tell us your life story. Keep things short, clear and obvious."}, {"type": "image", "content": "https://miro.medium.com/max/10820/1*oSlZ3WLbSQ9R6I2grolKbw.jpeg"}, {"type": "subtitle", "content": "90% of Cold Outreach Messages I Receive Are Terrible"}, {"type": "sentence", "content": "Like many people I’m constantly bombarded by cold sales messages via LinkedIn and email. Most of them fall into the trap of being a combination of the following:"}, {"type": "sentence", "content": "Needless to say, I am very unlikely to engage."}, {"type": "subtitle", "content": "My Cold Outreach Approach"}, {"type": "sentence", "content": "This is how I approach potential guests for my podcast on LinkedIn. I also adapt the message slightly to use it on Twitter and other platforms, usually just by changing the CTA. My goal is to convey clearly my value and what I want from them in the shortest message possible."}, {"type": "sentence", "content": "It’s also important to note, this is also sent to a carefully selected list of people, as opposed to a blanket outreach campaign. It’s just as important to put time and effort into working out who you are messaging, alongside the message itself."}, {"type": "sentence", "content": "It currently has a 70% success rate (success = accepting the connection request which allows me to send them through more information)"}, {"type": "subtitle", "content": "Breakdown: Why does it work?"}, {"type": "sentence", "content": "Hi [X],"}, {"type": "sentence", "content": "I’m not a huge fan of hugely formalised openings, but just use your common sense here, if they would be more responsive to “dear” due to the position or age consider using it. I’d much rather save the characters and make the message appear as short as possible."}, {"type": "sentence", "content": "Also please never ever use “greetings of the day” — if I read this I immediately delete something."}, {"type": "sentence", "content": "[My podcast The Brave explores resilience and adaptability in the 21st century.]"}, {"type": "sentence", "content": "Set the scene and give them context in one sentence. Avoid superfluous details and keep it to the absolute essentials."}, {"type": "sentence", "content": "[We have released over 30 episodes with over 3000 downloads and have a growing audience which includes global creative and tech professionals.]"}, {"type": "sentence", "content": "This is where you want to establish both your own credibility and the value you can offer. Statistics are an especially powerful way of displaying credibility (ratings, downloads, users etc.)."}, {"type": "sentence", "content": "[I’d love discuss having you as a guest on an episode],"}, {"type": "sentence", "content": "This is your ask. You need to make it 100% clear what you’re expecting from a continued conversation."}, {"type": "sentence", "content": "Please note “My company provides X services, I’d love to take 5 minutes of your time to discuss how we can help you” is extremely vague."}, {"type": "sentence", "content": "People don’t have 5 minutes to find out how you’re going to help them. They want to know immediately the problem you solve and the value they bring."}, {"type": "sentence", "content": "[could we connect]?"}, {"type": "sentence", "content": "This is your CTA. Make it clear how they can indicate their interest and give you permission to follow on the conversation."}, {"type": "sentence", "content": "Ideally your ask shouldn’t be too onerous on the other person, for example I’m much more likely to agree to be sent some info via email than agree to a 15 minute call."}, {"type": "sentence", "content": "Respect their time and attention. Remember, most people you’re trying to contact will be extremely busy and any message which looks time intensive to figure out and/or respond to will likely get ignored."}, {"type": "subtitle", "content": "Following Up"}, {"type": "sentence", "content": "How many times should you follow up a cold outreach email? It depends."}, {"type": "sentence", "content": "My personal preference is to send a single one line follow up a couple of days after my first message."}, {"type": "sentence", "content": "If they don’t show any desire to continue the conversation after that, I generally leave things for at least a month and then send a final message."}, {"type": "sentence", "content": "Enjoyed this post? Please share! You can find more of my ramblings and professional info on my website and follow me on Twitter @BethanVincent. You can also contact me on hello@bethanvincent.com"}], "topic": "marketing"}