{"title": "My Professor Tried to Talk Me Out of My Career", "data": [{"type": "subtitle", "content": "Why you need to ditch unsolicited advice"}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*64hNPH7qMezERQGalUrSmw.jpeg"}, {"type": "subtitle", "content": "“I think you’re making a huge mistake.”"}, {"type": "sentence", "content": "That was the first line of an e-mail from the professor teaching one of the very last classes I needed to graduate."}, {"type": "sentence", "content": "I remember clearly the late-night cram session in the library. It was just after midnight, my hands curled around my favorite cappuccino when I heard the familiar ding in my headphones."}, {"type": "sentence", "content": "My jaw dropped when I saw the e-mail. It was a large chunk of text, a near rant about how I was making a mistake applying for graduate school to pursue a career as a college educator."}, {"type": "sentence", "content": "My professor predicted I’d “get bored” as an educator, said that I was “wasting my talents,” and I would “never be able to make an impact.”"}, {"type": "sentence", "content": "Get bored?"}, {"type": "sentence", "content": "I’ve been an educator for many years, and I’ve been a lot of things. Frustrated and heartbroken, sure, but bored has never been one of them."}, {"type": "sentence", "content": "I felt the heat building up in my face, and my cheeks burned. I was angry."}, {"type": "sentence", "content": "They were my talents to “waste.”"}, {"type": "sentence", "content": "How dare he?"}, {"type": "sentence", "content": "“Never be able to make an impact” rang in my ears. Like many educators, making an impact is a key reason I was drawn to education. I believe in the power of education to transform lives."}, {"type": "sentence", "content": "I am very grateful for the inspiring educators and mentors who have transformed my life. Paying it forward is deeply meaningful to me. My dreams could have been derailed by this e-mail, but I ditched his unsolicited advice."}, {"type": "subtitle", "content": "When to Ditch Unsolicited Advice"}, {"type": "sentence", "content": "My mom always said, “Consider the source before you take the advice.” And she’s right. If the source doesn’t know you well, understand your circumstances, and lead by an example worth following, keep on moving."}, {"type": "sentence", "content": "The thing is, this professor was not one of my inspiring educators and mentors. I barely knew this man. I had completed half of a class with him."}, {"type": "sentence", "content": "I was baffled by his heavy-handed e-mail, especially given how little he knew about me. Friends told me, “He’s just on a power trip. Ignore him.”"}, {"type": "sentence", "content": "Psychologically speaking, they might be right. Art Markman, Ph.D. summarizes studies on advice-giving in Psychology Today, “Giving advice increased people’s sense of power. This was particularly true for people who are interested in seeking power.”"}, {"type": "subtitle", "content": "Ditch the power-trippers."}, {"type": "sentence", "content": "If the advice-giver is on a power trip, it could be self-serving advice so they can feel important. I’m not sure of that professor’s motives, but it is possible in another area of his life he was feeling dis-empowered. It could have been his upcoming retirement. That’s not my baggage to carry or unpack, but I can acknowledge its presence."}, {"type": "subtitle", "content": "Ditch the projectors."}, {"type": "sentence", "content": "It would help if you also ditched advice from people that are projecting their insecurities, fears, or regrets, but it can be hard to tell who is leveling with you versus who is projecting."}, {"type": "sentence", "content": "Here’s a hint. Someone who is leveling with you is giving you a truth you may not want to hear. But the difference is they’ve done the internal work necessary to take care of their well-being. Ideally, they know you well enough to give insights into your life. They care about you. And, they have a life you respect or expertise that is valuable. Like my mom says: Consider the source."}, {"type": "subtitle", "content": "Ditch the bad advice, but note how it makes you feel."}, {"type": "sentence", "content": "Just like someone encouraging you to follow your dreams can be validating — someone discouraging you can show you how badly you want something. That is also great information."}, {"type": "sentence", "content": "Feeling defensive could be a sign that your hopes, dreams, or choices are worth defending."}, {"type": "sentence", "content": "In my case, I responded to the e-mail the next day. I thanked him for the e-mail and explained that I would not be taking his advice. I ditched his unsolicited advice and never looked back. I love my career. My students are my biggest success, and I have many thank you notes from students who I’ve positively impacted."}, {"type": "sentence", "content": "Maybe I’ll never know why he felt compelled to give me unsolicited late-night advice about my dream."}, {"type": "sentence", "content": "But I do know that I am thankful every day that I didn’t take it."}, {"type": "sentence", "content": "Sign up for my newsletter for a little feminism, a little inspiration and a lot of life here."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "education"}