{"title": "How to Create a Killer Pitch Deck For Investors", "data": [{"type": "image", "content": "https://miro.medium.com/max/2560/0*5QqXPx6ICRvPiqv0.jpg"}, {"type": "sentence", "content": "Pitching your startup idea or product to a room full of investors is extremely nerve-wracking."}, {"type": "sentence", "content": "The pitch deck is a presentation that entrepreneurs put together when seeking a round of financing from investors. On average pitch decks have no more than 19 slides."}, {"type": "sentence", "content": "In essence, the three keys to powerful pitch decks that get funded are:"}, {"type": "sentence", "content": "I do a deep dive on pitch decks in a piece that I published not long ago where I cover the pitch deck template that was created by Silicon Valley legend, Peter Thiel (see it here). Moreover, I also provided a commentary on a pitch deck from an Uber competitor that has raised over $400M (see it here). In any case, below are essentially the slides that you want to include inside your presentation:"}, {"type": "sentence", "content": "Note that according to research done by DocSend, investors spend on average 3 minutes and 44 seconds per pitch deck. From their study which analyzed 200 pitch decks, investors spent the most amount of time reviewing the slides concerning financials, team, and competition."}, {"type": "sentence", "content": "1. Problem"}, {"type": "sentence", "content": "The slide covering the problem should be a way for you to explain what gap you are filling in the market. This needs to be a painful problem that people can relate to and that investors would not have issues with understanding."}, {"type": "sentence", "content": "Furthermore, you are only resolving one problem. Not two or three. You need to come across as someone that is focused and relentless to resolve a known issue."}, {"type": "sentence", "content": "Normally I would recommend startups to create different slides for the problem and the solution as you don‘t want to overwhelm the investor in one slide."}, {"type": "sentence", "content": "Note when an investor gets involved with your venture is either because one of the following things:"}, {"type": "sentence", "content": "If an investor falls inside the three buckets of interest cited above at the same time, that means you got your lead investor. This may result in you securing at least 20% of the financing of the entire round that you are looking to raise."}, {"type": "sentence", "content": "2. Solution"}, {"type": "sentence", "content": "The solution needs to be concise and very clear. Especially if you are a tech startup, your solution needs to be scalable. Scalability is the capability of a system to increase its total output under an increased load when resources are added. This is what investors essentially want to see. A company in which they can invest in order to have the wheel turn much faster."}, {"type": "sentence", "content": "Moreover, it makes sense on the solution to outline why it makes sense now. As you may know timing is everything in business and being at the right time in history is what really matters. Being too early or too late to market can be the main cause of failure for startups."}, {"type": "sentence", "content": "Avoid statements referencing you being the only one doing this, you being the clear leader, etc. Just like Mark Cuban puts it, there are at least 100 people that have come up with that idea before you and other companies that may be tackling that same problem with a different approach."}, {"type": "sentence", "content": "3. Market"}, {"type": "sentence", "content": "The market is going to determine the potential exit of the investor. If you are operating in a small market also the returns could be impacted by this."}, {"type": "sentence", "content": "Remember that any market that is under $1B might not be that attractive to an investor in hyper growth businesses. The reason for this is mainly because these investors are on the hunt for investment opportunities that may provide a 10x return in a horizon of 5 to 7 years."}, {"type": "sentence", "content": "Ultimate investors, and especially institutional investors, look for companies that will not only transform or disrupt their industry but have the potential to fundamentally reshape the way consumers interact with a market."}, {"type": "sentence", "content": "My recommendation is to show on this slide a graph that outlines the market growth in the past and the future potential growth so that investors can quantify the upside and potential ROI on their investment. Make sure you are including sources from research papers."}, {"type": "sentence", "content": "4. Product"}, {"type": "sentence", "content": "This slide is all about showing screenshots of your product in action. To make it even more powerful you may want to add some description about the product itself and some quotes of some of your existing clients talking about how much they love your product."}, {"type": "sentence", "content": "5. Traction"}, {"type": "sentence", "content": "This slide should show the month over month growth of the business (e.g. revenue, metrics, etc). This is the slide where you would include hopefully the famous hockey stick that investors want to see on every pitch deck they review. Getting to this type of “promise land“ for startups is not easy."}, {"type": "sentence", "content": "In the event you are very early stage or your growth is not that interesting I would avoid including it. To give you an idea, accelerator programs like Y Combiner expect at least 15% month over month growth."}, {"type": "sentence", "content": "6. Team"}, {"type": "sentence", "content": "The team is probably one of the most important slides in any pitch deck. The investor wants to know who is driving the bus and what makes them so unique to execute on that mission and vision. Note there are at least 100 other people that have also thought about your same idea. For that reason idea is 10% and 90% is from execution."}, {"type": "sentence", "content": "If you have the right people seated on the right seats of the bus the company will end up finding its direction to success. Unfortunately when you are investing in a first time founder you are also investing in that individual‘s education and all the mistakes he or she will make during the early days. This is always part of the journey and there is no way to go around it."}, {"type": "sentence", "content": "The best way to showcase the team slide is by just describing the members of the leadership team (ideally cofounders). List in bullet points what have been the two or three achievements from every member. Ideally those would be related to the company that is seeking capital."}, {"type": "sentence", "content": "7. Competition"}, {"type": "sentence", "content": "A diagram is a good idea to show the investor the competitors that you have executing in your space. How you compare to them and where you land with your value proposition."}, {"type": "sentence", "content": "You want to clearly differentiate yourself from the rest so that the person that is reviewing the slide gets what makes your company so unique."}, {"type": "sentence", "content": "Perhaps another slide that you want to include is one that describes how much capital each competitor has already raised in the past and at what valuation. This could help in providing some perspective of how much the market is paying. This could also play in your favor when the time comes to negotiate the terms of the deal or proceeding with a potential investment."}, {"type": "sentence", "content": "8. Financials"}, {"type": "sentence", "content": "Normally you want to shoot for at least 3 years of projections. There are some institutional investors that even ask for 5 years of projections but in my experience these investors tend to be the least sophisticated ones."}, {"type": "sentence", "content": "Even though projections are a shot in the dark when you are dealing with startups, they do provide a good idea of where the business is heading and potential outcomes. It also give a good idea to the investor as to how grounded the management of the the company is."}, {"type": "sentence", "content": "This slide is more important than entrepreneurs normally think. When you first connect with an institutional investor they will ask for your pitch deck. 3 months later they will ask you on your next meeting where things are at and then they will make a decision. With this in mind, it is always a good idea to be more on the conservative side and to over deliver. Worst thing that can happen is for you to completely miss the mark and under promise."}, {"type": "sentence", "content": "Additionally you will need to have ready your financials in Excel format as investors may want to see that after reviewing your pitch deck. For that reason you do not need to go into much detail on the deck. All you need is to provide a summary."}, {"type": "sentence", "content": "9. Amount being raised"}, {"type": "sentence", "content": "On the ask slide you want to be strategic. Do not put a specific amount that you are raising. For example, if you would like to raise $5 million, I would suggest putting a range between $3 million and $5 million. Firms have limitations on their investment which means that if you place $5 million in your pitch deck and that firm has a mandate to not invest over $3 million, you will most likely have them pass. By including the range from $3 million to $5 million on the raise amount you are also including such firms. For that reason you want to be attractive to as many targets as possible, so go with ranges instead of specific amounts."}, {"type": "sentence", "content": "Most founders forget to include in their pitch deck their contact information. If you have a large following on social media you should include the links on the cover slide. I find this would provide social proof. Interested investors will most likely look you up and will also reach out to people in common in order to ask for references."}, {"type": "sentence", "content": "If you are serious about your pitch deck it is not a bad idea to ask someone with a high-level understanding of sales psychology to take a look at your deck. A couple of tweaks to images, placement, and words could make a multi-million dollar difference."}], "topic": "startups"}