{"title": "The digital design industry is changing", "data": [{"type": "subtitle", "content": "It took just two months, but now it’s time to adjust to the new, much faster reality."}, {"type": "sentence", "content": "The pandemic came unexpectedly."}, {"type": "sentence", "content": "The IT people felt safe initially (and yes, that includes UX designers — we’re the IT crowd too), but after a while it started to negatively affect everyone."}, {"type": "sentence", "content": "Companies are cutting funding, budgets are dropping and the building processes are turning more and more agile. Some can even call them recklessly agile."}, {"type": "sentence", "content": "I’ve been watching the changes in the industry closely for the last two months and based on LinkedIn posts, tweets and our own experience with incoming leads I came to a couple of conclusions."}, {"type": "subtitle", "content": "The jobs"}, {"type": "sentence", "content": "Out of just my feeds I noticed 29 UXers lose their jobs. 12 Front-end developers were also unlucky. No back-end developers popped out in my feed, so I guess a lot of them are safe."}, {"type": "sentence", "content": "But what’s surprising UI designers are doing quite good. I have only seen 2 “purely UI” people getting fired (still, talking about just my feed)."}, {"type": "sentence", "content": "Some of the above UX people were UX/UI, but I quickly went through their portfolios to check out their skills, and most of them were really just UX designers with some UI knowledge. Nevertheless I tried to share each and every one of those posts further to help out, but that’s not my point here."}, {"type": "sentence", "content": "People are buying with their eyes, so especially now it may be easier to convince a customer with a dribbble-worthy set of shots in the portfolio, than a set of personas, some gray tables and diagrams."}, {"type": "subtitle", "content": "Maybe some things can happen automatically?"}, {"type": "sentence", "content": "AI is already simplifying and shortening some of those processes as we speak."}, {"type": "sentence", "content": "Maybe this is a good time to polish some UI skills a bit, and have a more eye-catching Resumé?"}, {"type": "sentence", "content": "After all, all those processes can still (and should) be there, but start with a nice high-fidelity design on the first page — present the outcome and then show how you got there."}, {"type": "sentence", "content": "Generalists in the industry are going to be the ones in demand, especially as UI isn’t really as hard to learn as the whole UX process."}, {"type": "sentence", "content": "If you already got personas, card sorting, empathy maps and all the research methods nailed, then move those rectangles around a little bit and make them beautiful :)"}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*n9jnLiItdXR7hSU8tyF-Ag.png"}, {"type": "subtitle", "content": "The landscape"}, {"type": "sentence", "content": "Even though I haven’t seen that many UI designers getting fired, I noticed something even more unexpected — there’s a lot less quality Dribbble shots being added. We were able to get to Popular for a few days in a row, which was previously very difficult to achieve."}, {"type": "sentence", "content": "So if they’re still working, I have no idea why the portfolio-building activity decreased."}, {"type": "sentence", "content": "But it did."}, {"type": "sentence", "content": "Some of the accounts I followed closely also post a lot less now, than they used to, even with all the team members still there."}, {"type": "sentence", "content": "Maybe people are a bit less motivated to work from home? I wrote a story about how I think working from home can have some negative consequences a while ago."}, {"type": "subtitle", "content": "The leads"}, {"type": "sentence", "content": "The fact that the average budgets decreased (about 20–30%) was to be expected. Only essential products are being built right now. Or the “sure” ones."}, {"type": "sentence", "content": "But we also noticed another thing — nearly 90% of the coming leads are sending their own wireframes now. They already have a product vision defined. About half of them have done some basic research themselves too."}, {"type": "sentence", "content": "Quite often we get full lo-fi prototypes in Figma, which has also hugely gained on popularity among our leads and customers."}, {"type": "sentence", "content": "What those customers want is guidance, an audit of what they already have and then yes … the UI and the coding."}, {"type": "sentence", "content": "Nobody asked us for personas or even flow-diagrams in those two months. People want to get straight to the point. When faced with a proposal of a longer process they often cite lower budgets and much faster execution times."}, {"type": "sentence", "content": "They want to get the product to market ASAP and test it on people."}, {"type": "sentence", "content": "This is why Speed Designing is also gaining popularity. The “dumbing down” of the process comes naturally. All the non-essential parts of it (that were often used to make the customer pay more) are now frowned upon from the start."}, {"type": "subtitle", "content": "Results, Results, Results"}, {"type": "sentence", "content": "Luckily the trend is still very strong on Research — both prototype testing and MVP response analysis. Click-tracking (hotjar etc.) became even more popular for web projects in the last two months."}, {"type": "sentence", "content": "Nearly all the clients already know about that research method and they want to implement it right away."}, {"type": "subtitle", "content": "Faster to market"}, {"type": "sentence", "content": "The general shift right now is to be a lot faster. And I believe this is going to continue in that direction. There won’t be a lot of time for “processes”. They need to be more flexible and simply faster from now on."}, {"type": "sentence", "content": "Hopefully the lockdowns and the entire global crisis will be over soon and we can come back to sort-of-how-it-was-before."}, {"type": "sentence", "content": "And maybe being faster is not that bad actually. It allows you to “see” what you’re building a lot faster as well, and that brings in a sense of accomplishment and joy."}, {"type": "sentence", "content": "Releasing products to market is a lot of fun."}, {"type": "sentence", "content": "Let’s make them great!"}, {"type": "sentence", "content": "Get MY UI DESIGN BOOK 📘 or subscribe on YOUTUBE 📺"}, {"type": "sentence", "content": "I fight design crime at night, and I work at HYPE4 during the day."}], "topic": "design"}