{"title": "What to Expect When Re-Entering Society After a Psych Hospitalization", "data": [{"type": "sentence", "content": "Lockdown has triggered many feelings for people. For me, it has brought back memories of my time as a psych patient. Yes, a patient in a psych ward. Talking about psych wards or psych hospitalization gives people the heebie-jeebies. I understand why mental wellness measures like therapy and meditation are more popular to bring up while hospitalization is left in the shadows."}, {"type": "sentence", "content": "Discussion about hospitalization is gruesome. It is uncomfortable. And it is not hopeful. However, discomfort around the topic will not minimize how Covid-19 will induce and exacerbate severe mental illnesses within the general public. This damage will lead many to require medical intervention. Even though psych hospitalizations are difficult, I hope to share my prior experience to make it easier for someone else to transition from in-patient treatment to the outside world."}, {"type": "sentence", "content": "My time in inpatient-treatment was no walk in the park, but my reintegration after was worse. When it came to getting back on my feet I didn’t know where to start and struggled a lot. Hell, I still struggle. But you should not have to go through what I did if you have to utilize hospitalization to manage the mental hardships of Covid-19. Here are some ways to cope!"}, {"type": "subtitle", "content": "It Is Okay to Not Feel Okay"}, {"type": "sentence", "content": "When leaving a psych ward you are technically supposed to feel better than when you were admitted. But that does not always happen. The hospital is a temporary zone and not a quick fix to your problems. Their job is to stabilize you, not to cure you. And they are constantly trying to free up beds which are more scarce in the pandemic."}, {"type": "sentence", "content": "When I left it took a few months for me to feel like myself again. I felt scared and overly sedated. Like I was watching my own life from a distance. I beat myself up for not feeling “better” and thought I was failing my loved ones. If I could go back in time and talk to myself, I would tell him that there is no correct way to feel about his experience. You are not weak if you do not feel secure."}, {"type": "subtitle", "content": "The Little Things Matter"}, {"type": "sentence", "content": "In the hospital I spent my days:"}, {"type": "sentence", "content": "Your relationship with control and autonomy to make your own decisions will change. Immediately after my discharge I hurried my ass to Dos Toros and overate. I could not believe I was able to make choices again and I sometimes catch myself with the urge to ask permission to eat or to watch tv."}, {"type": "sentence", "content": "This is not to shame the regulations I had to follow as they were necessary to keep us safe. But I never imagined the rules would give me a deeper appreciation for independence."}, {"type": "subtitle", "content": "I Had Nightmares in the Beginning"}, {"type": "sentence", "content": "One part of the 24 hour personnel keeping tabs on you is the middle of the night staff that come in to take your blood. Nearly every night two people came into my room to wake up my roommate and me to draw our blood. It had something to do with checking our health and reaction to medication. There were nights when I did not want to be poked or prodded but I didn’t have an option. I was also way too drugged up to be rebellious."}, {"type": "sentence", "content": "So when I returned home all of this contributed to nightmares for the first couple of weeks. I was not used to sleeping alone and jumped up in cold sweats thinking someone was coming to poke me with a needle. If you are not sleeping well just know that your inability to soundly sleep will ease with time. I had to literally relearn how to sleep again."}, {"type": "image", "content": "https://miro.medium.com/max/7872/0*KewszDrGAhGLfG7f"}, {"type": "subtitle", "content": "Medication Can Be a Bitch"}, {"type": "sentence", "content": "If you are hospitalized for mental health you are more than likely to have already been on medication and if not will be put on medication. Every medication has unique side-effects. Some make you sleepy, hungry, thirsty, mess with sex drive or climax, shift your weight, etc. During my time as a patient, I was discontinued off of my medications and started on new ones. I felt terrible. Medication withdrawal can be rough. I suffered chills, headaches, and dizziness. My new meds were not settled in yet so I was very tired all of the time. I fell asleep in my workplace’s bathroom stalls a few times."}, {"type": "sentence", "content": "Yes, medication alterations are not easy but please do not stop taking your medication without telling your psychiatrist. When you leave the facility you will be given a psychiatrist if you do not have one and they are there to support your process. Let them do their job because playing a doctor can end deadly."}, {"type": "sentence", "content": "I did not like the medications I was put on and it took a few months to find the right combo. Once I did, my quality of life improved tremendously. This does not mean that you will have to necessarily stay on medication but let your psychiatrist determine that. If you do not like their answer you can get a second opinion."}, {"type": "subtitle", "content": "You May Need to Take Some Time to Adjust"}, {"type": "sentence", "content": "I rushed back to work and I wish I didn’t. Between the new medication and the intense experience of the hospital, I was not ready. I often fought to stay awake and had moments when I held back tears from unexpected breakdowns. I was processing."}, {"type": "sentence", "content": "Working from home can aid adjustment but it might not be enough. You may need a few days or more off of work. If you are uncomfortable to disclose your personal information with your employer, best know that they cannot say no to a doctor’s note. Take advantage of your medical rights. Under HIPPA, no one is entitled to know why you were in a facility and they cannot inquire as to why you need the time off. There are laws to protect you from archaic policies and toxic work cultures."}, {"type": "subtitle", "content": "You Might Run Into Others Who Were Hospitalized With You"}, {"type": "sentence", "content": "There is a probability that you will cross paths with another former patient. It happened to me on more than one occasion in a massive city like New York City. It is acceptable if you want to say hi or if you are anxious to interact. You need to respond in a way that is emotionally safe for you. If the person reacts in a way you do not like, do not take it personally. They are on their own journey and it is not your job to take care of them. It is a small world and you need to prioritize your own recovery at all times."}, {"type": "image", "content": "https://miro.medium.com/max/7998/1*yChyhFiKvXdbWw-HrECWVQ.jpeg"}, {"type": "subtitle", "content": "You Do Not Need to Rebuild Alone"}, {"type": "sentence", "content": "If you are familiar with my past articles you know I am a sucker for teamwork and community. This also applies to returning to everyday life after a hospitalization. It is crucial to create a support group made up of loved ones, your therapist, and physicians. A strategy about who will be available to monitor you when you confront medication changes and who you can reach out to when you feel like you are experiencing an episode is important. You need some people around you who are in a better state of mind than you are."}, {"type": "sentence", "content": "Do not be deterred if there are people in your life who do not show up for you in the ways you would prefer. This can include family too. People are going to have ignorant beliefs and personal traumas around mental illness and hospitalization. But like I mentioned before, it is not your job to figure out anyone else’s feelings. This is about you. My best advice is to focus on those who will celebrate you and not get stuck on the ones who tolerate you. It is not worth the headache."}, {"type": "sentence", "content": "Resources that can make a difference are:"}, {"type": "sentence", "content": "With progress there is still an unfortunate reality that you can be in crisis again. An alternative to going back to the hospital can be a crisis respite center. Crisis respite centers are made for out-patient care where you can gain quality services and live your everyday life like going to work or school. Look up the closest crisis respite center near you. If you feel that you are a danger to yourself or others please call 9–1–1 or the National Suicide Prevention Lifeline."}, {"type": "sentence", "content": "Never forget that getting help is nothing you should be ashamed of and getting help should not hurt. You matter!"}, {"type": "sentence", "content": "Thank you for reading my article."}], "topic": "mindfulness"}