{"title": "Your Office Might Be More Political Than You Think", "data": [{"type": "subtitle", "content": "Just because there’s no fighting, doesn’t mean office politics isn’t happening."}, {"type": "image", "content": "https://miro.medium.com/max/9640/1*l9La4SoBS2-yDkLtW1ZlIw.jpeg"}, {"type": "sentence", "content": "There’s no question that office politics is one of the most common stress factors for employees at any level and one of the primary reasons people leave jobs. In-fighting and backstabbing are a reality — almost an accepted one, unfortunately — in a lot of companies."}, {"type": "sentence", "content": "On the opposite end, a lot of people feel grateful to be in environments they feel aren’t “political” at all. They’re happy to say there’s no fighting nor arguing going on, and everyone seems to get along really well with each other except for the occasional clashes ( which are “probably isolated”). Problem is, they might at the same time feel they’re not actually getting a lot of things done and the day-to-day issues continue to happen without much sign of improvement."}, {"type": "sentence", "content": "So what gives?"}, {"type": "subtitle", "content": "What is “political”?"}, {"type": "sentence", "content": "I’ve just recently read The Five Dysfunctions of a Team and the book offers a very insightful definition of what it means to be “political”. According to the fictional CEO Kathryn:"}, {"type": "sentence", "content": "On the surface, that doesn’t seem so bad. Tact is an underrated soft skill, after all."}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*kGSGNr0mH5u4I2A-cgDTuw.jpeg"}, {"type": "sentence", "content": "Unfortunately though, tact is often driven by fear and fear is often counterproductive. How others react is not something you can control and even your most calculated decisions can never guarantee any particular result. The worst part is that trying to control others’ reactions takes away energy that could be better spent pursuing your actual goals."}, {"type": "sentence", "content": "In the end, while office politics often manifests in people bringing each other down, it’s just as well reflected in people “mincing words” and walking on eggshells around each other. That is, after all, something actual politicians do a lot of — even more, in fact, than they do debates or mudslinging."}, {"type": "subtitle", "content": "How do I deal with it?"}, {"type": "image", "content": "https://miro.medium.com/max/7148/1*q5lyc817FyU-v5mhvFRcQQ.jpeg"}, {"type": "sentence", "content": "I personally struggle with this even to this day. I’ve never felt comfortable with conflict and I often find myself wanting to avoid debates or tempted to withdraw from an important discussion. Sadly, conflict is never easy and we never really get used to it, no matter how often we confront it. That’s just how we humans are — conflict wears us down. That’s completely okay. You need to allow yourself to recharge after a particularly draining discussion. But make sure the issue gets resolved, not shelved."}, {"type": "sentence", "content": "Trust is the master key here, and not in the sense of trusting others will just somehow figure out what best to do (without you weighing in). Rather, this means trust that others in your team have the same goal in mind as you do, regardless of how they react to your opinions. Likewise, trust that they don’t have malicious intent in arguing with you — they may simply be missing some context or they may actually be making a better point."}, {"type": "sentence", "content": "If this just doesn’t seem possible to do in your situation, then you may need to reflect on whether you’re in the right place. There are definitely ways to remedy this particular team dysfunction but until everyone is ready to put in the work to fix it, it’s likely never going to happen."}, {"type": "sentence", "content": "Originally published at https://techmanagement.life on May 22, 2020. If you liked this post, subscribe to our mailing list for more!"}], "topic": "leadership"}