{"title": "The Dirty Truth About the Privilege to Travel", "data": [{"type": "sentence", "content": "Not everyone can see the world by giving up their lattes"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*kCJzhZsyNw3ALcF3kF5ERw.jpeg"}, {"type": "sentence", "content": "Every few weeks, a new article pops up on Medium detailing how the writer gave up everything to spend a year traveling overseas and how you should do so, too. They recount with bright-eyed enthusiasm how, with a bit of hard work and courage, they were able to undertake such a life-changing endeavor. They’ll share what they learned about themselves, how it provided them with a better education than college, and how they’ve since leveraged those lessons into a new career or a happier life."}, {"type": "sentence", "content": "I know, I am one of them. I quit my day job, put my condo up for rent, sold most of my possessions, booked a flight, and spent six years traveling. I saw 42 countries on five continents by working as a tour leader and scuba professional. It was lonely, hard, and scary, and it was wonderful. I wouldn’t take it back for anything, and I will share with anyone who will listen the endless list of ways traveling has enriched my life. Still, I stop short of selling it as a never-ending stream of motivational quotes because it’s important to acknowledge the truth: I was only able to do this because of the privileges I enjoy. Yup, I worked hard and gave up a lot of things, but all the hard work and inner strength in the world isn’t going to be enough for a large percent of the world to be able to live this dream. It’s time we stop pretending it is so."}, {"type": "sentence", "content": "Here are a few of the truths you’ll most likely find about people who are able to take extended trips abroad:"}, {"type": "subtitle", "content": "They hold a powerful passport"}, {"type": "sentence", "content": "Holders of US passports enjoy the privilege of being able to visit 185 destinations without a visa. European Union, Canadian, and Australian passports rate similarly. Yet, if you were born a little further east or south, in say Turkey or Belize, that number is cut by half. Should you have been born in Israel, your passport is not accepted in 16 countries, no matter what. The ability to hang out in Thailand for months on end, facing only the minor inconvenience of having to hop over to Bali for a “visa run” is something only those who hold passports from wealthy, mostly western countries, can enjoy."}, {"type": "subtitle", "content": "They are able-bodied"}, {"type": "sentence", "content": "If westerners with disabilities find navigating public transportation, accessing information, and confronting negative attitudes frustrating in their home countries, imagine how difficult it can be abroad. The American Community Survey estimates that 12.8% of Americans have a disability, and the European Commission reports 17.6% of its population does as well. Having a disability can make traveling anywhere from inconvenient to impossible. Developing countries rarely build infrastructure with accessibility in mind, and even high-end lodging geared towards tourists frequently omit wheelchair-accessible restrooms. That’s not to say many non-western countries aren’t making an effort. On my last trip to Egypt, I enjoyed dining at a KFC that was entirely run by staff who were hearing impaired. Still, for most travelers with a disability navigating a foreign country presents additional layers of challenges."}, {"type": "subtitle", "content": "They are cis-gendered and heteronormative"}, {"type": "sentence", "content": "There are currently 73 jurisdictions in the world that criminalize private, consensual, same-sex sexual activity. Of those, 12 of them may impose the death penalty for these perceived crimes. Many popular tourist destinations, such as Egypt, Jamaica, and Singapore, are included in this list. Even in locations where same-sex relations aren’t criminalized, LGBTQ travelers can experience harassment and violence. Transgender travelers have reported frequent difficulties upon entering countries when their documents bear a name and photo that no longer correspond to their gender identity. Even the U.S. State Department recommends LGBTQ travelers take extra precautions, including carrying health documents, custody documents, and contact details for legal representation."}, {"type": "subtitle", "content": "They have access to health care"}, {"type": "sentence", "content": "Imagine spending a year traveling without the assurance that your health care expenses would be covered. I don’t know anyone who has undertaken this kind of journey who hasn’t, at the least, experienced gastrointestinal issues. Many have been in minor accidents or contracted diseases, from scooter accidents in Thailand to malaria in Uganda."}, {"type": "sentence", "content": "While basic medical care can be surprisingly affordable in the developing world, the effects of these kinds of minor medical issues can be long-lasting, requiring further treatment both abroad and after travelers return home. Not to mention, having access to medications and quality medical care can be a matter of life and death for travelers with compromised immune systems."}, {"type": "subtitle", "content": "They are not members of a persecuted race or religion"}, {"type": "sentence", "content": "Traveling can present extra challenges for minorities, and the possibility of facing discrimination while traveling continues to be a reality in much of the world. Muslim women frequently report facing additional security checks at airports. Black Americans and Europeans regularly share stories of being stared at and being treated differently than white travelers. They report feeling nervous about the possibility of violence while traveling in European countries that are currently experiencing an influx of immigrants and refugees from Africa."}, {"type": "subtitle", "content": "They are able to save enough for their travel by cutting out non-essentials"}, {"type": "sentence", "content": "Nearly all of the articles I’ve read about extended travel include a list of the little things the author suggests sacrificing in order to save for their grand adventures. No more dining out, no daily lattes, using only credit cards that offer cash-back incentives. All this assumes everyone starts at a level of economic security in which they have the means to purchase such items in the first place. This kind of thinking, as embodied in such financial self-help books such as “The Latte Factor,” has rightfully been criticized. Suggesting this is an accessible way everyone can save conveys a real lack of compassion for those experiencing poverty. When we hint that the only reason everyone isn’t currently backpacking around Bolivia is due to a lack of economic discipline, it sounds a lot like poverty shaming."}, {"type": "subtitle", "content": "They have a financial safety-net"}, {"type": "sentence", "content": "Most extended travelers budget for their journey by calculating the average price per meal in each county, airfares, and accommodation, plus a bit extra to cover unforeseen expenses. But what happens if disaster strikes? During our current pandemic, travelers have been trapped overseas, forced to charter incredibly expensive flights home or shelter in place in accommodation they can’t afford. Tsunamis and earthquakes have historically left travelers stranded with little choice but to book expensive flights home — expenses that quickly eat through savings."}, {"type": "sentence", "content": "I know when I made my leap into extended traveling, I went knowing that if something truly horrible happened, my family, friends, and, to a certain extent, my government would help me out. Not everyone is as lucky. Those without access to credit or a network of friends able to assist can quickly find themselves in dire situations when the unthinkable happens."}, {"type": "sentence", "content": "I applaud these writers for encouraging their readers to travel, to take stock of the things that really matter in life, of appreciating experiences over things. I believe they indeed made sacrifices, and it took tremendous courage to embark on their journeys. I thank them for sharing their stories. I only wish they would do so while acknowledging the privilege that has allowed them to take these risks before casually suggesting it can be as easy for everyone else."}, {"type": "sentence", "content": "For those who don’t fall into the above categories and have still managed to take extended trips abroad, you have my sincere admiration. It’s time we all start to recognize the inequalities that create the barriers you’ve had to overcome."}, {"type": "sentence", "content": "We travel so as to better understand the world, particularly that which is different from what we know. I suggest a good place to start is by acknowledging the differences back home."}], "topic": "travel"}