{"title": "Time Blocking: How to Get The Most Out of Your Schedule", "data": [{"type": "subtitle", "content": "Some of the most productive people in the world swear by a technique called time blocking. Here’s how to use it."}, {"type": "image", "content": "https://miro.medium.com/max/1672/0*C8n-TH4n_Ht6KFNE.png"}, {"type": "sentence", "content": "Ever heard of Elon Musk, Bill Gates, or Cal Newport?"}, {"type": "sentence", "content": "Yep — all time-blockers. And they’re not doing it because they like coloring in their bullet journals. They’re squeezing every drop of productivity from their days."}, {"type": "sentence", "content": "It’s simple and it works. And I’m going to show you how."}, {"type": "sentence", "content": "So, let’s see if this sounds familiar:"}, {"type": "sentence", "content": "You have too many things to do, and the list never gets smaller. You’re juggling work, side projects, and your personal life. They all demand more of your time. You want to give them all more time."}, {"type": "sentence", "content": "Whenever you start working on your list, something comes up. An important email that needs a reply. An unscheduled meeting. The phone rings."}, {"type": "sentence", "content": "It probably seems normal now — just a part of living in a busy world."}, {"type": "sentence", "content": "Getting things done is hard."}, {"type": "sentence", "content": "Well, I’ve got some news."}, {"type": "sentence", "content": "Making lists of things to do, and trying desperately to finish them isn’t enough. It doesn’t give your days structure or routine. To-do lists don’t help you focus."}, {"type": "sentence", "content": "You need to bring in an important element: time."}, {"type": "sentence", "content": "Tasks need to be associated with time. You have to figure out a task will get done, and it’s going to take."}, {"type": "sentence", "content": "It sounds simple, and it is. But it’s also powerful. Imagine knowing exactly what tasks you will finish this week? Add to that, handling emails, errands, a social life, and better health."}, {"type": "sentence", "content": "Well, that’s what time blocking is all about. It will let you control your life like nothing else you’ve tried."}, {"type": "subtitle", "content": "What is Time Blocking?"}, {"type": "sentence", "content": "Time blocking is a method of combining task management and your calendar. You create ‘blocks’ of time in your days and give them tasks to focus on. Every task fits into its own time block, without interrupting anything else."}, {"type": "sentence", "content": "With time blocking, your schedule is completely filled. Work tasks, social events, and rest are all planned and prioritized."}, {"type": "sentence", "content": "Instead of just working on long lists of tasks, time blocking lets you plan what you are going to achieve in a day. It forces you to figure out how to spend your time."}, {"type": "sentence", "content": "This is more powerful and way more productive than endless to-do lists."}, {"type": "sentence", "content": "How?"}, {"type": "sentence", "content": "Because it’s proactive. You take control of tasks, instead of reacting to external demands. It forces prioritization. And it creates organization."}, {"type": "sentence", "content": "Does it sound intimidating? Well, it’s actually pretty common, and super easy."}, {"type": "sentence", "content": "Let me tell you how I accidentally tried it out."}, {"type": "subtitle", "content": "How I Discovered Time Blocking"}, {"type": "sentence", "content": "My first introduction to time blocking happened without me even realizing it. One day, my manager called me in for a meeting to talk about my schedule."}, {"type": "sentence", "content": "He said that I had to block out 2 hours every week to do nothing but think about ways to improve our profit margin. I was allowed to use it to do research, but I couldn’t do any other work, and it had to be during my paid work hours."}, {"type": "sentence", "content": "The success of the exercise wasn’t determined by how many tasks I finished in 2 hours. Instead, we looked at the results."}, {"type": "sentence", "content": "Guess what: profits went up, by a lot. And the distracting tasks still got done."}, {"type": "sentence", "content": "That manager had noticed my days always got interrupted by unexpected problems. It was part of the job, and I had to deal with everything that came up."}, {"type": "sentence", "content": "My ultimate goal was to increase profit. I couldn’t just ignore that because I was busy."}, {"type": "sentence", "content": "The priority needed to be respected in my schedule — no matter what."}, {"type": "sentence", "content": "And so I figured out how powerful this idea could be. I kept noticing more and more benefits — enough to build the rest of my schedule like this."}, {"type": "sentence", "content": "I think you’ll pretty quickly agree."}, {"type": "subtitle", "content": "Why Does Time Blocking Work?"}, {"type": "sentence", "content": "You’ve probably already tried time blocking too — without realizing. Before I started thinking about it, I would use the time between meetings to try and finish tasks."}, {"type": "sentence", "content": "And when I was a student, I would sign up for classes that left gaps in my days. I’d use those to focus on assignments."}, {"type": "sentence", "content": "Let’s go through the things time-blockers discover."}, {"type": "subtitle", "content": "Time Blocking Creates Deadlines"}, {"type": "sentence", "content": "Tasks tend to fill as much time as we let them. This is Parkinson’s Law, and it’s a big deal."}, {"type": "sentence", "content": "If I gave myself a week to write this article, it would take that long. Easily, actually. And would it be 5 times better? Would it provide more value than finishing this and four more articles?"}, {"type": "sentence", "content": "Probably not."}, {"type": "sentence", "content": "We are more effective when we limit the amount of time a task has. We get more done and the outcomes are as good — if not better."}, {"type": "subtitle", "content": "Time Blocking Prevents Procrastination"}, {"type": "sentence", "content": "Getting started is the hardest part of doing something. Just knowing what to begin with is tough. If you’ve got a huge list of things to do in a day, it’s even worse."}, {"type": "sentence", "content": "You can figure out how to stop procrastinating by designing a blocked schedule."}, {"type": "sentence", "content": "You won’t have to worry about what to do first. It takes everything out of the equation except the time on the clock and the task on the schedule."}, {"type": "subtitle", "content": "Time Blocking Helps You Focus On Hard Tasks"}, {"type": "sentence", "content": "Time blocking isn’t only about what you are doing at any given point. It’s also about what you’re not doing."}, {"type": "sentence", "content": "When it’s time to do hard, focused work, nobody needs distractions. Multitasking doesn’t work."}, {"type": "sentence", "content": "Pesky nuisances (like email and social media) get their own time blocks. And they aren’t allowed into the blocks of anything else."}, {"type": "sentence", "content": "This is one of the best ways to improve focus and achieve deep work."}, {"type": "subtitle", "content": "Time Blocking Makes Small Tasks More Efficient"}, {"type": "sentence", "content": "There’s a flip side of being better able to focus on important work and avoid distractions. You get more efficient at doing tedious, distracting work (also known as ‘shallow work’)."}, {"type": "sentence", "content": "This happens by combining techniques: time blocking and batching."}, {"type": "sentence", "content": "If you’re limiting email to once per day (or even once a week) then you’re batching. And when you sit down to focus on email and do a bunch of them together, you save a lot of time."}, {"type": "sentence", "content": "You’re not clicking in and out of apps or windows."}, {"type": "sentence", "content": "You don’t have to backtrack and remember what you’re up to."}, {"type": "sentence", "content": "You’re more efficient."}, {"type": "subtitle", "content": "Block Scheduling Creates Accountability"}, {"type": "sentence", "content": "Once you start block scheduling you become aware of how you spend your time. This can be confronting, but it’s how you unlock the biggest gains."}, {"type": "sentence", "content": "You are accountable for the blocks and how they are filled in. There are no more excuses like “I just haven’t got time to exercise and eat properly.”"}, {"type": "sentence", "content": "That changes to:"}, {"type": "sentence", "content": "“I haven’t decided to make time for exercise and proper eating.”"}, {"type": "sentence", "content": "This is really important for me."}, {"type": "sentence", "content": "It will lead you to take control over your time and everything you do with it."}, {"type": "subtitle", "content": "How Does Time Blocking Work?"}, {"type": "image", "content": "https://miro.medium.com/max/3920/0*4xenVdc3Ree_8Vbl.png"}, {"type": "sentence", "content": "Everyone should be time blocking. But, we all have different goals to achieve."}, {"type": "sentence", "content": "That means the actual execution is different for everyone. Here are the 6 steps of time blocking:"}, {"type": "subtitle", "content": "Step 1: Determine Your Goals, Priorities, and Obligations"}, {"type": "sentence", "content": "From this point on, we’re going to make time for your priorities, and get things done."}, {"type": "sentence", "content": "To do that, you need to understand what you’re trying to achieve. Think about how much time you want to spend with your family. Decide your vision for your ideal future."}, {"type": "sentence", "content": "If you haven’t made your own personal goals and career goals yet, read my guides on both first."}, {"type": "sentence", "content": "You need goals first, so you can prioritize tasks and activities."}, {"type": "sentence", "content": "From your long-term goals, create short-term objectives to pursue. You need targets that are achievable within 6 months, ideally."}, {"type": "sentence", "content": "For each objective, come up with tasks to complete in the next week. These are going to be scheduled, along with all of your other activities."}, {"type": "subtitle", "content": "Step 2: Create a Blank Template For Your Block Calendar"}, {"type": "sentence", "content": "It’s best to have a layout that breaks days into individual hours. I like to use blocks of 2 hours where possible, but plenty of tasks don’t need that long."}, {"type": "sentence", "content": "You can add precise times to tasks inside these if you need (such as a meeting that starts at 11.15 and finishes at 11.45)."}, {"type": "sentence", "content": "I use digital calendars to do my scheduling, but this exercise also works with pen and paper. I’ve included a few apps that are helpful at the bottom of this article."}, {"type": "sentence", "content": "I recommend you use colors to highlight tasks from different categories. For example:"}, {"type": "sentence", "content": "We start adding tasks in the next step. Using colors to show each category gives you a great visual picture of where your time is being spent."}, {"type": "subtitle", "content": "Step 3: Fill in Fixed Tasks and Personal Activities"}, {"type": "sentence", "content": "Fill in blocks for tasks you can’t move or change. This includes things like family pick-ups, commuting to work, and recurring meetings that you don’t control. Plan to exercise, eat, and rest as well."}, {"type": "sentence", "content": "You should also create a morning and evening routine, and block off time for that."}, {"type": "sentence", "content": "By blocking out time for your personal life at this stage, you are creating a framework that your work can fit into."}, {"type": "sentence", "content": "I definitely find it’s best to block-in things like health and family first. After all, these things are non-negotiable in the long-term. You can adjust and make sacrifices if you need more time to get work done."}, {"type": "subtitle", "content": "Step 4: Create Blocks for Focused Work"}, {"type": "sentence", "content": "Writing and editing need my full concentration. Because of that, I give them my most productive periods of the day. And for me, that’s mornings."}, {"type": "sentence", "content": "If you prefer to break up intense focus, create multiple blocks for it every day. Block time for it when you are going to be the most effective."}, {"type": "sentence", "content": "Make sure the time you’re carving out will be free from distraction."}, {"type": "subtitle", "content": "Step 5: Schedule Blocks for Repeat, Easy Tasks, and Errands"}, {"type": "sentence", "content": "Once you’ve given away your most productive blocks, create time for everything else. These things need to happen, but they aren’t the priority. They’re often ‘reactive’ tasks — they usually serve the needs of other people and their productivity."}, {"type": "sentence", "content": "For most of us, it’s things like email, phone calls, and meetings. They creep in and stop you from focussing on things that matter most."}, {"type": "sentence", "content": "But:"}, {"type": "sentence", "content": "They still need to get done."}, {"type": "sentence", "content": "The best way to handle these is with batching. Wait for them to build up, and do them together. If you can get away with it, push them together and do them when you are less productive."}, {"type": "sentence", "content": "I like to do everything that’s not time-sensitive in the afternoon. And ideally, I do them later in the week. This includes running errands and grocery shopping for me."}, {"type": "sentence", "content": "I’d rather lose a day to tedious, easy tasks than have them interrupt every other day."}, {"type": "sentence", "content": "And remember, you won’t be able to control everything here."}, {"type": "sentence", "content": "Do what you can within your work systems."}, {"type": "sentence", "content": "Once you’ve done that, your week should look pretty full. Actually — it needs to. Don’t leave any gaps."}, {"type": "sentence", "content": "If you have time left over, you get to decide what to do with it. That’s the best part of being so organized."}, {"type": "subtitle", "content": "Step 6: Hold a Weekly Review to Evaluate and Plan"}, {"type": "sentence", "content": "By this stage, you’re ready to start following your schedule. At the end of the week, you need to sit down and see how things went — in a weekly review."}, {"type": "sentence", "content": "My weekly review is probably the most important 2-hours of my week."}, {"type": "sentence", "content": "You have to invest in your block scheduling for it to work. You can’t copy anyone else’s exact structure, because their tasks aren’t the same as yours or mine."}, {"type": "sentence", "content": "Your blocks have to suit your life. And your tasks."}, {"type": "sentence", "content": "So:"}, {"type": "sentence", "content": "In my weekly review, I go through every block on my schedule. I check if I finished the assigned tasks. Anything that wasn’t done goes back onto the to-do list for the next week."}, {"type": "sentence", "content": "It’s important to ask whether you misjudged the time a task needed, got distracted, or something else got in the way."}, {"type": "sentence", "content": "Don’t be afraid to change the structure around. Figure out what works for you."}, {"type": "sentence", "content": "Once you’ve reviewed your progress, look at the tasks you need to do next week. Check they align with your goals and objectives. Then assign things to your block template for the next week."}, {"type": "sentence", "content": "Check you’ve covered every project, made time for unavoidable tasks, and take care of your health."}, {"type": "sentence", "content": "And that’s it, all done. Except, of course, you’re never finished."}, {"type": "sentence", "content": "There’re always improvements to make, and a new week coming."}, {"type": "sentence", "content": "Which is great — it means this is a tool you have your whole life to perfect and benefit from."}, {"type": "subtitle", "content": "4 Tips to Improve Your Time Blocking Efforts"}, {"type": "sentence", "content": "I kept the steps pretty simple — so you can get started blocking time right away."}, {"type": "sentence", "content": "It does take some learning, though. I’ll run you through some of the tips that I’ve found useful so far."}, {"type": "subtitle", "content": "1. Stick to the Schedule"}, {"type": "sentence", "content": "You have to be strict about the blocks and give yourself deadlines for working on the tasks."}, {"type": "sentence", "content": "When the schedule says stop — you stop."}, {"type": "sentence", "content": "Once you start making little exceptions, you quickly lose the benefits."}, {"type": "sentence", "content": "If you don’t quite finish a task, make a note to complete it next time. You don’t want to start a chain reaction that ruins a whole day."}, {"type": "sentence", "content": "It’s a good idea to overestimate time for tasks in the beginning. You’ll feel way better about getting something done too fast than failing a bunch of times."}, {"type": "subtitle", "content": "2. Use Intervals and Take Breaks"}, {"type": "sentence", "content": "I focus best when I break blocks into intervals. I ignore everything other than the task for a set amount of time, then take a short break."}, {"type": "sentence", "content": "This is the Pomodoro productivity technique."}, {"type": "sentence", "content": "As an example, most of my work blocks are 2-hours. So you might work for 25-minutes, then take a five-minute break. Repeat that four times in a 2-hour block."}, {"type": "sentence", "content": "If something is difficult or frustrating, use shorter work intervals."}, {"type": "sentence", "content": "After a few cycles, plan longer breaks for meals and down-time."}, {"type": "sentence", "content": "This technique is going to help you sustain work for the whole block. It also means that every work interval ends in a break — so you can move between tasks smoothly."}, {"type": "subtitle", "content": "3. Create ‘Themes’ for Each Day"}, {"type": "sentence", "content": "We already touched on batching. Well, this is a time management technique that pushes that idea even further."}, {"type": "sentence", "content": "Create days for tasks that are similar and relevant to each other. By getting in the flow of related tasks and activities, you’re more likely to achieve deep work."}, {"type": "sentence", "content": "And also, by batching up an entire day of distracting, easy tasks you keep them away from the focused work."}, {"type": "sentence", "content": "For example:"}, {"type": "sentence", "content": "I know writers who spend one day doing research for all their articles. Then they spend two days a week just writing article drafts. On the fourth day they edit everything they’ve written. They batch all their errands, emails, calls, and shopping up for the fifth day."}, {"type": "sentence", "content": "Each day has a theme, in which all the tasks are similar."}, {"type": "sentence", "content": "You can do it in your personal life too. If you have two free days a week, you might want to theme one of them for having fun and trying new things. The other can be rest and organization."}, {"type": "sentence", "content": "Your brain will definitely get in the grove using this approach, so it’s worth considering using themes."}, {"type": "subtitle", "content": "4. Build a Routine"}, {"type": "sentence", "content": "The last tip is to do everything you can to build a routine. There are going to be commitments you can’t control. Every week is going to be different."}, {"type": "sentence", "content": "That’s OK. But you will get the benefits quicker if you create consistent block structures. Building good habits is a genuine productivity hack. And good habits literally come from choosing the right behaviors consistently."}, {"type": "sentence", "content": "Even if you can’t control the middle of the day, the morning and night are yours to design."}, {"type": "sentence", "content": "Create consistency, build discipline. You’ll thank me, I swear."}, {"type": "subtitle", "content": "4 Time Blocking Missteps to Avoid"}, {"type": "sentence", "content": "At this point, you’re probably pretty excited. I definitely was when I started figuring this stuff out."}, {"type": "sentence", "content": "Before you dive in, there are a few common mistakes it’s worth avoiding from the get-go."}, {"type": "subtitle", "content": "1. Don’t Over-Plan Fun"}, {"type": "sentence", "content": "For a lot of people, scheduling fun is the best way to ruin the mood. I’ve definitely tried to over-plan fun in the past."}, {"type": "sentence", "content": "‘Enjoying myself’ became a task I had to complete, just like my work."}, {"type": "sentence", "content": "I still recommend you block off plenty of time for general fun and rest. Then just leave it at that."}, {"type": "sentence", "content": "You can be spontaneous about how you use the time when it comes. Choose whether you socialize or watch TV on the couch."}, {"type": "sentence", "content": "You need to look forward to the down-time and feel free to use it however you want."}, {"type": "subtitle", "content": "2. Don’t Be Too Rigid"}, {"type": "sentence", "content": "The reality of time blocking is that it’s almost impossible to do perfectly."}, {"type": "sentence", "content": "You will hear about Elon Musk and Bill Gates breaking their days into 5-minute increments. And sure, you can aim to be that precise."}, {"type": "sentence", "content": "Personally, I’ve never had the perfect week. I doubt they have either. Something always comes up, things always change. It’s inevitable."}, {"type": "sentence", "content": "Be prepared to make changes, and be flexible."}, {"type": "sentence", "content": "Your schedule is the goal and the guide. You work towards mastering it. Don’t panic if things go wrong, just start the next block fresh."}, {"type": "sentence", "content": "A good solution for this is to create a block every week to ‘catch up’ on anything that you didn’t quite get to. If you finish everything, then great. If not, you have a back-up to make sure you complete all the tasks by the end of the week."}, {"type": "subtitle", "content": "3. Avoid Planning Tasks in Too Much Detail"}, {"type": "sentence", "content": "When you start out, it’s going to be hard to know how much time a task needs. If you’ve only ever kept to-do lists, you haven’t always thought about how long things take."}, {"type": "sentence", "content": "You won’t master estimating task time right away."}, {"type": "sentence", "content": "And so:"}, {"type": "sentence", "content": "If you try to plan every task in every block, you’re going to end up misjudging."}, {"type": "sentence", "content": "This is one of the reasons I like to create longer time blocks. I have a set amount of time and a group of tasks — usually 2-hours. I try to finish them all in the intervals of that block. If I don’t that’s fine — I just reschedule whatever is leftover. My day continues without any worry."}, {"type": "subtitle", "content": "4. Don’t Get Disheartened"}, {"type": "sentence", "content": "This is a big one, so listen up."}, {"type": "sentence", "content": "When things inevitably don’t go as planned, you can’t get disheartened. I guarantee you will get better results by time blocking, so failing one block, or even a whole day, is no big deal."}, {"type": "sentence", "content": "It happens to everyone."}, {"type": "sentence", "content": "And the longer you work on it, the better you will get. The more tasks you estimate time for, and the more weekly reviews you do, the easier it will be."}, {"type": "sentence", "content": "Stay positive."}, {"type": "subtitle", "content": "The 4 Best Time Blocking Apps"}, {"type": "sentence", "content": "At its simplest, time blocking is about task management and scheduling. There are a lot of apps that do either or both of these."}, {"type": "sentence", "content": "I’ve included a few that I think can help you build your system."}, {"type": "subtitle", "content": "1. TickTick Premium — Time Blocking and Interval Timer"}, {"type": "sentence", "content": "TickTick Premium brings together some powerful benefits. You can create to-do lists and block time for them on a calendar. It’s got another cool feature though: an interval timer."}, {"type": "sentence", "content": "I mentioned the Pomodoro technique above as a way to stay focused during a long time block. Having an app that not only lets you plan your schedule but also run a timer for the actual work is really handy."}, {"type": "sentence", "content": "It works on all popular platforms. But keep in mind, you’ll need the paid version to use the calendar."}, {"type": "subtitle", "content": "2. Planway — Team Calendar"}, {"type": "sentence", "content": "This app is built to work alongside Trello — a task management app. If you’re already using Trello to manage tasks, this is the easiest way to create a block schedule."}, {"type": "sentence", "content": "Once they are connected, you can easily drag tasks over to the schedule and organize your blocks. This is a good option if you have multiple users working on the same schedule."}, {"type": "sentence", "content": "There’s also support for popular digital calendars (Outlook, Google, iCloud)."}, {"type": "sentence", "content": "If you’re not currently using Trello, it’s worth looking into this system."}, {"type": "subtitle", "content": "3. SkedPal — Automated Time Blocking"}, {"type": "sentence", "content": "SkedPal can give you some powerful automation. It will take your existing digital calendar and add your tasks to blocks. It can even account for your priorities."}, {"type": "sentence", "content": "You basically create a to-do list in the app and give a deadline and an estimate for how long it will take."}, {"type": "sentence", "content": "Then SkedPal can generate a full block schedule for you."}, {"type": "sentence", "content": "You can adjust anything that doesn’t quite work. It will also let you allocate certain projects or types of work for set times in the week."}, {"type": "sentence", "content": "I like this as a way to try out time blocking without spending too long setting it up."}, {"type": "subtitle", "content": "4. HourStack — Time Tracking for Your Time Blocking"}, {"type": "sentence", "content": "One of the time blocking challenges everyone faces is estimating task times."}, {"type": "sentence", "content": "HourStack lets you build your block schedule first. Then, you select a task you’re going to work on, and start a timer."}, {"type": "sentence", "content": "When the time for that block is up, you mark it as complete or leave it to finish at another time."}, {"type": "sentence", "content": "I like this idea for two reasons:"}, {"type": "sentence", "content": "First, it forces you to think very actively about time. You have to signal that you’re starting something, and also whether it got completed."}, {"type": "sentence", "content": "Second, it tracks how well you are estimating task times."}, {"type": "sentence", "content": "With this kind of approach, you’re going to very quickly know whether this is something you need to get better at."}, {"type": "sentence", "content": "Even if you don’t like this kind of thing for the long-term, it’s a really good exercise to go through in the beginning."}, {"type": "subtitle", "content": "You Control Your Time Blocking"}, {"type": "sentence", "content": "Time blocking works because it introduces control to your life. It manages what you do and when you do it."}, {"type": "sentence", "content": "Remember this at all times."}, {"type": "sentence", "content": "You are the one in control. You decide what goes in the blocks. This is a mindset shift — away from allowing external forces to dictate your schedule."}, {"type": "sentence", "content": "So if you feel like you’re not in control, then make changes."}, {"type": "sentence", "content": "Experiment and revise — always."}, {"type": "sentence", "content": "After a little practice, you’ll really notice the benefits. And then, you’ll never go back."}, {"type": "sentence", "content": "Good Luck."}, {"type": "subtitle", "content": "Field Notes"}, {"type": "sentence", "content": "How to start time blocking:"}, {"type": "sentence", "content": "Tips for time blocking:"}, {"type": "sentence", "content": "The best apps for time blocking:"}, {"type": "sentence", "content": "Originally published at https://dansilvestre.com on May 22, 2020."}], "topic": "productivity"}