{"title": "Quarantine Love", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "sentence", "content": "Anthony hadn’t bothered trying to date since the quarantine began. It’d been over two months and he’d been ready to give it another go since after Christmas, but instead he kept pushing it further away. Before he knew it he found himself stuck in a tough position, unable to meet a new romantic interest via happenstance, it became apparent he’d have to give dating apps a try again."}, {"type": "sentence", "content": "He opened up the dating app his friends had been hounding him about, he’d be another fish in a grand ocean forced to create a bio about himself in hopes it would interest someone with similar tastes."}, {"type": "sentence", "content": "Profile: Anthony M. 5'11. Athletic...ish, if running a few times a week and not being able to go to the gym anymore counts as athletic. I work, or, used to work, maybe still do, at a marketing agency. I basically come up with ideas to sell products, which would make you think I’d be better at creating a bio about myself, but I try not to bring my work home with me.I have a dog, Rocco, his life is pretty modern for the most part. He’s four, had him since he was a puppy. I haven’t needed to set an alarm since the day I brought him home. I have my own place, not much, but I like it. If you have any questions…ask?"}, {"type": "sentence", "content": "Anthony posted his bio and then waited. An hour later his phone went off. He looked at it to see a text from his friend Jennifer."}, {"type": "sentence", "content": "Jennifer: Is that really the bio you’re going with? Tony, there’s so much more to you than that. Give yourself some credit."}, {"type": "sentence", "content": "Anthony: Easier said than done. I’ve never been great at these things. Hangout soon and help me?"}, {"type": "sentence", "content": "Jennifer: Quarantine…"}, {"type": "sentence", "content": "Anthony: Oh, right…"}, {"type": "sentence", "content": "Without being able to see his friend one on one he wasn’t sure if he’d be able to get his bio into shape anytime soon. He set his phone down on the coffee table and walked over to the kitchen."}, {"type": "sentence", "content": "“Hungry, Rocco?” Rocco wagged his tail, his tongue dripping on the hardwood floor. “I’ll take that as a yes.” Anthony grabbed a can of dog food out of the pantry, popped open the top, and scooped out what looked like pink, and apparently appetizing, sludge into a bowl. He set the bowl down and his dog dove right in. “What about me?” Anthony pulled a can of chili out of the pantry and repeated the process."}, {"type": "sentence", "content": "Anthony sat at the table, with Rocco not far, and ate his pink sludge."}, {"type": "sentence", "content": "Then his phone went off, the vibrations sounding like a mini earthquake was taking place in his living room. He shoveled in a spoonful of beans and meat and chewed as he went to fetch his only proof life still existed outside of his house."}, {"type": "sentence", "content": "Kelsey: What kind of dog?"}, {"type": "sentence", "content": "He laughed and made his way back to the kitchen."}, {"type": "sentence", "content": "“I spent all that time on a bio and all everyone cares about is you, pal,” he said, scratching behind Rocco’s ear. “Can’t say I blame them.”"}, {"type": "sentence", "content": "Anthony: English setter, mixed. Not too keen on the mix. He’s black and white with some brown splotches on his face. Super friendly. I could go on and on about him honestly…do you have any pets?"}, {"type": "sentence", "content": "He placed the phone next to his napkin and returned to his dinner."}, {"type": "sentence", "content": "“Don’t think our meals are much different these days, pal.”"}, {"type": "sentence", "content": "Kelsey: Cats>>>>"}, {"type": "sentence", "content": "Anthony: I’ll have to take your word for it. I’ve heard they’re not the best at catch though…"}, {"type": "sentence", "content": "Kelsey: They’re too busy for chasing frisbees, mice on the other hand. You know what? I’d rather not think about the mice, lol. Charlie, that’s my cat (she’s amazing in every way) left me a little gift a few days ago by my slippers."}, {"type": "sentence", "content": "Anthony: Aww, I wish Rocco would bring me gifts."}, {"type": "sentence", "content": "Kelsey: Not these kinds of gifts. Anyway, new topic? Have you been able to keep working through the pandemic?"}, {"type": "sentence", "content": "Anthony: Furloughed, going on three weeks now. Started off working from home, but with things not looking like they’ll open back up any time soon my boss had to cut a few of us. There’s talk they’ll swap some of us in a couple weeks, I just wonder if the work will be there. What about you?"}, {"type": "sentence", "content": "Kelsey: I’m a freelance writer, so it’s felt kind of the same, just a lot less busy. What do/did you do you work?"}, {"type": "sentence", "content": "Anthony: Marketing, but when it boils down to it our jobs are probably similar in a few ways. Sounds like you’ve been able to find a few jobs, though? That’s good. It’s been Rocco and I for a while now, we’re hunkered down and luckily he likes scary movies as much as I do."}, {"type": "sentence", "content": "Kelsey: Oh no, no, no to scary movies. I get nightmares."}, {"type": "sentence", "content": "Anthony: You probably wouldn’t get nightmares if you had a dog…"}, {"type": "sentence", "content": "Kelsey: Nice try. Charlie doesn’t like them either. We both like fantasy movies, so we’ll watch those together. She’s big into action too."}, {"type": "sentence", "content": "Anthony: A cat of many tastes."}, {"type": "sentence", "content": "Anthony walked upstairs and set his phone down on the coaster sized charger. Rocco lead the way as he smeared toothpaste on his brush, the first brush he’d bought in years that wasn’t electric since the store was practically cleaned out the last time he went shopping. He spit, rinsed the paste down the drain, popped two ibuprofen, then went to bed."}, {"type": "sentence", "content": "The next morning, as he sat at the kitchen table and pushed around his bowl of oatmeal with the last clean spoon he had, he read through Kelsey’s bio."}, {"type": "sentence", "content": "Profile: Kelsey P. 5'4. Back when going outside was considered normal I liked to hike nearby parks and run along the canal. I work from home, so at least I have a sense of normal with everything that’s going on.I have a cat (you must also like cats). Her name is Charlie, she’s a Siamese mix. Think of the softest thing you’ve ever touched, and times that by a million, and that’s what it’s like to pet Charlie.Looking to buy a house (maybe when this is all over?), but for now living it up in an apartment. I’m not far from the canal, which is a plus.Interests:Used to be: Hiking, running, hanging out with friends on the weekendNow: TV, reading (R.S Tallon just came out with a new book, anyone read it? Anyone? Just me?), and staring out the window as I fantasize about fresh air"}, {"type": "sentence", "content": "“She’s got a sense of humor, pal,” said Anthony as he walked his bowl over to the sink. “That’s the best thing someone can have at a time like this. Also a pet to talk to, right? Rocco? Eh, guess I’ve been talking to myself.” He placed his bowl and spoon into the dishwasher and then pulled his vibrating phone out of his pocket."}, {"type": "sentence", "content": "Jennifer: Why haven’t you changed your bio yet?"}, {"type": "sentence", "content": "Anthony: Started talking to someone on the app. She seems nice."}, {"type": "sentence", "content": "Jennifer: Could be talking to more than just one person if you’d update your bio."}, {"type": "sentence", "content": "Anthony: She’s funny too. She has a cat named Charlie, apparently the softest cat on earth. She doesn’t like scary movies like I do, but I’ve yet to meet anyone who does."}, {"type": "sentence", "content": "Jennifer: Tony, Tony, Tony. What am I going to do with you? Well, she sounds lovely. Keep it up then. Proud of you."}, {"type": "sentence", "content": "Anthony: Thanks, mom."}, {"type": "sentence", "content": "Jennifer: HA! I’m not ready for kids. You can call me your Aunt, though."}, {"type": "sentence", "content": "Anthony: Aunt Jenny has a nice ring to it."}, {"type": "sentence", "content": "Anthony took respite on the couch and turned on the TV. He had two episodes left, and although it seemed like the series ran out of ideas halfway through, it wasn’t like he had anything else to do. Rocco soon joined him, fighting with a plastic bone while taking up the other side of the couch."}, {"type": "sentence", "content": "“Someday I’ll get you another one of those,” said Anthony. He pulled at the bone and laughed as Rocco pulled back, eventually giving up and letting his dog win the tug-of-war. “Again?” He lost the second time, too."}, {"type": "sentence", "content": "Around noon there was a knock at the door. Lunch and a brief moment of human contact."}, {"type": "sentence", "content": "“What’s it like out there?” asked Anthony."}, {"type": "sentence", "content": "“You get used to the zombies,” replied the driver as he handed over the bag of food. “Turns out they they chant ‘Biiiiiinge’ instead of brains.”"}, {"type": "sentence", "content": "“I knew the movies were fake. I’ve been binge watching all morning. Am I? Oh no.”"}, {"type": "sentence", "content": "“Another customer lost,” said the driver."}, {"type": "sentence", "content": "They both laughed, then the driver took his leave. Anthony rested the bag on the counter and filled Rocco’s bowl."}, {"type": "sentence", "content": "“You get the same meal, but I’ve decided to treat myself,” said Anthony. He reached into his bag and pulled out his sandwich. Fine,” he rolled his eyes and smirked, “you can have some.” He opened his sandwich and put some of the chicken into Rocco’s bowl. He grabbed a can of soda out of the refrigerator and sat at the table."}, {"type": "sentence", "content": "Anthony: What’s for lunch?"}, {"type": "sentence", "content": "Kelsey: Is it lunch time already? What day is it? Month?"}, {"type": "sentence", "content": "Anthony: I remember my first trip to Mars."}, {"type": "sentence", "content": "Kelsey: I knew it’d be red, but yeesh. Guess I’ll order out. Ideas?"}, {"type": "sentence", "content": "Anthony: I just got a sandwich and fries from Ricky’s Deli delivered. Rocco approves."}, {"type": "sentence", "content": "Kelsey: Well if Rocco approves it must be good. I like Ricky’s! You must live pretty close…"}, {"type": "sentence", "content": "Anthony: I saw in your bio you like to run the canal. I’m a few miles away, take my bicycle out there every so often."}, {"type": "sentence", "content": "Kelsey: You’re one of those people, eh? On your left!"}, {"type": "sentence", "content": "Anthony: I do love shouting that, lol."}, {"type": "sentence", "content": "Kelsey: We should meet up."}, {"type": "sentence", "content": "Anthony: What if…someone sees?"}, {"type": "sentence", "content": "Kelsey: Midnight. Canal. Come alone."}, {"type": "sentence", "content": "Anthony: I’ll be sleeping."}, {"type": "sentence", "content": "Kelsey: Dang, okay. Tomorrow. Noon. I’ll be the one wearing the floral printed mask."}, {"type": "sentence", "content": "Anthony: I’ll be the one wearing a bandanna."}, {"type": "sentence", "content": "Kelsey: Maybe we can rob a train? Something to think about."}, {"type": "sentence", "content": "Anthony: Too romantic for our first date."}, {"type": "sentence", "content": "Kelsey: You’re right. Plus there probably wouldn’t be any people onboard."}, {"type": "sentence", "content": "Anthony: Because of the pandemic?"}, {"type": "sentence", "content": "Kelsey: Because automobiles were invented."}, {"type": "sentence", "content": "Anthony: Oh, right. I’ve heard of those. Tomorrow at noon works! Meet outside of Lamplighter’s Pub? There’s a shelter with some benches."}, {"type": "sentence", "content": "Kelsey: I’ll be there!"}, {"type": "sentence", "content": "Anthony parked in the lot of scattered cars. He pulled his green bandanna over his face and stepped out into the sun. As he walked closer to the shelter he could see someone sitting on one of the benches."}, {"type": "sentence", "content": "“Kelsey?” he said."}, {"type": "sentence", "content": "“That’s me!” replied Kelsey. She got up. “Uh, a wave hello I guess is the most formal greeting we can do at the moment. Join me on my bench?”"}, {"type": "sentence", "content": "They sat at either end of the bench. Anthony looked over to her, only being able to see her eyes, which were cosmic blue, and her hair, which was a rich brown that reached the middle of her back."}, {"type": "sentence", "content": "“You can’t tell but I swear I’m smiling right now,” said Anthony."}, {"type": "sentence", "content": "Other stories on P.S. I Love You…"}], "topic": "fiction"}