{"title": "Why Joe Rogan Is Leaving YouTube for a $100 Million Deal With Spotify", "data": [{"type": "subtitle", "content": "Is it censorship problems or monetary gains?"}, {"type": "image", "content": "https://miro.medium.com/max/3376/1*UFrb-qLD0VOzH3NHs6vTCA.png"}, {"type": "sentence", "content": "On 20th May 2020, Joe Rogan posted a 54-second video on YouTube that was by far his shortest and the most astonishing one — even more extraordinary than Elon Musk smoking marijuana on his show."}, {"type": "sentence", "content": "Even though he seemed calm throughout the video, he certainly seems to have a massive resentment and anger towards YouTube."}, {"type": "sentence", "content": "The fans seem to have a mixed reaction. The video got 38K likes and 28K dislikes. Such a huge number of dislikes isn’t very common on Joe Rogan’s channel. So it’s clear that some people are very annoyed by this decision."}, {"type": "sentence", "content": "But it’s a very human reaction. People resist change and want to stick to established methods of living. It’s likely that fans will get used to the new platform and get acclimated to receiving Joe’s wisdom through Spotify instead of YouTube."}, {"type": "subtitle", "content": "What’s Going to Happen?"}, {"type": "sentence", "content": "First of all, there’ll be a massive transfer of data from Joe Rogan’s channel JRE Clips to Spotify. We’re talking about terabytes of videos here — it’s huge."}, {"type": "sentence", "content": "By the end of the year, around 4.5 million followers of this renowned YouTube podcast channel will have to move to Spotify to listen to his bold, motivational, and sometimes controversial as well as politically incorrect thoughts."}, {"type": "image", "content": "https://miro.medium.com/max/2912/1*r7hMSD-IwYxk__7yUZ2wlw.png"}, {"type": "sentence", "content": "Just in a couple of days after Joe dropped the bomb on YouTube, Spotify’s stock price went from 160 to 190."}, {"type": "sentence", "content": "As Joe said, the video version of his podcast will be available on Spotify, so fans who are used to watching him face-to-face while he drops wisdom won’t be disappointed after all. It’s apparent that Spotify wants to compete with YouTube by enabling its platform to share videos."}, {"type": "sentence", "content": "But what does this mean for YouTube? Well, Spotify’s stock value ascension is just the beginning. Joe is taking his podcast and millions of listeners along with him to Spotify."}, {"type": "sentence", "content": "Now, let’s talk about money. It’s said that Joe Rogan is receiving a whopping $100 million to sign an exclusive deal with the music streaming service Spotify. But let’s not forget the ad revenue JRE podcast is going to earn right from the get-go — it’s estimated to be a few million dollars per month as well."}, {"type": "sentence", "content": "Not to mention the ad revenue that Spotify will earn when millions of new listeners are exposed to ads on their platform. In short, everyone makes money — a lot of it."}, {"type": "sentence", "content": "However, the most important aspect to note here is this — Joe Rogan is NOT an employee of Spotify. He’s an independent content creator and Spotify will let him do whatever he wants to."}, {"type": "sentence", "content": "So keep in mind that he’s not a sell-out. He’s just switching platforms and will continue to be an autonomous podcaster with no one telling him what to post and what not to. Anyone with common sense who regularly listens to JRE Clips will know that someone like Joe Rogan would never compromise his integrity for money. However, the massive number of dislikes shows that some people might have misinterpreted Joe’s decision."}, {"type": "subtitle", "content": "Why Is Joe Rogan Leaving Youtube?"}, {"type": "sentence", "content": "This is the question that probably only Joe can answer the best — and he will at some point in the future."}, {"type": "sentence", "content": "However, it’s said YouTube’s censorship issues have been a big pain for Joe Rogan’s podcast. It’s not just about refraining from speaking swear words, it’s way deeper than that."}, {"type": "sentence", "content": "Joe’s straightforward and fearless attitude might have offended a few people. Maybe he’s received a lot of censorship notices from YouTube. For any creative person, freedom of expression is worth more than anything."}, {"type": "sentence", "content": "Content creators want to create and express themselves. It’s understandable that an outspoken martial artist like Joe wouldn’t want to live in the fear of receiving content strikes from YouTube."}, {"type": "sentence", "content": "He must have felt this frustration for a long time and it’s possible that the planning of this massive online exodus took a few months."}, {"type": "sentence", "content": "There’s another possibility, however. Maybe Spotify’s offer was too financially lucrative for Joe to decline. Of course, YouTube’s censorship issues certainly seem to be a problem here. But to snatch away one of YouTube’s top podcaster is no small potatoes and definitely takes a lot of money."}, {"type": "sentence", "content": "There’s something that’s going on behind the scenes that no one knows, but this news surely shows us the value of good content creator these days — they’re worth in the millions."}, {"type": "sentence", "content": "Also, one thing is clear — if you have millions of loyal fans, no platform in this world can stop you from taking up space and expressing yourself. If one platform censors a creator, there are always a dozen competitors out there who’d value them."}, {"type": "sentence", "content": "Why do you think Joe’s leaving YouTube? Let me know your thoughts in the response section."}, {"type": "subtitle", "content": "About This Publication"}, {"type": "sentence", "content": "Men’s Reads focuses on publishing articles that are relevant to men. We focus on bringing you expert advice, not just friendly advice. Feel free to stay in the loop if you want trustworthy advice on men’s fitness, psychology, nutrition, finances and career, style and grooming, and relationship guidance."}], "topic": "business"}