{"title": "Weighing the Benefits of Buying Another Online Course", "data": [{"type": "subtitle", "content": "The convenience of learning online might be the thing holding us back from doing the work."}, {"type": "sentence", "content": "Yesterday I almost spent $1500 on another writing class. I got as far as putting all of my information in but stopped at the point where I input my credit card information. Part of me already regrets the decision, but the other part of me knows that it was the right move for me right now."}, {"type": "sentence", "content": "This particular online course is only available once a year, which of course makes the FOMO very strong — a shrewd marketing choice on their part. It’s also written and sold by some huge names in the copy & marketing industries. They make some big money-making claims that I completely buy into."}, {"type": "sentence", "content": "But I’ve already taken two other online writing classes, one in building a copywriting business and one in the basics of food writing. Is another online course really what I need right now? In the end, this is why I decided not to buy the course, and what I plan to do instead."}, {"type": "subtitle", "content": "Why I didn’t buy it."}, {"type": "sentence", "content": "The first reason I didn’t buy it has absolutely nothing to do with writing. It’s that this year I was given the incredible gift of being completely consumer debt-free. I still have student loans that I can live with, but the credit card debt and loans were ruining my life and destroying my future. I don’t want anything to do with that kind of spending again, ever. Even the offer of a payment plan, $150 per month for 10 months on my debit card, is treading into deep water for me. Breaking the spending mindset has been a years-long struggle for me that I finally feel like I’m on the up-side of. If I can’t afford to pay for it straight-out, I can’t afford it."}, {"type": "sentence", "content": "Like 38 million other people in the US right now, I’ve also lost my job due to the Coronavirus pandemic. All things considered, I’m very lucky. I was able to get unemployment early. I have a small padding in my savings account. My family is supportive both emotionally and financially. But even with all of those factors, now really isn’t the time for me to drop two months’ worth of rent on an online course. The future is so uncertain, and I may need to pay rent with that cash here soon."}, {"type": "sentence", "content": "Even with the financial factors, I may have been convinced to buy the course had it not been for one HUGE fact. Facing this fact head-on wasn’t easy, but the hard truth of it helped put everything in perspective."}, {"type": "sentence", "content": "The fact is, if I want my copy and food writing to get better, I need to be doing more writing. I need to commit to sitting down every day to write. I need to read more writers who are doing what I want to be doing. I have to put in the work. Buying another writing course would help in some ways, but learning is not the same as doing. Now is the time to write. I can go back and refine my work after I’ve gotten some words on the page."}, {"type": "sentence", "content": "I’m looking forward to making a full-time career out of my writing. As I grappled with the choice to sign up for the course, I weighed the options. Sitting down to write today is free. It also gets me a step closer to making a living from writing. Buying a course will immediately cost me money, and there’s no guarantee that I’ll make any money from what I’ve learned (although I have confidence that the instructors of this particular course are incredibly knowledgeable.)"}, {"type": "image", "content": "https://miro.medium.com/max/11520/0*7nGjFtUp5eHqorD3"}, {"type": "subtitle", "content": "This is what I’m going to do instead."}, {"type": "sentence", "content": "After closing the very attractive landing page and emotionally walking away, I decided that just because I didn’t buy the class didn’t mean I can’t find other ways to grow as a writer. Given the budget of $150 a month, how many books could I buy? How many magazines could I subscribe to? How many meals could I afford to have and write about? How many ingredients for recipes could I buy?"}, {"type": "sentence", "content": "After all, I’m a pastry chef who wasn’t trained in a traditional cooking school. I took a quick diploma program and then spent a decade learning on the job. This is no different."}, {"type": "subtitle", "content": "Books Books Books"}, {"type": "sentence", "content": "Yes, books and especially cookbooks can get expensive quickly. But there’s such a variety of experts out there, so I can choose the resources that inspire me. If I spend $50–75 a month on books, that’s at least one used book a week."}, {"type": "subtitle", "content": "Magazines"}, {"type": "sentence", "content": "Subscriptions to mainstream magazines are incredibly cheap these days. A few months ago I signed up for a subscription to Bon Appetite magazine for about $15, which included a cute canvas grocery tote. Some independent publications cost more, about $15 an issue, but that’s still a reasonable addition to my budget. The same idea applies to online newspaper subscriptions. Maybe it’s time to start reading the LA Times."}, {"type": "subtitle", "content": "Dining"}, {"type": "sentence", "content": "It may be a little while before I’m sitting in the dining room of another incredible NYC restaurant given the current health crisis. But it’ll happen again one day. In the meantime, I can continue to order satisfying and diverse foods right from my couch. It’s the incredible blessing of living in Queens that I’m surrounded by a world of food. Not to mention the economic contribution of supporting local restaurants during our nationwide economic collapse. The more you eat, the more you can write about eating."}, {"type": "subtitle", "content": "Ingredients & Home-cooking"}, {"type": "sentence", "content": "I know I’m not the only person who has gotten excited to try a new recipe, gone to the store to pick everything up, maybe sourced some unique ingredients, and been a little surprised by how much all of those ingredients cost me. I don’t have much pantry space (or counter space for that matter), so I only keep staples on hand. Making a little room in my budget for cooking is not only going to help me be a better cook but inspire and elevate my food writing as well."}, {"type": "subtitle", "content": "WRITE."}, {"type": "sentence", "content": "If I can spend an hour or two a day reading through the course material and watching videos online, I can spend an hour or two reading and writing on my own. Yes, I might have to work a little harder to find the answers to my questions. I might have to learn by trial and error, but I’m already accustomed to that style of learning. The real learning is in the work. Everything else is just a prompt to get you to the starting line."}, {"type": "sentence", "content": "📝 Save this story in Journal."}, {"type": "sentence", "content": "👩‍💻 Wake up every Sunday morning to the week’s most noteworthy stories in Tech waiting in your inbox. Read the Noteworthy in Tech newsletter."}], "topic": "education"}