{"title": "Why Should I Remove My Ghost Followers on Instagram?", "data": [{"type": "subtitle", "content": "WORTH IT"}, {"type": "subtitle", "content": "I manually deleted 20,000 fake followers in 3 steps—and it was worth it"}, {"type": "image", "content": "https://miro.medium.com/max/12008/0*WqRU99xNDpQkj_rR"}, {"type": "sentence", "content": "Common sense will tell you that you should gain followers on social media, not remove them. This is pretty much the beginning of any discovery call I have with potential clients: “Yes but, can you help me gain followers?”"}, {"type": "sentence", "content": "Sigh. Slight pause."}, {"type": "sentence", "content": "The second question comes: “Should I buy followers?”"}, {"type": "sentence", "content": "Second sigh."}, {"type": "sentence", "content": "I may be old-school, I may believe in karma, but whenever you talk to me you’ll hear one thing: quality over quantity."}, {"type": "sentence", "content": "So, there you go, a little experiment."}, {"type": "sentence", "content": "We started cleaning up followers from our Instagram account, Creative Impact, six months ago, ahead of a rebrand."}, {"type": "image", "content": "https://miro.medium.com/max/4232/1*bXZfWUw9SwA2BgS1MQmzzg.png"}, {"type": "sentence", "content": "I picked up the efforts again three weeks ago, determined to revive our Instagram account once and for all. I ended up cleaning up and deleting manually 20,000 people."}, {"type": "sentence", "content": "Yup. I’ll let that sink in for a second."}, {"type": "sentence", "content": "In this piece I talk about the three phases of followers clean up you can also do for yourself."}, {"type": "subtitle", "content": "Analyse"}, {"type": "sentence", "content": "Here’s what I discovered. I ran a profile quality audit like I always do when kicking off an audit on Instagram. If it’s your first time giving your followers a once-over, that may be enough."}, {"type": "sentence", "content": "The basic free audits you can run won’t tell you much about the quality of following and engagement rate, so I got a more in-depth report. Overall, our engagement levels are good when it comes to us engaging with our following."}, {"type": "sentence", "content": "Now, to make a point clear, our engagement rate was 0.1%."}, {"type": "sentence", "content": "That is below poor. Why? Well, let me introduce you to ghost followers. From Wikipedia:"}, {"type": "sentence", "content": "Yet, the number of ghost followers was staggering. 80% of our followers have not interacted with us. The report also gives you a breakdown of your followers' quality — most of them are not deemed fake or suspicious (only 1%), but a big chunk of these people has been inactive for over four years."}, {"type": "sentence", "content": "The example below shows you the type of accounts you should be looking for."}, {"type": "sentence", "content": "Our Instagram account is seven years old."}, {"type": "sentence", "content": "Our business rebranded from Health Bloggers Community to Creative Impact Co in 2020. On top of people who just left the platform and did not delete their account is staggering."}, {"type": "sentence", "content": "How do I know that? Welcome to the implementation phase."}, {"type": "subtitle", "content": "Implement"}, {"type": "sentence", "content": "We never, ever bought followers — no shame if you did, but please, do not do it again if you have."}, {"type": "sentence", "content": "I had clients who did, and it’s not worth it. We changed the content we post on our platform massively in the past two years. As I mentioned above, a lot of people who were on Instagram in 2014 are not there anymore. Plus, some fake followers are just hard to spot, sneaky things. So, overall, it can be hard to spot the good apples from the bad ones."}, {"type": "sentence", "content": "Unless you go on a follower cleanup spree."}, {"type": "image", "content": "https://miro.medium.com/max/4320/1*5waR0W1g6EVo7W3f8_NlZw.png"}, {"type": "sentence", "content": "The clearest ones to spot have no posts, no profile picture, and loads of followers. Yet, there are more and more bots on the horizon."}, {"type": "sentence", "content": "In an ideal world, I’d tell you to use an app for this. Yet, Instagram penalizes your account if you do, and you do not have full control over who is deleted and who is not."}, {"type": "sentence", "content": "So, if you want to do things right and proper you have to do it manually."}, {"type": "sentence", "content": "So far, in two waves (one six months ago, and a second one started in the last three weeks), I managed to clean up around 20,000 people."}, {"type": "sentence", "content": "I would literally go through our followers list and click on anyone who looked suspicious. I would look for potential bots as well as people who have not posted since 2017 or beyond (yup, far too many of our ghost followers have been dormant since 2015)."}, {"type": "sentence", "content": "A great perk of doing this is that I got to re-engage with active followers who may forget about us by liking some of their pictures, which also sparked up our engagement."}, {"type": "sentence", "content": "This is the most time-consuming part of the process, but so worth it."}, {"type": "subtitle", "content": "Maintain"}, {"type": "sentence", "content": "I asked my colleague, who runs the social side of the business daily, to be on top of checking all new followers every working day. Interact with each new follower, and remove directly anyone suspicious."}, {"type": "sentence", "content": "This is a smaller step compared to the implementation process, but still essential to prevent us from having to run audits to this extent in the future."}, {"type": "sentence", "content": "I’ll also keep on cleaning followers every week, making sure I look out for any obvious irrelevant followers I may find, whilst engaging with some old followers."}, {"type": "subtitle", "content": "Why Go Through All the Fuss?"}, {"type": "image", "content": "https://miro.medium.com/max/4144/1*2kPESEDGiq7g1BbyH4Qg-g.png"}, {"type": "sentence", "content": "We spend over four hours per week engaging on Instagram. To us, it’s a key way to engage with our customers. Especially since Instagram is going to be adding likes, it’s more important than ever to encourage them as a way to engage and keep being on top of their feeds."}, {"type": "sentence", "content": "Running an audit for your social media accounts is key. Our Hypeauditor ranking has increased — as well as our overall engagement, by 1.5%!"}, {"type": "sentence", "content": "It sounds counterproductive to delete someone who follows you, but you should know what type of audience wants to engage with you, and their accounts can give a clear snapshot of whether they are a good fit."}, {"type": "sentence", "content": "Remember, you need people willing to engage and, ultimately, buy from you."}, {"type": "sentence", "content": "More than ever, the quality of the audience has become the true currency."}, {"type": "sentence", "content": "As this is not a “set it and forget it” job. We’ll keep nurturing the quality of our followers, and I am truly looking forward to seeing the health of our account become stellar once again."}], "topic": "social-media"}