{"title": "The Power of Words: How Uplifting Content Benefits Your Brain", "data": [{"type": "subtitle", "content": "The Science Behind the Power of Words and Their Effect On Our Physical and Mental Well-being"}, {"type": "image", "content": "https://miro.medium.com/max/7296/1*KYUHR8X6qjMyiE0NoHqqLg.jpeg"}, {"type": "sentence", "content": "The words you read or listen to have a physical effect on your well-being. From changing your brain’s functioning to shaping the molecular structure of your cells, being more conscious of the words you choose to consume or speak can bring many benefits to you and others."}, {"type": "sentence", "content": "Just as we are affected by the words we take in, so do the words that we share with others (whether verbally or in writing) have the power to benefit them on a physical and mental level."}, {"type": "subtitle", "content": "FEEL THE WORDS IN YOUR BODY"}, {"type": "sentence", "content": "You may already be aware of the different feeling tone in your body when you read an inspirational auto-biography versus a fear-based news article. But before we get into the biological reasons behind these feelings, test the power of words for yourself if you desire (or skip to the next section if you‘re excited to read about the scientific explanations)."}, {"type": "sentence", "content": "Read these two short paragraphs and notice how your body responds to each:"}, {"type": "sentence", "content": "“You’re doing a great job and progressing really well. Look at how much you’re learning and how you’re growing! Look at how much of a difference you are making and how much of a positive impact you’ve had on so many lives already! You are such a courageous and lovely being. I appreciate you.”"}, {"type": "sentence", "content": "Perhaps after reading the paragraph above you felt warm feelings that inspire you to keep shining your awesomeness?Now…"}, {"type": "sentence", "content": "“You’re not important and you don’t have what it takes. You’re not putting in enough effort. You’re never going to make it. There’s not enough good to go around. The world is a dangerous place.”"}, {"type": "sentence", "content": "Even though these words may be coming from a complete stranger, you may have felt sensations of constriction in your heart when reading the second paragraph — especially if it triggered an association with a past negative experience."}, {"type": "sentence", "content": "So how exactly does uplifting content have a positive effect on our physical and mental well-being?"}, {"type": "subtitle", "content": "YOUR BRAIN ON POSITIVE WORDS"}, {"type": "sentence", "content": "Our brain responds to words by producing feelings. Negative words spark the fight-or-flight response as the brain senses a discrepancy between how we’re feeling and how we think we should be feeling. The brain sends us feelings of pain or discomfort to motivate us to find a solution and close this gap."}, {"type": "sentence", "content": "Placing our attention on the positive shifts results in noteworthy positive shifts in brain function. According to the research of Dr. Andrew Newberg and Mark Robert Waldman, when we hold optimistic or uplifting words in our mind, we stimulate parts of our brain that affect our propensity to take action. The more we are exposed to positive content, the more we start to view ourselves and others differently."}, {"type": "sentence", "content": "Our thalamus plays a role in how we perceive reality and in the chemical sensations that are released in the body — which we call “feelings.” The thalamus responds to the messages we receive from the external environment and relays messages to the rest of the brain."}, {"type": "sentence", "content": "According to Newberg and Waldman, recent studies show that over time, concentrating on positive thoughts can shrink the size of the brain’s fear-center, the amygdala. It can also make us smarter by increasing the thickness of the neocortex which is associated with our higher-order thinking."}, {"type": "sentence", "content": "Reading uplifting content helps us shift our focus to what is right instead of what is wrong. It helps us see the possibilities rather than keeping us stuck in our negative or worrisome thought patterns."}, {"type": "sentence", "content": "The more we expose ourselves to positive words, the more the brain registers the importance we place on feeling good. Our neural networks of “optimism” are strengthened. As we perceive the billions of possibilities out there in the world, the brain then slowly becomes trained to bring more of the positive to our consciousness."}, {"type": "sentence", "content": "The more we focus on the good, the better we feel. The better we feel, the more likely we are to express positive words to others, fueling the momentum of positivity. The feedback loop between perceptions, thoughts, and feelings is complete."}, {"type": "subtitle", "content": "YOUR CELLS ON POSITIVE WORDS"}, {"type": "sentence", "content": "Words carry a vibration that affects matter at the molecular level."}, {"type": "sentence", "content": "Dr. Masaru Emoto, known for his research on the effect of consciousness on the molecular structure of water, demonstrated how words shape water molecules. His experiments showed how uplifting words and intentions (such as Thank You, Love, Compassion, Truth, Peace, Love & Gratitude, Humility) resulted in the water molecules shaping themselves as beautiful crystal structures while unkind words created distorted, non-symmetrical crystal structures."}, {"type": "image", "content": "https://miro.medium.com/max/1558/1*qgcdJvZHsMZIhWdqSfvfew.jpeg"}, {"type": "sentence", "content": "Between 50–60% of our bodies are made up of water. If words and intentions can affect the molecular structure of water to this degree, think of how much power they have to contribute to our own well-being. The coherent structure of such molecules may be a much more efficient way for nature to optimize the flow of nutrients through our system and to focus on maintenance and healing than asymmetrical structure resulting from negative vibrations."}, {"type": "sentence", "content": "LET’S KEEP USING THE POWER OF WORDS FOR GOOD!Word by word, we can heal ourselves and others. In upliftment, there is strength."}, {"type": "subtitle", "content": "You can do it!You are loved. You are appreciated beyond measure. Thank you for existing."}, {"type": "sentence", "content": "— — -"}, {"type": "sentence", "content": "Help remind your loved ones of their magnificence with my brand new book of uplifting short writings and travel photos — You Are Essential: 101 Reminders of Your Magnificence."}], "topic": "neuroscience"}