{"title": "The Introverted Marketer: Developing My Calling and Finding Myself Along the Way.", "data": [{"type": "image", "content": "https://miro.medium.com/max/12000/1*TZCWfdsfcBIxMGtFphzzVg.jpeg"}, {"type": "sentence", "content": "If you asked me five years ago what I’d be doing in 2020, running a digital media agency would have been far down the list. Growing up, I knew I wanted to start my own business. And honestly, any sector would have been fine with me."}, {"type": "sentence", "content": "Except marketing."}, {"type": "sentence", "content": "Because what is marketing anyway? To me it was a bunch of hipsters selling the obvious to anyone who’d bite."}, {"type": "sentence", "content": "It wasn’t until I began managing the marketing operations for a small fashion startup that I realized I’d been wrong all along. More on that later*."}, {"type": "subtitle", "content": "I’ve Always Been Excited by Growth."}, {"type": "sentence", "content": "As an intern at a healthcare REIT for three years during my undergrad, I was surrounded by growth. Hired as employee #35, I left three years later as one of well over one-hundred staff members."}, {"type": "sentence", "content": "For the first two years, I played a role(albeit a minor one) in the acquisition of dozens of medical office buildings. It was invigorating. New deals were coming in on what seemed like a daily basis."}, {"type": "sentence", "content": "And then…they stopped."}, {"type": "sentence", "content": "In my final year strategy changed, and acquisition was no longer a focus."}, {"type": "sentence", "content": "And as time went on, I lost interest."}, {"type": "sentence", "content": "I left the whole situation feeling puzzled. Had I lost my ‘love’ of commercial real estate? Was it me? Was it the company?"}, {"type": "sentence", "content": "Having recently completed what would end up being my final semester of college, I wasn’t exactly sure what to do."}, {"type": "sentence", "content": "I had a few side-projects lined up, but nothing long term."}, {"type": "sentence", "content": "It wasn’t until I took a leap of faith and joined what was at the time, a very small fashion startup, that I finally found the answers I was looking for."}, {"type": "subtitle", "content": "The Fashion Startup*"}, {"type": "sentence", "content": "My employment began in typical startup fashion. Unclear roles, long hours and a VC firm attempting to control the madness from three timezones away."}, {"type": "sentence", "content": "We didn’t know much, but we were growing — and fast."}, {"type": "sentence", "content": "Months went by and official roles were placed, with me assuming the position of marketing manager."}, {"type": "sentence", "content": "My role consisted of, well, just about everything. The product was built and our team was set, leaving customer acquisition as the next thing to do."}, {"type": "sentence", "content": "At this point, I’m experiencing the most exciting time in my young career. Our user base was growing exponentially, the team was expanding, and I was in the drivers seat."}, {"type": "sentence", "content": "For the sake of brevity, I’ll save the full story for another post. Just know that I owe much of my current success to this opportunity."}, {"type": "sentence", "content": "As a young(younger) college student, what I initially mistook for an interest in finance and commercial real estate, was more accurately a passion for growth. The pure thrill of being a part of a movement which has seemingly endless potential."}, {"type": "sentence", "content": "While some desire consistency and guarantee, I realized I needed more."}, {"type": "subtitle", "content": "The Dilemma"}, {"type": "sentence", "content": "It was at that [fashion] startup that I realized marketing is a catalyst for growth. What I’ve been searching for my entire career."}, {"type": "sentence", "content": "Time went on and as things stabilized, I began taking clients on the side. More time went on, and I made the decision to leave my post and venture out on my own."}, {"type": "sentence", "content": "And it was great. Yes, there were long days and sleepless nights — but I was growing, my business was growing, and I was helping others grow as well."}, {"type": "sentence", "content": "There was a problem, though."}, {"type": "sentence", "content": "I was asking others to sell themselves while I wasn’t willing to do the same."}, {"type": "sentence", "content": "One day, a former client reached out to me to discuss re-branding his business. He’d launched and sold several businesses throughout his career, and was a frequent sounding board for my ideas. In return, I offered any advice I could as it related to my area of relative expertise."}, {"type": "sentence", "content": "I told him that his company’s brand should largely reflect the personality and values of the organization( him and his staff). We talked a bit more, and then each went on our way."}, {"type": "sentence", "content": "Shortly after our talk, reflecting on our discussion, I realized something so obvious it was embarrassing. Here I am telling this man that his company image should be a reflection of himself and his team(which I strongly believe) , while doing everything in my power to detach MY personality from my very own company."}, {"type": "sentence", "content": "When I started Shockmouse Media, I thought it would be the perfect vail for my personal issues with the marketing industry. It allowed me to sell myself, without selling my soul to tireless self-promotion and personal branding."}, {"type": "sentence", "content": "It took me awhile to come to terms with my new found character flaw. I knew I was being a hypocrite, and I knew what needed to be done. The only problem was, I still hated the idea of selling myself. I still hated the idea of leveraging myself for business gain."}, {"type": "sentence", "content": "A few sleepless nights and a dozen too many Matt D’Avella Youtube videos later, I realized the real problem. What I chose to perceive as an utter distaste for self-promotion was in reality a fear of putting myself out there."}, {"type": "sentence", "content": "Up to this point in my life, I had been able to remain low-key in nearly every aspect of my life. I got into schools, landed jobs, and maintained a healthy personal life all while remaining as low-key as possible."}, {"type": "sentence", "content": "The realization that I was in-fact afraid of putting myself out there was a big one. But one that I credit my current and future success to."}, {"type": "sentence", "content": "As it turns out, people prefer working with people and not faceless organizations( who knew? )."}, {"type": "sentence", "content": "By repositioning my business as an extension of myself, I was able to form deeper relationships with clients and peers. As a result, my priorities shifted from monetary considerations to working with people that share common goals and values."}, {"type": "sentence", "content": "But what ultimately ended up happening when I came to terms with my fear and insecurity is I became a better marketer and business owner."}, {"type": "sentence", "content": "I fell in love with marketing because it allowed me to take part in the personal and professional growth of others. In business, sustained growth comes from building and nurturing relationships. And at the base of every relationship is trust."}, {"type": "sentence", "content": "I lived most of my professional life in the shadows, advising others to do the opposite while failing to face my own reality. But those days are long gone."}, {"type": "sentence", "content": "I sit here writing, in the midst of a global pandemic, mandated by law to distance myself from others. And yet, in my professional life I feel more connected than ever."}, {"type": "sentence", "content": "Crazy."}], "topic": "marketing"}