{"title": "The Fundamental Flaw in The Modern Digital Publishing Model", "data": [{"type": "subtitle", "content": "Charging your workforce for their labor has no future as a business model"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*IeQMyOAJbTRsv3Adk-Jy9g.jpeg"}, {"type": "sentence", "content": "Digital publishers now charge authors for the right to create content on their platforms. Does this model have a future or will the workers revolt?"}, {"type": "sentence", "content": "I was invited a while ago to be a beta-tester on thinkspot. For those of you that haven’t heard of it, thinkspot was the brainchild of Jordan Peterson and a few other like minded souls."}, {"type": "sentence", "content": "The platform was created for off-narrative individuals to spread their ideas and thoughts without fear of ostracization and the now, all to frequent, risk of the village funeral pyre. A place where liberals and intellectuals could discuss their views openly and enjoy mindful critique."}, {"type": "sentence", "content": "An email arrived in my inbox this morning with the latest articles and podcasts from thinkspot. I had a few minutes and paged through the articles. Nothing revolutionary, but a few interesting pieces on the fight for male masculinity and the continuation of the gender-based campus wars during the pandemic. A psychology piece by Peterson and a few other podcasts."}, {"type": "sentence", "content": "At the footer of the email was the familiar invitation to contribute to the conversation. Alongside it was an offer. If I acted now, it would cost me as little as $1 a month."}, {"type": "sentence", "content": "The irony of charging authors to write for you is never lost on me. I smile every time I see the carefully couched phrases that accompany demands for cash. I write on numerous platforms and the pay-to-write model is rapidly becoming the norm."}, {"type": "sentence", "content": "I refuse."}, {"type": "sentence", "content": "Offering something as ’special’ or an ’act now and save’ ploy doesn’t change the motivation behind the request. It merely serves to obfuscate the glaringly obvious truth these offers conceal."}, {"type": "sentence", "content": "We are going to charge you to work for us."}, {"type": "sentence", "content": "Call me principled, call me stubborn, hell you can even even invoke the heads of swines. Guilty on all counts. It’s not that I’m stingy and it’s not that I begrudge these businesses an opportunity to eke out their pound of flesh. It is simply a matter of principle."}, {"type": "sentence", "content": "Let’s compare this pay-to-write model in relation to other industries to examine why digital publishers have decided charging authors for creating content on their platforms is acceptable."}, {"type": "sentence", "content": "Which other creative disciplines charge creators for showcasing their work, whilst at the same time profiting from showcasing said work? Let’s examine video."}, {"type": "subtitle", "content": "YouTube"}, {"type": "sentence", "content": "A decisive no. YouTube does not charge its ‘creators’ to place their videos on the platform. YouTube does offer paid memberships, but these target viewers of the hosted videos and not the creators."}, {"type": "sentence", "content": "YouTube monetised in-video advertising and then offered viewers the choice of paying to remove said adverts. Deviously cunning and a hugely appealing motivation for shelling out around $10 a month to remove the annoyance of having your video interrupted every few minutes."}, {"type": "sentence", "content": "They have, however, never charged their creators for placing content onto the platform. A massively successful model that has found ways of generating income without the need for taxing its labourers."}, {"type": "sentence", "content": "Next, let’s see how photographers fare. One of the larger, more established players in the industry whose been around a while is Lightstock."}, {"type": "subtitle", "content": "Lightstock"}, {"type": "sentence", "content": "Their business ethic is based on the Apostles Creed and yes, they’re a faith-based platform. One that’s done particularly well in the extremely competitive industry of selling digital images online."}, {"type": "sentence", "content": "Lightstock makes their living off the creativity of photographers and their business model works and works well. They offer photographers a free account in exchange for a mutually beneficial arrangement."}, {"type": "sentence", "content": "No payment is required to host your work on Lightstock. There is no ‘additional functionality’ or benefit offered to the photographers in return for a monthly membership. The platform earns its living from the work of the photographers and accords them their due respect."}, {"type": "subtitle", "content": "The exploitation of artists"}, {"type": "sentence", "content": "How frequently, as a writer, do you think of yourself as such. Perhaps because of the medium we use to express ourselves, we tend to forget this is who we are. Writers are artists, in every sense of the word."}, {"type": "sentence", "content": "Artists that employ words rather than still, moving or manufactured images to paint our pictures. It’s easy to glance at a block of text and overlook the beauty its appearance belies. To discover the hidden images and flowing stories contained within, you need to read. Not so with visual arts."}, {"type": "sentence", "content": "If YouTube or Lightstock where to change their business model tomorrow and revert to paid memberships for their creators, there would be an outcry. People would vote with their feet and the digital landscape would fundamentally change for both these companies."}, {"type": "sentence", "content": "Yet, for the artists that paint with our keyboards and choose a pen as their brush, the same does not hold true. We are being exploited as writers. That’s the cold hard truth of it."}, {"type": "subtitle", "content": "The emergence of Paywalls"}, {"type": "sentence", "content": "In 1996 The Wall Street Journal (WSJ) became the first online publication to set up a ‘hard’ paywall. Their readers would have to pay to view its articles online. The decision, viewed as controversial at the time, has served them well and the practice continues today."}, {"type": "sentence", "content": "In 2010 the Times in London followed suit. It was also considered a controversial move as the paper was not specialized in the same way as the WSJ, but offered more general news."}, {"type": "sentence", "content": "The argument was raised that readers would simply turn elsewhere for their news. This proved to be true, with open and free publications such as the Guardian arguably benefiting most. Paywalls continue to be controversial in the industry."}, {"type": "sentence", "content": "Rupert Murdoch and Warren Buffet are outspoken supporters of the paywall model whilst other industry voices come out against it, citing freedom of press and free access to information as arguments against."}, {"type": "sentence", "content": "Like them or not, paywalls have in some cases proven a successful mechanism for monetizing publications. They have earned their place in the world of digital publishing. In some instances."}, {"type": "sentence", "content": "There seems to be an emerging pattern to the successful implementation of paywalls, with the WSJ serving as our best historical model. In no particular order, the key elements for success could best be described as follows;"}, {"type": "sentence", "content": "If you’re a new player on the block and you don’t tick at least two of the boxes above, then toying with a paywall system can and often does lead to your publications downfall."}, {"type": "subtitle", "content": "Substack’s validation of the paywall system"}, {"type": "sentence", "content": "For those of you who haven’t used or seen Substack, their business principle is simple. Create a personal space for artists to place their work behind a paywall. Allow said artist to sell a monthly subscription to their readers for the right to view the work."}, {"type": "sentence", "content": "Thousands of writers do exactly this. They sell readers the right to access articles the writer has placed behind their own mini paywall. The writers making the most money on Substack are those who create content of value."}, {"type": "sentence", "content": "They’re selling something they’ve created to people with an interest in the writer's particular field of expertise. Something that’s not freely available elsewhere online. Something that offers value to the subscriber."}, {"type": "sentence", "content": "Substack generates its income on a commission basis. They take a small portion of the monthly subscriptions the authors earn. Fundamentally, Substack has enabled mini WSJ’s, thousands upon thousands of them, and the model works."}, {"type": "subtitle", "content": "The ad-free model and the paywall"}, {"type": "sentence", "content": "In the mid-2010s Medium arrived on the digital publishing landscape. It initially positioned itself as an ad-free blogging platform with a focus on tech articles and has since its inception, experimented with various models to try and monetize the platform."}, {"type": "sentence", "content": "Its latest efforts center on two revenue streams. Its writers and its readers. The carrot dangled before the writers is simple and effective. Pay $5 a month for a few added features and you can write for Medium."}, {"type": "sentence", "content": "In fairness to Medium, they do offer a free account which on the surface doesn’t seem to prejudice the writers utilizing it. It is interesting though that the majority of writers, current estimates are well over half a million of them, choose to pay the $5. The reason is simple."}, {"type": "sentence", "content": "A key feature of the author’s subscription payment is that it allows you free access to read all the other material created on Medium. Material that resides behind Medium’s paywall and has been created by the writers."}, {"type": "sentence", "content": "Writers read. They are Medium’s ideal customer."}, {"type": "sentence", "content": "What percentage of Medium’s income is from author payments and how much is generated by paying readers that don’t contribute content is unknown."}, {"type": "sentence", "content": "Medium places the author’s articles behind a metered paywall, charges readers to view the articles and shares a small percentage of the revenues with the author."}, {"type": "sentence", "content": "Time will tell if Medium’s most recent iteration of its business model proves successful. Based on established prerequisites for the successful deployment of a paywall, the results should prove interesting."}, {"type": "sentence", "content": "Vocal Media offers a similar system to writers, offering a free and a paid membership. Payment unlocks features and increases the author’s earning potential."}, {"type": "sentence", "content": "At the time of writing Vocal does not operate a paywall. Their articles are free to view, but they have duplicated one of Medium’s income streams in terms of utilizing contributors, rather than their materials alone, to generate revenue."}, {"type": "subtitle", "content": "The marketing synergy of reading and writing"}, {"type": "sentence", "content": "If you write, you read. Fact. The reverse is not true. Not all readers are writers, but we all read, to varying degrees. Those of us who aren’t fond of the pastime will be forced into it for various reasons."}, {"type": "sentence", "content": "The need for information that isn’t available in video or audio format is a key factor. Make no mistake, social media has played a massively enabling role in promoting a whole new generation of passive. readers."}, {"type": "sentence", "content": "I call them passive because they’re reading. Not intentionally, but they’re still reading out of necessity. An active social media user will consume books worth of text in a few days. They may never read a book in their lives, but they’re reading and they number in the billions."}, {"type": "sentence", "content": "To attract this new ‘reader’, we’ve rapidly adjusted the presentation and layout of articles published online, some would argue to the detriment of the craft we practice."}, {"type": "sentence", "content": "Writing styles now focus on short, focused and simplified articles. Quick fixes for a quick-fix society that doesn’t have the inclination or luxury to invest time and thought."}, {"type": "sentence", "content": "There is no longevity to this style of writing. It’s created in an instant and lasts as long as it takes to be replaced by the next article. The beast is insatiable and demands constant feeding."}, {"type": "sentence", "content": "Platforms that provide this beast with sustenance need writers."}, {"type": "sentence", "content": "The important part of that sentence is the word need. In a market that has yet to fully develop, the limited number of platforms catering to this insatiable media machine have led to the current imbalance and skewed monetization practices."}, {"type": "sentence", "content": "The demand for written material is growing exponentially and businesses and startups are currently developing new and innovative models to provide articles for this market."}, {"type": "sentence", "content": "New YouTube’s and Lightstock’s, specifically developed for writers for the sole purposes of selling the content these artists produce. Models that will focus on monetizing the materials rather than charging the workforce for their labor."}, {"type": "sentence", "content": "It’s an exciting period for writers and an important one. We need to recognize the value of our work and seek to protect our communities from exploitation, both financial and artistic."}, {"type": "sentence", "content": "We have the words, now would be a serendipitous opportunity for their use. Just please don’t pay anyone to publish them."}], "topic": "freelancing"}