{"title": "The search for existential joy", "data": [{"type": "subtitle", "content": "Or: Finding the sublime in the banal"}, {"type": "sentence", "content": "These are dark days. As we sit at home, doing our daily risk assessments, doing our best to strike the balance between being responsible and staying sane, anxieties run rampant. Uncertainty abounds. The days blend together; the nights are dark and full of terrors; time loses all meaning. In short: we’re all struggling right now."}, {"type": "sentence", "content": "But what exactly is the shape of that struggle? What is the structure of our anxiety, of our fear? And how does knowing that help us? This one is pretty heavy on the philosophy, so let’s strap on in."}, {"type": "sentence", "content": "The philosopher Heidegger (who for all his brilliance was for a time a member of the Nazi party, so, you know, #problematicfaves and all that) distinguished cleverly between fear and what he called Angst. Fear, according to Heidegger, has a particular structure to it: it consists of the subjective experience of fear, a fear of (e.g., a dog) and a fear for (e.g., your face). That is, fear is an experience that is tied very directly to states of affairs in the world. By contrast, Angst consists solely of the subjective experience of fear, but without any particular points of reference in the world itself."}, {"type": "sentence", "content": "(You can think of this as analogous to the difference between jumping across a chasm — the one side and the other, connected by that suspended, airborne instant — and drifting in an endless void, still suspended and afloat but not really in relation to anything in particular. Alternately, you can think of this as the difference between your muscles flexing to help you stand or walk, and you getting a goddamn charley horse for no goddamn reason.)"}, {"type": "sentence", "content": "This basic formula landed in France, where it was misunderstood by Sartre and laid the foundation for much of what we think of as modern existentialism. By the time it arrived in the English-speaking world, Angst had become “existential dread,” “existential crisis,” or the pithier cognate “anxiety.” We can think of anxiety, in this philosophical sense, as a fear unmoored from the world, a subjective experience of fear divorced from any particular fear of or fear for."}, {"type": "sentence", "content": "For Heidegger, a thinking and self-aware being is simply wired for Angst. Angst, anxiety, is not an inappropriate or misfiring experience of fear; rather, fear is a localized and contextualized instance of anxiety. Put another way: it’s not that the experience of anxiety is fear creeping in where it doesn’t belong, it’s that the experience of fear is invoking and applying your anxiety wiring to some real-world situation."}, {"type": "sentence", "content": "Fear can be rational or not, depending on how logically connected your fear of is to your fear for; Angst, on the other hand, isn’t even irrational so much as it is prerational, since rationality applies only to the relations of objects and concepts. That’s why a fear can be resolved with a reassurance, while an anxiety can only be endured."}, {"type": "sentence", "content": "(Bonus round: this is why we pretty consistently find that people with high baseline levels of anxiety cope better rather than worse in actual crisis situations. Being able to attach that subjective experience to actual crisis conditions both retrospectively justifies the feeling and prospectively renders the feeling resolvable.)"}, {"type": "sentence", "content": "What Heidegger doesn’t talk about, and what seems to be missing from much of his existentialist progeny, is an exploration of how this same structure might be replicated across other fundamental human emotions. Heidegger tells us, in effect, that “Our experience of fear is a localized, contextualized instance of our underlying wiring for Angst, and sometimes that wiring is exposed and the machinery just fires on its own,” which is an important insight… but we can go further."}, {"type": "sentence", "content": "We don’t have a lot of good words for these underlying protoemotions — we’re collectively bad at thinking about them, so we haven’t had much occasion to find language for them, either — but take, for example, the experience of listlessness. When listlessness takes hold, I find myself pacing (always mentally, and usually physically) like a caged animal, reaching for something I can’t name or identify, feeling vaguely unsatisfied no matter what I do. What is listlessness but an existential desire? My desiring wiring is exposed, but without any meaningful relation to anything in the world — I have the subjective experience of desire, but divorced from any particular object of desire. When depression takes hold, I’m not sad for anyone or about anything; it’s just the underlying wiring revealing itself, doing its background business but suddenly and inexplicably in the foreground."}, {"type": "sentence", "content": "In the same way as anxiety can’t be resolved with reassurance, listlessness can’t be resolved with satisfaction and depression can’t be resolved with cheer. That’s why the standard advice is to exercise, to shower, to eat well, to clean one’s room — the goal is not to resolve these experiences, since they by definition can’t be resolved, but to reassert the order of the world, to kick some dirt onto the exposed wiring, to shunt those processes back into the background, to salve what can’t be solved. “The way out,” as they say, “is through.”"}, {"type": "sentence", "content": "But here’s the thing: we’re not only wired for suffering."}, {"type": "sentence", "content": "For my favorite example of this, let’s look to Japan. Japanese has two words — ureshii and shiawase — that both translate roughly to “happy” and that mean deeply, critically different things. Ureshii is a reactive happiness, the sort of happiness that you experience when you hear from an old friend or receive a gift or find a quarter in the couch cushions. It’s a localized, contextualized instance of happiness. Shiawase, on the other hand, is the “happily ever after” kind of happiness at the end of a fairy tale, the fundamental and underlying happiness that is revealed when obstructions are cleared away. It’s a happiness that’s not attached to or reliant on any particular thing to be happy about; it’s the happiness we’re wired for and then, by and large, distracted from."}, {"type": "sentence", "content": "(Bonus round: this model also neatly describes some of the Eastern notions of enlightenment as a sort of existential acceptance, independent of any particular thing to be accepted.)"}, {"type": "sentence", "content": "This all fits very cleanly into our model and puts existential joy squarely in our sights. But how do we get at it? How do we summon it into the foreground of our lives? Its undesirable cousins — anxiety, anhedonia, depression — give us some clues. While they often barge uninvited into our days, they generally do so when we find ourselves in the thinnest places of our worlds, in the places where those wires run closest to the surface because we’ve worn paths into the ground with our frequent visits: places of insecurity, or exhaustion, or trauma. Similarly, we can identify and make a point of spending time in the places where our wiring for existential joy runs closest to the surface."}, {"type": "sentence", "content": "I don’t think there’s a one-size-fits-all prescription here, since even if the wiring were the same, the wear and tear on each individual person is unique. I can tell you that for me, the most reliable path is what I call the banality of coexistence — this joy for me is most easily found in the companionable silence between intimates, in the casual anticipation of another’s needs, in the sharing of some tea. Maybe yours is more easily accessed through the “this body is working as intended” of vigorous exercise or the oonts-oonts of a loud club or the enveloping silence of “I’m the only one awake right now.” There’s no wrong place for it to live (unless it lives in places that require you to harm others)."}, {"type": "image", "content": "https://miro.medium.com/max/960/1*Q4KKVJ_4zoWb-YbQi6j0uw.jpeg"}, {"type": "sentence", "content": "What you’re looking for is kind of the opposite of whatever “sparks joy” — what you want isn’t just the reactive, localized, contextualized instance of happiness, but the underlying happiness itself. My advice is to look for the most banal places, the places you go most often without thinking about it, that are still in the general neighborhood of happiness. Don’t get discouraged; this isn’t the sort of thing that can be done on demand. But it’ll get easier with practice and with the self-knowledge that that practice will bring."}, {"type": "sentence", "content": "(Bonus round: we live in a capitalist society that sustains itself through a cycle of manufactured need. This means that we have a whole lot of practice and inertia when it comes to reactive joy — ”I bought the thing,” “I got the job,” etc. — and very little concept of what it’s like to exist in a way that’s unobstructed, with a view not focused on our latest need.)"}, {"type": "sentence", "content": "However dark these days get, however much fear and anxiety spring up in your life, remember that there is joy in you — not because of anything you’ve done to find it or make it or deserve it, but because it’s simply part of your wiring. Even if it’s hard to get to, even if it’s been a while since you last felt it, even if you’ve never felt it before. And just like anxiety can’t be dispelled by reassurance, this joy can’t be extinguished by loss or by loneliness or by suffering."}, {"type": "sentence", "content": "But also, don’t forget to exercise, to shower, to eat well, to clean your room. Anxiety and anhedonia and depression can’t extinguish the existential joy, but they can distract you from it. What shiawase demands of you is that you make room."}, {"type": "sentence", "content": "May you live happily ever after."}], "topic": "mental-health"}