{"title": "Every Transformation is a Kind of Dying", "data": [{"type": "subtitle", "content": "Is it so terrible?"}, {"type": "image", "content": "https://miro.medium.com/max/3184/1*jvIREPMfGySuayhMdyg6NQ.jpeg"}, {"type": "sentence", "content": "Most people struggle with death — it’s a concept that ignites alarm and trepidation."}, {"type": "sentence", "content": "But each of us — and nearly all the things we know — are dying every day."}, {"type": "sentence", "content": "In reality, we’re more comfortable with death than we give ourselves credit for. People, places, and things — as we know them — are dying all around us: our skin, the organizations we work for, friendships, stock markets, nature, and so on. Death is happening constantly and predictably."}, {"type": "sentence", "content": "Death doesn’t necessarily mean ceasing to exist. Often, it means something is changing from one state to another."}, {"type": "sentence", "content": "No doubt, some types of death — the exceptions — are jarring and potentially life-altering. Losing a loved one can be a terrible process to endure, with many difficulties to endure going forward. We’ve all been there."}, {"type": "sentence", "content": "Yet, optimism abounds. With death, comes birth. It’s a movement from A to B. Through this evolution, we experience transformation."}, {"type": "sentence", "content": "Transformation changes someone or something into a new state — form, appearance, character, or nature. This is an opportunity. We can be sad about it or we can choose to be enlivened. Every transformative experience presents us with a choice on how to navigate it."}, {"type": "sentence", "content": "Despite the unfortunately common “the world is happening to me” mentality, we can each choose to view death and transformation positively."}, {"type": "subtitle", "content": "Embracing death as a first step toward transformation"}, {"type": "sentence", "content": "My daughter recently faced one of these transformative moments. On the eve of her 10th birthday, she was struggling mightily: “Daddy, I can’t handle being double-digits. Once I turn 10, I’ll never be a single-digit age ever again!” This was real trouble."}, {"type": "sentence", "content": "My first thought was to bring in some deep philosophical thinking, but then I caught myself (“She’s a child…keep it simple, stupid.”). We talked about what transformation is, and I likened it to the caterpillar evolving to butterfly. Unshockingly, that immediately grabbed her, and she wanted to be the butterfly (Yes! Successful fatherly advice!)."}, {"type": "image", "content": "https://miro.medium.com/max/9856/0*ExdkXnGa0VDwtuUD"}, {"type": "sentence", "content": "Transformation requires death. That’s how it works."}, {"type": "sentence", "content": "In Meditations, Marcus Aurelius reflects deeply on death. He wrestles with it for years, seeking to establish a more useful and optimistic perspective on what it means."}, {"type": "sentence", "content": "He arrives at a broader view than human mortality:"}, {"type": "sentence", "content": "True, Marcus. Death propels transformation, and it can be wonderful if we let it. We must find ways to navigate these constant sea changes."}, {"type": "subtitle", "content": "Navigating the transformative stage"}, {"type": "sentence", "content": "Life is a continuous flow of transformations."}, {"type": "sentence", "content": "In Buddhism, there is a concept of bardo, meaning “in-between.” It traditionally describes the transitional state between death and rebirth, but its essence also characterizes the gap between any two states. When people need to say goodbye to one state and welcome another, this is where anxiety and fear often kick in. Bardo can signal great disruption and uncertainty."}, {"type": "image", "content": "https://miro.medium.com/max/1340/0*5fTUlWMSbxogxwIc.jpeg"}, {"type": "sentence", "content": "It’s during this transitional moment that we need to develop the skill and confidence to welcome this scary journey. Opening ourselves to constant change is what makes us stronger and more resilient, and able to develop more awakened minds."}, {"type": "sentence", "content": "As Eckhart Tolle said, “All you can do is create a space for transformation to happen.”"}, {"type": "sentence", "content": "Building transformation muscle requires practice. When forced to change, the lizard brain wants to take over and resist. We hate letting go of old patterns. Yet, letting go is required. How you use your time during a period of transformation will greatly influence what you experience on the other side."}, {"type": "subtitle", "content": "Which will you choose…Alive Time or Dead Time?"}, {"type": "sentence", "content": "A transformation period can seem like forever, and many people fall into deep psychological holes, living in despair and longing for the past. They see the death of something as the end."}, {"type": "sentence", "content": "What you do with your transformation time matters greatly. Will you seize it? Or simply wait things out? Ryan Holiday neatly packages this concept in Alive Time versus Dead Time. Learned from his mentor, Robert Greene, essentially we have two options in a period of transformation:"}, {"type": "sentence", "content": "Alive Time requires a brave step into something new and uncomfortable. It’s about pushing yourself — physically, intellectually, emotionally, you name it. Practice tiny habits that eventually turn into desired behaviors — all part of the future self you’ve envisioned and you’re transforming into."}, {"type": "sentence", "content": "Death triggers fear, and it forces transformation. It’s all part of the circle of life. Navigating transformation — whatever type you’re dealing with — can be very difficult. But you can adopt a new mindset — one that serves you going forward. And you can select how you spend your in-between time. It’s all opportunity. What will you choose?"}, {"type": "sentence", "content": "Want to stay in touch? Follow me on matthewdoan.com, Medium, LinkedIn, and Twitter."}], "topic": "mindfulness"}