{"title": "The 4 Kinds of Well-Earning Writers", "data": [{"type": "subtitle", "content": "When everyone’s “a writer,” how you describe yourself matters"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*qCOkHS6Eh_i9r2ff"}, {"type": "sentence", "content": "In the 21st century, there is no such thing as “a writer.” Everyone is a writer. Everyone knows how to write — but that doesn’t make them a professional."}, {"type": "sentence", "content": "It’s easy to lump word jugglers together under the generic, catch-all term — and, often, we do — but it makes it hard to answer what should be a simple question: How do writers make money?"}, {"type": "sentence", "content": "Professional writers use their skills to achieve certain outcomes, outcomes desired by others, and that’s why they get paid."}, {"type": "sentence", "content": "It could be creating a feeling, making a sale, providing information, or one of a million other things, but it’s always a specific activity. Therefore, the term “writer” always breaks down into a more exact description."}, {"type": "sentence", "content": "There are, however, many of those descriptions, and we usually have to look hard at any one person’s profile in order to come up with it."}, {"type": "sentence", "content": "Blogger, author, journalist, creator, reporter, essayist, freelancer, marketer, artist, copywriter, the list goes on and on. Where should you begin?"}, {"type": "sentence", "content": "You begin by doing what humans do best when facing the chaos of the world: You look for patterns."}, {"type": "sentence", "content": "In 2012, my best friend sent me an article by James Altucher. Here’s the title:"}, {"type": "sentence", "content": "“How to be THE LUCKIEST GUY ON THE PLANET in 4 Easy Steps.”"}, {"type": "sentence", "content": "Sounds great, right? I read it. It was brilliant. James talked about his father, luck, happiness, about his daily practice and how he completely turned his life around."}, {"type": "sentence", "content": "He also said he only had 3 goals in life:"}, {"type": "sentence", "content": "A) I want to be happy."}, {"type": "sentence", "content": "B) I want to eradicate unhappiness in my life."}, {"type": "sentence", "content": "C) I want every day to be as smooth as possible. No hassles."}, {"type": "sentence", "content": "The second I read these lines, I knew that was me. I’m sure you’ve had that feeling. “That’s me!”"}, {"type": "sentence", "content": "It’s an incredibly powerful moment."}, {"type": "sentence", "content": "In fact, it was so powerful that I did what anyone struck by the lightning of words does: I read it again. And again. And again."}, {"type": "sentence", "content": "I read everything from James Altucher I could find, and by the time I was done, I knew I wanted to do what he did: “Write cool things and get paid for it.”"}, {"type": "sentence", "content": "Ha! How naïve. At the time, I failed to understand the huge machinery working in James’ background, and I didn’t see how his blog — though the centerpiece of it all — was only one part of a much bigger picture."}, {"type": "sentence", "content": "A decade later, I know a little more. To my own amazement, I even did pull it off. I can “write cool things and get paid for it.”"}, {"type": "sentence", "content": "Looking back, however, I had to jump through countless hoops. I climbed endless rungs on the writing income ladder, and only by touching them all could I understand how modern writers get paid."}, {"type": "sentence", "content": "Stephen King says there are four kinds of writers: Bad ones, competent ones, good ones, and geniuses. That’s a matter of technical ability."}, {"type": "sentence", "content": "When it comes to making money, there are four archetypes of writers:"}, {"type": "sentence", "content": "A freelancer relies on contractual work. They might work multiple part-time projects or join a company full-time as a journalist, staff writer, or copywriter. They rarely pick what they write about, and they enjoy the benefits of a regular job — but they also have to be their own marketing department."}, {"type": "sentence", "content": "An author writes books, books, and more books still. Everything is in service of the next book, whether it’s self-published or comes with a deal from Penguin Random House, whether it’s fiction or non-fiction, whether it pays the bills yet or it doesn’t. With blood, sweat, and tears, you can get there."}, {"type": "sentence", "content": "The marketer treats writing like one of many skills in her arsenal. She uses it to attract people, and she uses it to sell things. She may use it inside of freelance contracts or in her self-chosen projects. A marketer could be an affiliate for coconut water, run a small ecommerce coffee store, and work part-time for an agency all at once."}, {"type": "sentence", "content": "An artist writes for the same reason Da Vinci swang his brush: to capture the essence of life. Whatever his creations, if only 1,000 true fans would become his loyal patrons, he’d be set. It may be a long road, but it’s a road that leads to creative freedom."}, {"type": "sentence", "content": "Each of these archetypes has advantages and disadvantages. You can combine them, switch from one to the other, and new ones will emerge in the future. Overall, however, they represent four broad categories of how you can earn from your writing."}, {"type": "sentence", "content": "They all oscillate between shipping art to an audience, being an entrepreneur, and working a traditional job — and yet none of them are clearly marked as one or the other."}, {"type": "sentence", "content": "Everyone is a writer — and yet, no such thing as a “writer” exists."}, {"type": "sentence", "content": "I’d love to meet 2012-Nik in a flashback. There are two things I would do:"}, {"type": "sentence", "content": "That guy had no idea what it took to be a professional writer — but he had the guts to imagine a form of it that didn’t even exist. It’s been a long time since then. A lot of things have changed."}, {"type": "sentence", "content": "Some authors make $250,000+ per year just off self-published books. A freelancer can make six figures with just three clients. Patreon has paid out over $1 billion to creators since 2013. And some affiliate websites generate up to $100,000 in a single month."}, {"type": "sentence", "content": "None of these are easy to achieve. All of these paths take years, maybe a decade. The point is they exist. There now is light where, a few short years ago, there was nothing."}, {"type": "sentence", "content": "A professional writer gets paid to keep writing. Period. If you don’t, writing is a hobby."}, {"type": "sentence", "content": "There are a million reasons to write, and not everyone needs to go pro. We don’t have to monetize all our passions by any means."}, {"type": "sentence", "content": "But if you want to — eventually — make a living from your writing, don’t think of yourself as a writer. Be specific. Dare dive into these archetypes. Call yourself an author. A freelancer. A marketer or an artist."}, {"type": "sentence", "content": "Whatever you do, align your words with where you want to go. Not just those on the page, but those you use to describe yourself."}, {"type": "sentence", "content": "In a world where everyone’s a writer, it will make all the difference."}], "topic": "marketing"}