{"title": "Broken Heart Does Not Want Flowers", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*kW-1s3lIQJzASVJ1RFZ7Iw.jpeg"}, {"type": "sentence", "content": "The morning after, Jane stretched in tangled sheets. Sunshine streamed through the flimsy blinds he’d promised to replace. Today they’d launch the boat and enjoy the picnic she’d already packed. She smiled at the ceiling."}, {"type": "sentence", "content": "Why was her pillow wet?"}, {"type": "sentence", "content": "She cried when she remembered."}, {"type": "sentence", "content": "There would be no boat launch, no picnic today or ever with him. He needed time, he’d said. It wasn’t her, it was him, and he was so confused. The only thing he was sure he wanted was the end of them."}, {"type": "sentence", "content": "He needed time and space. From them. From her."}, {"type": "sentence", "content": "Comforter clutched to chest, she ignored polite knocking on the door. It stopped and left her in peace to stare at the wall."}, {"type": "sentence", "content": "Later, the knocking returned, long, loud, and impossible to ignore."}, {"type": "sentence", "content": "Holding her robe closed, she thundered to the door. What idiot didn’t know to respect no answer?"}, {"type": "sentence", "content": "She wrenched the door open and glared at her best friend."}, {"type": "sentence", "content": "“Got here just in time,” Steffie said, nudging a vase of red long-stem roses. “You’d think he’d do more than this mess.”"}, {"type": "sentence", "content": "Jane gasped at the beautiful roses. “My favorite flowers. He still loves me!”"}, {"type": "sentence", "content": "Steffie shook her head. “No. He doesn’t. A man who loves you doesn’t keep breaking your heart and making up with roses the next morning. A broken heart doesn’t want flowers.”"}, {"type": "sentence", "content": "Jane hefted the crystal vase to her heart with a grunt."}, {"type": "sentence", "content": "“This is not love,” said Steffie articulating every word and staring into Jane’s eyes. “This is floral stalking. Give them to me. He breaks up, you text drunken despair, and then he makes up to keep you off-balance. You deserve better.”"}, {"type": "sentence", "content": "Steffie waggled her fingers at the vase. When Jane sneezed and held them closer, Steffie seized the vase, charged down the hall, and deposited it at Mrs. Peter’s door, stuffing its gift card in her pocket."}, {"type": "sentence", "content": "“Get dressed,” Steffie herded Jane into the apartment. “Wash your face and get dressed. There’s something you need to see.”"}, {"type": "sentence", "content": "Steffie drove without speaking, music loud and windows open. An hour out of the city, Jane yielded to wildflower fields and wandered no-expectations beauty."}, {"type": "sentence", "content": "They spent the day gathering flowers and farmer’s market bounty. Fueled by strong coffee and stronger friendship, Jane strode into the possibilities revealed when you walk away from morning-after-break-up flowers."}, {"type": "image", "content": "https://miro.medium.com/max/5746/1*3KZgHjMmgIiZka8Wg14kqg.jpeg"}], "topic": "fiction"}