{"title": "God of War Shows Us the Harms of Toxic Masculinity", "data": [{"type": "subtitle", "content": "Exploring the relationship between a son and his father"}, {"type": "image", "content": "https://miro.medium.com/max/10240/1*KVHnyzX3T7kZH985IARcKw@2x.jpeg"}, {"type": "sentence", "content": "The relationship between any parent and child is a complicated one, but the dynamic between a father and son is particularly fraught. Depending on your mileage, you probably reacted to that last sentence in a very particular way. Some sons have very positive relationships with their father, some negative, and others have never had the chance to find out. If like me you have a particularly negative reaction when thinking about your father, it probably isn’t a very good relationship. God of War is ultimately about all of these feelings, masterfully painting a portrait of a father and son who’s relationship very well could be as real and complicated as your own."}, {"type": "sentence", "content": "Back in 2018 when I heard there was a new God of War game that everybody in the gaming industry couldn’t stop talking about I didn’t think much of it. God of War is a long running franchise full of gods and monsters typically based in the world of Greek mythology. While they were a staple of my youth and incredibly influential to video games, they were never more than throughly entertaining (and violent) games to me. Sure they had some excellent world building and cool stories, but they were just games. I finally decided to sit down and give the new God of War a chance and what I experienced was nothing like I have ever seen in the series before. I found the game made me question my own relationship with my father and had me contemplating big questions about what it means to be a son."}, {"type": "subtitle", "content": "Spoilers below for God of War (2018) and other past games in the series"}, {"type": "sentence", "content": "God of War’s main character is Kratos (known as the Ghost of Sparta). In the previous games we see Kratos rise as a lowly Spartan soldier battling monsters of Ancient Greek myth, dethroning the Olympians, to even dying multiple times only to return from the gates of Hades. In this God of War game we are instead immersed into the world of Norse mythology (Odin, Thor, frost giants, elves, and alike). We find Kratos and his son Atreus living in the woods preparing for the funeral of the recently deceased third member of their family Faye (wife of Kratos and mother to Atreus). Even though we haven’t met this character or seen Kratos or Atreus interact with her, we feel her loss and the effect it must have on the family. Not long after the funeral has commenced, we see Kratos and Atreus set off to scatter the ashes of Faye from the highest peak in the land. With the mother out of the picture, Kratos feels he has to accelerate the learning of Atreus and teach him to become a “man” quicker then he might prefer."}, {"type": "sentence", "content": "This would be arduous enough if this was a typical road trip story between a father and son, however, Kratos has a lot more on his mind while traveling on the dangerous roads of an ancient fictitious Norway. Atreus is still just a kid and he doesn’t quite understand there are more than bears and wolves on the road to the highest mountain. We see first hand how Kratos has to deal with the pressure of tending to his son who doesn’t understand what is going on around him, and protecting him from the dangers of the world. Fathers understand the burden of this balance all too well, but in Kratos’s position these dangers are dragons and trolls. This is something the game does very well, it doesn’t seem to have an obvious bias. Too often we see stories about a parent and child and the authors influence is sometimes too clear. The best storytelling framing is when the writers allow the audience/user to empathize with all characters in the story. The story wouldn’t work if we just thought Kratos was a bad dad or that Atreus was spoiled and weak. We need to be able to see each side of their thinking and how their choices impact not only their own life but the lives of their family."}, {"type": "image", "content": "https://miro.medium.com/max/3782/1*qxdLxcNW4Eg9dmFkWPV1Mg@2x.jpeg"}, {"type": "sentence", "content": "Through the story we see Kratos learn to trust Atreus more and have the patience and bravery to let him fail or succeed on his own. But he doesn’t achieve this level of understanding without much prior failure. In the beginning of the story Kratos doesn’t even give Atreus much time to grieve for his mother before having him practice his boxing, (pictured above)or yelling at him for not focusing when hunting a deer. We see Kratos journey from his toxic parenting techniques to a better understanding of himself and his son. Kratos eventually understands he doesn’t want his son to end up like him, and in order to make that happen he can’t raise him on his personal philosophy alone."}, {"type": "sentence", "content": "For me, playing God of War helped me come to terms with the relationship I have with my father, and I hope any who are willing to explore that complicated dynamic would be willing to give this story a try; regardless of whether you game regularly or not. While I feel like each indiveduals life and relationships are unique and personal, I think that there are similarities and patterns that emerge across all human experiences. Games like God of War are works of art that help us understand those experiences a little better."}], "topic": "gaming"}