{"title": "Cycling in Alicante — Serpis Greenway", "data": [{"type": "image", "content": "https://miro.medium.com/max/2800/0*GW8BJHa7Q_VEQsvA.jpg"}, {"type": "subtitle", "content": "The Serpis Greenway follows the route of the former Alcoy-Gandia railway through areas of great natural beauty and historical interest."}, {"type": "subtitle", "content": "The 30-kilometre ride takes us from the Mediterranean coast to inland Alicante through the spectacular scenery of el Raco del Duc."}, {"type": "sentence", "content": "ROUTES IN ALICANTE"}, {"type": "subtitle", "content": "Serpis Greenway"}, {"type": "sentence", "content": "Located on the southern side of the border between the provinces of Valencia and Alicante and running approximately 30 kilometres between the towns of Villalonga and Muro de Alcoy, the Serpis Greenway follows part of the route of the Alcoy-Gandia railway line along the course of the River Serpis as it passes through the spectacular landscape of el Raco del Duc, also known by the more sinister name of el barranc de l’infern (“Hell’s gorge”)."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*Hu1jv1e4phPWyJOM.jpg"}, {"type": "sentence", "content": "With 6 tunnels and 2 of its 7 original metallic bridges remaining, the route is yet to be fully incorporated into the Vías Verdes network, although some sections have been reconditioned."}, {"type": "sentence", "content": "At the time of writing, work has recently been carried out on the conversion of the line’s original route between Muro de Alcoy and Alcoy, where it will link up with the operational Alcoy Greenway, making for over 40 kilometres of traffic-free greenway."}, {"type": "subtitle", "content": "A little history"}, {"type": "sentence", "content": "As was somewhat common in other areas of Spain, in the late 19th-century the inland region around the city of Alcoy responded to its pronounced industrial development with the construction of a railway, in this case operated by the British company Alcoy and Gandia Railway and Harbour Co. Ltd. and linking the city to the port of Gandia on the Mediterranean coast. Known as the “English railway” (el tren dels anglesos in Valencian), the line was used for transporting coal and other materials to the growing Alcoy industrial sector, and for exporting industrial products such as textile, paper and olive oil via Gandia."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*h8jj5IU09qiXGst2.JPG"}, {"type": "sentence", "content": "The construction of the railway was subject both to physical and to political constraints: for a considerable stretch the River Serpis passes through mountainous terrain and a narrow gorge known as el barranc de l’infern (“Hell’s gorge”), whilst the local authorities insisted on the creation of stations in Alcoy, Muro de Alcoy, Villalonga and Gandia in a bid to ensure that the new infrastructure improved communications between the coastal and the inland areas. Further stations were later added in Gandia port, Beniarrés, Cocentaina, Beniarjó, l’Orxa and Gaianes."}, {"type": "image", "content": "https://miro.medium.com/max/2168/0*tMSjJyTjdDjPjGeY.jpg"}, {"type": "sentence", "content": "The new line was also planned in such a manner as to facilitate its connection to subsidiary lines running to Cullera, to the north of Gandia, and to Denia (part of which is now a greenway), to the south. There was also a connection to the Yecla line (part of which has been reconverted into the Xixarra Greenway) at Muro de Alcoy."}, {"type": "sentence", "content": "Frequently subject to episodes of financial turmoil during its operation, the line was the recipient of State subsidies from the 1940s onwards before its eventual closure in 1969."}, {"type": "image", "content": "https://miro.medium.com/max/2076/0*0Z6m3du8-X0x1TAJ.JPG"}, {"type": "subtitle", "content": "Villalonga"}, {"type": "sentence", "content": "We’ve taken Villalonga as the start of this route, although when in operation the railway ran to the port of Gandia, passing through the villages of Potríes, Beniarjó and Almoines on its way to the coast."}, {"type": "sentence", "content": "We can still cover this 10-kilometre stretch quite easily by bike, although we will have to use open and sometimes busy roads for the most part, as the original route no longer exists in its entirety. This alternative perhaps isn’t the most suitable if you are accompanied by children."}, {"type": "subtitle", "content": "Start of the route"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*NhaNUC_dD8ygp4Js.jpg"}, {"type": "sentence", "content": "Once we reach Villalonga, we can pick up the Serpis Greenway at the roundabout where the CV-685 enters the town, next to the IES Vall de la Safor High School. The way isn’t signposted as such, and is only marked as “Via Pista” in Google Maps."}, {"type": "sentence", "content": "After 200 metres we reach a crossroads, with the town’s cemetery on the left and the course of the original railway on the right."}, {"type": "sentence", "content": "If we carry on straight ahead, along the south bank of the River Serpis, we will have to tackle a rather steep climb that tops out, after around 3 kilometres, at a quarry that is often used as a car park and the starting point for the greenway. The main drawback with this option, in addition to the slog up the hill, is its remote location and lack of any security. From here we turn right and drop back down to the level of the River Serpis and pick up our route."}, {"type": "image", "content": "https://miro.medium.com/max/2352/0*TyuYnEJu1kdWcjHt.JPG"}, {"type": "sentence", "content": "If we turn right at the crossroads, we follow the original railway, again for around 3 kilometres, to the River Serpis and the site of the original railway bridge crossing the river. The bridge is long since gone, and to cross we have to avail ourselves of a somewhat rudimentary footbridge composed of pipes and concrete. We can see it in the video above. It’s quite safe, although perhaps a little unnerving, especially for those with vertigo."}, {"type": "image", "content": "https://miro.medium.com/max/2328/0*mPao6RpSe_o4iaLY.JPG"}, {"type": "sentence", "content": "So we have a choice: parking at the quarry, scrambling across the river, or taking on the testing climb no sooner are we underway. Neither of the latter are serious, but “el que avisa no traiciona” as the saying goes."}, {"type": "subtitle", "content": "The Greenway"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*QQmBB_bD_83drICM.jpg"}, {"type": "sentence", "content": "Once on the other side of the River Serpis the two routes meet up amid bancales (terraced fields) and carob trees as the greenway meanders its way up the gorge."}, {"type": "sentence", "content": "Around 1.5 kilometres later we come to the first of the 6 tunnels along the route. It’s worth carrying lights for use in the tunnels, as they can be quite dark inside, and also perhaps something to cover our arms, especially if we are planning on riding the route after dark/early spring/late autumn/winter, as they can be rather cold inside."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*v6SvxRkvgXbvBDzM.jpg"}, {"type": "sentence", "content": "After another kilometre or so we come to one of the area’s characteristic water-management structures: an azud, or a “diversion dam”, to use the rather more prosaic English term. Sitting like a crescent moon just under the water, the dam was used to hold up the flow of water and thus raise the level of the river, the force of which could then be harnessed for use in agricultural or industrial processes."}, {"type": "subtitle", "content": "La Fàbrica de l’Infern"}, {"type": "image", "content": "https://miro.medium.com/max/2132/0*t8wINecf3-2xiTr4.jpg"}, {"type": "sentence", "content": "A further kilometre separates us from la Fàbrica de i’Infern (Hell’s Factory), also known less alarmingly as la Fàbrica de la Llum (the Electric Factory), an abandoned hydroelectric plant dating from 1895 that was used to generate electricity for the area’s paper manufacturers."}, {"type": "sentence", "content": "It must be noted that, as has already been said, this route has not yet been included in the Vías Verdes network and, as such, is not equipped with the corresponding signage nor subject to the same maintenance. This last point is especially notable in the stretch between Villalonga and Lorcha, were the surface is often strewn with stones and ruts. Notwithstanding, it is perfectably rideable, if a little slow in places."}, {"type": "sentence", "content": "Curiosities at this point on the route include la Ermita de l’Inmaculada, a chapel build by the plant’s owners for its workers, who no doubt required special protection against the perils present in such an ungodly-named location. Whilst accessible, the hydroelectric plant, the chapel and the surrounding buildings are in a very poor state of repair and should only be approached with the utmost caution, if at all."}, {"type": "subtitle", "content": "L’Orxa"}, {"type": "sentence", "content": "At this point the greenway crosses the river and heads off towards L’Orxa, some 5 kilometres distant. We will pass an abandoned paper mill and another azud before we arrive at the village’s old train station, located under the gaze of the imposing ruins of the Castillo de Perputxent."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*KO59PiK8qiBtHZMZ.jpg"}, {"type": "sentence", "content": "A well-condition spot with plenty of parking and near the very hospitable village of L’Orxa, this is often used as a starting or turnaround point for those choosing to complete a shorter stretch of the route."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*89WVEuULKj9SF5SH.jpg"}, {"type": "sentence", "content": "We’ve leave el Racó del Duc, or el Barranc de l’infern, now and enter the wider, lush Perputxent Valley, dedicated to the cultivation of fruit trees in the main."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*U9q4zq1fkALZwdgL.jpg"}, {"type": "sentence", "content": "To our right rise up the mountains separating the provinces of Alicante and Valencia, whilst to the left the inland agglomerations of mountains so popular among Europe’s amateur and professional cyclists alike."}, {"type": "subtitle", "content": "Beniarrés"}, {"type": "sentence", "content": "The @7 kilometres to Beniarrés are mainly asphalted and make for very pleasant riding. Just before reaching Beniarrés the greenway emerges onto the CV-701 road, which we must cross before picking up our route again some 20 metres or so further along on the other side. The greenway isn’t signposted here, and it isn’t the best of solutions so it is worth paying attention, especially if cycling with children."}, {"type": "sentence", "content": "Once we’ve safely picked up our route again, the greenway swings around the south side of Beniarrés, passing through an impressive — and very dark — tunnel before emerging near to the town square. A perfect excuse to stop and refuel."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*XMPuY5-EXDSDEjL0.jpg"}, {"type": "sentence", "content": "A kilometre and a half to the south of Beniarrés lies the reservoir of the same name, yet another example of the creative use made of the River Serpis."}, {"type": "sentence", "content": "The exit from Beniarrés also has a trick, as the original railway line is missing a bridge around half a kilometre from the town, so we must take the CV-705 road direction Muro de Alcoy for a little under a kilometre before turning right and rejoining the greenway. Again, it’s not signposted, but the route runs parallel to the road at a few metres to right, and it’s not too difficult to find."}, {"type": "subtitle", "content": "Gaianes"}, {"type": "sentence", "content": "From here on the route continues to Gaianes, where we are required to do a bit of navigating around the streets before picking up the greenway again and head off towards Muro de Alcoy. Just half a kilometre to the south of Gaianes is la albufera de Gayanes, a freshwater lagoon that is frequented by migratory birds and which has been declared a protected natural area. On the way to Muro de Alcoy we cross over the A7 Autovía del Mediterraneo via a new bridge, and when entering Muro we must navigate a rather steep climb out of the River Agres’s (normally) dry riverbed, which would have originally been crossed by a long-since disappeared railway bridge."}, {"type": "subtitle", "content": "Muro de Alcoy"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*XevbU1-SLTY5-wJF.jpeg"}, {"type": "sentence", "content": "Our destination, Muro de Alcoy, is the largest town we will have come across since Villalonga, and offers the usual range of cafes, bars, restaurants and shops."}, {"type": "sentence", "content": "If we chosen the town as our turnaround point, we simply set off back the way came to Villalonga, this time down hill."}, {"type": "sentence", "content": "Alternatively, we can use Muro as starting point from which to investigate the nearby Sierra Mariola and Font Roja Natural Parks, or to continue on greenways to Alcoy, Yecla and beyond."}, {"type": "subtitle", "content": "How to arrive"}, {"type": "subtitle", "content": "Villalonga"}, {"type": "sentence", "content": "We’ve taken the start of our ride as town of Villalonga in the Valencian comarca of la Safor, located in the south of the province."}, {"type": "image", "content": "https://miro.medium.com/max/2076/0*j6XRb4S4V1BCwPce.JPG"}, {"type": "sentence", "content": "It lies around 10 kilometres from the centre of Gandia, from where it can be reached by car or bike via the CV-680 road (it is possible to ride some portions of this stretch along agricultural roads and back streets, but this requires a certain detailed knowledge of the area and is a little time-consumimg). As mentioned in the article, this road can be a little busy at times and isn’t recommended for children."}, {"type": "subtitle", "content": "Gandia"}, {"type": "sentence", "content": "Gandia itself is 70 kilometres to the south of the city of Valencia, and 110 kilometres to the north of the city of Alicante. It lies on both the N-332 road and the AP-7 toll motorway, which has junctions to the north of Gandia (Junction 60 — Gandia/Xeraco/Xeresa) and in Oliva (Junction 61 — Oliva/Gandia)."}, {"type": "sentence", "content": "Gandia can also be reached by train from Valencia Nord train station. Transporting bicycles on trains always seems to be a sticky matter in Spain, subject to factors that aren’t always clear or consistent, so as always you would do best to contact RENFE before trying to board a train with your bike."}, {"type": "subtitle", "content": "Muro de Alcoy"}, {"type": "sentence", "content": "If you decide to ride the Serpis Greenway in the opposite direction, you can reach Muro de Alcoy by car via the inland, toll-free A7. The town lies around 100 kilometres to the south of the city of Valencia, and around 70 kilometres to the north of the city of Alicante."}, {"type": "sentence", "content": "It can also be reached by train from Valencia Nord station, changing at Xátiva. The service isn’t too regular, and the same advice applies regarding boarding with bicycles."}, {"type": "subtitle", "content": "Further riding"}, {"type": "sentence", "content": "Hemming Muro de Alcoy in from the west is the Sierra de Mariola Natural Park, the highest peak of which is the Montcabrer, at 1,389 m.a.s.l., whilst just beyond Alcoy we find the Font Roja Natural Park, of which the Sierra del Menejador is the point at 1,356 m.a.s.l. Both are highly recommended."}, {"type": "subtitle", "content": "Alcoy Greenway"}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*dy5oQyxQSLD_3EHZ.jpg"}, {"type": "sentence", "content": "If we decide to explore the area, we can head south out of Muro de Alcoy and carry on to the city of Alcoy, following in large part the route of the original railway. As of writing, work is gradually underway on the reconversion of the railway along this stretch, although no date has been given for its opening as a greenway."}, {"type": "subtitle", "content": "Alcoy — Alicante"}, {"type": "sentence", "content": "From Alcoy we can access the Font Roja Natural Park, or follow the Greenway along the route of the Alcoy-Alicante railway, which never entered into operation despite almost a century of planning and works. The original route can be followed south to La Sagra, from where we can switch between the intended railway, which is now mostly composed of gravel or asphalt agricultural tracks, and service roads, passing through Ibi, Castalla and near to Tibi before arriving after some 20 kilometres at the Maigmó Greenway, the final stretch which has been reconditioned and included in the Vía Verde network."}, {"type": "image", "content": "https://miro.medium.com/max/2246/0*Jajq5LmbKf7qoLVZ.JPG"}, {"type": "sentence", "content": "The end of the Maigmó Greenway lies around 10 kilometres from the city of Alicante."}, {"type": "subtitle", "content": "Xixarra Greenway"}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*xmNgGg1dA553M5hc.JPG"}, {"type": "sentence", "content": "Interestingly, at the time of writing it has been announced that work is to begin on the reconditioning of the original stretch of the Xixarra Greenway in Cieza, in the adjacent region of Murcia. Further plans include the reconidtioning of the stretches of the same railway route around the towns of Jumilla and Yecla, and eventually their connection to the existing reconditioned stretch that runs from Santuario de las Virtudes to Biar, making for a total of 70 or so kilometres of greenway."}, {"type": "sentence", "content": "The remaining stretch of the route between Biar and Muro de Alcoy, while by no means complete and not included in the Vias Verdes network, is rideable for long stretches, and is mainly surfaced with gravel and asphalt."}, {"type": "image", "content": "https://miro.medium.com/max/2800/0*9HUYcFyxcVuLSwHj.JPG"}, {"type": "sentence", "content": "With the exception of some long-disappeared stretches and certain of the towns and villages that lie along the way that would have to be navigated by road, this gives us around 180 kilometres of former railway from the Mediterranean coast to the borders of la Mancha to investigate."}, {"type": "image", "content": "https://miro.medium.com/max/2314/0*ZkBB-0Wg2wKA00qB.JPG"}, {"type": "sentence", "content": "NB: Please note that this article was created during the lockdown restrictions imposed in response to the COVID-19 crisis. As such, many of the photos used have been obtained from Wikicommons, with credit given as appropriate. For the sake of formatting the original credit has been omitted from the first photograph. That credit is: Pau Lagunas / CC BY-SA. It is hoped that we will be able to compliment the article with our own photos once the restrictions on movement are lifted. If you detect any anomaly in the use or crediting of the photos used, please do not hesitate to contact us."}, {"type": "subtitle", "content": "Links"}, {"type": "sentence", "content": "Alcoy Greenway"}, {"type": "sentence", "content": "Ibi Greenway"}, {"type": "sentence", "content": "Maigmó Greenway"}, {"type": "sentence", "content": "Safor Greenway"}, {"type": "sentence", "content": "Serpis Greenway (in Spanish)"}, {"type": "sentence", "content": "Xixarra Greenway"}, {"type": "sentence", "content": "Alcoy Turismo"}, {"type": "sentence", "content": "Visit Gandia"}, {"type": "sentence", "content": "RENFE Cercanias (in Spanish)"}, {"type": "sentence", "content": "Originally posted in www.onyour.bike"}], "topic": "travel"}