{"title": "The secret to user onboarding", "data": [{"type": "image", "content": "https://miro.medium.com/max/12000/1*82tLvpTHNeMHsTOfTi63-Q.jpeg"}, {"type": "sentence", "content": "Every product in the whole world has an onboarding. It’s like death or taxes: it’s inescapable. You might spend one second thinking about it, or you might have an entire team dedicated to onboarding, but you can’t avoid it. At 4Degrees our onboarding is very labor-intensive. Someone from our team spends an hour or more walking new users through the platform and pointing out relevant features. It adds a nice personal touch to our business software, but we are quickly outgrowing this method."}, {"type": "sentence", "content": "I’m in the process of designing our in-product onboarding flow from the ground up. My process always begins with lots and lots of research. At this point in my research, I’ve gone through so many onboarding flows, my inbox is just a pile of marketing emails. You can’t even imagine how many times I’ve hit “unsubscribe” in the past week, but it was worth it."}, {"type": "sentence", "content": "I’ve been through some amazing onboarding flows, some horrible flows, and everything in-between. I took all this market research, analyzed it, and I discovered the secret to a great onboarding flow."}, {"type": "subtitle", "content": "Value Action"}, {"type": "sentence", "content": "While it’s fun to laugh at the losers, I think it’s far more productive to analyze the winners. As I started to analyze what I consider to be the “best” onboarding flows, one theme kept jumping out at me. They all encouraged the user to perform some sort of action that led to them gaining value."}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*obYuQZ_yVy2ejhhaTmEVkw.png"}, {"type": "sentence", "content": "This creates a connection in the user’s mind between their effort and the product’s value. I call this a value action."}, {"type": "sentence", "content": "Lots of companies focus on getting the user to value as quickly as possible, but they miss an important part: correlating the user's effort to the value."}, {"type": "sentence", "content": "In his book Hooked, Nir Eyal talks about the psychological phenomenon known as “the escalation of commitment” which says that the more effort a person puts into a product, the more they value it."}, {"type": "sentence", "content": "This phenomenon can be seen in lots of different products, from Ikea furniture to Betty Crocker cakes; all types of users value products that they put effort into. It’s the same with digital products. If you don’t believe me, go talk to a Notion fanatic or a Photoshop expert."}, {"type": "sentence", "content": "Now that we have discovered value action, how do we recreate it in our own products? The first step is to look at some good examples. Since every product offers different values to its users, every value action will look very different. Even so, we can gain insight and ideas from looking at other product’s value actions."}, {"type": "subtitle", "content": "Trello: Value + Action"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*aTXrWBb7viOcNYIE"}, {"type": "sentence", "content": "Trello doesn’t just drop their users into an empty state with a bunch of coach marks pointing in 10 different directions. Trello holds its user's hand through the value action of naming three boards and filling them with three tasks. This is an important but manageable task for a new user to accomplish."}, {"type": "sentence", "content": "During the onboarding flow, the user can visualize their work in a way that helps them prioritize tasks. For most users, this helps them to see the value of the product. The user is putting in the effort (naming boards, writing out tasks) that is adding to the value they feel. If Trello left users in an empty state or provided placeholder data, the user wouldn’t experience as much value. From the first screen, the user starts to understand that the more they work in Trello, the more value they’ll get from Trello."}, {"type": "sentence", "content": "Thank you Trello, you’re a true value action hero."}, {"type": "subtitle", "content": "Value Action, Rinse and Repeat"}, {"type": "sentence", "content": "As I continued to dig into the idea of value action, I realized another theme that went hand-in-hand with value action: education. The best onboarding flows show a value action and teach the user how to navigate the product. These flows help the user understand where the important buttons are and where to go for help. The best onboarding flows leave their users with the knowledge of how to repeat the value action!"}, {"type": "sentence", "content": "It’s not enough to get the user to value; it’s not enough to get the user to understand the relationship between effort and value; the onboarding flow also has to teach the user how to repeat that value action on their own!"}, {"type": "subtitle", "content": "Duolingo: Value + Action + Product Education"}, {"type": "image", "content": "https://miro.medium.com/max/1392/0*Z5T4kwHgjj2XUxOb"}, {"type": "sentence", "content": "Duolingo is one of those products that makes designing an onboarding flow look incredibly easy. By the third screen, the user is already translating a sentence into the language they want to learn. The relationship between the user’s effort and the value they receive is obvious right off the bat."}, {"type": "sentence", "content": "Not only does Duolingo do value action very well, but they also add in product education, and they do it all in about 5 screens. Duolingo carefully walks the user through a lesson — their value action. They point out where to go to find extra help. When the flow is over, the user is left feeling confident and ready to learn a new language."}, {"type": "sentence", "content": "Duolingo’s users feel confident because the onboarding flow is almost identical to the main product. When the user starts their first non-onboarding lesson, they aren’t surprised by anything; they know exactly what to do."}, {"type": "sentence", "content": "Value action plus product education means making the user incredibly comfortable with the product. Then the user can replicate the value action they experienced in the main product."}, {"type": "subtitle", "content": "Keep it Intuitive and Simple, Stupid"}, {"type": "image", "content": "https://miro.medium.com/max/3840/0*EQGw6lVhdPNoKzhv.jpg"}, {"type": "sentence", "content": "It’s important to note that Duolingo’s great UX isn’t due to their onboarding flow alone. The product itself is so intuitive that most users could figure it out without the onboarding flow."}, {"type": "sentence", "content": "When you are designing an onboarding flow, if you feel like you have to explain how every feature works, you need to re-think the usability of your product. It’s a great exercise to look at your product through the eyes of a brand new user. Thinking this way can uncover the hidden complexity that can creep into products."}, {"type": "sentence", "content": "If your product is (mostly) intuitive, the next step is to keep the onboarding flow short. No user wants to go through 45 minutes of value actions and product education."}, {"type": "sentence", "content": "At 4Degrees, our product has a lot of features; there are dozens of value actions that I could lead users to. It shouldn’t be difficult to uncover value actions in your product, the hard part is choosing one or two value actions and leaving the rest out of the onboarding flow."}, {"type": "sentence", "content": "My advice is to test, test, and test some more. Let your users tell you what value actions work and which ones don’t. Who knows, maybe you need different value actions for different types of users! Every product is different, but every product has to lead its users to value during onboarding."}, {"type": "sentence", "content": "Designing an onboarding flow is not easy, but you can’t ignore it. Every user goes through onboarding, and it can make or break the success of your product. Good luck!"}], "topic": "design"}