{"title": "Virtual Background in webcam with Body Segmentation technique", "data": [{"type": "subtitle", "content": "Webcam background change is not limited to Zoom now, I just did it in the browser with tensorflow.js body-pix model"}, {"type": "image", "content": "https://miro.medium.com/max/2000/1*7JZFg4utLSm5qSXxDs-hnA.jpeg"}, {"type": "sentence", "content": "Have you ever had a moment when browsing those pretty travel selfies on social media, you talk to yourself: “I wish I could be there”? Guess what, we are going to make it come true today. With the latest technology of Person Segmentation, we can separate the body section with the background on a pixel level."}, {"type": "sentence", "content": "Very similar to the video conference software Zoom’s change background feature, which can hide the messy room behind you, and transport you to a deserted island or peaceful beach."}, {"type": "sentence", "content": "In this article, I will show you how to build a Selfie Anywhere app, which can put you inside those beautiful travel scenes by changing the background of a selfie in real-time. You don’t need Photoshop, and you don’t need a green screen neither. Let’s have some fun and count down ” 3, 2, 1… Say cheese” !"}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*wI5UkUo1KziqXX2c5ocAaQ.jpeg"}, {"type": "sentence", "content": "Try it yourself, the demo is in the link below :"}, {"type": "subtitle", "content": "Implementation"}, {"type": "sentence", "content": "Did you take some selfies above and show that to your friends? I hope you like it, this app utilized an advanced technique called Body Segmentation, which can identify human being in an image or video stream, and segment the foreground body from the background."}, {"type": "sentence", "content": "Early this year, Google releases BodyPix, an open-source machine learning model which allows for person and body-part segmentation in the browser with TensorFlow.js. I was amazed by this technology, and come up with the idea of building the above Selfie Anywhere application. Follow me below for the journey of how I implemented it."}, {"type": "subtitle", "content": "# Step 1: Include tfjs and body-pix"}, {"type": "sentence", "content": "First of all, simply include the script Tensorflow.js and its body-pix model in the <head> section of the html file."}, {"type": "sentence", "content": "Or you can install it via npm for use in a TypeScript / ES6 project"}, {"type": "subtitle", "content": "# Step 2: Stream webcam to browser"}, {"type": "sentence", "content": "To stream your webcam into the browser, I utilize the JavaScript library navigator.mediaDevices.getUserMedia. To find out more details about that, please refer to my previous article :"}, {"type": "subtitle", "content": "# Step 3: Load BodyPix Model"}, {"type": "sentence", "content": "In order to process segmentation, we first need to load the pre-trained BodyPix model, by calling the API of bodyPix.load(modelConfig). BodyPix comes with a few different versions of the model, with different performance characteristics trading off model size and prediction time with accuracy."}, {"type": "sentence", "content": "By default, BodyPix loads a MobileNetV1 architecture with a 0.75 multiplier. This is recommended for computers with mid-range/lower-end GPUs. A model with a 0.50 multiplier is recommended for mobile. The ResNet architecture is recommended for computers with even more powerful GPUs."}, {"type": "subtitle", "content": "# Step 4: Body segmentation"}, {"type": "sentence", "content": "Next, we start to feed the webcam stream through the body-pix model to perform person segmentation, by calling the API of net.estimatePersonSegmentation(video, outputStride, segmentationThreshold). It segments an image into pixels that are and aren’t part of a person. It returns a binary array with 1 for the pixels that are part of the person, and 0 otherwise. The array size corresponds to the number of pixels in the image."}, {"type": "sentence", "content": "flipHorizontal defaults to false. If the segmentation & pose should be flipped/mirrored horizontally. This should be set to true for videos where the video is by default flipped horizontally (i.e. a webcam), and you want the segmentation & pose to be returned in the proper orientation."}, {"type": "sentence", "content": "segmentationThreshold is used to determining the minimum value a pixel’s score must have to be considered part of a person. In essence, a higher value will create a tighter crop around a person but may result in some pixels being that are part of a person being excluded from the returned segmentation mask."}, {"type": "sentence", "content": "It returns a Promise that resolves with a SemanticPersonSegmentation object. Multiple people in the image get merged into a single binary mask. In addition to width, height, and data fields, it returns a field allPoses which contains poses for all people. The data array for all people containing 307200 values, one for each pixel of the 640x480 image."}, {"type": "subtitle", "content": "# Step 5: Remove Background"}, {"type": "sentence", "content": "In the above function, we get the binary array to indicate pixels belong to body or not, now we can use it to remove the background, and only draw the body on a canvas. In an ImageData object, each pixel holds the values of red, green, blue, and alpha (transparency), the trick to remove the background is by setting the pixel’s transparency value to 0."}, {"type": "subtitle", "content": "# Step 6: Overlay canvas above background image"}, {"type": "sentence", "content": "Once we had the canvas that only contains the body with a transparent background, then we just need to overlay it on top of a background image of the breathtaking nature scene."}, {"type": "sentence", "content": "Applying css style below"}, {"type": "subtitle", "content": "# Step 7 : Take a screenshot"}, {"type": "sentence", "content": "For taking the picture, I am using a 3rd party JavaScript library html2canvas.js. It allows you to take “screenshots” of web pages or parts of it, directly on the users browser."}, {"type": "sentence", "content": "That’s pretty much for the code! Other than that is just making the demo look nice. Choose one of those spectacular scenes, set your favorite pose and smile!"}, {"type": "subtitle", "content": "GitHub repository"}, {"type": "sentence", "content": "You can download the complete code of the above demo in the link below:"}, {"type": "subtitle", "content": "Conclusion"}, {"type": "image", "content": "https://miro.medium.com/max/14562/1*8fn1OfDPeaoqmSIXrKVrCQ.jpeg"}, {"type": "sentence", "content": "Advancements in instance segmentation technologies are now showing promise for many fields ranging from self-driving vehicles to medical diagnosis. With deep learning neural network, the models are now becoming more and more accurate. I hope this article is just the beginning of your journey to learn more about image segmentation and computer vision."}, {"type": "sentence", "content": "Thank you for reading. If you like this article, please share on Facebook or Twitter. Let me know in the comment if you have any questions. Follow me on GitHub and Linkedin."}], "topic": "artificial-intelligence"}