{"title": "What Scientists And The Public Need To Know About Believing Lies And How We Fight It Together", "data": [{"type": "subtitle", "content": "Peer-Reviewed Politics"}, {"type": "subtitle", "content": "Poor science literacy can’t explain the misinformation crisis or the political divide. Getting the cause wrong means we can’t find the right solution."}, {"type": "sentence", "content": "Exasperation. That’s a word you could use to describe how many scientists are feeling under the current plague of conspiracy theories and snake oil cures."}, {"type": "sentence", "content": "The belief that the problem comes from a lack of science literacy hurts both scientists and society. We cannot help the public rightly understand scientific findings until we rightly understand why they don’t."}, {"type": "image", "content": "https://miro.medium.com/max/8400/1*D-HShqfSdsK0tS756pa0Pg.png"}, {"type": "sentence", "content": "THE STATE OF SCIENCE LITERACY People understand science. With little evidence, many believed/believe (I was once among them) that not understanding science drives people to do or support things for which we have no evidence. It should be clear to us, from this example alone, that intellect and education offer little protection against mistaking personal impressions for a fact."}, {"type": "sentence", "content": "The premise also meant assuming those who knew less would trust scientists less, but studies haven’t found that. Though it may not feel like it, public trust in scientists is high, especially compared to politicians who they report distrusting most. We’ve got that going for us."}, {"type": "image", "content": "https://miro.medium.com/max/1460/1*5NYv-X0nnDawEP9VVkRjpw.png"}, {"type": "sentence", "content": "That all makes sense until you realize that our actions show that our views roughly follow the respective political parties. What people report, and what they appear to believe, makes little sense, so we need to find the pieces of this puzzle we aren’t seeing."}, {"type": "sentence", "content": "WHY DOES THIS MATTER FOR SCIENCE COMMUNICATION? Opinion, and what changes it, reveals clues about what besides reality affects how we feel and respond. The 2008 market crash provoked a universally negative view of the economy. That seems fair."}, {"type": "sentence", "content": "The negative view persisted for Republicans even after the economy had improved. Then, their positive outlook shot skyward when a Republican took office. This suggests that their favorable views are responding to something other than the market."}, {"type": "image", "content": "https://miro.medium.com/max/1692/1*uNCKwX6sEaWPMDBJNXvWBQ.png"}, {"type": "sentence", "content": "Democrats' positive outlook fell when their opposing party took office. The depth of the shift seems steep compared to the data, though not necessarily extreme. Republicans' shift was several times greater than that of Democrats."}, {"type": "sentence", "content": "Here exists our problem. Opinions mirrored one another in the past, with a gap between attributable to personal bias. The responses said that both parties were reacting to the same situation, either magnified or diminished depending on the view. The deepening split and opposing responses of today say we are no longer responding to the same reality."}, {"type": "sentence", "content": "At least that seems more likely than that we quickly embraced diametrically opposing values. The opinion shifts appear in response to the leadership change. Economy and wages have not changed so strikingly as to warrant the large swings in opinion and the timing is wrong for it to be in response to the actual economy."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*u_w6lU_WzPMufUGYKEHkng.png"}, {"type": "sentence", "content": "While the GDP has risen, the average hourly wage dipped before returning to just below the place where it started. It’s possible more money was coming into the US economy, but the average person was making less per hour. Perhaps you could make an argument that democrats’ negative outlook reflected the reality, but their negative view arrived before wages fell."}, {"type": "sentence", "content": "Something else is affecting our perception of reality, but it’s likely not as simple as whatever opposes your view is greedy or communist."}, {"type": "image", "content": "https://miro.medium.com/max/1346/1*7kA_Rt0Qn5Uolu09UMYtug.jpeg"}, {"type": "sentence", "content": "Curiously, the steep-swinging opinions run counter to self-reported trust in scientists who reported nothing that warranted these opinion shifts. There are scientists in almost every field, economy included."}, {"type": "sentence", "content": "The data beg the question: People report strong trust in scientists and strong distrust in politicians, so why do their opinions show otherwise? Can people know themselves that poorly?"}, {"type": "sentence", "content": "WHAT WE KNOW ABOUT OPINIONS AND BELIEFSWe want to believe whatever falls in-line with those around us, a harmonious existence. Motivated reasoning results. Instead of starting with evidence and drawing a conclusion, we do it backward."}, {"type": "sentence", "content": "We take something we want or that we think may be true and support it with things we think are evidence — but often, the “evidence” is less proof and more imagination. It’s not that people don’t understand science or that they don’t care about the facts."}, {"type": "sentence", "content": "Imagine someone says the new guy in town is sketchy. Then you recall seeing him do something, literally anything, and think it seems suspicious now. Looking back, you tag meaning to something that meant nothing earlier. It becomes evidence. Never mind that it meant nothing to you before the suggestion."}, {"type": "sentence", "content": "People assess information based on what it would mean for their current worldview. I suspect there is a survival instinct deeply embedded in this behavior. We survive by living in a community, so fighting and spouting views counter to those around us threaten our ability to work together and survive."}, {"type": "sentence", "content": "It’s much easier to be contrarian today, but it used to get you burned at the stake. We used to be much more reactionary. Sometimes we still are. Nature is a hard force to fight, and we often lie the most to ourselves."}, {"type": "sentence", "content": "If you’re selling crude oil and a study shows how bad burning it hurts the environment, it doesn’t matter if you understand science or not. The odds are that you find the study suspicious and think it’s bad science. What’s the alternative? Dismantling your life and admitting you’re a scourge on the earth sounds about as fun as mediating a debate between Sen. Bernie Sanders and Pres. Donald Trump about climate science."}, {"type": "sentence", "content": "If you voted for someone who commits a crime or betrays your trust, there is little motivation to see the truth. It won’t fix things, you may worry people will question your judgment, and it could mean the opposing party wins next time. By instilling us with fear of the alternative, those in power ensure we will pardon no matter the offense."}, {"type": "image", "content": "https://miro.medium.com/max/8400/1*nq_xxf5gqPQSd8Qkh_C-6w.png"}, {"type": "sentence", "content": "We have little choice if we see these two choices:"}, {"type": "sentence", "content": "It’s genius if you think about it. The response is predictable. We look the other way and say it’s for the “greater good.”"}, {"type": "sentence", "content": "Neither party is the enemy in actuality. People have views far too complex to distill into talking points, but we can feel otherwise by not checking our biases and not questioning ourselves about why we believe what we believe."}, {"type": "sentence", "content": "We are not humble creatures, us humans. We like to be right, so much that we are like a toddler who covers his eyes and believes no one can see him."}, {"type": "sentence", "content": "How much weight we give something depends on our worldview. If it supports what someone already believes, they accept. If it does not, then the information may strike them as suspect."}, {"type": "sentence", "content": "People in a study felt this way irrespective of the truth."}, {"type": "sentence", "content": "WHY WOULD THIS TYPE OF THINKING BE BENEFICIAL?“Identity protection,” interpreting facts such that they allow us to maintain our standing and identity within a group that shares our beliefs, probably drives more than we appreciate."}, {"type": "sentence", "content": "Everyone knows the sensation. You’re sitting at Thanksgiving dinner and a distant uncle espouses extreme political ideas and you just shove more potatoes in your mouth. It’s not worth it. Maybe you stay silent, knowing he will disregard anything, no matter how damning. That’s identity protection. You can’t get him to see the truth because his mind won’t let you."}, {"type": "sentence", "content": "If you believe something, ask yourself why. I assure you there are those who rely on the likelihood that you won’t ask. You will take them at their word, so long as they share your views. Don’t mistake the person saying what you want to hear for a person telling the truth. Be extra cautious if they say it over and over. Repeat a lie often enough and it becomes the truth."}, {"type": "image", "content": "https://miro.medium.com/max/8400/1*VDSaaUdI8YutMf6PDbDqmQ.png"}, {"type": "sentence", "content": "Any phrases coming to mind right now?"}, {"type": "sentence", "content": "Probably many political slogans. That’s why people use them. Whether it’s “Yes, we can” or “Fake news,” you stand a fair chance of convincing everyone it’s true, if you say it enough. Once it sounds like it could be true and enough people believe it — a consensus — it’s likely you will feel pressure to believe it, too. A person would have to willfully resist bias and aggressively look for the truth to stand a chance."}, {"type": "sentence", "content": "Regardless of how true something is, people find repeated phrases more likely true, while recent information strikes them as suspicious for a reason they can’t say. The repeated phrase might be “the world is flat” and the new phrase “the world is round.”"}, {"type": "sentence", "content": "Our feeling about it means about as much as it means when you look at an optical illusion and see something that isn’t there. We love provoking this experience so much, there are entire book series devoted to it. Still, we know what we see isn’t any more real than it is when a downward-facing selfie makes you look 25lbs lighter. Oh, how I wish that were real."}, {"type": "sentence", "content": "Often in a debate, I ask why someone arrived at their belief. If they know something I don’t, I should want to know — that is, if I’m concerned with the truth. Asking why must be exceptionally rare because it catches people off-guard. Some assume its sarcasm, and I have to clarify that I’m serious."}, {"type": "sentence", "content": "Sometimes it comes down to a personal story that doesn’t necessarily represent reality or saying something like “well, everyone knows XYZ” or “[insert opponent’s name] did XYZ and where is your anger about that?” These don’t relate to the argument, but it tells you the person you’re talking to thinks they do."}, {"type": "sentence", "content": "Asking why, with no intention to listen, can be another expression of bias. It’s not that they are rude; they may have honestly thought you didn’t have a reason. That said, if you ask why, then you better be willing to hear and possibly admit you are wrong. If your aim is to silence anyone who disagrees, you’re not interested in the truth."}, {"type": "image", "content": "https://miro.medium.com/max/4800/0*71j4FnRkGv4F7Hz9"}, {"type": "sentence", "content": "People often assume if I ask about rationale, I must support their opposition — not true — showing the power in tools of manipulation. Bias colors everything. Asking for justification should not upset someone with sound reasons. If it’s the truth, it has nothing to fear; the truth stands on its own."}, {"type": "sentence", "content": "My experience has gone one of three ways:"}, {"type": "sentence", "content": "Maybe it flows from the fear of being wrong. Maybe it taps into fear of the alternative that has been ground into our minds. It’s just the truth to us now. Then, we allow poor behavior because, in our minds, what other choice do we have?"}, {"type": "sentence", "content": "We have a choice. They do not get to hold us ransom with lies, not unless we let them. At first, you won’t want to see it, but deep down I think we know. We can fight bias and division."}, {"type": "sentence", "content": "If we understand how something can sound true when it’s false and understand how people attempt to control our opinions, then all the propaganda in the world can’t hurt us. Preparing ourselves for the lies we may hear could work like an immunization against misinformation."}, {"type": "sentence", "content": "The conspiracy theories during Covid-19 were almost predictable looking at the social media from the Ebola outbreak. We saw “misinformation, conspiracy theories, politically motivated stories, dangerous ‘cures,’ risk-skewing ideas, and rumors.” We are creatures of habit; evidently, we’re also not overly creative."}, {"type": "sentence", "content": "We decide if false ideas lead us to act against our interests and if we share or repeat something that isn’t true. Whatever we choose, sharing something we haven’t verified is not harmless."}, {"type": "sentence", "content": "Joseph Goebbels told us so."}, {"type": "image", "content": "https://miro.medium.com/max/8400/1*XZfTO_xmNVTtcNg4LHPBMA.png"}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*fSJo9E6JmZ4DgDT7TEoZUg.png"}], "topic": "science"}