{"title": "7 Habits of Living Your Best Life", "data": [{"type": "subtitle", "content": "It’s important to implement habits to live a successful life — be intentional."}, {"type": "sentence", "content": "Lately, I’m living my best life. Not every day, but most days. Five out of seven, at least. This may sound odd, given the circumstances of the world in which we find ourselves living. But I am. I’m earning money doing something I love, I found something I love to spend time doing (this is key), I’m in a relationship where I’m free to be me, and I love where I’m living."}, {"type": "sentence", "content": "Most nights, I put my head down on my pillow, satisfied. Even during a pandemic, my life is vibing positivity along."}, {"type": "sentence", "content": "As humans, we have a deep desire to live fulfilled and happy lives, and with a few mental shifts and implementing small daily habits, you can increase your satisfied quotient."}, {"type": "subtitle", "content": "Here are 7 habits of living your best life"}, {"type": "subtitle", "content": "Do something you love every single day"}, {"type": "sentence", "content": "Maybe you can’t quit the job you hate because your family relies on your income and the health insurance which it provides, but you can add something you love to your day."}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*yojPYFLsf71OZB1Q9IFoIA.jpeg"}, {"type": "sentence", "content": "I was miserable about six years ago, in a rut. I kept the same routine day in and day out, and none of it was making me happy. Nothing excited me. I had the same drive to make, the same work to do, the same schedule to keep, the same laundry to wash, the same. I asked myself what would shift my energy, excite me, what could I add to my day that would give me some joy?"}, {"type": "sentence", "content": "The answer was simple, it was the question that took me a long time to get right. Ask yourself, ‘What brings me joy?’"}, {"type": "sentence", "content": "I wasn’t doing anything during the day I love to do. The answer was I needed to create again. So, I took up playing the piano I had quit as a child. I found a teacher and started taking piano lessons as an adult. I feel joy when I’m sitting at the keyboard struggling to get a song right. Hours go by without me noticing, it’s simple, but it makes me happy."}, {"type": "sentence", "content": "Playing the music again had a ripple effect in my life, it made me want to write again. More joy. I’ve been writing since."}, {"type": "subtitle", "content": "Be present and honest"}, {"type": "sentence", "content": "I’m honest with people in my life. Meaning, I’m present when those I love are around, and not hiding in my phone. I look up from the computer and smile when my partner walks into the house. If my daughter asks me a question, I look at her and not my phone."}, {"type": "sentence", "content": "If you are hiding in your device, you can’t be present."}, {"type": "sentence", "content": "I want to live a full life. What that means is I’m fully present with those I love. I know the other way all too well. I excel at shutting down, and it doesn’t feel good in the long run. It is terrible for the success of intimate relationships."}, {"type": "sentence", "content": "It may not be easy to fully engage in relationships when they are not going well. But to get to a place where you enjoy being around your people, you need to be honest and present, especially when they are making bids for attention. This also requires having boundaries and taking time for yourself so that when you do come back to engage with your partner or child, you are all in."}, {"type": "sentence", "content": "Your friends and family know when you are not there — you may be physically in the room, but mentally thinking about your work with your face buried in your iPhone, and it makes them feel bad."}, {"type": "sentence", "content": "People want to feel seen and heard, it is impossible to do this when you have your eyes on your phone, and only half of your attention on whoever is trying to communicate with you."}, {"type": "sentence", "content": "Be more honest and present."}, {"type": "subtitle", "content": "Make sleep a top priority in your life"}, {"type": "sentence", "content": "I used to have a hard time going to sleep at night. Once I finally drifted off to sleep, I would toss and turn and wake up at some point. Since charging my phone a couple of rooms away from my bedroom at night, uninterrupted sleep is no longer a problem."}, {"type": "sentence", "content": "Get real with your phone use. Implement strict boundaries, so it isn’t running your life. I’ve done this, and now I fall asleep in less than ten minutes, I don’t wake up in the middle of the night, and I get a solid nine hours of straight sleep."}, {"type": "sentence", "content": "Make your bedroom sacred. Use it only for rest, sex, and reading before bed. That way, your mind will associate your bedroom with only those things that relax you and make you want to drift off to peaceful slumber."}, {"type": "sentence", "content": "Don’t look at a screen a good two hours before sleep. Most weekday nights, I read for an hour before bed. Sleep is vital for physical and emotional health, and for starting the next day well."}, {"type": "subtitle", "content": "Keep your word"}, {"type": "sentence", "content": "Keep your word, not just with your friends and those you value, but with yourself."}, {"type": "sentence", "content": "When you say you are going to do something, do it. I found my word slipping when it came to something I didn’t want to do for my work life, and it was making me feel bad. When we disappoint ourselves and don’t do the things we write down or tell ourselves we are going to do, it affects our habits and productivity and our self-worth."}, {"type": "sentence", "content": "You need to be able to follow through on things that are important to you or adds value to your life. If you don’t, then it is not that important to you, or it is essential to you, and you’re letting yourself down by not getting it down. When you let yourself down, it affects your self-esteem."}, {"type": "sentence", "content": "If you say you are going to stick to a goal like daily exercise, then not sticking to it is harming your relationships with yourself."}, {"type": "subtitle", "content": "Be intentional"}, {"type": "sentence", "content": "The key to living the life you want to live is to be intentional. Being intentional is the starting off point to realizing your dreams."}, {"type": "sentence", "content": "A lot of times, we just go through the motions because that is what we have always done. Living on autopilot becomes a habit by default. We think it is the easiest way to live, but it might not be the best way to live your best life."}, {"type": "sentence", "content": "Being intentional with your life is the key to success."}, {"type": "sentence", "content": "When you set intentions, even small ones, it gives you focus and drive to achieve your goals."}, {"type": "sentence", "content": "When we do what we love, when we set goals that get us to the place we want to be next week, next year, in the next five years, we start living the life we want to live. We don’t allow things to just happen to us by accident."}, {"type": "sentence", "content": "Set the intention to fill your life with those things that give you value and let go of those things that are holding you down."}, {"type": "sentence", "content": "The classic Vedic text known as the Upanishads declares, “You are what your deepest desire is. As your desire is, so is your intention. As your intention is, so is your will. As your will is, so is your deed. As your deed is, so is your destiny.”"}, {"type": "subtitle", "content": "Don’t be so rigid"}, {"type": "sentence", "content": "Don’t make getting to your best life another full-time job. Craving some chocolate? Eat it. A glass of wine on a chilly summer night with friends? Go for it. Give in to desires that make you feel good."}, {"type": "sentence", "content": "It’s as essential to treat yourself as it is to keep the goals you set for yourself."}, {"type": "sentence", "content": "Take a bubble bath and read. Sit in the sun and read. Things like this feed my soul and give me the energy to accomplish the goals I’m reaching for in my work life."}, {"type": "sentence", "content": "Sitting in the sun and reading may not seem productive, but doing so feeds my creative mind and gets my creative juices flowing for when I do have to produce and write."}, {"type": "sentence", "content": "If you are a writer, you must live life, so you have something of value to say."}, {"type": "subtitle", "content": "Invest in your health"}, {"type": "sentence", "content": "Start on a journey of optimal health."}, {"type": "sentence", "content": "Physical health affects your emotional health and well-being. Start small if you don’t eat well. Add a few greens and fruits into your daily diet. You will feel better from just adding those two things."}, {"type": "sentence", "content": "Since I’ve embraced a healthy diet, I have more energy. Right away, I can tell when I’ve eaten something that makes my body feel bloated and full, like canola oil or processed foods."}, {"type": "sentence", "content": "I’m sensitive to foods I’m allergic to. When I eat excess amounts of sugar, carbohydrates, caffeine, dairy, and alcohol, I feel like crap. I don’t sleep well, my writing is off, and I’m cranky. The same result happens when I don’t get daily exercise. If I don’t sweat once a day, I feel off. Exercise and eating well affect nearly every other aspect of your life."}, {"type": "sentence", "content": "When you have an extra 100 dollars, do yourself a favor and go see a nutritionist and figure out what foods irritate you or you’re allergic to."}, {"type": "sentence", "content": "Dedicate one full year to eating well and eliminating foods you’re allergic to, and exercise five times a week."}, {"type": "sentence", "content": "You owe it to yourself to know how it feels to be in optimal health for one year. Once you do this, it will be tough to eat those foods that make you feel sluggish and unhealthy again."}, {"type": "sentence", "content": "Just implementing one of these seven changes will improve your life. Add one a week. Even if you only implement one change into your life, that one change will make you more mindful in other areas."}, {"type": "sentence", "content": "You may still have to commute every day, or do things that don’t bring your much joy — they just have to get done — but if you go after those things that bring you joy and allow you to live your best life, you’ll start wanting more and more of those things that fill you up and less and less of the things that decrease your quality of life."}, {"type": "sentence", "content": "We all deserve happiness."}, {"type": "sentence", "content": "Join my email list here."}, {"type": "sentence", "content": "Jessica is a writer, an online entrepreneur, and a recovering perfectionist. She lives in Los Angeles with her extrovert daughter, two dogs, and two cats."}], "topic": "mindfulness"}