{"title": "The FAA is Challenging Kids to Build Airports on Minecraft", "data": [{"type": "sentence", "content": "COVID-19 cancellations didn’t stop these FAA aviation and STEM outreach representatives from getting kids excited about aviation and aerospace. They’re shifting their plans into new opportunities with a Minecraft Airport Design Challenge."}, {"type": "image", "content": "https://miro.medium.com/max/10944/1*mEqY-fQF6-3Sz305FzNG0Q.jpeg"}, {"type": "sentence", "content": "Blair Hess had just become an FAA STEM AVSED Outreach Representative when COVID-19 hit. The agency’s Science, Technology, Engineering, and Math (STEM) Aviation and Space Education (AVSED) Program equips FAA employees with tools to expose K-12 students to aviation and aerospace careers and to promote STEM education. However, the public health crisis essentially brought all meetings and events with students to a halt."}, {"type": "sentence", "content": "Following a meeting where they cancelled all upcoming in-person outreach events, “Blair jokingly said ‘Well we’ll have to reach kids in a virtual world and build a Minecraft game.’ And I thought that might actually work. So a conversation that lasted all of ten minutes led to us developing a national pilot program in a week,” said Chuck Tackett, a Program Analyst on the Southwest Region’s Executive Operations Team who also serves as the regional STEM AVSED point of contact."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*ASwVDiZIwQ7fGwEm4gRHuQ.jpeg"}, {"type": "image", "content": "https://miro.medium.com/max/1698/1*Gllw93NWRFV93qt4jmhZvQ.jpeg"}, {"type": "sentence", "content": "Minecraft is a video game designed for players to build and create worlds using 3D blocks. More recently, it’s gained popularity as an education tool and can be used to teach skills like collaboration and problem solving."}, {"type": "sentence", "content": "Tackett and Hess quickly got to work after that initial conversation. They researched other Minecraft design contests and spoke with their own kids and family friends for input. In a matter of days, they created an outline, scoring rubric and executive summary for a STEM AVSED Airport Design Challenge."}, {"type": "sentence", "content": "Challenge participants research a local airport of their choosing, and then recreate that airport in the virtual world of Minecraft. Over five weeks beginning April 27, participants work individually or in small teams and receive instruction from FAA staff who specialize in specific areas of the airport. When the contest ends, a panel of FAA staff will assess and score each entry, considering technical accuracy, creativity, innovation and demonstrated knowledge. Winners will be awarded certificates, and all participants will walk away with applied STEM skills."}, {"type": "sentence", "content": "With schools closed and many parents responsible for “home schooling” and keeping their kids entertained around the clock, Tackett and Hess received lots of interest in the Challenge. They pulled in several colleagues in the Southwest Region to help develop the content, leverage existing outreach relationships and enhance multi-media promotional material. They shared details of the Challenge with several state education offices, social media groups for parents, the Junior ROTC, Civil Air Patrol and Boy Scouts of America."}, {"type": "sentence", "content": "“In the first week of launching the Challenge we had teams registered in 39 states, Puerto Rico, and a military base in Germany,” said Tackett. “It’s exciting to see how quickly it’s being embraced and the feedback so far has been really positive.”"}, {"type": "sentence", "content": "There has also been strong interest and excitement within the FAA."}, {"type": "sentence", "content": "“This is an awesome way to continue our Agency STEM AVSED goals during these unique times and to reach future members of the aviation industry,” said Rob Lowe, the FAA’s Southwest Regional Administrator."}, {"type": "sentence", "content": "“Our team is so fired up about how this has grown in such a short time,” continued Lowe. “Just a few weeks ago as the COVID-19 pandemic caused the cancellation of our normal STEM AVSED outreach activities, our team could have just pulled back into the disappointment, but instead they immediately began to explore new and innovative ways to continue this vital education effort. They quickly zeroed in on ways to reach students who are sheltering at home and landed on using a video game, in this case Minecraft.”"}, {"type": "sentence", "content": "The Challenge went from the idea phase and into deployment in a month. “We are completely focused on reaching future aviation industry members and planting those seeds of excitement and desire so that they can be part of and even shape the aviation and space industry of the future,” says Lowe."}, {"type": "sentence", "content": "Since the launch of the pilot competition, 727 students from 43 states, plus the District of Columbia, Puerto Rico, England, and Germany have registered."}, {"type": "sentence", "content": "“This [COVID-19] is an unfortunate situation, but an upside is a lot of employees are able to really focus and get involved with the Challenge and provide dedicated assistance to students now,” said Hess."}, {"type": "sentence", "content": "Learn more about the FAA’s STEM AVSED Airport Design Challenge on our website, or watch a short video about the Challenge on the FAA’s YouTube channel."}, {"type": "image", "content": "https://miro.medium.com/max/1270/1*QXq4lKiwkBnQZJUjuUPeVg.jpeg"}], "topic": "education"}