{"title": "Deep Learning-Prepare Image for Dataset", "data": [{"type": "subtitle", "content": "A simple way to get images for your dataset"}, {"type": "sentence", "content": "Whenever we begin a machine learning project, the first thing that we need is a dataset. Dataset will be the pillar of your training model. You can build the dataset either automatically or manually. Here I am going to share about the manual process."}, {"type": "subtitle", "content": "What is the dataset?"}, {"type": "sentence", "content": "Dataset is the collection of specific data for your ML project needs. The type of data depends on the kind of AI you need to train. Basically, you have two datasets:"}, {"type": "sentence", "content": "Whenever you are training a custom model the important thing is images. Yes, of course the images play a main role in deep learning. The accuracy of your model will be based on the training images. So, before you train a custom model, you need to plan how to get images? Here, I’m going to share my ideas on the easy way to get images for a dataset."}, {"type": "subtitle", "content": "Get images from google"}, {"type": "sentence", "content": "Yes, we can get images from Google. Using the Download All Images browser extension we can easily get images in a few minutes. You can check out here for more details about this extension! It is available on major browsers. Unfortunately, this extension is not available on the Safari browser."}, {"type": "sentence", "content": "Once you download images using this extension, you will see the downloaded images in a folder with random filenames. We can rename the files or remove the .png file using the below Python script."}, {"type": "sentence", "content": "Remove PNGs from the downloaded image folder."}, {"type": "sentence", "content": "Rename your image files"}, {"type": "subtitle", "content": "Get images from videos"}, {"type": "sentence", "content": "Here we have another way to prepare images for the Dataset. We can easily extract images from video files. Detecto gives a simple solution to get images from the video. Refer Detecto for more information."}, {"type": "sentence", "content": "Using the following code we can extract images from video files."}, {"type": "subtitle", "content": "Using your set of images"}, {"type": "sentence", "content": "You can take pictures of objects which you will use to train your model. The important note is to make sure your images are not beyond 800x600. This will help your dataset train much quicker."}, {"type": "sentence", "content": "I have prepared a video and explained about the above process. Please check out the below video blog."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "As an ML noob, I need to figure out the best way to prepare the dataset for training a model. I hope this will be useful. My ultimate idea is to create a Python package for this process. :)"}, {"type": "sentence", "content": "Yes, I will come up with my next article!"}], "topic": "data-science"}