{"title": "A Welcome He’ll Never Forget", "data": [{"type": "subtitle", "content": "This Ain’t No Love Story"}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*vBAw_GXHSkACvlLI"}, {"type": "sentence", "content": "Jeff would be home in a few hours. Everything had to be perfect. He claimed I didn’t take housework seriously. Today, I would prove him wrong."}, {"type": "sentence", "content": "I rested a moment on the camel-colored, leather couch remembering how my cheeks flushed with excitement when I told the salesman I’d take it. I glowed with pride when I told him to deliver the glass coffee table as well. Jeff’s credit card fit snug in my grasp. He told me I could have anything I wanted."}, {"type": "sentence", "content": "Jeff loved finding new ways to spoil me, but he drew the line at having pets. Dog and cat hair swelled his face like a prize-winning pumpkin. Strong odors bothered him as well, making him sneeze until his nose became a swollen, snot-dripping, scarlet orb."}, {"type": "sentence", "content": "Jeff was a man who got what he wanted, and four years ago, he decided he wanted me. I didn’t stand a chance. His relentless pursuit left me heady and disoriented. Jeff became the center of my universe. I dropped out of college and went to work for his computer software company. It seemed absurd to waste money on a business degree when I was learning insider secrets of building a company firsthand. He made a lot of money and promised to take care of me."}, {"type": "sentence", "content": "“Someday,” he said, “everything that’s mine will be yours.”"}, {"type": "sentence", "content": "That’s all I needed to hear."}, {"type": "sentence", "content": "My body quivered when he used the word our. Our house. Our company. Our future. Our lives. The word our seemed the most intimate, soulful word in the world. Just thinking the word left me breathless."}, {"type": "sentence", "content": "A long, wistful sigh escaped my lips, along with a plume of cigarette smoke. Another deep drag from my Marlboro Light kept me level-headed. Picking up the nasty habit came incredibly easy to me. I stretched my legs, leaving prints on the coffee table from my dirty bare feet. The cigarette glowed bright red, like a streetlight instructing me to stop, but couldn’t. I rested it on the buttery-soft leather, tattooing my initials in the center of the cushion Jeff sits on while checking emails after work. Feeling a touch of nostalgia, I burnt a lopsided heart next to the letters. I filled it in, turning it black. That’s what it felt like inside my chest: shrunken, poisoned and dark."}, {"type": "sentence", "content": "I admired my handiwork and flicked the cigarette onto the carpet. We didn’t own ashtrays. Jeff couldn’t tolerate smoking. A hint of smoke in the air made him double over into a coughing fit. I pictured tears pouring out of his eyes and dripping off his cheeks."}, {"type": "sentence", "content": "I stood up. There were things to do. Three hungry cats were mewing, brushing their long fur against my calves. They followed me into the kitchen like ducklings and purred when they heard the whir of the can opener."}, {"type": "sentence", "content": "“Food’s coming, guys. Hold on a minute.” I assumed they were guys but wasn’t positive. It was either Fluffy, Tuffy, and Duffy or Candy, Mandy, and Sandy. They weren’t my cats. I borrowed them for the last month from my neighbor."}, {"type": "sentence", "content": "I opened an extra can of tuna fish for Jeff, like I had been doing since he abandoned me. Mentally, I ticked off the places I had already stashed some: the vacuum cleaner compartment, behind the washer and dryer, behind the fake log in the electric fireplace, inside curtain rods. I sprinted down the hallway to the den. I lifted the seat off his computer chair. The hollow cylinder beneath was a perfect space to pack tuna."}, {"type": "sentence", "content": "The litter box near the linen closet looked pretty full. I dove into the task of emptying it with enthusiasm, scooping it up and tossing it in the toilet. Every four scoops earned a flush. The information on the bag of cat litter guaranteed the granules turned to clay when wet for easy cleaning. The clay would eventually clog the pipes. My grin felt strange. I hadn’t smiled in a while."}, {"type": "sentence", "content": "Everything fell apart when Jeff told me about Cindy, the big-titted grocery store clerk that made him feel good about himself. Next thing I knew, he told me “we” were over. Jeff, ever selfless, said I could pack my things and find a new place to live while he and Cindy went on a month-long tour of Europe."}, {"type": "sentence", "content": "“I think that I am being more than fair and generous,” he said with a straight face that I longed to disfigure with the new set of golf clubs I bought him for his birthday."}, {"type": "sentence", "content": "Reliving that moment summoned hot tears that blurred my vision. I tripped over the pile of empty beer cans and pizza boxes, giving me a wicked rug burn on my knee."}, {"type": "sentence", "content": "“Damn it,” I spat. My legs were already a mess. They were covered with angry, oozing welts I earned when I rubbed poison ivy leaves over every conceivable surface of the house. I should have saved that task for last. My bad."}, {"type": "sentence", "content": "Wretched sobs escaped my lips and for the first time I felt a deep remorse. I thought wrecking Jeff’s house was the perfect revenge for him wrecking my life, but in a rare moment of clarity, I realized I was only torturing myself. I looked around the ravaged house and saw it was too late to undo the damage."}, {"type": "sentence", "content": "I carried a pizza box into the kitchen. With a Sharpie, I wrote on the box, “I AM SORRY, JEFF. FOR REAL.”"}, {"type": "sentence", "content": "It was the least I could do, apologize."}, {"type": "sentence", "content": "It was more than he did for me."}, {"type": "sentence", "content": "Gathering the cats in my arms, I walked over to Mrs. Pinkley’s house. I ignored her alarmed face when she took in my appearance."}, {"type": "sentence", "content": "“Thanks for letting me borrow them. They were good company. I’ll be going now. My new apartment is waiting for me.”"}, {"type": "sentence", "content": "“Take care of yourself,” she whispered."}, {"type": "sentence", "content": "I need to. I thought. No one’s going to do it for me."}, {"type": "sentence", "content": "Check out Tracy’s satire of an elderly woman anxious to end quarantine … but not for the reasons you’d expect!"}], "topic": "fiction"}