{"title": "Build Confidence One Layer At A Time With These 7 Strategies", "data": [{"type": "subtitle", "content": "If you don’t feel naturally confident, here are a few things you can do to change that."}, {"type": "image", "content": "https://miro.medium.com/max/9666/0*VvpaHe83upOATBxF"}, {"type": "sentence", "content": "There’s always that one person in the room."}, {"type": "sentence", "content": "The one who seems to have it all going on, whose confidence just shines. What does that person have that you don’t?"}, {"type": "sentence", "content": "Probably not as much as you think."}, {"type": "sentence", "content": "Confident people aren’t born that way, they do things that bring about their confidence. They live in a way that builds it."}, {"type": "sentence", "content": "So if you don’t feel naturally confident, here are a few things you can do to change that:"}, {"type": "image", "content": "https://miro.medium.com/max/7696/0*K59_cGKZ23bngffZ"}, {"type": "subtitle", "content": "Take risks."}, {"type": "sentence", "content": "Taking more risks means pushing your boundaries. When you do this, you open yourself up to new experiences and life lessons. These experiences and lessons keep you moving forward. The act of moving forward is in itself a huge reward that boosts your confidence, and the renewed confidence keeps you moving forward. Even failing can build confidence as you overcome obstacles and rise to life’s challenges."}, {"type": "subtitle", "content": "Grow."}, {"type": "sentence", "content": "Personal growth is a great way to inspire confidence. When something scares you, and you face it head-on, you learn to overcome the fear that is stopping you from being all you can be. Take some time for self-reflection. Is there something that you’ve been avoiding because it’s painful or uncomfortable? By tackling those demons head-on, you will grow in ways you never thought possible into pride and strength."}, {"type": "image", "content": "https://miro.medium.com/max/6810/0*UmMmdlJgMa47Heko"}, {"type": "subtitle", "content": "Be delusional."}, {"type": "sentence", "content": "Thinking highly of ourselves actually has an evolutionary function. Psychologists call it self-enhancement bias and it’s our tendency to prop up our egos with irrationally high opinions of ourselves to avoid despair. This handy bit of mental gymnastics is also what leads us to believe we can do things that might be above our pay grade and we all know that half the battle with anything, especially confidence, is the mindset. As long as you get the balance right, a little bit of this can go a long way."}, {"type": "subtitle", "content": "Learn things."}, {"type": "sentence", "content": "Actively learn something. Do research; ask questions, try to master a new skill. Practice something until you get good at it. When you know you’re good at something, it shows. Remember, anything can be learned, and anything learned can be mastered. It just takes practice."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*k5lhWHqAdO-OCADs"}, {"type": "subtitle", "content": "Get out there."}, {"type": "sentence", "content": "Put yourself out there more. Make contacts you wouldn’t typically pursue. Purposefully raise the bar for yourself. Making contacts is helpful in every area of life; the more people you know, the more opportunities you will have to build relationships. The more connections you have on the go, the more feedback you’ll get, and the more doors that will open. As the doors open, you’ll start to realize just how much you have to offer."}, {"type": "subtitle", "content": "Be optimistic."}, {"type": "sentence", "content": "Being optimistic makes you feel hopeful and eager. It gives you that “can do” attitude. Sometimes half the battle is how you think about something. When you feel hopeful, there is a trickle-down effect that colors everything else. Being optimistic boosts confidence because when the future looks bright, good things are unavoidable."}, {"type": "image", "content": "https://miro.medium.com/max/13440/0*25MftdOHHFp-T-nQ"}, {"type": "subtitle", "content": "Rock your best points."}, {"type": "sentence", "content": "Do you have piercing eyes and a killer wit? Amazing curves and an IQ to boot? Are you the wise one who always has sage advice for the broken-hearted? Whatever it is that makes you uniquely you, rock that part and make it shine. There is nobody like you, and that will always be your greatest asset, so don’t hold back. Give it some thought, figure out what you love most about yourself, and then embrace that and share it with the world."}, {"type": "sentence", "content": "Confidence isn’t about putting up a facade. It’s about knowing who you are and something that you can work on and strengthen. It can be cultivated and developed layer by layer like an oil painting that gets richer and more complex with each layer."}, {"type": "sentence", "content": "Start building those layers one by one so that you can be the person who commands the room with supreme confidence."}, {"type": "subtitle", "content": "Thanks so much for reading!"}, {"type": "sentence", "content": "If you’d like to read more articles that uplift and enlighten, join us here on ILLUMINATION. Here are some more excellent writers to check out: George J. Ziogas, Madoc Maduka, Jessica Cote, Charles Roast, Chris Hedges, Roxanna Azimy, Bill Abbate, Dr. Jeff Livingston, Dr. Kylie Harris, Aurora Eliam, CMP. Why not write for us? Bring your talent, courage, and insight, share your story, and let’s do something great!"}, {"type": "sentence", "content": "If you’d like to read some more stories by me, feel free to check these out:"}], "topic": "mental-health"}