{"title": "Is accessibility enough?", "data": [{"type": "subtitle", "content": "Having a seat at the table does not guarantee I will eat what is served."}, {"type": "sentence", "content": "I look back on how far we have come as a society in making things accessible for people with disabilities. Yet, how far behind we are in inclusive user and customer experience. Just because I ‘can’ use your product or service, it does not mean I ‘want’ too."}, {"type": "sentence", "content": "In 1971, I was born with Cerebral Palsy. My parents were told that I might not live past 12, I might never speak clearly, if at all. Even if I overcame all that, the world was not set up to accommodate my special needs to have a fulfilling life. Schools were not accessible. Businesses were not accessible. Workplaces were not accessible. The world was not accessible. In 1971, that was true. Luckily my parents saw what was possible, not simply what is."}, {"type": "sentence", "content": "They saw a place where things would be as available for people with disabilities as they are for people without disabilities. Growing up through all these years, I have witnessed the struggle for equal rights for people with disabilities. The right to be able to get an education. The ability to independently get around in the community. To shop. To work. To live."}, {"type": "sentence", "content": "Advances in accessibility have allowed me to graduate university, travel the world, establish a career. Overall, this has given me the seat at the table. Is that enough?"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*_etNCOT00bawDML9_Ol5Gg.png"}, {"type": "sentence", "content": "Inclusive user experience — the user experience of using a product or service as a user with a disability. If the experience is great — I will use it again and again. If the experience is poor — how can you improve it for my unique needs so I might use it again instead of your competitor's offering that has a more inclusive experience?"}, {"type": "sentence", "content": "Inclusive customer experience — the customer experience of purchasing a product or service as a customer with a disability. If the experience is great I will buy it again and again. If not, how do you improve the inclusive customer experience so you might win me back as a customer your competitor? How do you make me a loyal customer?"}, {"type": "sentence", "content": "In many cases, this may be the same person. In other cases, the user and customer can be two different people."}, {"type": "sentence", "content": "We have further to go in terms of making a product or service accessible for a person with a disability in a journey towards transforming that person to a user or customer with a disability. Are businesses focusing on delivering value to this specific persona or market segment? What are they doing to win me over?"}, {"type": "sentence", "content": "Through the years I have been able to do so many things that generations before could have never done with a disability. Some of these have been truly amazing. They get my continued business. However, many of these things did not provide me the same user experience that many customers without a disability got to enjoy. This is no longer acceptable. Why should this poor inclusive experience continue?"}, {"type": "sentence", "content": "One can argue that users/customers with a disability are a smaller segment in comparison to the overall segment. This might be true for now. However, accessibility will extend the lifetime value of a customer as they transition through all ranges of abilities in their lifetime. Plus, the accessibility movement has removed barriers for people with disabilities to earn disposable income. Like non-disabled customers, they will base their decision on what product or service to use based on their inclusive user/customer experience."}, {"type": "sentence", "content": "Accessibility has made things available. Great inclusive experience makes products and services desirable. Sadly this desirable experience has been the exception rather than the focus."}, {"type": "image", "content": "https://miro.medium.com/max/600/1*8oKG2kXA26MxeUBrvllYLA.jpeg"}, {"type": "sentence", "content": "I know it is possible to go beyond accessibility. Progressive businesses like Microsoft and Scotiabank (I acknowledge my bias) have raised the bar to extend accessibility to amazing inclusive user and customer experience. Microsoft 365 has been designed with having a fabulous inclusive experience at the core. Out of the box, I can do voice to text in Office products. Microsoft Teams do not only allow people with disabilities to collaborate in a real-time video meeting without worrying about commuting, but it also provides captioning so people with a hearing disability can communicate within the product instantly. Scotiabank has incorporated inclusive design at the core of its digital offering. Accommodating users with seeing, hearing, and mobility challenges to bank effortlessly from wherever they are. No traveling required!"}, {"type": "sentence", "content": "This proves it is possible to measure and improve inclusive user and customer experiences. I have worked with amazing design communities that think of user experience for all abilities."}, {"type": "sentence", "content": "What can your business do to enable high inclusive users and customers with a disability?"}, {"type": "sentence", "content": "We can no longer be satisfied with just accessibility. Equality of all abilities will not happen unless we get the same user experience as consumers having the same great experience regardless of ability."}, {"type": "sentence", "content": "People with disabilities have fought for decades for accessibility. It is now businesses turn to champion inclusive experiences and retention."}, {"type": "sentence", "content": "What is your business going to do to compete for my inclusive disposable income?"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*K1_-GRQpSI9-u6V12ytvGw.png"}, {"type": "sentence", "content": "Until next time,"}, {"type": "sentence", "content": "Dave"}, {"type": "sentence", "content": "Twitter: @DDame"}, {"type": "sentence", "content": "www.davedame.com"}, {"type": "sentence", "content": "LinkedIn Profile"}, {"type": "sentence", "content": "Medium — https://medium.com/dave-dame"}], "topic": "ux"}