{"title": "How to Run a Brilliant and Professional Meeting", "data": [{"type": "image", "content": "https://miro.medium.com/max/10944/0*DxIyZehLS_Lwz_w9"}, {"type": "sentence", "content": "Meetings, virtual or in the flesh, must be appropriately planned"}, {"type": "sentence", "content": "Bringing a group of people together is expensive. Meetings reflect the culture of an organization, and they must be productive and positive. Like players in an orchestra, some people will play more notes than others, but everyone is equally important."}, {"type": "sentence", "content": "Overseeing a highly effective meeting is a career skill. It showcases your abilities and highlights your potential to a large group of people."}, {"type": "sentence", "content": "Follow these simple rules to ensure your meetings are the best part of the working week."}, {"type": "subtitle", "content": "1. Prepare"}, {"type": "sentence", "content": "Papers should be issued halfway between two meetings and at least five days in advance of the session they apply to."}, {"type": "sentence", "content": "Set a clear agenda. Each item should have a title with a single sentence description, so everyone is clear what it refers to."}, {"type": "sentence", "content": "Give each item a designated time slot, a lead person, and list any related papers provided in advance. Check in with item leads ahead of the meeting."}, {"type": "sentence", "content": "Think carefully about how you order agenda items. Clarify the start time, location and other requirements (login details, parking, etc.)"}, {"type": "subtitle", "content": "2. Be Thoughtful"}, {"type": "sentence", "content": "People are busy."}, {"type": "sentence", "content": "If sending out lots of papers in advance label them clearly to show which item they refer to and provide an executive summary of each one."}, {"type": "subtitle", "content": "3. Stick to Expectations"}, {"type": "sentence", "content": "The Chair must lead the meeting skilfully by keeping track of the time, inviting people to speak, ensuring people are respectful of each other (e.g. one conversation at a time.)"}, {"type": "sentence", "content": "Do what you promised. Don’t surprise people. Some get anxious ahead of meetings. Stick to the agenda and the time allocated to each item."}, {"type": "sentence", "content": "Start promptly. Don’t wait for latecomers. When they arrive discreetly acknowledge them."}, {"type": "sentence", "content": "Finish on time."}, {"type": "subtitle", "content": "4. Manage Emotions"}, {"type": "sentence", "content": "Keep an eye on body language. Scan the room often."}, {"type": "sentence", "content": "Have clear ground rules about what is acceptable. Meetings are about discussing ideas, they are not the place for personal vendettas."}, {"type": "sentence", "content": "Deal with hostility and negativity by inviting counter-balancing points of view. Manage this skilfully, allowing people to express how they feel. Don’t ignore ideas."}, {"type": "sentence", "content": "Take a short break after a difficult discussion if necessary."}, {"type": "sentence", "content": "Don’t assume that quiet people aren’t engaged."}, {"type": "subtitle", "content": "5. Keep Clear Records"}, {"type": "sentence", "content": "Take a clear record of the meeting as minutes with actions. Ensure this includes a record of attendance."}, {"type": "sentence", "content": "Allocate actions to individuals. The action could involve several people, but one person must be responsible."}, {"type": "sentence", "content": "Number the minutes and actions so they can be easily checked next time."}, {"type": "sentence", "content": "Agree on the forthcoming agenda."}, {"type": "sentence", "content": "Rinse. Repeat."}, {"type": "sentence", "content": "Authors Note: I learned a lot of this stuff, some of which is based on Tropman’s theories, when studying for my MA. I have put it into practice and refined it to suit over the last 20 years. I hope it helps you run a brilliant meeting."}], "topic": "productivity"}