{"title": "How Weird Can Life Get? This Weird.", "data": [{"type": "sentence", "content": "How strange can lifeforms be? What are the toughest forms of life on the planet? And what could these epic survivors teach us about life on other worlds?"}, {"type": "sentence", "content": "By Ana Luiza Dias"}, {"type": "sentence", "content": "How weird can life get? Let’s just say, Mother Nature is an exemplary mother. She gave birth to species of all sizes, colors, shapes, and habits of life. And she loves all her children equally, without discriminating — even the strangest beings on the planet."}, {"type": "sentence", "content": "Human beings have explored most of the land area of Earth, but only with special equipment, shelter, and tools to survive. Some lifeforms can survive, and even thrive, in environments that would quickly kill people unlucky enough to face them without protection."}, {"type": "image", "content": "https://miro.medium.com/max/2876/1*baCLXGKLZTmdJPzFW755lg.jpeg"}, {"type": "sentence", "content": "Living beings have overcome epic challenges in in the search for shelter, food, and the chance of passing on their genes."}, {"type": "sentence", "content": "Want to see some of those weirdos and find out how they live? Come with me!"}, {"type": "sentence", "content": "Tardigrades, the Nature Warriors"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*AyxkDdIqKXxZRC741uImjw.jpeg"}, {"type": "sentence", "content": "Tardigrades are warriors that would possibly survive the apocalypse and repopulate the world afterward. These eight-legged microscopic creatures are so cute that they are called water bears. Besides that, they love water and can be found in all kinds of environments, from the deep-sea to sand tunes."}, {"type": "sentence", "content": "“Despite looking squishy, tardigrades are covered in a tough cuticle, similar to the exoskeletons of grasshoppers, praying mantises, and other insects to which they are related. Like those insects, tardigrades have to shed their cuticles in order to grow,” National Geographic describes."}, {"type": "sentence", "content": "These little guys prove to all of us that size doesn’t matter. They’re so tough that they can survive for up to 30 years without food or water, and face extreme temperatures, from absolute zero to above-boiling water."}, {"type": "sentence", "content": "They can even survive the cruel vacuum, intense cold, and radiation of space. The most curious thing is that they don´t need a spacesuit for that. That´s because they have a special protein that protects their DNA from damage."}, {"type": "sentence", "content": "“When not flying in a low Earth orbit, they prefer to spend their days in water, perhaps on a beach or a dewy patch of moss. But when the water dries up, the millimetre-long ‘bears’ can contract into a dried-out state and survive like that for years. They are also one of the few animals that survive year-round on continental Antarctica, and are among the most radiation-resistant animals known,” Heidi Ledford writes for Nature."}, {"type": "sentence", "content": "Thermus aquaticus — Hanging Out at the Hot Springs"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*qYi9kyEv2tyFieckVnf3oA.jpeg"}, {"type": "sentence", "content": "Thermus aquaticus are the bacteria that make COVID-19 testing possible."}, {"type": "sentence", "content": "Like our tardigrade friends, Thermus aquaticus bacteria are extremophiles, meaning they can survive in extreme environments. They are found in the hot springs of Yellowstone National Park (USA)."}, {"type": "sentence", "content": "The enzyme Taq polymerase can be extracted from this bacteria. This enzyme is crucial for the functioning of the PCR test, used to detect the coronavirus and many other diseases. This is because the PCR testing requires temperatures up to 95 C. [203 F.] degrees, which the enzyme can support without degrading."}, {"type": "sentence", "content": "“An enzyme discovered in T. aquaticus — called Taq polymerase — made PCR practical. Because it came from an extremophile, Taq polymerase can withstand the heat of the PCR process without breaking down like ordinary polymerase enzymes. In 1989 Taq polymerase was named Science Magazine’s first-ever ‘Molecule of the Year,’” the National Park Service (NPS) reports."}, {"type": "sentence", "content": "The Red Flat Bark Beetle, The Tauntaun of the Insect World"}, {"type": "image", "content": "https://miro.medium.com/max/2000/1*ED5vTAk7Qk8sxX1h8lSU6g.jpeg"}, {"type": "sentence", "content": "We’ve already talked about surviving high temperatures, but what about the extreme cold?"}, {"type": "sentence", "content": "The red flat bark beetle (Cucujus clavipes) nails that challenge. Larvae of this species were found at temperatures below -150 C (-238 F)."}, {"type": "sentence", "content": "They managed to survive in arctic conditions where the formation of ice crystals in their internal fluids could kill them."}, {"type": "sentence", "content": "The way they solve this problem was by producing a cocktail of anti-freezing proteins that stop water molecules from grouping together. In addition, the high levels of glycerol in their blood prevent water in their bodies from forming deadly ice crystals. They can also dehydrate their internal tissues when temperatures fall."}, {"type": "sentence", "content": "“This concentrates the antifreezes several fold, such that if they’re exposed to really low temperatures their body water then vitrifies [forms a glass-like substance] rather than freezing,” John Duman from the University of Notre Dame in Indiana, explains."}, {"type": "sentence", "content": "One of the reasons extremophiles exist is because they’ve found an ecological niche for which they’re well-adapted, and where they face little or no competition."}, {"type": "sentence", "content": "Sometimes, people talk about the end of the world. But the truth is, if it happens, it will probably only be the end of the world as we know it. There may be species which adapt to the new environment. I would bet on the tardigrades."}, {"type": "sentence", "content": "Dr. Ana Luiza Dias earned her Ph.D. in Psychobiology (Sleep Sciences) and is a specialist in Biotechnology from the Federal University of São Paulo, Brazil. She is passionate about science, nature, and biotechnology, and her goal is to impact people’s health and quality of life."}, {"type": "sentence", "content": "Did you like this article? Join us on The Cosmic Companion Network for our podcast, weekly video series, informative newsletter, news briefings on Amazon Alexa and more!"}], "topic": "science"}