{"title": "Consciousness Ain’t Real — Part 2", "data": [{"type": "sentence", "content": "Part 1 related why I think the discounting consciousness is wrong as in misguided. Part 2, here, explains why I think the idea is wrong as in damaging!"}, {"type": "subtitle", "content": "It’s back!"}, {"type": "sentence", "content": "As far as I can tell, the revival of consciously thinking that conscious thinking has no impact was initiated in a 2008 article in Nature refining Libet’s earlier work."}, {"type": "sentence", "content": "Here’s a precis of the Nature article, probably too abbreviated but the full article is behind a paywall. To make it easy, I’ll summarize the article further on."}, {"type": "sentence", "content": "What I find disturbing is the gap between the experimental findings and the conceptual framework the authors lead with!"}, {"type": "subtitle", "content": "What is claimed"}, {"type": "sentence", "content": "To quote the intro to the full version of the study:"}, {"type": "sentence", "content": "I feel compelled to point out that dragging ‘freedom’ into this opens an additional world of goofiness. Whether or not consciousness choice is a determined material process, i.e., by some definitions not free, is quite a different issue from whether it exists or not. See my Free Will Considered As Three Lunches."}, {"type": "subtitle", "content": "What has been demonstrated"}, {"type": "sentence", "content": "What are the guts of the experiment?"}, {"type": "sentence", "content": "The image below makes the results clearer."}, {"type": "image", "content": "https://miro.medium.com/max/1260/0*LYhDNRb8_kjALkib.jpg"}, {"type": "sentence", "content": "(You can read the details in the Nature Neuroscience summary above or an easier to understand review and interview with Haynes in Wired.)"}, {"type": "sentence", "content": "There were similar earlier experiments, but Haynes et al. had a big impact for one particular reason. The time between the fMRI detected ‘micropatterns’ and the reported decision stretched out into seconds vs. the milliseconds’ gaps reported in previous experiments."}, {"type": "sentence", "content": "The longer time gap clearly could not be a measurement error. There is no doubt that the phenomenon exists. Drawing out its implications and limits will continue to produce fascinating science."}, {"type": "subtitle", "content": "Now let’s take a step back"}, {"type": "sentence", "content": "Where I have problems is where a single limited insight becomes a ‘nothing but’ explanation well in advance of doing the hard experimental work."}, {"type": "sentence", "content": "All conscious decisions are really unconscious ‘micropattern’ events?"}, {"type": "sentence", "content": "Seriously? Kahneman published Thinking, Fast and Slow in 2011. There the Nobel Laureate describes decades of research in how fast and slow thinking affects our behavior. He examines both’ fast’ instinctive, intuitive, emotional systems and ‘slow’ deliberate, logical systems."}, {"type": "sentence", "content": "A nod in that direction could have accompanied the authors’ massive — and potentially destructive — overgeneralization. Haynes does a much better job of qualifying things elsewhere. From the Wired article mentioned in part 1."}, {"type": "sentence", "content": "…but here’s how the Wired article leads out — triggered, no doubt, by the way Haynes framed up the experiment in Nature."}, {"type": "sentence", "content": "Before you knew about what!? Before you subscribed to Wired, or picked it up on the newsstand, or spotted the article in your newsfeed?"}, {"type": "subtitle", "content": "The Sununu Syndrome"}, {"type": "sentence", "content": "One of my Zen teachers likes to interpret the traditional “three poisons” of Buddhism (“greed, anger, and ignorance”) as “greed, anger, and certainty.” — Julie Nelson, What Is Radical Economics?"}, {"type": "sentence", "content": "There’s something I call the Sununu Syndrome…my shorthand for being ‘so smart you’re stupid.’"}, {"type": "sentence", "content": "It’s not about intelligence, though really — it’s about arrogance."}, {"type": "sentence", "content": "It’s having the certainty to insist your understanding is Gospel. It’s having enough intelligence to build or apply a model — but not enough to recognize the possible limits of the model or the limits of human understanding itself."}, {"type": "sentence", "content": "B. F. Skinner triggered my youthful grumpiness by setting off ‘bad logic’ sensors. Then the situation was made worse by my having to put up with various dogmatic straight-faced defenders. The last straw was being forced to read Beyond Freedom and Dignity from a less than critical perspective in a Psych class."}, {"type": "sentence", "content": "Again the issue is over-generalization turning useful results into grandiose nonsense."}, {"type": "subtitle", "content": "Damage Done"}, {"type": "sentence", "content": "Why am I still so heated about this? It’s the maturing grumpiness that one can only achieve by observing patterns over decades."}, {"type": "sentence", "content": "I’ve seen this sort of aggressive over-generalization pay off in pain and misery time and time again. My poster children are Richard Dawkins, B. F. Skinner, and Milton Friedman."}, {"type": "sentence", "content": "Charitably, the problem is falling in love with a model and doing what science is supposed to do by pushing the model to the limits."}, {"type": "image", "content": "https://miro.medium.com/max/584/1*WOBB4YjDDjgTTFarysdQeQ.png"}, {"type": "sentence", "content": "I was inclined to the charitable view until I saw Dawkin’s Selfish Gene cited as the ‘scientific’ underpinning for business articles supporting the 80’s “greed is good” ethos."}, {"type": "sentence", "content": "Or watched the impact of Milton Friedman’s analysis of human behavior as self-centered financial optimization play out in disaster after disaster when myopically applied."}, {"type": "sentence", "content": "(One significant, but less noticed, negative effect were the waves of economists and business students reprogrammed to happily optimize self-interest — just when the planet needs the exact opposite. As you may have noticed, they then headed out to dispense the Koolaid to the rest of us.)"}, {"type": "subtitle", "content": "Consciousness Is A Human Achievement"}, {"type": "sentence", "content": "This is not to deny that a considerable amount of what determines our behavior is below the surface."}, {"type": "sentence", "content": "Of course, it is:"}, {"type": "sentence", "content": "Discovering limits and challenges to what’s under our conscious control isn’t a new thing."}, {"type": "sentence", "content": "We’ll continue to map the frontiers of consciousness, the impact of non-conscious processes, and the possibilities of reclaiming lost parts of ourselves for a more integrated self."}, {"type": "sentence", "content": "All this can be done without relying on a simplistic one-note model!"}, {"type": "sentence", "content": "Science is, in the long run, self-correcting. With luck, this is simply a B.F Skinner moment triggering my ‘denying the obvious’ bad-logic detectors and not a highly destructive sustained Full Milton. Denial of conscious choice may be a small blip — but it smells worse to me."}, {"type": "sentence", "content": "A viewpoint that arrogantly insists on reducing our complexity and connection and discounts the need for a deeper awareness…at a time when it’s critical to find fellow-cause with our species and the natural world?"}, {"type": "sentence", "content": "Not a poison I’m in a rush to drink."}], "topic": "neuroscience"}