{"title": "Is a Cannabis ETF The Best Play For 2020?", "data": [{"type": "image", "content": "https://miro.medium.com/max/2400/0*VJg9DK405J75c3NU.jpg"}, {"type": "subtitle", "content": "With COVID-19 decimating some of the cannabis industry’s biggest players, could a cannabis ETF be the best path forward for investors?"}, {"type": "sentence", "content": "If 2019 and now 2020 has shown us anything, it’s that no pot stock is safe. Some of the biggest players have taken the hardest hits recently, and the industry has never looked so uncertain."}, {"type": "sentence", "content": "Major players like Canopy Growth have recently downsized their operations and furloughed hundreds of staff, and Aurora Cannabis has had to perform a 12-to-1 reverse stock split, in order to maintain its listing upon the NYSE. MedMen also had a fall from grace, after being poised to become one of the largest MSO’s in the United States. MedMen had to swiftly reshuffle its management after falling behind on vendor payments, and Gotham Green Partners revoked its $115 million credit line to the company, placing them in a precarious financial position."}, {"type": "sentence", "content": "Simply put; no company is immune to poor execution and tumultuous external factors."}, {"type": "sentence", "content": "The COVID-19 crisis has put a capital strain on every company in the industry, with investor sentiment as bearish as can be — and capital raises becoming near-impossible. Worse yet, is that some of the key players mentioned above have less than 6 months of cash runway."}, {"type": "sentence", "content": "So what’s an investor to do? The coronavirus pandemic has made it abundantly clear (if it wasn’t already) that the future isn’t set in stone, and in two years we may see an entirely different landscape of cannabis companies — some may be new players, some may absorb current players, and others may simply drop off the map."}, {"type": "sentence", "content": "This can make things intimidating for any neophyte investor, or for those who currently have skin in the game and are likely seeing massive losses in their portfolio."}, {"type": "sentence", "content": "In order to remedy this fear, in addition to freeing up some of their time, many investors are turning towards cannabis ETF’s, as a way to diversify their portfolio and reduce the amount of exposure they have to any individual cannabis company."}, {"type": "subtitle", "content": "What is an ETF?"}, {"type": "sentence", "content": "First things first, let’s unpack precisely what an ETF is. If you’re a veteran investor, you can skip over this section. All you noobies, listen up."}, {"type": "sentence", "content": "ETF stands for Exchange-Traded Fund and is often referred to as a “basket of securities” that holds a series of underlying assets rather than just one. In essence, you aren’t buying into one individual company, but instead, you are getting exposure to a host of companies via your chosen ETF. ETFs are categorized by the shares comprised within them, whether it be a collection of some of the best-performing stocks on the market (think S&P500), or it might instead amalgamate companies from a particular industry — in this case, the cannabis industry."}, {"type": "sentence", "content": "Each ETF share grants its owner a proportional stake in the total assets belonging to the fund, and the price of ETF shares is driven by the value of the assets held by the fund, with any rise or fall in the asset’s value corresponding to a change in the stock’s value."}, {"type": "sentence", "content": "ETFs give investors the benefit of trading intraday, allowing those invested into an ETF to get into or out of a position at any time throughout the day, unlike mutual funds, which trade only once per day — however, it’s more common that ETF investors are in it for the long-haul, as these funds are typically a “set-it-and-forget-it” investment."}, {"type": "sentence", "content": "You can then decide between an “actively-managed” ETF, meaning that you’re investing in a fund in which a manager or a management team decides how to invest the fund’s money, or you can choose a “passively-managed fund” which follows a market index as closely as possible. Actively managed ETFs come with a higher management fee, but this is to cover the fund manager who will be actively looking for ways to improve the return for investors."}, {"type": "subtitle", "content": "What to Look For in a Cannabis ETF?"}, {"type": "sentence", "content": "When investing in a cannabis ETF, there are several things you want to consider that will affect the way your ETF performs. Firstly, the legislative landscape is ever-changing with cannabis, and this was most recently exemplified in the United States with the COVID-19 crisis in which cannabis companies weren’t eligible to access the multi-trillion dollar stimulus package. This was like pouring salt on a wound for the U.S. cannabis industry, who already aren’t able to access financial institutions due to the federal illegality of the plant — placing a hefty capital crunch upon the industry at large."}, {"type": "sentence", "content": "Meanwhile, in Canada, cannabis is federally legal, and as such, cannabis companies will have the opportunity to access to a $40 billion dollar COVID-19 credit program. Moreover, Canada recently legalized the extended range of cannabis form factors known as “legalization 2.0,” which should boost the revenues of both dispensaries and producers, on top of the already increased sales seen recently in Canada from COVID-19."}, {"type": "sentence", "content": "For this reason, you might want to focus on an ETF that is more Canada-centric, as the market for cannabis is more fully-developed and therefore offers investors a somewhat safer choice than the U.S., in that Canada is less subject to legislative and financial hurdles."}, {"type": "sentence", "content": "However, if you’re playing the long-game, the population of the U.S. is nearly tenfold the population of Canada, so in the coming years, the U.S. will be where the largest gains are made."}, {"type": "sentence", "content": "You then have cannabis companies that can sidestep legal hurdles entirely, such as ancillary companies like Innovative Industrial Properties (IIPR), which focuses upon the acquisition, ownership, and management of specialized industrial properties leased primarily to medical-use cannabis companies. If you look at IIPR’s stock over the past year against the American Cannabis Index, you’ll notice that the American Cannabis Index has experienced a much steeper decline in share price over the past 12 months than IIPR, a “non-plant-touching” company."}, {"type": "sentence", "content": "Put simply, you want to think about the various facets of the cannabis industry, the subsets within it, and chart your best path forward from there. You might have some Canadian companies, some American, and with an overall focus upon Medical cannabis companies — which ETF you choose is up to you."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*tfuaF2mhTxdUftko.jpg"}, {"type": "subtitle", "content": "What’s the Best Cannabis ETF?"}, {"type": "sentence", "content": "While we’re in turbulent times globally, it can be easy to look at a fledgling industry like the cannabis industry and give it a wide berth — particularly given the losses seen across the sector in the last 12 months alone. However, given that the global legal marijuana market is expected to reach USD $73.6 billion by 2027, having exposure to this growing industry at its current low point also opens investors up to exponential gains."}, {"type": "sentence", "content": "Exposing yourself through an ETF is the best way to get your foot in the door while having a diversified portfolio that doesn’t put all your eggs in one basket. So let’s take a look at some of the prominent ETFs on the market."}, {"type": "subtitle", "content": "1. ETFMG Alternative Harvest ETF (MJ)"}, {"type": "sentence", "content": "With total net assets over $472 million USD, the Alternative Harvest ETF is the largest ETF involved with cannabis by a long stretch."}, {"type": "sentence", "content": "The ETFMG Alternative Harvest ETF was the first cannabis ETF listed in the U.S. and holds 38 stocks, 70% of which are pot companies involved in medical and recreational cannabis, with a prominent focus upon Canadian cannabis companies."}, {"type": "sentence", "content": "In the MJ ETF, investors can find all the biggest names like Canopy, GW Pharma and Cronos Group, while also gaining access to ancillary players like Scotts Miracle-Gro, who focus upon hydroponic systems. Additionally, within the MJ ETF, investors can also gain exposure to non-cannabis related companies in the tobacco sector."}, {"type": "sentence", "content": "MJ also happens to be one of the most expensive ETFs on the market, with a management fee of $75 a year per $1,000 invested. This is definitely something to consider when choosing if MJ is right for you."}, {"type": "subtitle", "content": "2. Horizons Marijuana Life Sciences Index ETF (HMMJ)"}, {"type": "sentence", "content": "One of the largest marijuana funds in the world is HMMJ which trades on the Toronto Stock Exchange. The fund tracks the North American Marijuana Index, which was compiled by the German firm Solactive, and is primarily composed of U.S. and Canada-based cannabis or hemp companies."}, {"type": "sentence", "content": "To become eligible for listing in the index companies must have a market cap higher than $75 million (CAD), and meet certain liquidity requirements, including a monthly daily trading volume that exceeds 75,000 shares, as well as an average daily trading value of $250,000 or higher."}, {"type": "sentence", "content": "Rather than purchasing an equal stake in each stock listed on the index, the HHMJ fund uses each company’s quarterly market cap to adjust its’ weighting. Each time the ETF commences quarterly rebalancing it limits the maximum weight for any one stock to 10 percent, although the weightings can become much larger in between these periods due to market volatility."}, {"type": "sentence", "content": "As such, the most recent deletions for HMMJ in this quarter were Abacus Health (CSE: ABCS), cbdMD (NYSE: YCBD), Agraflora Organics (CSE: AGRA) and Flower One (CSE: FONE)."}, {"type": "sentence", "content": "Similar to the MJ ETF, you’ll find many of the major cannabis players within HMMJ, however some notable additions to HMMJ are Charlotte’s Web (TSE:CWEB), which focuses predominantly on hemp-derived CBD products that are federally legal in the US and Innovative Industrial Properties (NYSE:IIPR) which is an ancillary stock we mentioned above."}, {"type": "subtitle", "content": "3. The Cambria Cannabis ETF (TOKE)"}, {"type": "sentence", "content": "Having entered the cannabis market in July last year, the TOKE cannabis ETF is a relative newcomer when compared to the other ETFs on this list. Additionally, while the MJ ETF has over $472 million in assets, TOKE only has $8M, making it a much smaller fund for investors."}, {"type": "sentence", "content": "Despite its newness to the industry, TOKE has some favorable traits going for it; starting with its low 0.42% annual fee, over 0.3% cheaper than MJ. In addition to this, TOKE is actively managed, which means you’ll also be investing in the Cambria management team who will be personally looking for the best investments."}, {"type": "sentence", "content": "At least 80% of TOKE’s holdings are cannabis-related, featuring many of the big cannabis players like Canopy Growth, GW Pharma, Innovative Industrial Properties and Charlotte’s Web."}, {"type": "sentence", "content": "Beyond cannabis, however, investors will also gain exposure to some of TOKE’s non-cannabis related holdings like Constellation Brands, a fortune 500 alcohol company famous for producing Corona and Modelo, who invested an enormous chunk into Canopy Growth in 2017. Additionally, investors in TOKE will gain exposure to the U.S. dollar, which has been steadily climbing in relation to other currencies over the past few years, and British American Tobacco."}, {"type": "subtitle", "content": "What’s the verdict on Cannabis ETFs?"}, {"type": "sentence", "content": "Amid the tumult of the past twelve months, there have been some positives for the cannabis industry. While the COVID-19 pandemic left no company unscathed, the acceptance of the “essential” nature of cannabis dispensaries by state governments affirms the legitimacy of the industry, particularly in the case of the medical side of the cannabis sphere."}, {"type": "sentence", "content": "Moreover, the recent boon that cannabis dispensaries have provided for Illinois adds to the economic benefits to legalization, which will bode well for legislators considering making the plant legal in their state, especially given how fractured economies will be post-COVID-19."}, {"type": "sentence", "content": "There are real benefits and a real demand for cannabis legalization, as well as momentum toward legalization across the globe — the only thing that will change is which companies will stick around for the long haul. For these reasons, investing in cannabis ETFs can be a wise decision."}, {"type": "sentence", "content": "Cannabis ETFs give investors diversity in their investments, allowing them to have a stake in each subset of the industry, whether it be in biotechs, cultivators, or ancillary companies. In some cases, ETFs give you access to other industries entirely, like the tobacco industry or through currency, broadening the exposure investors get to a wider range of markets."}, {"type": "sentence", "content": "And while we’re in this Black Swan event for pot stocks and shares are at historic lows, it may be a good time for investors to consider looking into a cannabis ETF."}, {"type": "sentence", "content": "This post originally appeared on The Green Fund- APAC region’s leading source of cannabis information."}], "topic": "economy"}