{"title": "Building a Business From a Bedroom, $98,130 and 11-Months In", "data": [{"type": "subtitle", "content": "Lessons learned sleeping 4ft from my office"}, {"type": "sentence", "content": "June 21st, 2019, was my last day in a salaried job."}, {"type": "sentence", "content": "Since then, I’ve been working for myself, running an online business from various cafes and my bedroom."}, {"type": "sentence", "content": "Someone asked at the start of the year what my goal was for the end of the year. I had none except to still be in business. So far, so good. You see, going from making $0 online to $1 online is hard. But once you’ve got a taste, you can use the same principles to keep the momentum going."}, {"type": "sentence", "content": "The main one, regardless of whether you’re at $0 per month or $100,000 per month: Bring people value that they’re willing to pay for."}, {"type": "sentence", "content": "How can you do this?"}, {"type": "sentence", "content": "Build skills and teach people how to perform that skill. Entertain someone so they’d be disappointed if you were gone. Create a product someone wants in their lives."}, {"type": "sentence", "content": "Of course, there are more, and you can mix and match them to suit your tastes. The red thread being, you have to create something."}, {"type": "sentence", "content": "Once you have a paying customer, you’re a business."}, {"type": "subtitle", "content": "How do I make money?"}, {"type": "sentence", "content": "Before working for myself, every job I had, I’d exchange time for money. I’d get paid for the hours I was there. 9–5? That’s 7.5 hours. Come on, you didn’t think you’d get paid for lunch, did you? No sir."}, {"type": "sentence", "content": "The first benefit of this depends on the job; you’ve got an opportunity to learn skills that you can use in your business. One of the ideal situations in life is to get paid to learn."}, {"type": "sentence", "content": "The second is you can use the funds from your regular job to fund your business."}, {"type": "sentence", "content": "That’s what I did."}, {"type": "sentence", "content": "My last two jobs were working for Apple as a Genius (the one who talks to customers fixes your computers) and as a machine learning engineer for Max Kelsen."}, {"type": "sentence", "content": "So the skills I built there were explaining technology in an understandable way (Apple tech support) and writing machine learning code to help various businesses get information out of their data."}, {"type": "sentence", "content": "My primary source of income is now at the crossover of those two. I created a beginner-friendly machine learning course to teach people how to do what I was doing as a machine learning engineer."}, {"type": "sentence", "content": "This didn’t happen overnight."}, {"type": "sentence", "content": "The good news is, once you realize your brain is comprised of programmable mush, mostly in the form of hydrogen atoms, you’ve got the recipe you need to start changing direction. In other words, learning what you need to learn and creating what you want to create."}, {"type": "sentence", "content": "In 2016, I switched my balance from consuming to creating. A line in the sand. A strict rule to start making more things than I consumed."}, {"type": "sentence", "content": "I became a frozen yogurt machine. All output. Blog posts, videos on YouTube, Medium articles, all around the topic of me studying my self-created machine learning master’s degree, and sharing what I’d learned."}, {"type": "sentence", "content": "Through this, eventually, people found my work and started asking questions."}, {"type": "sentence", "content": "The most consistent one being, “I want to learn machine learning, where do I start?”. To which I’d usually answer with a list of curated resources."}, {"type": "sentence", "content": "But despite an opportunity hitting me in the face (I’d get the question almost daily), it took me longer than I care to admit to starting answering it properly."}, {"type": "sentence", "content": "The history books will show, I left my job, wrote an article about the 12 things I learned during my first year as a machine learning engineer, a few people read it, including someone called Andrei. He’d created a few technology courses and was looking to create one on machine learning. He asked if I wanted to partner, and after doing my research, I said yes. It turns out Andrei was one of the most popular instructors on Udemy (an online platform for selling and participating in community-made courses)."}, {"type": "sentence", "content": "And since launching our course on January 17, 2020, I’ve made more from it than I did for the whole time I worked at my last job."}, {"type": "sentence", "content": "Let’s get a little specific, shall we?"}, {"type": "sentence", "content": "The skill I get paid for is at the crossover of machine learning and communication. Breaking down an intimidating topic in a way others can understand."}, {"type": "sentence", "content": "This crossover led to the following income sources (all in USD):"}, {"type": "sentence", "content": "The first thing you might notice is none of these amounts are set in stone. Unlike a salary, there’s some variability here."}, {"type": "sentence", "content": "Some months might be higher, and some months might be lower. Some can’t handle the instability. But as you’ll see later, I think it’s a good thing."}, {"type": "subtitle", "content": "Opportunity staring you in the face"}, {"type": "sentence", "content": "I had people asking me daily, “I want to learn machine learning, where do I start?”."}, {"type": "sentence", "content": "It’s a question I’d asked myself when I started, and one that I’d spent the past 2-years solving for myself."}, {"type": "sentence", "content": "And when I finally did solve it for someone else, I had a customer."}, {"type": "sentence", "content": "The takeaway?"}, {"type": "sentence", "content": "If you’re looking for an opportunity to start your own business, it might be right in front of you."}, {"type": "sentence", "content": "If not…it’s time to create your own opportunity."}, {"type": "sentence", "content": "Before making a single $1 online, I spent over a year creating things and publishing them (keyword: publishing), building skills, making nothing."}, {"type": "sentence", "content": "It was my form of an apprenticeship. You see, when I began, the things I was creating weren’t that good."}, {"type": "sentence", "content": "And the same will go for you. When you begin, you’ll lack skills like the ability to connect what’s in your head to what comes out of your hands or mouth. That’s okay. Everyone goes through this right of passage."}, {"type": "sentence", "content": "My secret? Blind faith in whatever I was doing would eventually pay off."}, {"type": "sentence", "content": "Remember: creating your own business online means creating value for others in one way or another."}, {"type": "sentence", "content": "For me, it came in the form of videos and articles."}, {"type": "sentence", "content": "Don’t overthink it."}, {"type": "sentence", "content": "Write about it instead. You never know who will reach out"}, {"type": "subtitle", "content": "Whatever business you’re in, you’re in the education business"}, {"type": "sentence", "content": "Step one, create a valuable product."}, {"type": "sentence", "content": "Step two, educate people on what they’re buying."}, {"type": "sentence", "content": "Don’t be confused when you think people buy your product because they want the product itself. Your customers don’t buy your product as much as they buy the story they can tell themselves after buying your product."}, {"type": "sentence", "content": "In my case, as of now, my main product is a machine learning course for beginners."}, {"type": "sentence", "content": "Now, do people buy the machine learning course because of the 42.5 hours of video content? Or the beautifully crafted presentations and hand-drawn drawings? Or is it because they’re looking for a change? To learn something new. To hop on board the magic carpet ride, which is current technology trends? To fill their sails with the tailwinds of a society leveraging machine learning to fuel progress?"}, {"type": "sentence", "content": "That’s what I’m selling."}, {"type": "sentence", "content": "I’m selling an opportunity for someone to learn one of the most powerful technologies going around."}, {"type": "sentence", "content": "I’m selling the story that when you hear of some large company using machine learning to build cars that drive themselves to the grocery store, you no longer have to be a bystander. Instead, why not join in."}, {"type": "sentence", "content": "I’ve got the most important job in the world: Adding fuel to the fire in the hearts of those eager to learn."}, {"type": "sentence", "content": "Once you’ve built something of value, your marketing isn’t telling people what it is; they’re smart enough to figure that out, telling them how they can use it."}, {"type": "subtitle", "content": "The first hire, are you replaceable?"}, {"type": "sentence", "content": "The first 3-months my machine learning course was live; I answered every single question myself. And so I should. I put the thing out there, and I should be the one who gets to see where it’s weak."}, {"type": "sentence", "content": "You see, I struggle to release control. I find it hard to put trust in someone else to a job as good as myself. Call it ego, call it lack of experience, call it what you want. I’m working on it."}, {"type": "sentence", "content": "My worries were squashed after Andrei and I hired a teacher’s assistant, Shubhamai, to answer questions for our machine learning course."}, {"type": "sentence", "content": "How’d we hire him?"}, {"type": "sentence", "content": "The trial was, answer a few questions and see how things go."}, {"type": "sentence", "content": "It turns out, Shubamai is an absolute and complete living legend. He takes care of the questions even better than I did. He inspires me to do better work."}, {"type": "sentence", "content": "The lesson?"}, {"type": "sentence", "content": "Hire people smarter than you (if your ego can handle it)."}, {"type": "subtitle", "content": "Money is replenishable, time is not"}, {"type": "sentence", "content": "I’m now at the point — the crossover where more money doesn’t make you happier."}, {"type": "sentence", "content": "It’s the improvement I’m after, the striving, the challenge. More money masquerades the real journey — the journey to mastery. And you know what? Money stands in the shadow of the best currency in the world: the effect you have on others."}, {"type": "sentence", "content": "But feeling good doesn’t pay for food."}, {"type": "sentence", "content": "This first year, I’m focused on cashflow. Get the money through the door, pay for bills and living expenses, use the rest build a war chest. And for God’s sake, keep those expenses low man. You don’t need anything more than a keyboard and an internet connection to create value."}, {"type": "sentence", "content": "Once cashflow is taken care of, it won’t be the primary goal month-to-month. Building skills will be the primary goal. It was improving at the crafts that got me here."}, {"type": "sentence", "content": "I can always earn more money, whereas having the energy and drive I do now to improve may not always be around, so I’m taking advantage of it."}, {"type": "sentence", "content": "You see, if you get stuck optimizing for cashflow month-to-month, you’ll get good at that. Perhaps that’s what you’re after (and if it’s early on, it should be), but if not, focus on continually building skill."}, {"type": "subtitle", "content": "What does one do with an empty calendar and no set hours? An example day"}, {"type": "sentence", "content": "Every small business owner knows that scheduling is essential. Upon waking up, I write a list of what needs to get done for the day."}, {"type": "sentence", "content": "I base the day list on the week list, which focuses on what needs to get done for the week. I base the week list on my ideal life over the next 3–5 years."}, {"type": "sentence", "content": "As in, the answer to the question, “If I woke up today in 3-years time, how would I like to spend my time?”. Of course, impossible to predict, but that doesn’t mean it’s not fun (and important) to answer."}, {"type": "sentence", "content": "Having this allows me to watch what I do. Not what I say."}, {"type": "sentence", "content": "I’m pretty good at telling myself everything’s going fine. But when I examine the lists at the day or week’s end, I can see what got done and what didn’t."}, {"type": "sentence", "content": "If you’re planning on starting a small business, you need to check in with yourself. Watch what you do, not what you say. If not you, who?"}, {"type": "subtitle", "content": "Make your work, work for you"}, {"type": "sentence", "content": "Here’s my master plan."}, {"type": "sentence", "content": "Create digital assets, digital assets that inspire, educate, and entertain — the holy trinity. Use the funds from the digital asset sales to provide for my family and fuel future creations."}, {"type": "sentence", "content": "Why digital?"}, {"type": "sentence", "content": "They allow me to stay agile, keep the calendar empty, to follow my curiosity, while sharing what I’ve learned with others. And because for now, the keyboard is my tool of choice."}, {"type": "sentence", "content": "Finally, they replicate infinitely. An article you wrote last year can be read today."}, {"type": "sentence", "content": "So once you’ve spent the time showing up and doing the work, the work works for you."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "business"}