{"title": "How To Set Prices As An Inexperienced Freelancer", "data": [{"type": "subtitle", "content": "The difficult but important steps you have to take to get started."}, {"type": "image", "content": "https://miro.medium.com/max/9216/1*6qvC-dBIVjPi2nOJybxKMg.jpeg"}, {"type": "sentence", "content": "No matter how skilled you are, if you don’t have any experience actually trying to sell your services as a freelancer, it can be very difficult to know what prices to charge."}, {"type": "sentence", "content": "There are several routes you can go down with freelancing. Unless you already have a network of contacts you will most likely have to try one of the freelancing platforms available online or simply cold email potential clients."}, {"type": "sentence", "content": "Both of these options can be be very scary. Even once you have your pitch together, and once you have some samples prepared, you still have to make the tough decision of how much to charge."}, {"type": "sentence", "content": "If you are truly inexperienced, it is unfortunately not quite as simple as checking what an hourly rate would be for the same kind of work performed by someone employed by a big company. This is just not going to be achievable when you first start freelancing."}, {"type": "sentence", "content": "By inexperienced I am referring to those that have no social proof and no portfolio of past work. So how do you set a price for your very first clients without anything to back it up?"}, {"type": "sentence", "content": "Obviously it will depend on the skill, but no matter what you are doing for someone, if you try and charge your first client what they would expect to pay a professional, you will have a hard time converting them."}, {"type": "sentence", "content": "This doesn’t mean you should shoot really low, as you do not want to end up working for much less than you are worth. However, it is very difficult to avoid doing this in the beginning, and unless you do already have a strong network of existing contacts that you know are willing to pay reasonably close to the average rate, you will have to start lower than you would like."}, {"type": "sentence", "content": "If you are using a freelancing platform for example, you will see hundreds of other people offering the same service as you for just a couple of dollars. This is definitely not what you want to do, but it should show you that unless you can prove yourself to be worth more than that, most of your potential clients will go elsewhere."}, {"type": "sentence", "content": "The important thing to remember about freelancing is that you need to focus on quality from the very beginning. If you can do that, you will be able to benefit from positive feedback, reviews and you will ultimately gain the all-important social proof that will allow you to raise your prices over time."}, {"type": "sentence", "content": "There are some general tips that you can follow to set your initial prices , and if you apply these you will be able to set and adjust your rates in a way that suits you and your clients."}, {"type": "sentence", "content": "1. Check out what other people in your niche are charging and look at their social proof. Find out what people are saying about them and see how this relates to their prices."}, {"type": "sentence", "content": "2. Use average hourly rates for your specific skillset as a reference, not as a guide. In the beginning you will simply not be able to charge these kinds of prices without the social proof and the results to justify them. Instead, use them to formulate your goals for where you want to be in the future."}, {"type": "sentence", "content": "3. Start lower than you would like. This is a must, as if you start charging your dream hourly rate you will struggle to attract clients and just end up disappointed. Instead, consider dropping it by a couple of dollars and see if you gain traction."}, {"type": "sentence", "content": "4. Use your customers’ feedback to learn what they will and won’t pay for. If you can, try and negotiate prices for specific projects, and gauge what people see as too much and what they find to be acceptable. This will change over time as you complete more projects and gain more social proof, and so you will be able to adjust your prices accordingly."}, {"type": "image", "content": "https://miro.medium.com/max/10944/1*ou8F43J3DPZKy3mfQxFzbQ.jpeg"}, {"type": "sentence", "content": "So, try not to focus too much on the price when you are just starting out, and focus more on providing high-quality services. Freelancing is not an easy road to success by any means, but don’t make it harder for yourself by charging too much or working yourself to the bone for an hourly rate of a couple of cents."}, {"type": "sentence", "content": "Use other people as references, and use your customer base and feedback as a guide to how you can set your prices effectively."}], "topic": "freelancing"}