{"title": "Editing Ourselves Into Oblivion", "data": [{"type": "subtitle", "content": "Express Yourself"}, {"type": "subtitle", "content": "Where does the real me end and the fictional one begin?"}, {"type": "image", "content": "https://miro.medium.com/max/4242/1*9oqT_hHMiOy3WVSwuGmcYA.jpeg"}, {"type": "sentence", "content": "In her 2010 experimental novel, How a Person Should Be, Sheila Heti writes that “most people live their entire lives with their clothes on.” They are private and possess a natural modesty. Others, artists, she writes, cannot put their clothes on. “They are destined to expose every part of themselves, so the rest of us can know what it means to be human.”"}, {"type": "sentence", "content": "When I told my mom I wanted to publish books, she said she didn’t understand. “That would feel like running around naked.” My mom used to sell art, and her statement annoyed me. Because she was right. My debut novel comes out this month. And I feel very naked."}, {"type": "sentence", "content": "As kids, we have nightmares of being naked at school — a metaphor for exposing our true selves. Today, everyone is naked online. In the age of Only Fans, public nudity has been rendered an empty gesture. It’s difficult to go online without seeing someone’s breasts you never wanted to see. But bodies are edited into a lie, a form of being clothed, and true exposure remains rare."}, {"type": "sentence", "content": "I am 33 years old. I wrote my first novel draft at age 17. I wrote four entire novel manuscripts that I was unable to sell to a publisher before selling this one. In other words, I have been actively trying to publish a novel for 16 years. And this month it’s happening."}, {"type": "sentence", "content": "It all feels very surreal."}, {"type": "sentence", "content": "Which is sort of what my novel is about."}, {"type": "sentence", "content": "In Vagablonde, my protagonist — Prue — is a government lawyer who has tried for many years to make it as a rapper. When I was writing it, I was a government lawyer who wanted to be a writer. Writing Prue’s artistic ambitions was not difficult; not writing them would have been harder. As the book progresses, Prue’s music career takes off. She makes a song that goes viral and lands a show opening for her favorite band. It’s everything she’s ever dreamed of, but before the show — she feels only dread."}, {"type": "image", "content": "https://miro.medium.com/max/1498/1*-Zi5ybfXVQrRw5uGgK21pA.jpeg"}, {"type": "sentence", "content": "I hadn’t sold a book at the time I was writing Vagablonde, but I know how minds work. I wanted nothing more than to publish a book, but I knew that accomplishing this goal wouldn’t fill the void in my soul. I’m an achiever. I’ve been accomplishing goals. The void remains. Prue’s void remains."}, {"type": "sentence", "content": "Prue and I share other qualities. We both have serious neuroses surrounding food and our hair. We both enjoy the fleeting high of drinking on amphetamines. We can both be self-absorbed and shallow and care way too much about empty measures of external validation. We both confuse a “good time” for “genuine connection.” We both find “being present” excruciating, favoring distractions over feelings. We are both Virgos."}, {"type": "sentence", "content": "From early drafts, readers told me my character was a “narcissist,” a “sociopath,” a “monster.” As an artist, I enjoyed these comments, as that was my intention in writing Prue — I live for a monstrous heroine. But as a human being, it also hurt. Because Prue is loosely based on me. Daphne Sidor wrote in her review of Vagablonde for Lambda Literary: “There’s a kind of bravery in attaching so many autobiographical elements to such a deliberately alienating character.” This neither shocked nor offended me. Prue is deliberately alienating, and I can be too. It’s not something I like about myself, but I am who I am."}, {"type": "sentence", "content": "I wrote Vagablonde on, well, a “cocktail.” (The very same cocktail Prue is on for most of the narrative.) I was extremely depressed. I felt like a loser. My writing career was not a career at all. I was still writing legal briefs and getting yelled at for minute formatting errors, like my indentations being .1 centimeter off. I went out a lot but had few real friends. My happiest periods during this time involved taking an Adderall and hitting my vape pen and drinking beer and writing this book. During those months, that was the only time I felt energetic and alive and in control. I fell in love with the rhythm of my sentences and the way my characters continued to surprise me. I was turning my bleak reality into something more glamorous. Still bleak… but chic!"}, {"type": "sentence", "content": "I let my protagonist hit rock bottom so I didn’t have to."}, {"type": "sentence", "content": "As I promote the book, I’m thinking about the line between the real me and the fictional me, how I separate them, and if I even have to. Just as people edit their bodies and faces into oblivion online, I hide behind the fictional version of myself I write into my books and play on Twitter. I wore tortoiseshell glasses the entire first year of my MFA program. I have 20/20 vision."}, {"type": "sentence", "content": "At the end Vagablonde, Prue decides to stop taking Adderall and quits drinking for a while. Since I sold this book, I stopped picking up the Adderall prescription I didn’t need and quit drinking for a spell. Prue also dyes her blonde hair back to its natural color, which is like, “beige,” to avoid looking like a child or a colonist. I did this too, for the same reasons."}, {"type": "sentence", "content": "Was I writing manifestations?"}, {"type": "sentence", "content": "Promoting this novel brings up a lot of confusing feelings. I’m happy and excited, because this is something I’ve wanted for so long, but I also wrote the book during a very dark time. I thought the book would save me, and in some ways it did. I’m much healthier now. I’m less delusional. I’m more at peace with my mediocrity."}, {"type": "sentence", "content": "Perhaps symbolically, at one point in the narrative, Prue learns there are naked photos of her circulating on the internet. She has no memory of the photos being taken, and no idea who took them. Her friend wants her to be upset but she is not upset. She is flattered. Because she looks good, and she cares more about getting attention than about self-respect."}, {"type": "sentence", "content": "Prue showed me what I did not want."}, {"type": "sentence", "content": "I have three main goals with my writing. First and foremost, to help people feel less alone. Books do this in a way television and movies cannot, because we are hearing the voices inside other peoples’ heads, and learning the personal is universal. Second is to entertain people, to get them through their days, to get their minds off the irritating chatter in their heads and distract them a bit from their pain. The third is to get people to see the world in new ways, to shift their perspective, even if it’s just .1 centimeter, like the indents in my briefs."}, {"type": "sentence", "content": "If I could accomplish just one of these things, I think I’m okay with being naked — metaphorically, for a bit, and on my own terms."}], "topic": "fiction"}