{"title": "My Mother’s Knives", "data": [{"type": "subtitle", "content": "A neighbor takes her obsession with the guy downstairs to the extreme."}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*mn0-eGUKM2CoMPPGuK3V3g.jpeg"}, {"type": "sentence", "content": "Trigger warning: This story contains violence and references to child sexual abuse."}, {"type": "sentence", "content": "I was glad when the downstairs neighbor moved out. I didn’t like Gladys at all. She’d make a face at me when I saw her and tell me I needed to see a skin doctor or go on a diet or take a shower. Or she complained that I jangled my keys too loud and thumped up the stairs when I came home from work at two in the morning. It wasn’t my fault she was a light sleeper."}, {"type": "sentence", "content": "But I fixed her. I told Mrs. Priscoletti that Gladys’ teenage son had moved in. If there’s one thing that Mrs. Priscoletti hates, it’s “unauthorized residents.” I also told her that he was smoking pot, playing loud heavy metal music and bringing over friends with pierced noses. It worked. Mrs. Priscoletti didn’t renew Gladys’ lease. Gladys tried to get back at me when she moved out. She took my “Welcome” doormat with the picture of the rose cottage and cat. I went to Wal-Mart and got another one exactly the same."}, {"type": "sentence", "content": "Mrs. Priscoletti always moved fast to line up new tenants, not like when she had to make a repair. So, I sat at my typewriter by the attic window, making up stories about the people I saw on the street below, and waited for my new neighbor. I’ve had this portable typewriter since I was a kid. That’s how long I’ve been writing stories. I’m lucky my mother never threw it out. She tried to, but I hugged it so hard to my chest she couldn’t get my arms off. So, she ripped up my stories instead. I hid them after that."}, {"type": "sentence", "content": "The new tenant arrived the Saturday after Gladys moved out. He pulled up in a car filled with junk. I leaned out the window to get a good look. I caught sight of the bald patch on his head as he unlocked the front door and stepped in. A woman with mousy, shoulder-length hair followed him. I rushed downstairs but stayed on the steps. They didn’t close their front door so I could hear almost everything."}, {"type": "sentence", "content": "“Paul, this is real nice!”"}, {"type": "sentence", "content": "“Look at the little back yard.” Their voices faded out. I ran to my bedroom in the back and yanked up the window. Paul had black hair and a mustache, big glasses and a belly hanging over his belt. She had a flat stomach. He pointed at the flower bed. “I can plant string beans over here, eggplant there, put my tomatoes in this sunny spot.”"}, {"type": "sentence", "content": "“And I’ll sit right here and work on my tan!” She laughed. He put his arm around her and kissed her head."}, {"type": "sentence", "content": "Paul didn’t have any furniture, just boxes. I waited til they almost finished unloading the car — I didn’t want to get stuck carrying stuff — and went downstairs. I poked my head in the door. Giggles and play growl noises came from the bedroom."}, {"type": "sentence", "content": "“Yoo-hoo!” The sounds stopped and they came out, hair mussed, shirts rucked up. I put on my nice-as-apple-pie smile."}, {"type": "sentence", "content": "“Hi, I’m Mary Grace Nagy, I live upstairs.”"}, {"type": "sentence", "content": "“Paul Ventimiglia, this is my girlfriend Denise.”"}, {"type": "sentence", "content": "“Are you both settling in okay?”"}, {"type": "sentence", "content": "“It’s just me moving in, but I don’t have much to settle. My ex-wife got all the furniture.” He chuckled and gave Denise one of those “in the know” looks. She rolled her eyes. He had a nice way about him, warm eyes, a real smile. I stared at his mouth. He had a gap between his front teeth. My father had a gap just like that."}, {"type": "sentence", "content": "“If you’re getting furniture delivered, I can let them in for you,” I said. “I’m home days.”"}, {"type": "sentence", "content": "“You work at home?” Denise raised her eyebrows."}, {"type": "sentence", "content": "“I work nights, cleaning state offices downtown.”"}, {"type": "sentence", "content": "“Maybe you clean my office, the Department of Transportation,” Paul said."}, {"type": "sentence", "content": "“I do Health and Human Services.”"}, {"type": "sentence", "content": "“That would’ve been too funny if you worked at the DOT. But that’s very nice of you to offer about deliveries, Mary Grace. Maybe I’ll take you up on that.”"}, {"type": "sentence", "content": "“You lived here long?” Denise was sure nosy for someone who wasn’t even my neighbor."}, {"type": "sentence", "content": "“I’ve lived in Chambersburg my whole life. We were the only Hungarian family around. It was all Italian back then. Now the Italians are old, like Mrs. Priscoletti. The young ones all move out of Trenton. I’ve lived in this…”"}, {"type": "sentence", "content": "Denise nudged him. “We better get the rest of those boxes, babe. We gotta be at Charlie’s at six.”"}, {"type": "sentence", "content": "“Yeah, that’s right. Sorry, we’ll have to talk more later, Mary Grace. Nice meeting you.”"}, {"type": "sentence", "content": "“Nice meeting you.” Denise turned up the edges of her mouth."}, {"type": "sentence", "content": "I smiled at Paul and half-lifted my hand at her."}, {"type": "sentence", "content": "The following Saturday morning, a truck pulled up and delivered a couch, a bed, table and chairs and other stuff. Paul wasn’t taking me up on my offer about deliveries. A girl came over. She looked like him, probably his daughter. Nothing special, another of those teenage girls you see slobbering all over their boyfriends at the video arcade."}, {"type": "sentence", "content": "In the afternoon, they went out. I waited by the window til I saw his car pull up. He was by himself. He must’ve dropped off the kid. I raced downstairs and pretended like I was checking the mail in the hallway when he came in. He smiled at me."}, {"type": "sentence", "content": "“Hope we didn’t wake you this morning,” Paul said. “Those delivery guys weren’t too quiet.”"}, {"type": "sentence", "content": "“Oh, no, I didn’t hear a thing.”"}, {"type": "sentence", "content": "“It was such a hassle. The couch wouldn’t fit through the door and we had to take the door off the hinges to get it in. We kind of nicked the door jamb.”"}, {"type": "sentence", "content": "“Mrs. Priscoletti isn’t going to like that,” I said."}, {"type": "sentence", "content": "“She doesn’t have to know, does she?” He winked at me."}, {"type": "sentence", "content": "“Of course not. You know, when my mother and I moved in here, she’s dead now, but back…”"}, {"type": "sentence", "content": "“Mary Grace, sorry, I gotta get ready to go out with Denise.” Paul was unlocking his front door. “She’ll kill me if I’m late. Catch you later.” The door closed."}, {"type": "sentence", "content": "She really had him on a leash."}, {"type": "sentence", "content": "Paul settled into his routine. He’d leave the house shortly after eight, sit in his car for a minute to warm up the engine and drive off. He’d return just after five. Tuesdays and Thursdays he came home for lunch and Denise would come over. She had her own key."}, {"type": "sentence", "content": "If I sat in my bedroom with the window open, I could hear the kitchen noises from downstairs: the clatter of the dishes and utensils, the water running, the scrape of the chairs. On the weekends, I smelled garlic and onion, hear the sizzle of oil in the frying pan. A couple times I heard grunts and groans. I slammed down the window and went up to the attic, pounding my feet on the stairs as hard as I could."}, {"type": "sentence", "content": "Since I was home when the mailman came, I’d always pick up the mail. Mrs. Priscoletti was too cheap to put up mailboxes outside, so the letters came through the old slot in the front door and landed on the floor. I put Paul’s stuff in a neat pile by his door. He had a lot of credit cards — Visa, American Express, MasterCard. I never had a credit card."}, {"type": "sentence", "content": "On my nights off, I’d listen outside his door to hear what show he was watching, then I’d run upstairs and tune in my TV to the same one. After a couple weeks, I didn’t even have to listen at the door. I knew what he’d be watching. He liked cop shows the best."}, {"type": "sentence", "content": "I knocked on his door after he got home one night. He answered in his undershirt. A gold cross glinted around his neck. My father wore a cross. I used to swizzle it back and forth on its chain when I sat on his knee."}, {"type": "sentence", "content": "“Anything wrong?” Paul stared at me."}, {"type": "sentence", "content": "“Just remembered something that slipped my mind.” I waved my hand. “Anyway, sorry to bother you, but the gas man came yesterday and said he needed to get into the basement to read the meter. Something about too many months of averaging,” I said. “I told Mrs. Priscoletti years ago to have the meters moved outside but she says it costs too much.”"}, {"type": "sentence", "content": "Paul scratched his chin. “What a pain. I guess I’ll call the gas company or something.”"}, {"type": "sentence", "content": "“If you leave me the key on the sixth of the month, I could let the gas man in. I’d be happy to do that.”"}, {"type": "sentence", "content": "Paul’s face perked. “That’s real nice of you, Mary Grace. Thanks.” He smiled. “Mrs. Priscoletti is cheap, isn’t she? My tub needs to be replaced, but she’s sending her son to grout the crack.”"}, {"type": "sentence", "content": "“She’s always been like that. She did the cheapest job possible to convert this rowhouse into apartments. My mother always said that Mrs. Priscoletti would end up paying double than if she’d done a proper job in the first place.”"}, {"type": "sentence", "content": "“I’m sure. Well, I’ll get a copy made of the key for you.”"}, {"type": "sentence", "content": "“I took care of my mother til she died. That was five years ago.”"}, {"type": "sentence", "content": "“I’m so sorry. Listen, I got a pot of sauce on the stove. I’ll catch you later.”"}, {"type": "sentence", "content": "A few days later, I found an envelope pushed under my door. It was Paul’s key with a note saying to keep it in case of emergency. I hummed all night long as I vacuumed my floors."}, {"type": "sentence", "content": "The next morning after Paul left for work, I let myself into his apartment. I grabbed a handful of candies from a glass bowl on the coffee table and sat in the recliner in front of the TV. I went into the kitchen and stuck my finger in the pot of tomato sauce left on the stove. Spicy. I opened the cabinets. He really liked pasta."}, {"type": "sentence", "content": "His phone receiver smelled of cologne. I spotted the bottle in the bathroom and sprinkled a bit on my neck. The medicine cabinet had regular things like aspirin and Tums. The best stuff was in the bedroom. It usually is. I found two copies of Penthouse under his bed. His underwear was on the floor, size 40. It had a big heart you know where. I stuffed it in my pocket. He’d think he lost it at the laundromat or something."}, {"type": "sentence", "content": "Almost every day I hung out in Paul’s apartment. I watched TV and listened to his goopy music. I took off all my clothes and got into his bed so I could rub the smell from his dark brown sheets all over me. I flipped through his photo albums, his wedding, his baby’s christening. I sipped the dregs from the Bud cans in the recycling bin."}, {"type": "sentence", "content": "I was always real careful to leave everything exactly how I found it and to leave before he got home. But one day I slipped up. I fell asleep in the recliner and it was a Thursday, one of the days he and Denise came home for lunch."}, {"type": "sentence", "content": "I bolted out of the chair when I heard the hallway door bang shut and voices. I raced to the bedroom and dove into the closet. They went to the kitchen. The fridge opened, the cutlery drawer rattled, dishes scraped. Then I heard Denise giggling. “Stop, Paul. Oh, you!”"}, {"type": "sentence", "content": "They thumped across the living room and crashed into the bedroom door, laughing. I opened the closet door a crack. Denise was sprawled on the bed with Paul on top of her. He was kissing her, pinning her arms above her head. I pushed the door open a little wider. He pulled the blouse out from her skirt and unbuttoned it. He pushed up her bra and squeezed her. Then he spread her legs and moved on top of her. As he rocked back and forth, I watched the gold cross bounce off his chest. They didn’t stay long."}, {"type": "sentence", "content": "That night I dreamed of my mother sharpening her knives."}, {"type": "sentence", "content": "Not long after that, I heard knocking at the front door early one Sunday morning. I looked out. Denise was on the porch. “Paul, it’s me! Answer the friggin’ door, would you?” He didn’t answer. I looked across the street. His car was there. She pounded the door with her fist."}, {"type": "sentence", "content": "I went downstairs. I was going to tell her to piss off. Paul obviously didn’t want anything to do with her. He came out of his apartment at the same time, his hair messy and eyes puffy. He opened the door and she tumbled in."}, {"type": "sentence", "content": "“What took you? I’ve been out here for ten minutes already.”"}, {"type": "sentence", "content": "“I took a sleeping pill,” Paul said. “Where’s your key?”"}, {"type": "sentence", "content": "“I can’t find it. It might be in my other purse.”"}, {"type": "sentence", "content": "She saw me and practically shoved Paul into the apartment."}, {"type": "sentence", "content": "“She gives me the creeps,” I heard her say. “Something …”"}, {"type": "sentence", "content": "“Sh,” Paul said. The door shut and I could only hear the rumble of voices. I felt stabbed in the stomach, but at least Paul tried to protect me."}, {"type": "sentence", "content": "I wasn’t careless like Denise. I got a copy made of Paul’s key in case I lost it. I kept the keys in the music box my father gave me for my ninth birthday. When you open it, a little ballerina twirls to “Somewhere My Love,” the song from “Dr. Zhivago,” my favorite movie."}, {"type": "sentence", "content": "I made some chocolate peanut butter cookies a few days and took a plate down to Paul. I meant it as a thank you for sticking up for me against Denise."}, {"type": "sentence", "content": "“Want some vegetables from my garden?” he said. “I’ve had a bumper crop this year. I can’t eat them all.”"}, {"type": "sentence", "content": "He loaded up a paper bag of eggplants, tomatoes and string beans and handed it to me."}, {"type": "sentence", "content": "“Thanks,” I said. “This is so generous of you. It’s really so nice.” Tears scalded my eyes. I blinked them back. The last present I got from anyone was the music box. My father disappeared the day after he gave it to me."}, {"type": "sentence", "content": "Paul scratched his chin and looked down. “Well, uh, thanks for the cookies. They look real good.”"}, {"type": "sentence", "content": "“I used to make cookies for my mother all the time,” I said."}, {"type": "sentence", "content": "“Thanks again.” I could tell he was embarrassed at my generosity. I told him I’d see him later."}, {"type": "sentence", "content": "I couldn’t eat those vegetables. I put them in a bowl and carried them around with me, upstairs to the attic, to my bedside table, to the living room. But after a couple weeks, they shriveled up and rotted."}, {"type": "sentence", "content": "Paul left the empty cookie plate by my door. I figured he wanted more cookies but was too shy to ask. So, I took him down another plateful — oatmeal chocolate chip this time."}, {"type": "sentence", "content": "“Oh, thanks,” Paul said. “But you shouldn’t go to the trouble.”"}, {"type": "sentence", "content": "“It’s no trouble, really. I love baking,” I said."}, {"type": "sentence", "content": "“It’s just that I’m on a diet.”"}, {"type": "sentence", "content": "“You don’t need to go on a diet. You look perfect. The eggplant and tomatoes were the best I ever had, by the way. And the string beans, too.”"}, {"type": "sentence", "content": "“You want some more? I have plenty.”"}, {"type": "sentence", "content": "“That would be great.”"}, {"type": "sentence", "content": "“Hold on a sec.” He came back and gave me the bag. “I have to run. I was just about to go out.”"}, {"type": "sentence", "content": "“No problem. Thanks. We’ll talk later.”"}, {"type": "sentence", "content": "“Sure thing.” I liked the way he said that."}, {"type": "sentence", "content": "I went upstairs. This time I was prepared. I’d bought a couple dozen bottles of clear nail polish and I painted each eggplant, tomato and string bean so they would keep forever."}, {"type": "sentence", "content": "Then I moved my typewriter down from the attic into the living room by the front window so I could see Paul closer up when he went in and out. He was inspiring me to write lots of stories."}, {"type": "sentence", "content": "One Saturday night, I heard yelling from downstairs. I tiptoed down and pressed my ear against the door."}, {"type": "sentence", "content": "“How do you think that makes me feel when you talk to her, when you have anything to do with her?”"}, {"type": "sentence", "content": "“She’s a part of my life, like it or not.”"}, {"type": "sentence", "content": "“I know that, but you don’t have to rub it in my face all the time.”"}, {"type": "sentence", "content": "“Jesus, Denise, I’m not rubbing it in your face, I swear. I’m sorry, okay.”"}, {"type": "sentence", "content": "They calmed down and I went back upstairs. My chest was bursting. They were fighting about me! Denise really was getting to be a pain."}, {"type": "sentence", "content": "I waited til the lights went out downstairs and in the neighbors’ windows, then I grabbed my mother’s carving knife, went outside and slashed the tires on Denise’s car. I fell asleep in the living room, so I’d hear everything the next morning."}, {"type": "sentence", "content": "I woke up at the sound of Denise yelling. “Oh my God, Paul!”"}, {"type": "sentence", "content": "“What? Jesus!”"}, {"type": "sentence", "content": "I keeled over onto the floor laughing. I just couldn’t help it."}, {"type": "sentence", "content": "A couple days later, the car had four new tires. I went out again, this time with my mother’s paring knife, and scratched “bitch” on the fenders. A police officer knocked at my door later and asked if I had seen anyone suspicious."}, {"type": "sentence", "content": "I shook my head. “Nothing out of the ordinary.”"}, {"type": "sentence", "content": "“You sure? Mr. Ventimiglia says you watch everything that goes on in the street.”"}, {"type": "sentence", "content": "“No, I really haven’t seen anything.”"}, {"type": "sentence", "content": "He cocked his head at me for a second then scribbled on his pad. He ripped off the sheet and handed it to me. “If you remember anything, call me.”"}, {"type": "sentence", "content": "“Sure thing, Officer.”"}, {"type": "sentence", "content": "Paul knocked at my door a little later. I smiled my biggest smile, but he didn’t smile back."}, {"type": "sentence", "content": "“Mary Grace, I’m going to need my key.”"}, {"type": "sentence", "content": "The smile dropped clean off my face. “Why? Is there a problem?”"}, {"type": "sentence", "content": "“I think it’s safer with this trouble we’ve been having.”"}, {"type": "sentence", "content": "“What about the gas meter? I was taking care of that for you.”"}, {"type": "sentence", "content": "“Don’t worry about it. I really need the key.”"}, {"type": "sentence", "content": "“Sure thing.” A rage rose in my throat like vomit. I got the key from the music box and handed it to him."}, {"type": "sentence", "content": "“It’s these kids round here, you know,” I said. “The neighborhood’s not what it used to be.”"}, {"type": "sentence", "content": "“I’m thinking I might have to move out. This is crazy.”"}, {"type": "sentence", "content": "“You can’t leave!” I said before I could stop myself. His eyes widened then fastened on something over my shoulder then he turned and left."}, {"type": "sentence", "content": "I closed the door and swiveled to see what he’d been looking at. It was the bowl of varnished vegetables on the kitchen table."}, {"type": "sentence", "content": "Denise had totally turned him against me. He needed me to protect him. My mother’s voice echoed in my head. “People will corrupt you, Mary Grace, that’s why you have to stay close to me. I’ll protect you from evil people.” I closed my eyes, and she was pushing up my nightgown with the blade of her knife. I opened my eyes. My lungs felt real tight like I’d been running for my life."}, {"type": "sentence", "content": "I waited until late that night then I threw a dozen eggs at Paul’s car from the living room window. His car looked like it was crying yolks."}, {"type": "sentence", "content": "The next morning, I woke up to banging at the door. It was Paul. His face was all twisted."}, {"type": "sentence", "content": "“What the hell kind of game are you playing?” he yelled. “What the fuck is your problem?”"}, {"type": "sentence", "content": "“That was Denise. I saw her do it.” I wrapped my arms around his waist. “I’ll protect you. We’ll protect each other.”"}, {"type": "sentence", "content": "He struggled to pull me off. I hung on, just like I hung on to my typewriter, and just like my mother, he couldn’t loosen my grip."}, {"type": "sentence", "content": "“Let go of me! You’re fucking crazy! You did all this shit. I know you did, you weirdo!”"}, {"type": "sentence", "content": "Weirdo! That’s what they called me in school. I let him go and he staggered back. “Don’t you ever come near me or Denise again or I’ll call the cops!”"}, {"type": "sentence", "content": "She must be really poisoning him to make him yell names and threaten me like that. I was losing him."}, {"type": "sentence", "content": "The next day I let myself into Paul’s apartment with the copy of the spare key and crawled into the closet. I sat there breathing in the leather of his shoes and clothes. I heard a noise at the door. My body tingled."}, {"type": "sentence", "content": "They entered the apartment talking, but I couldn’t hear what they were saying. I didn’t have to wait long. The bedroom door banged against the wall. Paul walked in carrying Denise and laid her on the bed. They started kissing and rolling around. His hand pushed up her skirt to her hip. I squeezed my eyes shut tight. I felt the prick of the knife tip as my mother spread my legs. I felt the cold whiskey bottle enter me, the rough wooden plunger, the knife handle. The pain bolting through my body. Where was Daddy? Where did he go?"}, {"type": "sentence", "content": "Paul groaned and Denise cried out. I felt the knifepoint press my thigh. My mother would do that to shut me up if I made a sound. Why didn’t Daddy protect me? Did he leave so she could do this to me?"}, {"type": "sentence", "content": "“Could you get me some water, babe?”"}, {"type": "sentence", "content": "I opened my eyes. She was lying back with her eyes closed."}, {"type": "sentence", "content": "“Sure thing.” He swung his legs over the side of the bed."}, {"type": "sentence", "content": "When I heard the fridge door open, I lunged out of the closet and flung myself on top of her, plunging in my mother’s knife wherever I could. She screamed and tried to push me off. I stuck my fingers in her face and kept swinging the knife. I felt the power of making my mother scream and it doubled my strength."}, {"type": "sentence", "content": "Blood was making her body slippery. She was squirming and her arms were fighting me, but she couldn’t do much. Paul grabbed me from behind. I surged with anger. He should have been protecting me, helping me. Daddy should have been there."}, {"type": "sentence", "content": "I wrapped my arm around her neck with my fingers in her hair, so when he yanked me, I pulled her with me. I stabbed her in the back, but the blade hit bone. Paul tried to pin down my arm, but I moved too fast. I finally hit the spot. The knife slid between her ribs. She went limp. He seized my wrist. Paul didn’t appreciate anything I’d done for him. He was selfish, greedy, thoughtless. That’s what my mother yelled at me with each thrust of whatever it was she was putting in me."}, {"type": "sentence", "content": "With my free hand, I reached down to his privates and squeezed as hard as I could. He yelled and loosened his grip on my wrist. I yanked it free and sank the knife in his stomach. He fell back. I left it there and dragged myself upstairs. I was so tired. I didn’t even wash the blood off. I flopped onto the bed and went right to sleep."}, {"type": "sentence", "content": "I still sit at my typewriter at the window, but it’s a new view now. There’s a grassy slope and big trees with benches underneath. People stroll around. There’s the handsome Dr. Kramer. He has a tanned face that crinkles at the eyes when he smiles and asks, “And how are you today, Mary Grace?” I asked the kitchen manager if she’d let me bake cookies one day. I think Dr. Kramer would like chocolate coconut."}], "topic": "fiction"}