{"title": "Most Companies Should Stay Out of With Social Issues", "data": [{"type": "subtitle", "content": "Marketers need to be careful"}, {"type": "image", "content": "https://miro.medium.com/max/15360/1*766Vy_OvHKxIWBSTg08b_A.jpeg"}, {"type": "sentence", "content": "Some companies dive into social issues with purpose."}, {"type": "sentence", "content": "They know it’s high-risk, high-reward. They account for it. Gillette’s “toxic masculinity” ad was a notable example, appealing to a liberal base who saw the campaign as bold in raising social issues. More conservative consumers, and men, were offended, noting the campaign made a point to villainize white men."}, {"type": "sentence", "content": "With Gilette, they seemed to know there would be blowback."}, {"type": "sentence", "content": "What’s interesting is when marketers stumble into a social issue, in a fairly idiotic fashion, not seeming to have any sort of calculus to their actions."}, {"type": "subtitle", "content": "DiGiorno’s Faceplant"}, {"type": "sentence", "content": "In 2014, domestic violence was becoming a hot topic as people began to come forward with their claims. The conversation was more open."}, {"type": "sentence", "content": "A shocking video was then released that year. NFL running back, Ray Rice, was depicted in a casino elevator arguing with his girlfriend and then punching her, knocking her unconscious, and then dragging her limp body off of the elevator."}, {"type": "sentence", "content": "This spurred the conversation even further on Twitter and most of the social media."}, {"type": "sentence", "content": "A hashtag, #WhyIStayed, was created for the stories of women who suffered from domestic violence. It gave them a channel to explain the complexities of those situations."}, {"type": "sentence", "content": "So here we are on the feed, this conversation is happening between battered women on this hashtag."}, {"type": "sentence", "content": "And wham."}, {"type": "image", "content": "https://miro.medium.com/max/1120/1*QlNnY0y2LVqOiuoKESguvg.png"}, {"type": "sentence", "content": "This either demonstrated a complete misunderstanding of the context of the hashtag or was a tasteless attempt at humor."}, {"type": "sentence", "content": "It caused a quick reaction and backlash. DiGiorno then took it down and issued an apology, which was probably a better response than, “I thought it was funny.”"}, {"type": "image", "content": "https://miro.medium.com/max/990/1*WgnjUu12IrL0E9XuP2j0qg.png"}, {"type": "sentence", "content": "To be fair, it did look like an honest mistake from the outside. But Twitter, as usual, roasted them. DiGiorno’s Twitter account did a good job of apologizing quickly, taking the hit, and engaging with those who were offended by the tweet. They handled it better than some."}, {"type": "image", "content": "https://miro.medium.com/max/1208/1*WchO5nIr-SBDC8LJXqooXg.png"}, {"type": "sentence", "content": "I don’t envy the day that person had at work."}, {"type": "subtitle", "content": "Urban Outfitters’s Moment in the Sun"}, {"type": "sentence", "content": "Younger buyers and, perhaps, those who missed a pretty big history lesson, wouldn’t have been bothered by this sweater that was released:"}, {"type": "image", "content": "https://miro.medium.com/max/1400/0*UTzU3dwakDXyxWL4"}, {"type": "sentence", "content": "If you don’t see anything wrong, I’ll explain."}, {"type": "sentence", "content": "At Kent State University in 1970, students were protesting the Vietnam War. There was substantial corruption, lying, and a rising death toll. During a campus protest and without provocation, the national guard open fired on unarmed students, killing four and wounding nine."}, {"type": "sentence", "content": "If you notice on the sweater, it appears to be spattered with blood and even has tattered holes in it. This created a big stir, with a big label brand trying to monetize the event."}, {"type": "sentence", "content": "Urban Outfitters, unlike Digiorno, backpedaled and apologized but said:"}, {"type": "sentence", "content": "It does seem a minimalistic apology given how obvious the sweater was."}, {"type": "subtitle", "content": "Bloomingdales Is a Department Store, Right?"}, {"type": "sentence", "content": "After facing declining sales, and an upcoming holiday season, Bloomingdales ran a campaign that featured several ads of a man looming behind a woman:"}, {"type": "image", "content": "https://miro.medium.com/max/1320/0*qw071axav3PSFS-W"}, {"type": "sentence", "content": "It makes you wonder if Bill Cosby was writing these ads."}, {"type": "sentence", "content": "It was understandably offensive to the many people who have been date raped. These types of assaults happen more than you think."}, {"type": "sentence", "content": "For people thinking the public was being too sensitive, consider the idea of waking up in a haze not knowing what happened, and then realizing you’d been violated. It would change your attitude towards if this happened to you or someone you loved. It happened to someone close to me."}, {"type": "sentence", "content": "Lastly, what exactly was this ad selling? Egg nog? Alcohol?"}, {"type": "sentence", "content": "It was a stupid ad."}, {"type": "image", "content": "https://miro.medium.com/max/966/1*_aqxGIXT0CGCum74lDFlow.png"}, {"type": "sentence", "content": "Presumably, there were some internal meetings and they moved on."}, {"type": "sentence", "content": "When I see stuff like this, my first reaction is more along the lines of, “What the fuck were they thinking? Have they been living under a rock?,” rather than my own personal outrage."}, {"type": "sentence", "content": "As a marketer, it’s our job not to make stupid customer-facing decisions. It boggles the mind to see some of the advertisements that make it through the approval process."}, {"type": "sentence", "content": "I’ve seen many other cases like these three. One trend I’ve noticed: Those who take ownership swiftly and gave care to the problem, engaging with those who were genuinely offended tended to do the best in its aftermath. It blew over quicker."}, {"type": "sentence", "content": "This approach probably applies to a lot of things in life. Own it and move on."}], "topic": "social-media"}