{"title": "What is a Black Hole?", "data": [{"type": "subtitle", "content": "Black (Invisible) Holes"}, {"type": "sentence", "content": "Don’t let its name fool you, a black hole is not actually black. A black hole is a region in space where the pulling force of gravity is so strong that nothing can escape even the fastest object in the universe — light. Since no light can escape, black holes are considered invisible. We can’t see black holes but we have several ways to located it using its properties. We will talk about it later in this article."}, {"type": "sentence", "content": "A black hole is a very special space object that scientists has been trying to solve its identity for centuries. The first modern solution of general relativity that would characterize a black hole was found by Karl Schwarzschild in 1916, although its interpretation as a region of space from which nothing can escape was first published by David Finkelstein in 1958."}, {"type": "subtitle", "content": "How black holes are created?"}, {"type": "sentence", "content": "A black hole is what remains when a massive star dies. A star that has more than 3 times mass of our Sun can create a black hole."}, {"type": "image", "content": "https://miro.medium.com/max/976/1*aAUqL4jpKKY_oEUKJqOLoA.png"}, {"type": "sentence", "content": "Stars are hydrogen atoms that collapse from the enormous gas cloud under their own gravity."}, {"type": "image", "content": "https://miro.medium.com/max/3230/1*jCaqdeVNKMRaaKb2Ty4XEw.png"}, {"type": "sentence", "content": "In its core, nuclear fusion crushed hydrogen atoms into helium. This creates heat and radiation that push against the gravity. The amount of emitted heat and radiation is huge enough to not let the star collapse into itself by its own gravity. A star need to balance both of these forces in order to survive."}, {"type": "image", "content": "https://miro.medium.com/max/2480/1*Rx-vOhQorh1ZArT1RVoaNg.png"}, {"type": "sentence", "content": "The heat and pressure at the core can fuse helium into carbon. If the star is massive enough, it can fuse carbon into heavier elements such as oxygen, neon, silicon, magnesium, sulfur and iron."}, {"type": "sentence", "content": "The problem is that iron cannot burn. This means no radiation and heat will be generated. Without the pushing force from the inside of the star, the balance is broken and the star collapsed by its own gravity."}, {"type": "sentence", "content": "In a fraction of a second, due to its massive gravitational force, the core becomes so tightly packed that protons and electrons merged to form neutrons. The core heats to billions of degrees and explodes in to a supernova. The remains of the core can form a neutron star or a black hole depending upon the mass of the original star."}, {"type": "image", "content": "https://miro.medium.com/max/1500/0*zGFLBzg3cHorDTi7.jpg"}, {"type": "subtitle", "content": "How big are black holes?"}, {"type": "subtitle", "content": "Primordial (Miniature)"}, {"type": "sentence", "content": "It is the smallest type of black holes. Its size can be as small as a single atom but with the mass of a large mountain."}, {"type": "subtitle", "content": "Stellar"}, {"type": "sentence", "content": "Stellar is the most common type of medium-sized black holes. The mass of a stellar black hole can be up to 20 times greater than the mass of the sun. It can fit inside a ball with a diameter about 10 miles."}, {"type": "subtitle", "content": "Intermediate"}, {"type": "sentence", "content": "Black holes that are larger than Stellar but smaller than Supermassive black holes"}, {"type": "subtitle", "content": "Supermassive"}, {"type": "sentence", "content": "This type of black holes is the largest black holes that has ever existed. Its mass could be greater than 1 million Suns combined. The diameter is about the size of our Solar System. It is suspected that every large galaxy contains a supermassive black hole at its center."}, {"type": "image", "content": "https://miro.medium.com/max/2082/0*O3csMOTXnYKlVPSu.jpg"}, {"type": "subtitle", "content": "The types of black holes"}, {"type": "sentence", "content": "There are 2 main types of black holes, non-rotating and rotating black holes."}, {"type": "subtitle", "content": "Schwarzschild (Non-rotating black hole)"}, {"type": "image", "content": "https://miro.medium.com/max/2560/0*GBR_VW1XXGWFciMV.jpg"}, {"type": "sentence", "content": "This is the simplest type of black holes. This type of black hole only has singularity and event horizon. Don’t worry about those terms if you haven’t known it before I will describe it later. The Schwarzschild radius is the size of the event horizon of a non-rotating black hole."}, {"type": "subtitle", "content": "Kerr (Rotating black hole)"}, {"type": "sentence", "content": "This type of black holes is more interesting. Its ability to rotate has create an interesting components that allow us to study and understand the underlying knowledge of black holes and helps us to be able to discover them easier."}, {"type": "sentence", "content": "The components of Kerr or a rotating black hole are:"}, {"type": "sentence", "content": "The following image is a well illustration of a rotating black hole, so I will borrow some of its explanation."}, {"type": "subtitle", "content": "Singularity"}, {"type": "sentence", "content": "Singularity is located at the center. It is where all the mass of the star is concentrated into a region of infinite density. All the matter and energy that fall into the black hole ends up here. The prediction of infinite density by general relativity is thought to indicate the breakdown of the theory where quantum effects become important."}, {"type": "subtitle", "content": "Event horizon"}, {"type": "sentence", "content": "This is the black part of the black hole. It is a huge radius around the singularity where matter and energy cannot escape the black hole gravity. It is the point of no return."}, {"type": "sentence", "content": "You can think of the spacetime as a super elastic sheet which will not tear down even you put something super heavy on it. When you put a ball(mass) onto the sheet. The region around the ball will be sank down. The black hole is a super tiny ball with a mass of an earth. When you put this tiny ball onto the sheet. A small area around the sheet sank down and create an extremely steep hole."}, {"type": "sentence", "content": "The ball is singularity and the area that sank down is the event horizon."}, {"type": "image", "content": "https://miro.medium.com/max/4566/1*RZxSyf2qmeg8fG7_hlvsXw.png"}, {"type": "subtitle", "content": "Photon sphere"}, {"type": "sentence", "content": "Photons are emitted from nearby hot plasma in jets or an accretion disc. Without gravity, it would travel in straight line, but just outside the event horizon of the black hole, the gravity is strong enough to bend their path so that it can be seen as a bright ring surrounding black hole."}, {"type": "image", "content": "https://miro.medium.com/max/930/1*QTMFCGqbwlMn8oRzYv1eWQ.png"}, {"type": "subtitle", "content": "Relativistic jets"}, {"type": "sentence", "content": "Gas, dust remained from stars falling into the black hole produce jets of particles and radiation blasting out from the black hole’s poles at near light speed. They can extend for thousands of light-years into space."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*tKlCSwlM3-Vp7oZQ.jpg"}, {"type": "subtitle", "content": "Innermost stable circular orbit (ISCO)"}, {"type": "sentence", "content": "The last place that material can orbit safely without the risk of falling past the point of no return. It plays an important role in black hole accretion disks since it marks the inner edge of the disk. The ISCO radius is different depending on the type of a black hole (rotating or non-rotating)."}, {"type": "image", "content": "https://miro.medium.com/max/1256/0*SFL_dbgJ3Oz7x4Hj.png"}, {"type": "subtitle", "content": "Accretion disc"}, {"type": "sentence", "content": "A disc of superheated gas and dust whirls around a black hole at immense speeds, producing electromagnetic radiation (X-rays, optical, infared and radio) that reveal the black hole’s location. Some of this material is doomed to cross the event horizon, while other parts may be forced out to create jets."}, {"type": "sentence", "content": "In the recently news that we captured the image of a black hole, what we see is actually the image of accretion disk not the black hole itself."}, {"type": "image", "content": "https://miro.medium.com/max/2560/0*T3YrN2W2YWNOfw0E.jpg"}, {"type": "subtitle", "content": "Ergosphere"}, {"type": "sentence", "content": "Ergosphere is an en egg-shaped region of distorted space around the event horizon. The distortion is caused by the spinning of the black hole which drags the space around it."}, {"type": "image", "content": "https://miro.medium.com/max/640/0*OcQzyLg4JYnuhVjh.gif"}, {"type": "subtitle", "content": "Static limit"}, {"type": "sentence", "content": "The boundary between the ergosphere and normal space."}, {"type": "image", "content": "https://miro.medium.com/max/652/1*H_JN1sTC4GJ4iOQCY9tJTg.png"}, {"type": "subtitle", "content": "How do we detect black hole?"}, {"type": "sentence", "content": "Although we cannot see black holes due to its invisibility, we can detect or guess the presence of one by measuring its effects on objects around it. The following effects may be used:"}, {"type": "subtitle", "content": "Behavior of orbital objects"}, {"type": "sentence", "content": "By looking at the behavior of the objects, you can detect the presence of a black hole. You then use measurements of the movement of objects around a suspected black hole to calculate the black hole’s mass."}, {"type": "sentence", "content": "For example, if a visible star or disk of gas has a wobbling motion or spinning and there is not a visible reason for this motion. The invisible reason has an effect that appears to be caused by an object with a greater than three solar masses (too big to be a neutron star). Then a black hole may be causing the motion."}, {"type": "image", "content": "https://miro.medium.com/max/1348/1*M_GPwH0n58v7GxE6F9cPqQ.png"}, {"type": "subtitle", "content": "Gravitational lens effects"}, {"type": "sentence", "content": "As mentioned in the ergosphere part, it creates a gravitational lens effect that can be used to detect the black hole."}, {"type": "sentence", "content": "Einstein’s General Theory of Relativity predicted that gravity could bend space. This was later confirmed during a solar eclipse when a star’s position was measured before, during and after the eclipse. The star’s position shifted because the light from the star was bent by the sun’s gravity."}, {"type": "image", "content": "https://miro.medium.com/max/640/0*OcQzyLg4JYnuhVjh.gif"}, {"type": "sentence", "content": "Therefore, an object with immense gravity (like a galaxy or black hole) between the Earth and a distant object could bend the light from the distant object into a focus, much like a lens can."}, {"type": "image", "content": "https://miro.medium.com/max/570/1*-mzVIDwBTPrh0hLaYR1Mow.png"}, {"type": "subtitle", "content": "Emitted radiation"}, {"type": "sentence", "content": "When material falls into a black hole from a companion star, it gets heated to millions of degrees Kelvin and accelerated. The superheated materials emit X-rays which can be detected by X-ray telescopes such as the orbiting Chandra X-ray Observatory."}, {"type": "image", "content": "https://miro.medium.com/max/1320/1*2d2DUJHBM8O1_OnDcP0HWA.png"}, {"type": "sentence", "content": "In addition to X-rays, black holes can also eject materials at high speeds to form jets. Many galaxies have been observed with such jets. Currently, it is thought that these galaxies have supermassive black holes at their centers that produce the jets as well as strong radio emissions"}, {"type": "image", "content": "https://miro.medium.com/max/570/0*xXUVosCkIbhOF-rS.jpg"}, {"type": "subtitle", "content": "Capturing the first image of a black hole"}, {"type": "image", "content": "https://miro.medium.com/max/1280/0*MblCxUBIBdpMlFYW.jpg"}, {"type": "sentence", "content": "Capturing a picture of a black hole is not an easy task. Imagine standing on the 50th floor of the building trying to take a picture of an ant on the street with 2000s phone camera in a rainstorm day. It is the same situation when trying to take a picture of a black hole. The galaxy M87 is the too far. A lot of stars and dust through the way. We need a lens as large as the earth to capture it with a good resolution."}, {"type": "subtitle", "content": "Why choose Messier 87 (M87)?"}, {"type": "sentence", "content": "The closest black hole we could possibly take a picture is Sagittarius A* (Milky Way), but it was too small. The reasons they choose M87 is that it is nearby, very large, has an accretion disk traveling at near relativistic speeds and has an intense gravity, with predicted mass of 6.5 billion solar masses. This makes for a very photogenic black hole, surrounded by radiant heat, and offering an opportunity to show the shadow of the black hole in the center."}, {"type": "subtitle", "content": "How do they create the earth-sized telescope?"}, {"type": "image", "content": "https://miro.medium.com/max/1460/1*6WeFOd_DI1z_3EhX8PPF7w.png"}, {"type": "sentence", "content": "Event Horizon Telescope Project create an earth size telescope by combining 11 telescopes from all over the world (in 2018). They used Interferometry technique to capture the images"}, {"type": "sentence", "content": "Taking a picture of a black hole is like trying to listen to the playing piano with no sound. Turning on one key, we won’t be able to capture the song. Turning on 5–6 keys, we can guess what the song is. Think of it as a game show where you are trying to guess what is picture is, so the MC randomly flip a part of an image one by one until you can guess what it is."}, {"type": "subtitle", "content": "Handling with a huge amount of data"}, {"type": "sentence", "content": "The combined amount of data is over 5,242,880 Gigabytes. Sending huge amount of data via undersea internet cable may crash the whole internet system. Moreover, some of the research lab was located in a really far area which has no connection to the cable. To solve this, they exported the data to hard disks and manually carried it over the the planes."}, {"type": "image", "content": "https://miro.medium.com/max/1440/1*ntvceIIRFFEnQoHvP8jwqQ.png"}, {"type": "subtitle", "content": "Processing Data"}, {"type": "sentence", "content": "Katie Bouman creates CHIRP (Continuous High-resolution Image Reconstruction using Patch priors) algorithm. It is the algorithm that transform low resolution image into high resolution image. It combine images taken from the every telescopes, and turn it into a cohesive image."}, {"type": "image", "content": "https://miro.medium.com/max/2002/1*FZnsiTQu220znbNauk-VKA.png"}, {"type": "subtitle", "content": "What have we got from the black hole image?"}, {"type": "sentence", "content": "This article is written for an assignment of the course Science Technology and Modern World at King Mongkut’s Institute of Technology (KMITL), Thailand."}, {"type": "sentence", "content": "The article is used for educational purposes only."}, {"type": "subtitle", "content": "References"}], "topic": "science"}