{"title": "Time to rethink our economic paradigm", "data": [{"type": "image", "content": "https://miro.medium.com/max/1440/1*U8MEzGMqYMMJg6e14Kw4kg.jpeg"}, {"type": "sentence", "content": "The coronavirus pandemic has shaken the world as we know it. It is the first global pandemic since 1918, so we are facing something completely new for all, as unknown is yet how we will recover from it."}, {"type": "sentence", "content": "Certainly, this situation has uncovered the high risks of massive industrial delocalisation to faraway countries to the wider public and those policymakers and experts who preferred to look another way. Hospitals lacking surgical masks and other basic PPE and the difficulties in getting hold of reliable COVID-19 test kits are the most visible part, but only the tip of the iceberg if we look at the wider picture and the longer term."}, {"type": "sentence", "content": "More than half of the active substances used in European medicines are manufactured in China and India. But even the automotive sector, that mainly relies on local component suppliers, has had problems sourcing parts they needed to continue assembling cars, because some ‘lower value’ components are outsourced to China. Therefore, in the beginning of the pandemic, just when it was alarmingly spreading throughout Europe, some of them decided to pay high costs to bring those parts by airplane to avoid stopping completely their production line."}, {"type": "sentence", "content": "If this happened with a rapid demand surge and restrictions on Chinese manufacturing, imagine what would happen to Europe and the US in the event of a trade war or a new cold war situation with China."}, {"type": "sentence", "content": "My question is, how could so many governments and private companies in Europe and America did not really see this coming? We are worried about our dependence on foreign energy sources, so we quantify it, but why does no one calculate a country’s industrial dependence and takes measures to reduce it, or at least not to continue increasing it?"}, {"type": "sentence", "content": "Now, we are thinking we should have had a strategy against pandemics to be better prepared, or that we should diversify supply chains or have a national reserve of protective equipment and medicines. This is all good, it will certainly help us face pandemics better, but what about other complex challenges?"}, {"type": "sentence", "content": "Some voices, especially in the US, are talking about ‘decoupling’ from China, relocalising whole supply chains and going back to a bipolar world. This is a possible solution to this problem. It is not necessarily the best, but in any case it fails to take the whole picture into consideration."}, {"type": "sentence", "content": "What we need is a real paradigm shift, we need to have a public debate to rethink our theory of economic value and how we really integrate the long-term consequences and risks of our actions not only in public policy, but also in market mechanisms. We need to think in a really holistic and long-term manner."}, {"type": "subtitle", "content": "Theory of economic value"}, {"type": "sentence", "content": "Let us start with theory of value. Nowadays, it is generally accepted, both by mainstream economists and by enterprises in their strategies, that value equals price. Whatever rhetoric people may use about high or low ‘value’ or ‘added value’, the truth is we nearly always measure the economic value of a product by its price. ‘High added value’ products, that we tend not to delocalise, are more expensive products, or more accurately, products for which we get more extra money. This means that essential products for our lives such as food or active substances are ‘low added value’ and leads to the absurd notion that the packaging and marketing of food and medicines has a higher value than the food or the substances that heal you themselves."}, {"type": "sentence", "content": "As Mariana Mazzucato argues in The Value of Everything (focusing on the implications of the financialisation of industrial sectors) this has not always been the case and it probably ought not to be the case. The fact that price is the easiest measure of economic value does not mean that it is accurate or desirable, and when one really thinks about it without prejudging it, some of its shortcomings are quickly revealed."}, {"type": "sentence", "content": "The prevailing theory tells us that food products have a low added value and that a Ferrari has a very high added value, just because food is much cheaper than Ferraris — in the current market situation. In the same way as some people are now saying that the pandemic is making us “realise what are the things that really matter”, if there were food shortages, people would focus first on buying food, then save in case they need money to buy food in the near future, and then think about buying cars and luxury goods."}, {"type": "sentence", "content": "In a prolonged shortage, the prices of food and other basic goods would skyrocket — magically turning from low added value to high added value goods. But the product is exactly the same! Does this make sense or should the value of something be related to what it actually provides us, not its price in a specific setting? This is certainly difficult to measure, but what is clear is that in such a situation, if a millionaire had to choose between eating or buying a Ferrari, I am sure he would choose eating."}, {"type": "sentence", "content": "In the same way, when we measure productivity, we take the added value measured as price of goods produce and divide it by the working time used to produced those goods. This makes a lot of sense when one compares two factories in the same sector who produce similar goods, but does it really make sense when we compare activities that are so different like agriculture, industrial manufacturing, engineering or hospitality services? And to compare economies as a whole, adding all sectors together?"}, {"type": "sentence", "content": "In Southern European countries we are quite used to hearing that our economies produce less value or that they are less productive — even if these countries export a lot of food to more productive ones, that is, help many people to have a better and more varied diet at a lower price, but sure, that’s low value stuff. Of course, we use the same measures and speech with respect to others (after all, primary sectors account for less than 5% of GDP of these countries economies)."}, {"type": "sentence", "content": "As an engineer who has always preferred working in an office that among the noise and grease of a factory, and as a public servant, I cannot really say that working long hours under the sun taking care of crops is less productive, let alone dismiss those workers as lazy (as some people interpret a lower productivity)."}, {"type": "sentence", "content": "This takes us to an internal contradiction of the theory. As salaries are included in the added value of a product, exactly the same thing manufactured with the same technology has a higher added value if the factory is located in Sweden than if it is in Bulgaria. This looks like a circular reference to me: salaries are higher so added value or productivity is higher so salaries ought to be higher. This is also the case for GDP calculations, and that is why corrections, such as purchasing power parity (PPP), exist."}, {"type": "sentence", "content": "I am not saying that this measure of value is useless or does not make sense — but probably instead of value we should really call it something like ‘added price’ or ‘profit’. As I said before, I am not really inventing anything, intrinsic value theories are old. My pretension is to spark a debate on whether we should think of value as price or as something intrinsic (subject to change, but depending more of actual needs than on present preferences and production systems, aka market forces).Another question that I am not going to cover here is the discussion on whether the financial sector creates the value that GDP measurements assign to it, and the acknowledgement that some financial operations, such as purely speculative ones (e.g. high frequency trading) actually extract value from the economy."}, {"type": "sentence", "content": "Finally, another important matter that we do not have time to address in this article are the consequences that delocalisation to lower income countries has in the exploitation of their people and resources. EU companies must abide to labour and environmental protection regulations, but we do not care about what our overseas partners do in those areas."}, {"type": "subtitle", "content": "Considering the long term"}, {"type": "sentence", "content": "In any case, another related matter we should think about is how we include the long-term consequences of our current decisions in our choices."}, {"type": "sentence", "content": "The pandemic has punished our short-termism. The theory underlying the kind of globalisation we have pursued by which we outsource most or all of the capital assets needed to manufacture certain goods or even whole supply chains to Asia is that that industrial capacity will be always at our disposal."}, {"type": "sentence", "content": "We will always be able to buy those products manufactured thousands of kilometres away to fulfil our needs timely — whatever these are — for a reasonable price (that is, lower than if they were manufactured in our economies, taking into account higher logistic costs)."}, {"type": "sentence", "content": "This implicitly assumes either that all the world is one large economic system without barriers; or that we, the outsourcers, have unbeatable means to subjugate the manufacturing economies to our will, like if they were colonies."}, {"type": "sentence", "content": "This is obviously false, there is no single real authority who can manage executively the world economy and China is not only a nominally sovereign country, but has the political and military means to ensure this in practice."}, {"type": "sentence", "content": "In the current pandemic situation, no matter what the capital ownership is, state authorities have taken control (directly or indirectly, like in Europe) of the manufacturing facilities in their territory to make sure they fulfilled first the needs of their population and then, those of other countries’."}, {"type": "sentence", "content": "Even in the European Union, the only international organisation with a real integrated executive power over a single market, there have been regressions in integration and a return to the old nation-states. But this being so evident, why have we behaved as if it were true?"}, {"type": "sentence", "content": "Maybe the answer is that we have become so arrogant as a society that we firmly believe we can solve quickly any problem that may arise, it is just a matter of money. Need a vaccine? Just put all available resources to work on it and you will sure get it. Certainly, the power of human modern societies is huge, but it is not infinite, and anyway it is always better to avoid such risks than to try to solve them against a clock that ticks so fast."}, {"type": "sentence", "content": "Now our short-termism is being punished by the COVID-19 but in the coming years it is very likely that other, even bigger problems will come: first and foremost, the consequences of environmental degradation, which go well beyond those of climate change — and of course, this will not be the last pandemic in history."}, {"type": "subtitle", "content": "Economics is a social science — Do not forget it"}, {"type": "sentence", "content": "All of this is a good reason why economists need to stop trying to make their discipline look like a natural science. Whatever complex mathematics you use, economy will always be a social science because it studies how interconnected groups of humans — that is, societies — work, so economics will always be much closer to sociology and psychology than to physics."}, {"type": "sentence", "content": "Mathematics is a complex of formal tools that help to make science more rigorous. While they are absolutely necessary for the advance of physics and any empirical studies, they are not alien to social sciences, for example they can be very helpful in historical research (maybe some social scientists are alien to mathematics, but that’s not maths’ fault). Mathematics can add rigour to a theory, but they do not make it more ‘natural’ and objective."}, {"type": "sentence", "content": "Furthermore, we should always bear in mind that a formally perfect theory will not describe reality well if it is founded on false facts. This may be obvious, but then why do we believe that models based on implausible hypotheses are a good approximation to the truth? Is it just because we cannot build models whose foundations are closer to reality, solve them and make sense of them? Would it be better to accept once and for all that economics is not natural science and that the behaviour of the systems it studies is highly uncertain?"}, {"type": "sentence", "content": "Certainly these models help us delve into the complex world of a modern economy, but this does not mean that they should be used as infallible to predict or explain any situation."}, {"type": "sentence", "content": "Even if we now know that Newton’s physics does not work in the subatomic world or when masses are very large or speeds very high, Newton’s principles are observable and repeatable in the vast majority of phenomena we encounter."}, {"type": "sentence", "content": "On the other hand, hypotheses such as rationality of agents, perfect information, homogeneity of goods and lack of market power are good approximations in a small minority of markets, clearly untrue in many others, and just wishful thinking at the macro level."}, {"type": "sentence", "content": "Sure, everyone knows that models are an approximation to reality and there are always caveats — but still many take its conclusions as fundamentally true. If you start a model assuming that in a economic system all agents have all the information they need, the knowledge they need to make use of it and they will effectively act rationally (this is a main part of Lucas’ ‘rational expectations’)… Then, however perfect the formal derivation of the model is, can we really be sure the model outcome will be a fair approximation of reality?"}, {"type": "sentence", "content": "The only economic model that would be exact would be that able to decipher all thoughts, impulses and actions of humans and the interactions between them and all other variables that affect them (‘the environment’). Or at least something that would get close to that."}, {"type": "subtitle", "content": "But anyway, there will never be one universally right solution"}, {"type": "sentence", "content": "But even if we could build that perfect model, economic policies would still be debatable. The model would provide us the best choice in order to pursue a given outcome, but defining the most desired outcome would always be controversial. How we weigh the importance of economic growth, social equality, individualism, preserving traditions will always be subjective and there will never be a correct view. No one is right or wrong per se, but we would benefit if we confronted our opinions with others, enriching our views."}, {"type": "sentence", "content": "Our priorities in each of these areas will be shaped by our values and preferences, our past and present experiences and risk aversion and what we consider a foreseeable future, which are all malleable and naturally changing throughout our lives."}, {"type": "sentence", "content": "And on top of that preferences layer, we always need to decide how much more important is the short term over the long term. Let me take a climate change example: we could technically stop carbon emissions right now, but the short-term consequences would be giving up all comforts that we know, starvation for a significant part of the world’s population, disease… And no one wants that. We need to think both about the present and the future."}, {"type": "sentence", "content": "Democratic systems are especially well suited to find such compromises as they encourage public debate and have political institutions where different views are represented. However, their success cannot be taken for granted. For a democracy to answer these problems satisfactorily, discussions must be effectively encouraged and good information must be available to all. But also the population should receive an education that provides them knowledge and, above all, teach them how to think in a rational and critical way."}, {"type": "sentence", "content": "Now it is time to tackle the pandemic and get back to ‘normal life’. But soon, our societies will have to discuss about what things we value more, what risks are acceptable and which should be avoided — and then analyse how to shape our production and consumption systems accordingly."}], "topic": "economy"}