{"title": "Neuro-COVID: Gaining Recognition as New Disease Terminology", "data": [{"type": "subtitle", "content": "Infection | Brain"}, {"type": "subtitle", "content": "There’re 3 types of Neuro-COVID, and it progresses through 3 stages — involving the brain’s respiratory center."}, {"type": "image", "content": "https://miro.medium.com/max/6998/1*06MEsBXV3AFI3_t868wtgA.png"}, {"type": "sentence", "content": "While rare, neurological manifestations of COVID-19 are well-documented, which I detailed here. Its underlying mechanisms of neuroinfection are robust as well. Is now the time to coin a new COVID-19 disease terminology?"}, {"type": "subtitle", "content": "3 Types of Neuro-COVID"}, {"type": "sentence", "content": "In a May 5 published paper in Brain, Behavior, and Immunity, researchers at the University of Brescia in Italy said there are three distinct features of clinical COVID-19 neuroinfection: (1) Cerebral thrombosis with hemorrhagic infarction, (2) demyelinating lesions, and (3) encephalopathy. “We defined this condition as Neuro-COVID for the overwhelming CNS involvement in COVID-19,” they proposed."}, {"type": "subtitle", "content": "3 Stages of Neuro-COVID"}, {"type": "sentence", "content": "Neuro-COVID has three stages, the Italian researchers said, which are neuroinvasion, central nervous system (CNS) clearance, and immune response."}, {"type": "sentence", "content": "In phase 1 neuroinvasion, the virus infects the brain via either the olfactory nerve or the bloodstream. The viral load in the cerebrospinal fluid starts to increase until the second phase. Mild or no respiratory symptoms are present."}, {"type": "sentence", "content": "In phase 2 CNS clearance, the virus starts to go into deeper parts of the brain, such as the brainstem — the respiratory brain center. Respiratory symptoms become more apparent. The viral load in the cerebrospinal fluid begins to decrease. Here is when the nasopharyngeal swab can detect the virus."}, {"type": "sentence", "content": "In phase 3 immune response, the virus has replicated substantially and alarmed the immune system. A cytokine storm may occur, leading to widespread organ damage, including the brain and lungs. The brain respiratory center is further damaged, worsening respiratory symptoms."}, {"type": "sentence", "content": "In this final phase, the virus may be absent in the cerebrospinal fluid, but detectable in the nasopharyngeal swab. The completed phase 2 could explain why the cerebrospinal fluid was tested negative for the virus in some Neuro-COVID cases. Depending on which areas of the brain are damaged, either one of the three clinical types of Neuro-COVID occurs."}, {"type": "subtitle", "content": "Input From Other Research Groups: The Brainstem Involvement"}, {"type": "sentence", "content": "Two other papers by researchers in China support the proposed neuroinfection route the Italian researchers, which involve either olfactory nerve transport or blood-brain-barrier crossing, or both. One article, published in Frontiers of Medicine, is titled, “Neurological manifestations of patients with COVID-19: potential routes of SARS-CoV-2 neuroinvasion from the periphery to the brain.” The other, in Neurotoxicity Research, is called “Involvement of the Nervous System in SARS-CoV-2 Infection.”"}, {"type": "sentence", "content": "Other research groups have also linked the brainstem — brain’s respiratory center — to COVID-19. An area of the brainstem called the medulla oblongata harbors the nucleus of the solitary tract that receives and sends nerve signals to the heart and lungs. The pre-Bötzinger complex within the brainstem’s medulla is a cluster of neurons controlling the respiratory rhythm."}, {"type": "sentence", "content": "Damage to the pre-Bötzinger complex cause respiratory failure and death, said Indian researchers in their paper, “Is the Collapse of the Respiratory Center in the Brain Responsible for Respiratory Breakdown in COVID-19 Patients?” in ACS Chemical Neuroscience."}, {"type": "sentence", "content": "Based on previous coronavirus studies in animals, “it is reasonable to think that SARS-CoV-2 enters the CNS via the olfactory bulb and may reach brainstem causing dysfunction and/or death of infected neurons, especially those located in cardiorespiratory centers in the medulla,” agrees another paper in Brain, Behavior, and Immunity titled “SARS-CoV-2: A new virus but a familiar inflammation brain pattern.”"}, {"type": "sentence", "content": "MERS and SARS deposited in the brainstem when given to mice via the nose, researchers at Sultan Moulay Slimane University said in a commentary to the first paper that proposed a brainstem connection in COVID-19 by Chinese researchers in February, which I detailed here. “Accordingly, a part of respiratory failure could be effectively attributed to an injury of brainstem centers located in the medulla oblongata,” the commentary added."}, {"type": "sentence", "content": "ACE2 receptors used by SARS-CoV-2 is present in the brain, “especially in the brainstem and regions responsible for regulating cardiovascular functions,” said a paper in Neurological Sciences titled, “Rising evidence for neurological involvement in COVID-19 pandemic.” These regions include the nucleus of the solitary tract and medulla oblongata, they mentioned."}, {"type": "subtitle", "content": "The First Direct Evidence"}, {"type": "sentence", "content": "All these research groups — 6 in total, including the paper proposing Neuro-COVID as a new disease terminology — point towards the brainstem. Direct evidence is illuminated by a recent article titled, “First ultrastructural autoptic findings of SARS-Cov-2 in olfactory pathways and brainstem,” by researchers at the University of Milan in Italy."}, {"type": "sentence", "content": "They analyzed high-quality specimens from a deceased COVID-19 patient who suffered a loss of smell and taste, headache, fever, and acute respiratory distress syndrome (ARDS). They found SARS-CoV-2 particles concentrated in the olfactory nerve and brainstem, which were also damaged."}, {"type": "sentence", "content": "This study is the first evidence supporting a direct infection and destruction pathway of Neuro-COVID, from the olfactory system to the brainstem. “The damages of the brainstem could justify the specific respiratory dyssynergia presented by this patient,” the study authors concluded."}], "topic": "neuroscience"}