{"title": "Chronic Pain and the Brain", "data": [{"type": "subtitle", "content": "A neurobiological look into how and why we hurt"}, {"type": "subtitle", "content": "The relative morality of pain"}, {"type": "sentence", "content": "Think back to a time you experienced physical pain. Perhaps it was a sudden cramp, an ache that has lingered after a surgery, or stepping on your kid’s stray Lego. Pain is powerful– it can stir up emotion, elicit some unsavory words, and sometimes bring everyday life to a standstill."}, {"type": "sentence", "content": "However, this pain is completely internal– a monster of your own making. Pain is a sensory modality, like the more familiar five senses, that we have developed over the course of evolutionary history which likely provided survival advantages. Pain instructed our early ancestors that rest is good for a healing wound and that hot coals shouldn’t be touched."}, {"type": "sentence", "content": "But the truth is that perceived pain, our interpretation of a stimulus, doesn’t carry objective information about the actual danger of the stimulus; it is simply the firing of certain pain-transmitting neurons in your nervous system."}, {"type": "sentence", "content": "When you accidentally bang your funny bone, it can be momentarily excruciating and all-consuming. Yet in all likelihood, your survival isn’t in grave danger. This pain-danger mismatch can also be seen in paper cuts and when your feet ‘fall asleep.’"}, {"type": "sentence", "content": "The interpreted meaning of the stimulus that results in pain is actually encoded in the intricate circuitry of your neural pain pathways. In fact, if these circuits are impaired, pain can be felt with no apparent cause; if these circuits are non-functional, pain is not felt at all."}, {"type": "sentence", "content": "Pain is, by definition, a subjective sensory and emotional experience that is also affected by an individual’s tolerance, mood, anxiety, social support, and pain catastrophizing. While pain is subjective and appears nebulous, when you ask people suffering from chronic pain, it is undoubtedly real."}, {"type": "subtitle", "content": "The system is broken: faulty circuits in chronic pain"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*23aLVHR1rQ-VyFKH"}, {"type": "sentence", "content": "While acute pain from slicing a finger or breaking a bone might bring you into the ED, a potentially more dangerous threat that affects 1 in 5 American adults is chronic pain. Chronic pain is an umbrella term that characterizes many common conditions including chronic low back pain, fibromyalgia, IBS, and chronic headaches."}, {"type": "sentence", "content": "Unlike pain triggered by an external stimulus, or nociceptive pain, most chronic pain is caused by neuropathic pain. Neuropathic pain has no external stimulus: it is caused by dysfunction within the pain-transmitting machinery itself. It can develop after an injury, illness, or seemingly without reason, but this insidious mechanism ultimately results in constant, inappropriate pain signaling becoming the body’s new normal."}, {"type": "sentence", "content": "Pain circuits, like all other neuronal circuits, are composed of interconnected neurons. Virtually all neurons can be boiled down as functionally excitatory or inhibitory. This means that when a neuron is stimulated, it can excite a neuron in the pathway, propagating the signal or it can inhibit a neuron in the pathway, dampening the signal."}, {"type": "image", "content": "https://miro.medium.com/max/2792/1*m-eXzdSmtoEotV8Fg3NDdA.png"}, {"type": "sentence", "content": "To simplify, think back to when you learned to multiply negative numbers. Recall that one negative factor in a string of factors makes the product negative and two negatives actually makes a positive. So a strong excitatory (+) signal acting on an inhibitory (-) neuron becomes a strong inhibitory (-) signal; strong inhibition (-) of an inhibitory (-) neuron becomes a strong excitatory (+) signal (a phenomenon called disinhibition)."}, {"type": "sentence", "content": "Like nature’s own choose your own adventure game, the combinations are endless, but the big idea is that no neuron works in isolation. The meaning is in the circuit– the interconnectedness of excitatory and inhibitory neurons and their many nexuses of fine-tuning ultimately determine what that neural signal, or lack thereof, will be perceived as."}, {"type": "image", "content": "https://miro.medium.com/max/1984/1*TEPzZiKzpeYwemsddE39NQ.png"}, {"type": "sentence", "content": "Pain circuitry can be described in two major pathways:"}, {"type": "sentence", "content": "Many diseases of chronic pain are thought to be caused by dysfunctional descending pathways, a result either from illness or cell exhaustion from managing an acute injury."}, {"type": "sentence", "content": "In a healthy body or one that is initially responding to pain, this descending inhibition is important in keeping pain sensation at bay. But as these mechanisms are exhausted or degenerate, they are overpowered by the ascending signals that we perceive as pain."}, {"type": "subtitle", "content": "NSAIDs: why Advil isn’t enough"}, {"type": "sentence", "content": "So after falling off the workout wagon for a while, you force yourself to do some intense, full body exercise. And in the morning, you can barely roll out of bed. Muscle memory takes over as you screw off the safety cap, shake out 2 Advil, and throw ’em back. Does this sound familiar?"}, {"type": "sentence", "content": "Nonsteroidal anti-inflammatory drugs, or NSAIDs, like ibuprofen and aspirin are extremely popular because they are cheap, effective, and generally safe for most people."}, {"type": "image", "content": "https://miro.medium.com/max/900/1*_dOun1g8IjyG_0nrYPdLxQ.jpeg"}, {"type": "sentence", "content": "NSAIDs inhibit ascending pain pathways primarily at the source of the initial pain signal by inhibiting COX enzymes, inhibiting production of inflammatory proteins called prostaglandins. Prostaglandins normally increase the pain neuron’s excitability, causing more firing and pain sensation."}, {"type": "sentence", "content": "However, as many people with chronic pain know firsthand, the effects of NSAIDs are limited. If the source of pain, particularly that of the neurogenic variety, is later in the ascending circuit than where the NSAID is acting, the pain signal is still reaching the brain and being perceived."}, {"type": "subtitle", "content": "Opioids: playing with fire"}, {"type": "sentence", "content": "For years, opioids were the go-to pharmacologic therapy for managing chronic pain. Dissecting the misinformation and medical practices surrounding legal opioids that caused the US epidemic is beyond the scope of this article, but it’s important not to demonize the drugs themselves– given the right patient, medical indication, and responsible oversight, opioids can, in some cases, be an effective and life-saving therapy."}, {"type": "sentence", "content": "Pharmacological and illicit opioids like morphine, oxycodone, codeine, heroin, and fentanyl act on the opioid receptors, our own inherent pain regulation systems. They have structures that mimic those of the endogenous opioids that our own bodies make, such as endorphins and enkephalins, though their effects can differ greatly."}, {"type": "sentence", "content": "Opioids’ powerful analgesic effects are believed to be mediated primarily by descending pain pathways, dampening the aforementioned ascending pathways. Serotonin and norepinephrine signals from the periaqueductal gray nuclei of the brain excite intermediary interneurons that release opioids that inhibit ascending pain neurons, blocking the pain signal."}, {"type": "image", "content": "https://miro.medium.com/max/1922/1*VmePVPOV_sT09whrmWSCvw.png"}, {"type": "sentence", "content": "However, given the diminishing analgesic efficacy of opioids, paired with their high risks for addiction and overdose, clinical management of chronic pain has made a significant and welcome shift in therapeutic approaches."}, {"type": "subtitle", "content": "Antidepressants: Teaching an old drug new tricks"}, {"type": "sentence", "content": "As opioids have been relegated to the peripheries of medicine’s pain-fighting arsenal, antidepressant drugs have become effective alternatives to narcotic pain management. While the mechanisms of these effects are not certain, if these chronic pain conditions are truly products of dysfunctional descending pain pathways, the well-characterized effects of antidepressants on the brain could certainly play a role in bolstering descending pain modulation."}, {"type": "image", "content": "https://miro.medium.com/max/4494/1*7RbZGpomWr8EzwPuL8GxwA.jpeg"}, {"type": "sentence", "content": "Interestingly, unlike NSAIDs and opioids, the analgesic effect from tricyclic antidepressants (TCAs) and serotonin-norepinephrine reuptake inhibitors (SNRIs) tend to be graded, increasing after prolonged treatment. This suggests that the mechanism, at least in part, involves synaptic plasticity– a physical and functional remodeling of neuronal connections."}, {"type": "sentence", "content": "Most theories agree that the mechanism of action relies on strengthening norepinephrine synapses in the descending pathway, which are affected by TCAs and SNRIs. One study provides strong evidence that norepinephrine action is two-pronged– an immediate, central effect that employs the opioid system and a delayed, peripheral anti-inflammatory effect."}, {"type": "sentence", "content": "Additionally, the classic therapeutic effects of antidepressants may alleviate the emotional and cognitive components of pain. While antidepressants have their own risks and side effects, when compared to opioids, they are much less likely to be abused and do not cause potentially lethal respiratory depression."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "The causes and presentation of chronic pain differ for everyone. Genetics, mental health, socioeconomic status, and lifestyle habits are all factors, but no one is immune from the suffering that chronic pain brings."}, {"type": "sentence", "content": "With an aging population and increasing prevalences of conditions such as fibromyalgia and IBS, it may seem that lingering pain is a ubiquitous and inevitable part of life– this mentality is dangerous and self-limiting."}, {"type": "sentence", "content": "Let it be clear– pain is not normal and should not be ignored, especially with the availability of effective therapies. While I focused on pharmacological approaches, physical and alternative therapies should also be considered."}, {"type": "sentence", "content": "That being said, when pain cannot be adequately managed, healthy people and healthcare professionals must realize that attitudes that discredit legitimate experiences of pain impact an individual’s pain catastrophization and ability to cope. Additionally, conscious recognition of bias in disbelieving pain is essential, especially with populations whose pain has been historically and systematically dismissed."}, {"type": "sentence", "content": "So yes, pain is technically all in your head, but make no mistake– it’s very real."}, {"type": "sentence", "content": "Note: While this article is rooted in evidence-based research, it should not be taken as direct medical advice. Decisions about your health should always be made in consultation with your physician."}], "topic": "neuroscience"}