{"title": "How to Make Your Course as Durable as Mario Kart: Future-Proofing Online Educational Content", "data": [{"type": "image", "content": "https://miro.medium.com/max/1766/1*0y5Hook_bQZMJdhS6706_A.jpeg"}, {"type": "subtitle", "content": "Design Inspiration"}, {"type": "sentence", "content": "When I think of highly effective digital experiences that walk you through a progression of learning modules while balancing the need for accessibility of future audiences I think of the Super Nintendo Entertainment System. At any point in time, as long as you have your own SNES, you are able to pick up a Mario Kart cartridge, slap it in the machine, and start playing. It needs only five basic things: a game console, a game controller, a game cartridge, a TV, and electricity. You have those five things and you can start throwing bananas."}, {"type": "sentence", "content": "What happened? Why isn’t the content we design in 2020 as robustly as Mario Kart? Well, the Internet happened and we got carried away with it. Platforms grow and change. Websites rise and fall. We’ve forgotten how to make things just work in lieu of the fancy bells and whistles that come with the modern web capabilities."}, {"type": "sentence", "content": "My mission, in this article, is to argue that we need to design course systems and materials that are future-proof. Courses that allow for multiple generations to come to have access to the hard work we’ve dedicated to their creation."}, {"type": "sentence", "content": "To be clear: I’m not arguing that we need to ignore the advances of Internet technology when constructing courses, nor that the content won’t need to be revised as we create new knowledge or as beliefs and attitudes change. I am speaking from the point of view of the course designer. As you review the principles outlined below you will see that I’m arguing for compartmentalization and modulation of content so that we can better anticipate the needs of future audiences."}, {"type": "subtitle", "content": "Why?"}, {"type": "sentence", "content": "In 2012, when I started designing my first massive open online course (MOOC) New School Creation, my team and I gave no thought to creating a course that would be relevant eight years later."}, {"type": "sentence", "content": "Guess what? Eight years later, it is still relevant. We just re-released New School Creation (https://hthgse.online/newschoolcreation/) as a self-paced MailChimp course last month and we are working to create a sequel to the original course later this year."}, {"type": "sentence", "content": "So what happened? Why wasn’t I able to predict that the information would still be relevant in 2020 when we released in 2013? At the time, I and other early course designers were still trying to grapple with what MOOCs were."}, {"type": "sentence", "content": "Like many course designers for virtual audiences, our thought was to take a graduate course that Larry Rosenstock had taught in-person for years and translate that experience to an online course that people anywhere in the world could remotely complete. We thought the course would be offered once, and then, just like an in-person course, it would be over."}, {"type": "sentence", "content": "That’s not how it turned out."}, {"type": "sentence", "content": "The course stayed online, and people continued to access it. Periodically I would get emails from folks who were trying to access the course materials, and links were broken or whole sections of content just would not load. On top of that there was language within the courses that had dated the content in a confusing manner, such as instructions to turn assignments in at dates that had long since past. Although there was a continued audience of people who found value in the course, we were not thinking about their experience when we designed it."}, {"type": "sentence", "content": "I hate the idea that I unknowing facilitated a frustrating learning experience for these course users, but the course itself had been funded by time-sensitive grant money. That money was gone and we had not allocated funding towards the course for routine maintenance and upkeep."}, {"type": "subtitle", "content": "Future-Proofing"}, {"type": "sentence", "content": "After this experience and others just like it, I began working on a set of design principles for designing online course structures and materials that will ensure these are durable and “future-proof”. The concept of future-proofing is more commonly used in industrial sciences and the world of electronics, but it is relevant for thinking about how to be thoughtful educational designers for online spaces. Future-proofing is the process of designing products or systems that can be used in the future, even if the technology changes. Below you will find a list of concepts that will support you to create future-proof online learning experiences."}, {"type": "subtitle", "content": "Design Principles"}, {"type": "sentence", "content": "As more learning experiences move to online spaces, we need to make a plan to manage the course design so that it has more long-term viability. I recommend that this plan is developed in adherence with the following future-proofing design principles:"}, {"type": "sentence", "content": "References"}], "topic": "ux"}