{"title": "Remote Work Burnout Is Real", "data": [{"type": "subtitle", "content": "As a freelancer working remotely, dealing with it has not been easy."}, {"type": "sentence", "content": "I’ve got my facial mask on, avocado and cucumber to be precise. It’s 7 am. I’ve just finished half of my work for the day. I’ve unrolled my yoga mat to try to attempt to do a few poses before my day starts, then I hear my son stirring in his room, “Mommy! Mommy!” My only thought is, “Not again!” This is the precise reason why I start my day so early. This is the reason I can’t seem to ever get enough sleep."}, {"type": "sentence", "content": "12 hours later, I’m sitting on the couch emotionally spent. While watching my son bounce off the walls (literally) before bed, I’m pondering whether he’d go to bed early today so that I will be able to get the rest of the work done."}, {"type": "sentence", "content": "Some would say that I’m lucky. I don’t have a corporate job where I’m expected to be on calls all day long and work around other people’s schedules."}, {"type": "sentence", "content": "But, freelancing can be difficult. It’s productivity based. I have to produce a certain amount of content for my clients every month to earn enough to support us."}, {"type": "sentence", "content": "For a person who is single and without a family to deal with at home, the remote work schedule can be very attractive. With social distancing, loneliness is hard. But, at least, being in the zone without distraction is easier at home than in the office."}, {"type": "sentence", "content": "After several years of remote working from home, I’ve come to envy people who only complain about loneliness. To me, that is a luxury."}, {"type": "sentence", "content": "For the first year, I dealt with my isolation by taking my son out to playrooms and socializing him while meeting other parents."}, {"type": "sentence", "content": "When depression set in during the second year, I reached out on social media and tried to meet people in online communities."}, {"type": "sentence", "content": "In my third year, this year, with social distancing, I finally feel like I have a grip on how to deal with my remote work burnout."}, {"type": "subtitle", "content": "Remote Work Burnout"}, {"type": "sentence", "content": "If you are not familiar with remote work burnout, you may dismiss it like any other work burnout."}, {"type": "sentence", "content": "I know better."}, {"type": "sentence", "content": "In the office, you simply don’t have the one-two punch of isolation and work burnout to push your mental health over the edge."}, {"type": "sentence", "content": "I’m normally a stress-tolerant person. Even during work burnout, I can be super productive while my mental health takes a dive."}, {"type": "sentence", "content": "But during my remote work burnout, a dreadful feeling of “Blah”, coupled with anxiety at the smallest disturbance during my day, tells me that the remote work burnout is different."}, {"type": "sentence", "content": "It’s brought on by isolation, fear, and overwork. During times of remote work burnout, I can’t even bring myself to function."}, {"type": "sentence", "content": "I can’t work. I can barely eat. I can’t work out. I simply want to sit and stare at a blank space."}, {"type": "sentence", "content": "My senses simply go on strike. My mind goes into meltdown mode."}, {"type": "sentence", "content": "At the slightest mishap during my day: my son waking up too early in the morning, the toast is overcooked, or an appointment missed, the anxiety at not doing things as they are meant to be done multiplies. At times, it feels like panic attacks are just around the corner."}, {"type": "sentence", "content": "You are not imagining it."}, {"type": "sentence", "content": "It’s called remote work burnout."}, {"type": "sentence", "content": "It’s totally normal."}, {"type": "subtitle", "content": "The Treatment"}, {"type": "sentence", "content": "It may seem easy to simply stop working and take a day off when you are in remote work burnout, but it’s not that simple. I’ve found that taking a day off is the short term fix."}, {"type": "sentence", "content": "Often, there’s residual stress that will continue to accumulate over several months to a year."}, {"type": "sentence", "content": "Instead, you have to address the root of the issues of social isolation and overwork."}, {"type": "sentence", "content": "Ask yourself:"}, {"type": "sentence", "content": "Once you manage to accomplish both, then you will see a transformational effect on your own mental health."}, {"type": "sentence", "content": "For me, once I started to see improvement in both of these areas, I started to finally feel the motivation I needed to stop feeling like a victim of my “remote work” lifestyle."}, {"type": "sentence", "content": "Instead, I feel more empowered to make more changes in my life. Eating healthy, exercising, and taking care of every aspect of life will shift your focus away from scrutinizing your choices, doubting your abilities, and fearing the future."}, {"type": "sentence", "content": "Each person has a different way of getting their social needs fulfilled. Supporting others, in any way shape or form, whether online or offline is a great way to get your social needs fulfilled."}, {"type": "sentence", "content": "We all want to feel like we are actually making a difference by connecting with people around us. So, just reach out and spend a little bit of time making a difference in someone else’s life."}, {"type": "sentence", "content": "Working more does not equal more money."}, {"type": "sentence", "content": "However, having more free time in your remote work schedule to think freely is the key to making more money."}, {"type": "sentence", "content": "I’ve found that through trial and error, you need to develop your own system of productivity."}, {"type": "sentence", "content": "You can’t just say that because you’ve worked 12 hours, you just solved some major problems or gained the results that you seek."}, {"type": "sentence", "content": "As a freelancer, it’s very counterintuitive. But, I’ve found constant pivoting is the most helpful strategy for working less but more effectively."}, {"type": "sentence", "content": "You can’t rest on your laurels."}, {"type": "sentence", "content": "Rather than performing actions for the sake of performing them, think about your actions intentionally so that you can gain the results that you seek from those actions."}, {"type": "sentence", "content": "For me, in the last 5 months, I’ve asked myself questions that I didn’t want to ask."}, {"type": "sentence", "content": "Questions like the below gave me major anxiety just thinking about them:"}, {"type": "sentence", "content": "But, I was forced to ask these questions and pivot continuously toward a direction that worked for me."}, {"type": "sentence", "content": "Avoiding the difficult, the unexpected, and the things that you don’t want to hear will just make your work life even more stressful."}, {"type": "sentence", "content": "Start by asking yourself the hard questions, listing out all your answers on a spreadsheet, then tackling them one by one."}, {"type": "sentence", "content": "This is how you truly arrive at work that you enjoy while working less."}, {"type": "subtitle", "content": "Rethinking The Remote Work Burnout"}, {"type": "sentence", "content": "Through working through my burnout, I can tell you that sometimes drastic circumstances take drastic actions. By not be afraid of looking stupid, feeling incompetent, and even losing clients, you will put yourself on the path to real healing."}, {"type": "sentence", "content": "Now I think of my remote work burnout as a kind of a barometer. This barometer tells me whether or not my lifestyle has pushed me to my limits, whether a reset is needed."}, {"type": "sentence", "content": "Reset is not simply taking time out."}, {"type": "sentence", "content": "Reset means re-evaluating how you work, how you live, and whether your work is integrated into the life that you want to live."}, {"type": "sentence", "content": "When small annoyances in your life don’t seem to bother you anymore, then you know that you are onto something."}, {"type": "sentence", "content": "Until then, I’m pivoting every month, both in my work and in my life. Each month, I look back and I can see the confidence, the sense of oneness, and the synchronization I’ve achieved between my work and my life."}, {"type": "sentence", "content": "I know that I don’t have a cure for remote work burnout."}, {"type": "sentence", "content": "But, I’m no longer satisfied at simply treating the symptoms."}, {"type": "sentence", "content": "I want to go into remission. This is why every day, I treat the root cause of it."}], "topic": "mental-health"}