{"title": "How Not to Fire Someone: 5 Golden Principles", "data": [{"type": "subtitle", "content": "The way I got fired made me doubt my self-worth."}, {"type": "sentence", "content": "About a year ago, I was fired from a full-time job."}, {"type": "sentence", "content": "I still experience it as a trauma."}, {"type": "sentence", "content": "I have nightmares about it every couple of months."}, {"type": "sentence", "content": "Not because I loved it. Not because I needed it to survive. Not even because of my ego."}, {"type": "sentence", "content": "But because of how it was done."}, {"type": "sentence", "content": "It left me dehumanised."}, {"type": "sentence", "content": "A lot of people are and will be let go of in the wake of this economic crisis."}, {"type": "sentence", "content": "A handful of “lucky” ones will let go of their colleagues."}, {"type": "sentence", "content": "This is for you."}, {"type": "sentence", "content": "Now, I don’t generally believe there is a single best way of doing something."}, {"type": "sentence", "content": "But I know this for sure — there is a way not to fire someone."}, {"type": "sentence", "content": "Actually, there are five of them."}, {"type": "subtitle", "content": "1. Don’t do it without a forewarning."}, {"type": "sentence", "content": "I have to admit I didn’t see it coming. All I’d ever got my entire life was ‘brilliant’, ‘star performance’, and ‘please come back’."}, {"type": "sentence", "content": "The months before my dismissal, every time I asked for feedback, I would be given some general direction and a smile. In anticipation of my 3-month review, I asked, ‘What do I need to do to pass this?’"}, {"type": "sentence", "content": "Although I received multiple instances of advice on how to perform my role, I was never made aware that I was in danger of losing my job. Dehumanising strike number 1."}, {"type": "sentence", "content": "Of course, if you’re in the management team of Lehman Brothers circa September 2008, you’re excused. You can’t give your 25,000 employees much notice."}, {"type": "sentence", "content": "But if you’re not facing imminent bankruptcy, keep reading."}, {"type": "sentence", "content": "First, let’s get a few maxims out of the way."}, {"type": "sentence", "content": "If these ideas provoke the slightest vibration within you — great."}, {"type": "sentence", "content": "Now put it to work."}, {"type": "sentence", "content": "When you’re beginning to have doubts about your colleague’s performance, tell them point-blank. A few weeks or even months in advance of the due date."}, {"type": "sentence", "content": "Unless the employee constructed a convincing lie about their qualifications and skills, there’s a valid reason why they were hired. But managers who are bad at firing are good at enunciating justifications."}, {"type": "sentence", "content": "“We can’t afford you in these times,” or “You haven’t met our expectations.”"}, {"type": "sentence", "content": "That’s the ‘can’t be bothered’ option. It distorts the fact that, in business, there will always be another problem to hack, a marginal gain to push for. ‘We’re not satisfied’ is not a good enough excuse for firing someone out of the blue."}, {"type": "sentence", "content": "So, don’t let someone go without giving them a chance to improve, whereby expectations are clearly defined and resources are generously given to support their progress."}, {"type": "sentence", "content": "This might be a good time to mention that employees guilty of sexual harassment, abuse of power, and other illegal practices, do not fall into this category."}, {"type": "subtitle", "content": "2. Don’t hide your emotions."}, {"type": "sentence", "content": "What was dehumanising about my experience was that I felt unseen."}, {"type": "sentence", "content": "There was such a stark contrast between how my manager had treated me the months prior and how they treated me in our final meeting."}, {"type": "sentence", "content": "A smiling, emphatic, verbose person in general, they were now curt, dismissive, and emotionally closed."}, {"type": "sentence", "content": "Jobs are important. At the very least, for survival. People have bills, rent, food to pay for, and some have families to support."}, {"type": "sentence", "content": "Furthermore, climbing towards the self-actualisation part of the needs pyramid, people use jobs to fulfill their potential and serve the world around them."}, {"type": "sentence", "content": "Add to this that rejection is both a primal fear and a painful obstacle to overcome. Research has found that experiencing rejection triggers the same parts of the brain that respond to physical pain (the dorsal anterior cingulate and the anterior insula, should you be so curious)."}, {"type": "sentence", "content": "Thus, experiencing rejection whilst losing a source of income can be mentally challenging. Fair?"}, {"type": "sentence", "content": "Okay. So how about we make it easier for that person by showing them that their feelings are valid? That their inner worth is intact even whilst the rejection they’re experiencing is painful?"}, {"type": "sentence", "content": "How might we do that, you ask?"}, {"type": "sentence", "content": "Show some emotion."}, {"type": "sentence", "content": "Chances are, if you’re reading this in the 2020s and are not a cyborg — you will be experiencing some grief of your own when you let someone go. Maybe you clicked with their personality, or maybe you don’t want to make them feel bad."}, {"type": "sentence", "content": "Say it. Show it. Share your grief with them."}, {"type": "subtitle", "content": "3. Don’t dictate how they leave."}, {"type": "sentence", "content": "A couple of weeks before my last day, the CEO announced that a colleague had been dismissed and wouldn’t be returning to work. He asked if anyone had any questions."}, {"type": "sentence", "content": "I asked why it had not been possible to know this sooner, so we could say goodbye. The CEO replied, “It was mutually agreed that leaving quietly would be easier for him.”"}, {"type": "sentence", "content": "Fast-forward to when I was dismissed. I told my manager I wanted to say goodbye to everyone in person. They said I couldn’t do that — it would ‘disturb the workflow’. Management would announce my departure in their own time."}, {"type": "sentence", "content": "So much for ‘mutually agreeing.’"}, {"type": "sentence", "content": "Yet, that wasn’t the most painful moment. My manager then said I should wait there, at the cafeteria table, while they’d go to the office and fetch my belongings."}, {"type": "sentence", "content": "I am aware this is common practice across many industries and seniority levels. I am saying, let’s change that."}, {"type": "sentence", "content": "People who leave willingly get a going-away party, a sneakily-shuffled-around card, and an offer to return anytime they please."}, {"type": "sentence", "content": "People who leave ‘under complicated circumstances’ (code for ‘fired’) get 10 minutes’ notice, their last paycheck, and a party of one."}, {"type": "sentence", "content": "This is denigrating for a whole host of reasons, not the least of which is one’s physical and mental attachment to their workplace. People form bonds, both with their colleagues and the work itself. And even when employed for only a few months, that’s hundreds of hours spent at the same desk or building. For most of us."}, {"type": "sentence", "content": "It’s not just money that offers safety in a job. It’s also the routine, relationships, and physical surroundings."}, {"type": "sentence", "content": "Business is not just hockey sticks shooting up on a chart. A business would be nothing without healthy, motivated, diverse people rooting for the same goals. We know this, we speak about this at conferences, and yet we treat dismissed colleagues like burnt-out laptops."}, {"type": "sentence", "content": "So ask them how they want to leave."}, {"type": "sentence", "content": "I, for one, refused to simply disappear and insisted I pick up my own things."}, {"type": "sentence", "content": "Shame should not prevent us from acting with integrity."}, {"type": "subtitle", "content": "4. Don’t forget to ask for feedback."}, {"type": "sentence", "content": "This is the only one they got right."}, {"type": "sentence", "content": "After telling me about my performance, my manager asked if I had anything to add. That was the only moment when I felt seen. But if I were to set the standard even higher, I’d say that question wasn’t enough."}, {"type": "sentence", "content": "Again, a wise manager will ask themselves “How have I failed to support this person?” They should spend just as much time asking about the employee’s experience as they spend listing their areas of improvement."}, {"type": "sentence", "content": "Why do most companies only ask for detailed feedback when the employee quits, but not when the employee is let go of?"}, {"type": "sentence", "content": "(i.e. “If you choose to leave, there might be something wrong with us, but if we force you to leave, there is definitely something wrong with you.”)"}, {"type": "sentence", "content": "However poorly the former colleague may have performed, one thing is true in most cases. People are good at spotting unfairness, unkindness, and inconsistency. This means that, at the very least, you can learn how to improve the company culture and systems."}, {"type": "sentence", "content": "So, don’t look at your former colleague as a sunk cost. You need to still see them as an investment if you want to improve your productivity and turnover."}, {"type": "sentence", "content": "I personally reserved my right to not give extensive feedback. I chose not to mention the multitude of discrepancies which convinced me to hand in my resignation, had I not been beaten to it."}, {"type": "sentence", "content": "Instead, I politely extended my gratitude for their time and ended the conversation."}, {"type": "sentence", "content": "Which brings me to my final point."}, {"type": "subtitle", "content": "5. Don’t expect a trophy if you do it right."}, {"type": "sentence", "content": "You may ask for feedback, but they may not want to unpick disappointing times."}, {"type": "sentence", "content": "You may express your sadness that they’re leaving, but they may be poker-faced."}, {"type": "sentence", "content": "Because the fact is, if you are the one doing the dismissal, you are cutting their lifeline — even if it’s been ordered “from above” (by this I mean senior management, not heaven, just to clarify)."}, {"type": "sentence", "content": "You are the one with the power. And with great power comes — you know."}, {"type": "sentence", "content": "So, this final point asks for awareness. For many people, losing a job can lead to a spiralling crisis of self-belief, and increase the risk of depression and anxiety."}, {"type": "sentence", "content": "Every word you say and how you say it can influence how quickly your former colleague picks the pieces of their confidence back up. Pressure intended."}, {"type": "subtitle", "content": "Apply the 5 principles:"}, {"type": "sentence", "content": "It may just remind that person:"}, {"type": "sentence", "content": "And let me tell you, these mental pillars are crucial."}, {"type": "sentence", "content": "For me, they were absent. And this led to the biggest confidence spiral I’ve ever experienced."}, {"type": "sentence", "content": "And that, my friends, is a story for another day."}, {"type": "sentence", "content": "Ioana is a performer, social entrepreneur, management consultant, and failed product manager. She invests her time in challenging traditional narratives around work, human relationships and creativity."}], "topic": "leadership"}