{"title": "When We Went Inside", "data": [{"type": "image", "content": "https://miro.medium.com/max/1280/1*F7P9dpH9xYY_rrKLksSwgQ.jpeg"}, {"type": "subtitle", "content": "An agoraphobe’s advice on how to go out again"}, {"type": "sentence", "content": "Since the stay-at-home orders began in the United States in mid-March, I’ve been asked the same question over and over: “What is this like for you, since you’re, you know…agoraphobic?”"}, {"type": "sentence", "content": "I realize this is not a question that is asked of most humans, and that perhaps I ought to address it in some detail — not because my own story is particularly important, but because it may prove useful to others."}, {"type": "sentence", "content": "Lately, journalists ask The Question while interviewing me for stories about working from home, or about creativity, or about mental health. These are the only three things about which I am interviewed, except when I am on a book tour, or when the BBC World Service needs someone who is awake at 2 a.m. Pacific to say funny things about an unfolding American pop culture contretemps or sweet things about a newly dead comedian. I rarely say no to a harried British radio producer, particularly at 2 a.m. local time. I’m sober, so if I’m up that late, I’m surely not doing anything so interesting as “partying.”"}, {"type": "sentence", "content": "Some people ask The Question in a joking way that I’ve come to recognize as a transparent cloak for their own fear. “You must love this whole thing, right?” asked one guy I sort of know. He’s the middle-aged equivalent of a troubled teen boy, which is hardly uncommon. And I know he asked because he is scared, too."}, {"type": "sentence", "content": "My short, glib answer is, “Oh, this is my fucking Super Bowl.” But to answer bullshit with bullshit is generally not helpful."}, {"type": "sentence", "content": "So I decided to write a thoughtful essay on agoraphobia infused with aching lyricism and finely crafted metaphor. But honestly, after ten weeks of this shit, I’m tired and so are you. I decided to just tell you what happened to me, and how I am now, and what I’ve learned along the way."}, {"type": "sentence", "content": "I will talk about me, and then I will talk about you."}, {"type": "sentence", "content": "I had my first panic attack at around 8 years of age. I don’t remember it, but I am sure it was related to travel — planes, cars, and buses could be very scary places for some of the older people around me, and so it was for me, too."}, {"type": "sentence", "content": "Trains weren’t so tough for me. I despise motion sickness, to which I have always been prone — I can’t watch anything filmed with a shaky cam, which eliminates a great deal of self-consciously artsy indie cinema as well as some major action sequences in blockbuster features. But trains weren’t as bumpy as things that sped along a road or across the sky. And they made frequent stops, so I felt less trapped."}, {"type": "sentence", "content": "I am not a therapist, or a medical doctor, so let’s see what the brilliant folks at the world-renowned Cleveland Clinic have to say about all this:"}, {"type": "sentence", "content": "If you’ve never had a panic attack, suffice to say it is the exact inverse of an orgasm. If you’ve never had an orgasm, think of a panic attack as being an extended version of the moment right before you puke, when you’re terribly nauseous and would pay just about any sum of money for the feeling to end. If you’ve neither vomited nor climaxed in your life, I don’t know what to tell you."}, {"type": "sentence", "content": "This concludes the artistic literary metaphor portion of the essay. The Pulitzer Prize nominating committee may send my award to my television writing agents at Rothman Brecher Ehrich Livingston in Beverly Hills. I am sure my literary agent at Mendel Media would also accept it, and he’s in New York, which may be more convenient in terms of shipping fees. The Nobel Prize in Literature people can just fly me over to charming Scandinavia to pick it up."}, {"type": "sentence", "content": "It would not be fair to say I only experienced panic attacks because I grew up in an emotionally chaotic household, and that my brain was primed from early days to respond to meltdowns around me, using such time-honored methods as “defusing the tension bomb with humor.”"}, {"type": "sentence", "content": "It would also not be fair to claim this panic disorder, and later agoraphobia and suicidal depression, arose from a quirk of personal biochemistry alone. I tried to pin it all on luck of the genetic draw once on an episode of Marc Maron’s podcast, when I was there to promote my memoir, and Marc wouldn’t let me get away with it."}, {"type": "sentence", "content": "“I insist on family of origin being relevant,” he said, or something like that."}, {"type": "sentence", "content": "He was right, as I told him later, but at the time I was too worried about my mother’s potential reaction to get into it on the show. I grew up fearing my father’s disapproval and anger, and as I got older I began to fear my mom’s reactions more than my dad’s."}, {"type": "sentence", "content": "I’m sure I deflected Marc’s point with a joke. I don’t remember. I just know that I didn’t want to embarrass my parents, whom I love dearly and to whom I am enormously grateful, and that I didn’t want my mom to get mad at me. I don’t know that she would have, and of course I would’ve navigated any details with great care, but here is the most shocking revelation of this essay: I am a person who sometimes worries too much."}, {"type": "sentence", "content": "If you’re reading this essay, I suspect you do, too."}, {"type": "sentence", "content": "The panic attacks increased in strength as I got older, though the frequency was erratic. I could have a cluster of panic attacks during a particularly stressful time in my home life, and then go six months without having one. I didn’t know what they were until I was 16 years old. I thought I was getting sick, hyperventilating, overheating during exercise, or something mysterious and as-yet undiagnosed."}, {"type": "sentence", "content": "A panic attack represents a kind of metastasized fight, flight or freeze response. That’s the classic fear response in which the pupils dilate, the heart rate increases, breathing becomes faster and more shallow, the limbs tense, the stomach churns, and one automatically prepares to fight, flee or freeze. People often report breaking into a sweat, or feeling tingling up and down one or both arms. It’s quite common for someone to end up in the emergency room complaining of symptoms of a heart attack."}, {"type": "sentence", "content": "You can see how, after a lifetime of experiencing pseudo-heart attacks, one might grow tired of them. Exhausted, even. As a teen, I was given a medication that didn’t work. I didn’t ask for another one. I was already too tired."}, {"type": "sentence", "content": "By the time I was 21, I had grown actively agoraphobic, afraid to leave my apartment for fear of having another panic attack. I stopped going out for groceries, stopped going to classes at Emerson College, stopped eating much at all. I enjoyed getting smaller, not out of vanity, but out of the feeling that if I kept this up long enough, I might just disappear."}, {"type": "sentence", "content": "When you don’t eat, your brain can’t work properly. You get irritable, and then you get too weak to feel irritated. I appreciated that part, though logic took a long walk off the short pier of my brain around that time. I slept up to 18 hours a day. Eventually, I stopped leaving my bedroom except to occasionally use the bathroom. Sometimes I relieved myself in my bedroom."}, {"type": "sentence", "content": "The bedroom stank of acrid piss congealing in bowls beneath my bed, but at least I wasn’t outside."}, {"type": "sentence", "content": "The story of how I got better — a somewhat sanitized version of it, anyway — is contained in my memoir, Agorafabulous!: Dispatches From My Bedroom. It’s a fun book, and even funny, though generally not particularly amusing during the suicidal bits. I recommend it, and not just because I’m still paying off the tail end of my grad school loan and would appreciate your dollars. It’s the first of five books I’ve published thus far, and as a highly imperfect oldest child myself, I will always have a soft spot for it."}, {"type": "sentence", "content": "In short, I got on the right meds, went to the right shrink, did cognitive behavioral therapy and yoga, cut back on sugar and caffeine, learned to meditate, and went on with the rest of my life. The next ten years were bumpy in moments, but I got a B.A. in creative writing from Warren Wilson College and a graduate degree in teaching from Teachers College at Columbia University, promptly nuked my parents’ dreams of my professional stability by becoming a stand-up comic, signed my first book deal, lived in four very interesting states in various parts of the country, and worked with wonderful and terrible people in education, media and entertainment."}, {"type": "sentence", "content": "Now I’m 39. Things are pretty good, overall. I’m lucky. I’m sober. I’ve published five books, and hope to pitch another very soon. I have work. I have a few lovely close friends. I have a loving family back home on the East Coast, with a few relatives in other areas, as well. I have a cat who is a wonderful demon goddess. I’ve spent more of my adult life in love with travel than I have crouching miserably in my bedroom, filthy and alone, wracked with terror, rocking myself to sleep and crying."}, {"type": "sentence", "content": "That was the part about me, mostly. Now we are going to talk about you, mostly."}, {"type": "sentence", "content": "Are you dreading the moment when everything goes back to “normal,” when you’re expected to show up for family barbecues and work meetings and industry conventions and Little League games and school recitals again?"}, {"type": "sentence", "content": "Are you scared to go to the grocery store? Do you feel queasy in the car you used to drive with relative ease? Does the sunshine freak you out?"}, {"type": "sentence", "content": "I am here as an official, non-certified, non-professional non-provider of mental health services to inform you that your dread alone does not constitute a descent into agoraphobia. Congratulations on maybe “just” having an anxious response to a global pandemic and months of wild, terrifying uncertainty!"}, {"type": "sentence", "content": "It bears mentioning that a diagnosis of agoraphobia is made when a licensed, trained psychologist, psychiatrist, or psychiatric nurse practitioner (not a life coach or yoga teacher or Instagram essential oil influencer or an unlicensed yet enthusiastic mental health awareness advocate like me) evaluates a patient in the clinical setting, using the parameters set out in the most current edition of the Diagnostic and Statistical Manual of Mental Disorders, also known as the DSM-5."}, {"type": "sentence", "content": "The human condition is notoriously fraught with anxiety of the type that doesn’t need to be treated with therapy or medication. As a great philosopher never said, “It is what it is!” Maybe you just don’t want to deal with the assholes to whom you’re unfortunately related. Maybe you’re actually relieved to get to skip dropoff and pickup at school with those boring basics who unfortunately reproduced at roughly the same time you did and put the products of said reproduction in the same school as your own offspring."}, {"type": "sentence", "content": "You are not a jerk for appreciating a few of the surprisingly not-awful side effects of a global pandemic: the excuse to avoid people you can’t stand, the overtime pay if you’re fortunate enough to qualify for it as an essential worker, the furlough that caused financial stress but protected you from seeing or hearing your abusive boss for several weeks, the necessity of wearing a mask so you don’t need to do a full face of makeup."}, {"type": "sentence", "content": "Look, some of those elements are more superficial than others, but who cares? I’m not here to judge you for feeling joy or peace in strange moments at a terrible time. I’m right there with you. I’m here to talk to you about agoraphobia, a thing you may or may not experience in the next six to eighteen months. And my guess is that if you’re reading this article, you’re worried about experiencing it."}, {"type": "sentence", "content": "I say “six to eighteen months” because the lingering effects of trauma don’t generally pop up while the inciting event for said trauma is ongoing."}, {"type": "sentence", "content": "Where did I get that number? Honestly, I just remembered what I saw with friends who witnessed some of the events that took place on 9/11 and its immediate aftermath. Some of them were “fine” until they weren’t, and they found it particularly strange to experience their very first panic attack or 9/11-related nightmare in, say, March 2003."}, {"type": "sentence", "content": "Actual trauma experts like Dr. Bessel van der Kolk, M.D. (read The Body Keeps The Score, please) would be able to provide a better guesstimate."}, {"type": "sentence", "content": "My point is this: the brain works on its own timeline. Things will come up for you, or they won’t. But we won’t suddenly be out of the woods mental health-wise the day every city in America is 100% open for business and travel again."}, {"type": "sentence", "content": "If you find that anxiety interferes with your ability to perform such tasks as: ordering food by delivery, parenting, getting out of bed in the morning, falling asleep at night, making a phone call, answering a phone call, reading your text messages, taking out the garbage and recycling — and, eventually, when it is deemed safe, going to a gathering you’d otherwise enjoy, you aren’t alone."}, {"type": "sentence", "content": "If your anxiety persists, I suggest finding a licensed counselor, social worker, psychologist or psychiatrist who does talk therapy. Concurrently, it’s a wise idea to visit your general practitioner in order to rule out other underlying medical issues."}, {"type": "sentence", "content": "As I often say, “Everybody deserves a Yoda.” I would amend that to say that everybody deserves a Baby Yoda, but honestly we’d get nothing done — we’d just stare at that perfect being and squeal all day."}, {"type": "sentence", "content": "Let’s say your Yoda determines that you do, indeed, have agoraphobia. Welcome to the squad! Our meetings happen never. Don’t worry, you won’t necessarily end up pissing in bowls. In fact, that’s unlikely. The earlier you seek help, the likelier it is you’ll be able to manage your particular constellation of symptoms effectively."}, {"type": "sentence", "content": "Let’s return to the Cleveland Clinic for a bit about the treatment of agoraphobia, shall we?"}, {"type": "sentence", "content": "The article goes into more detail, but I can tell you that proper medication, CBT, mindfulness meditation, gentle physical exercise, creative expression through art, time spent in nature, and even pre-programmed soothing playlists for travel have been of enormous help to me. Check out the rest of the info from the Cleveland Clinic for more details."}, {"type": "sentence", "content": "By the way, have you been to Cleveland lately? It’s one of my favorite cities. I’d move there for the right reasons, though I love Los Angeles a lot. Cincinnati is also a real hoot. My friend Travis McElroy brought me there for a comedy gig last year, and I went all over the city by myself, eating and shopping and trying on clothes when we were allowed to do those things in public."}, {"type": "sentence", "content": "Now, the preceding paragraph appears to be an Ohiocentric digression, but I assure you we are en route to a larger point. I am not a future Pulitzer Prize winner in Literary Essays About Feelings for nothing, honey."}, {"type": "sentence", "content": "If I had not gotten help in my twenties and beyond, I would be dead by my own hand thanks to utter hopelessness as a result of the aforementioned symptoms. I know that in my bones, and in the rest of me, too. I would be dead. This is not an exaggeration."}, {"type": "sentence", "content": "Instead, I am a currently verifiably undead person who can tell you where she likes to eat and do comedy and do bookstore events in Cleveland, and Cincinnati, and Los Angeles, New York City, Boston, Chicago, Omaha, Denver, Seattle, Oregon, Michigan, North Carolina, South Carolina, New Hampshire, Florida, Washington D.C., Georgia, Texas, Ottawa, Toronto, Norway, Germany, the great state of New Jersey, plus places I can’t recall right now because there are simply too many of them."}, {"type": "sentence", "content": "My mother bought me a map of the United States and told me to mark every place on it where I’d traveled for a comedy show, or a book signing, or to speak at a university. I’m about a year behind and need to update it, but I keep it above my desk. It reminds me that great journeys are indeed possible, and that all I have is this moment. It also reminds me I’ve never booked a gig in Vancouver, which is absurd."}, {"type": "sentence", "content": "If you are suffering from a debilitating fear of going outside your own home, or enormous anxiety at the thought of having to leave your neighborhood or your town, know that there is help for you, and that you should seek it. Your journey with anxiety does not have to grow severe enough to warrant emergency attention. In fact, you can get in front of the issue with charming can-do American spirit, if not with can-do American universal healthcare coverage, as this does not currently exist."}, {"type": "sentence", "content": "I had the privilege of access to excellent mental healthcare. You and I and most of the rest of the world know this is a human right, but in the United States, it is not treated as such. People with money get more help. White people with money get the best help of all. To gloss over that aspect of the story would be to lie."}, {"type": "sentence", "content": "When I travel to speak about mental health awareness, I speak about the need for access to high quality care. Early treatment saves lives. Preventive care avoids so many crises. We could save so much money, so much time, and so much heartbreak as a society if we crafted a strong net to catch those who are falling."}, {"type": "sentence", "content": "Contact the National Alliance on Mental Illness for help in finding low-cost and no-cost mental health resources online and in your community. You may also find help through RAINN or through The Trevor Project. Local public health centers and even your local Planned Parenthood affiliate may have helpful advice on how to find affordable mental health providers."}, {"type": "sentence", "content": "I can’t tell you when the pandemic will end. I can’t tell you when you will get to go about your daily business as you please. I can’t tell you when you’ll feel “normal” again, whatever that means."}, {"type": "sentence", "content": "I can tell you that your fear is trying to tell you something. I can tell you that a trustworthy professional can help you interpret what seems unbelievably frightening. When you go down into those dark caverns of the self, bring a guide with a headlamp. You deserve that."}, {"type": "sentence", "content": "I can say, too, that you don’t need to drink or use drugs to deal with your fear. There are people who can help you stop doing that, and who will help you find a better way, if you are open to it."}, {"type": "sentence", "content": "I can tell you that if you work at it, you will have personal victories that bring you a great deal of joy. And that if you have a cat, that cat likely won’t give a shit about your self-actualization."}, {"type": "sentence", "content": "Go outside if you can. Wear a mask and stay away from other people. If you can take a walk in the woods with no one else around, take the mask off. Breathe. Put the mask on. Walk back inside."}, {"type": "sentence", "content": "There you go. That’s your victory for the day."}, {"type": "sentence", "content": "Your cat won’t care, but I’m proud of you."}, {"type": "sentence", "content": "We’ll get through this."}, {"type": "image", "content": "https://miro.medium.com/max/3992/1*Tr64NOcu00cSv877sbxk8g.png"}], "topic": "mental-health"}