{"title": "The Lazy Person’s Guide to Productivity", "data": [{"type": "subtitle", "content": "Work does not need to feel like work."}, {"type": "sentence", "content": "Humans evolved to be lazy. Several studies (1, 2, 3) have confirmed what we all intuitively know: we’re hardwired to avoid effort."}, {"type": "sentence", "content": "But there are at least five motivators with the power to spur us into action:"}, {"type": "sentence", "content": "If we understand these basics, we can coax the lazy human mind into a state of natural and consistent productivity. And when this coaxing is complete, your average month could end up looking like this:"}, {"type": "sentence", "content": "An average of 12 productive hours per day — not bad for a typical lazy human. Here are the five key insights that made it happen."}, {"type": "subtitle", "content": "Relax in Luxurious Productivity"}, {"type": "sentence", "content": "1 I’m writing to you from under a comfy duvet on a recliner in front of my big-screen TV (that serves as a computer screen) with my favorite music in the background and a nice cup of tea on the table beside me."}, {"type": "sentence", "content": "It’s strange to think that this qualifies as productivity. Yet, over the past year, this luxurious working position churned out 14 peer-reviewed scientific papers, 12 popular science articles, about 250 short personal development blog posts, and 10 Medium articles."}, {"type": "sentence", "content": "Allow your mind to work in total relaxation and luxury, and it will confuse laziness with productivity. This may be the best kind of confusion there is."}, {"type": "subtitle", "content": "A Huge Carrot — Far, Far Away"}, {"type": "sentence", "content": "2 Many personal development authors will encourage you to dream big and set ambitious goals. This is well and good, but we need to be a bit nicer to our lazy minds if we want their long-term cooperation."}, {"type": "sentence", "content": "Yes, have big dreams and grand ambitions, but give yourself ample time to make them happen. And by ample time, I mean decades."}, {"type": "sentence", "content": "There’s a nice word for this: Purpose."}, {"type": "sentence", "content": "Every lazy mind secretly dreaming about fame and fortune needs an inspirational — nay, an awe-inspiring — long-term purpose."}, {"type": "sentence", "content": "My awe-inspiring purpose is to help save the world by solving our great 21st-century sustainability challenge: Quadrupling the global economy while bringing CO2 emissions below zero."}, {"type": "sentence", "content": "This carrot is so big that shiny that I can see it clearly, even though it’s still decades away. Its sheer enormity also creates a strong gravitational field that continuously draws me in. No willpower required!"}, {"type": "subtitle", "content": "Endorphin Hill on Purpose Boulevard"}, {"type": "sentence", "content": "3 Productivity can be genuinely exhilarating. If your body is filled with feel-good endorphins while working, getting stuff done just feels right."}, {"type": "sentence", "content": "There’s a nice word for this too: Flow."}, {"type": "sentence", "content": "You’re likely to encounter plenty of flow-inducing endorphins on the long and winding road to your purpose. So the first thing to do is to claim your personal liberty so that you get to spend more time on this scenic road."}, {"type": "sentence", "content": "But more time on Purpose Boulevard does not automatically bring endorphins pouring down from the heavens. Nope, endorphins like to gather at particular points along this route: atop the Endorphin Hills."}, {"type": "sentence", "content": "It takes plenty of effort to get the human mind so engrossed in a task that it enters a state of flow. In other words, we must make the hike up Endorphin Hill if we want to enjoy the exhilarating descent on the other side."}, {"type": "sentence", "content": "To master this vital life skill of hill climbing, try the old Nike slogan with a little twist: “Just do it — mindfully.” In other words, climb Endorphin Hill with your mind firmly in the present. If you manage to let go of the past and the future, you might even enjoy this scenic hike."}, {"type": "sentence", "content": "And for those times when the climb just looks impossible, we can always call on the motivating power of a few strategic sticks."}, {"type": "subtitle", "content": "Wielding the Strategic Stick"}, {"type": "sentence", "content": "4 Stick-driven productivity is a dangerous game that should be played with caution. Humans can be highly productive with a scary stick hovering over their heads, but there’s always a longer-term price to pay."}, {"type": "sentence", "content": "In our modern world, an extended period of stick-driven productivity usually leads to burnout — a state devoid of all inspiration, characterized by zero productivity and bursts of self-destructive consumption."}, {"type": "sentence", "content": "Thus, we must employ the stick for one strategic purpose: Chasing us up the toughest Endorphin Hills. But first, make sure the previous three steps are firmly in place so that the stick is rarely needed. Otherwise, burnout awaits."}, {"type": "sentence", "content": "I employ RescueTime as my strategic stick. It works on a simple rule: log at least 200 hours of online productive time every month or donate $100 to charity. Since I started this practice a year ago, I’ve added about 70 hours of productivity to every month without any additional donations."}, {"type": "image", "content": "https://miro.medium.com/max/1512/1*uBZ6PbW10_wY5-IZL6LoOg.png"}, {"type": "sentence", "content": "But there is another way to increase your productive time: removing distractions. Here, some simple replacement therapy can work wonders."}, {"type": "subtitle", "content": "Productive Distractions"}, {"type": "sentence", "content": "5 There are thousands of apps and websites out there that sell you effort-free and addictive distractions. And our bored and lazy minds just lap it up, much to the detriment of our health and productivity."}, {"type": "sentence", "content": "So, what happens when you veto all these distraction-mongers? Serious detox symptoms? Bipolar mood swings? Clinical depression?"}, {"type": "sentence", "content": "Well, no. At least not when you present your boredom with more productive alternatives. In my case, I humbly presented my mind with a rather neglected guitar and piano, a Headspace subscription, a massage chair, some funny Norwegian comic books, and a lovely lake for daily walks (pictured below)."}, {"type": "sentence", "content": "And it accepted. No questions asked."}, {"type": "sentence", "content": "Thus, in addition to being more productive, I’m now more musical, mindful, relaxed, fluent in Norwegian, and physically active. Pretty good deal!"}, {"type": "subtitle", "content": "Lifelong Productivity, Inspired by Laziness"}, {"type": "sentence", "content": "Humans are not robots. We’re lazy apes with a big evolutionary aversion to effort, but an equally big and curious brain."}, {"type": "sentence", "content": "Hence, willpower doesn’t work. But strategy does."}, {"type": "sentence", "content": "The specifics in the strategy shared above will not work for everyone. We all have unique lives with their unique constraints and opportunities."}, {"type": "sentence", "content": "However, I believe that these principles are generically applicable. They have the potential to save many souls from a lifetime of producing for survival in the paycheck-to-paycheck grind of consumerist society."}, {"type": "sentence", "content": "Play these principles well, and you’ll get to spend your days chasing big shiny carrots in an endorphin-filled flow from a paradoxically productive position of luxurious comfort."}, {"type": "sentence", "content": "May you follow your laziness down Purpose Boulevard, over the rolling Endorphin Hills, to a life you truly love living :-)"}], "topic": "productivity"}