{"title": "What is EMDR?", "data": [{"type": "subtitle", "content": "How your brain recovers from trauma"}, {"type": "image", "content": "https://miro.medium.com/max/3678/1*fU2prodC4dIDWHFhUellrA.jpeg"}, {"type": "sentence", "content": "Throughout a typical day your brain is constantly doing two things. First, you are taking in sensory information from your five senses, that is, what you see, hear, smell, taste and touch. At the same time another part of your brain is creating a story about what all this sensory information means: for example that you are now waking up, then going to work, going to an appointment, coming home, and going to bed. A healthy memory is made up of these two parts joined together: the sensory information along with the story we tell ourselves about what happened, the meaning we make of our five senses."}, {"type": "sentence", "content": "As you sleep, your brain then sorts through the events of the day. These whole, two-part memories — the sensory data plus the meaning we made of them — are then stored in long-term memory, similar to how two halves of a book might be closed together before the book can be put away on a bookshelf."}, {"type": "sentence", "content": "Something very different happens, however, when we experience an event that is overwhelming, something that is beyond our ability to cope. When we experience a traumatic event the brain does an amazing thing to protect us from the pain of what is happening: it shuts down the part that makes meaning of our experience. We may “check-out” from what is happening altogether. As a result, the sensory information of what happened is not able to be joined with a story of what happened. This creates an un-whole memory that is unable to be processed and stored in long-term memory. Flashbacks, intrusive thoughts and nightmares are like an open book lying on the floor of your mind: you’ll keep tripping over it until you can find a way to close it and put it away on the shelf. This is why traumatic memories can still feel so vivid even when they happened a long time ago."}, {"type": "sentence", "content": "When we are not able to make accurate meaning of what happened, a second thing also usually occurs with traumatic events: we learn false negative lessons about ourselves from what happened. For example, it is common for abuse survivors to internalize the lesson, “I’m bad” from their abuse, even when they are in no way at-fault."}, {"type": "sentence", "content": "In order to heal such unhealthy memories, we have to do two things. First, we need to learn to desensitize ourselves to the memories, so that they are no longer triggering. Second we need to reprocess them with a healthy belief about ourselves. By doing so, the sensory information from the memory can finally be paired with a healthy story of what happened. The memory, now whole, can finally be stored in long-term memory. The book can finally be closed and put away on the bookshelf where it belongs."}, {"type": "image", "content": "https://miro.medium.com/max/2290/1*vGddg7i-Npz35GlTuEJhNA.png"}, {"type": "sentence", "content": "Research has shown that one way to help desensitize and reprocess memories is by alternately stimulating the left and right-hand sides of the brain. One way to do this is by moving the eyes to the left and right, something that, remarkably, happens naturally as we sleep. Another way is to alternately tap on the left and right hand sides of the body, for example on the hands or knees. Treatment that utilizes these techniques is known as Eye-Movement Desensitization and Reprocessing, or EMDR. While originally developed for the treatment of trauma, EMDR can also be effective for other persistent issues such as anxiety, depression, body image, or a loss of sense of meaning in self, others and the world."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*hkBFbyd8f229q6w97-jAaA.jpeg"}, {"type": "sentence", "content": "A first step of EMDR treatment is to equip you with tools and techniques that empower you to manage your arousal. Only when you feel proficient with these tools do you move on to processing past memories at a pace that feels safe to you."}, {"type": "sentence", "content": "At the conclusion of EMDR treatment, the goal is being able to merely recall these memories rather than being forced to re-live them, to merely have memories rather than feeling like the memories have you."}, {"type": "sentence", "content": "Peter W. Pruyn (“prine”) is a psychotherapist in Northampton, Massachusetts, a member of the New England Society for the Treatment of Trauma and Dissociation (NESTTD), and author of Peter’s Psycho-Ed Handouts: Client Handouts and Therapist Resources for Trauma, EMDR, and General Psychotherapy."}, {"type": "sentence", "content": "For more by this author, try:"}], "topic": "neuroscience"}