{"title": "Better Sleep and Self-Regulation Through Binaural Beats", "data": [{"type": "subtitle", "content": "Binaural beats advocates claim just this plus more, but are they right?"}, {"type": "image", "content": "https://miro.medium.com/max/2548/1*-A8gN_eZqas3fSc7r4ddvg.jpeg"}, {"type": "sentence", "content": "Okay, I have the reputation of sleeping anywhere."}, {"type": "sentence", "content": "Sunny car trip. Check. Airplane flying through a lightning storm. Check. Greyhound bus from New York City to Baltimore, drooling on a kind woman’s shoulder. Check. Hey! I was just a kid."}, {"type": "sentence", "content": "So, when I’ve had problems falling asleep the past month, I needed a solution."}, {"type": "sentence", "content": "My eyes immediately fell onto the psychedelic colors and the claims of thousands of “binaural beat” videos on YouTube."}, {"type": "sentence", "content": "What?!? Look at all of the things listening to this music can apparently bring. I mean this is like a pharmaceutical ad without the fine print."}, {"type": "sentence", "content": "Okay, this last one really made me question these claims. I mean is this the Holy Grail of sleep or the Fountain of Youth here? (Which BTW, you can go to, and I have been to during a stint in the sunshine state)."}, {"type": "sentence", "content": "Are these Youtubing binaural beats pushers just the snake oil peddlers for millenials? (Not that they would be the first. How is someone getting paid to unwrap candy eggs? How?)"}, {"type": "sentence", "content": "But what really caught my eye were the ones that said, “Fall Asleep Fast.”"}, {"type": "sentence", "content": "I’m open-minded. What’s the worse thing that can happen? (Other than some mind control action)"}, {"type": "sentence", "content": "Well, the best that could happen did. I literally fell asleep within five minutes. Okay, so something is going on. Let’s unpack this."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*eViP_LP0QBdsPMTQ-_tGrw.jpeg"}, {"type": "subtitle", "content": "What are Binaural Beats?"}, {"type": "sentence", "content": "The first thing to know is that there are not actually any beats. The concept behinds binaural beats is that they play a single droning sound, but with a frequency just different enough in each ear to trick your brain into thinking there is a beat."}, {"type": "sentence", "content": "Binaural beats work best when you are wearing headphones, because one side plays a sound frequency different than the other side. This tricks your brain into thinking there is a tiny pulse or a beat happening. This is actually an illusion and to work the frequency needs to be less than 1000 Hz and the difference not more than 30 Hz."}, {"type": "sentence", "content": "Basically, the brain is trying to come to terms with two different sound waves and finds a frequency somewhere in the middle, creating a beat. This balancing is, of course, very comforting to a libra such as myself."}, {"type": "sentence", "content": "Okay, so they are a real thing, but can binaural beats affect our health?"}, {"type": "subtitle", "content": "What’s the Science Say?"}, {"type": "sentence", "content": "As a scientist, I was pleasantly surprised to find out that there are in fact peer-reviewed papers on this — no offense to all of the YouTube stars out there."}, {"type": "sentence", "content": "On the other hand, Discover Magazine put out a bit of a scathing review of the science behind these claims, using flavorful words such as “allegedly”, “bold claims” and “cottage industry”. Perhaps living in San Francisco makes me a little more woo woo and I decided to dig in anyways. Healthline scientists seem to think there might be some benefits. I’m not deterred."}, {"type": "sentence", "content": "Essentially once the sound waves enter your brain they begin to vibrate at the frequency of the binaural beats known as entrainment of neural oscillation. Entrainment is basically what happens when you put two or more objects near each other, and they eventually become in sync. This is what Dutch physicist Christiaan Huygens found in 1665 when he left two pendulum clocks over night and came back to find the pendulums had synchronized. How romantic. Entrainment also happens with nearby electric dryers, the flash of fireflies (my favorite part of summer), and even the hearts of couples in love."}, {"type": "sentence", "content": "In the brain the binaural beats can affect EEG rhythms in almost all frequency bands, including theta, beta, and gamma bands. Normally, each EEG rhythm is associated with a particular activity, cognition, or behavior. For example, gamma oscillations are associated with the maintenance of arousal of the brain during the awake stage, while theta oscillations are found during meditation and associated with alertness, attention, orientation, and working memory, including the enhancement of cognitive and perceptual performances."}, {"type": "subtitle", "content": "Binaural Beats Can Help Reduce Anxiety and Make Us Happier"}, {"type": "sentence", "content": "Ultimately we are responsible for making ourselves happier, but tools are always nice. The claims about binaural beats reducing anxiety and improve mood seem to be true."}, {"type": "sentence", "content": "Listening to binaural beats between 16 and 24 Hz can improve performance and reduce negativity. Binaural beats in the theta range of 4–7 Hz can put you into a meditative state and reduce negativity. Anxiety levels in people getting ready for surgery were cut in half with binaural beats and also reduced in people waiting in the emergency room."}, {"type": "image", "content": "https://miro.medium.com/max/1820/1*sCqvFKUP6lqP1Pibi_CSxA.jpeg"}, {"type": "subtitle", "content": "Binaural Beats Can Improve Deep Sleep and Memory"}, {"type": "sentence", "content": "Sleep and memory are closely intertwined, so improving sleep can also improve memory. One piece of why binaural beats work well during sleep is that our hearing is the only sensation fully active during sleep. Good for when you want to hear someone breaking down your door. Bad for when you accidentally leave your phone notifications on."}, {"type": "sentence", "content": "Binaural beats can improve some of the most important type of sleep, slow wave sleep. Slow wave sleep or the N3 stage is when the body heals or repairs itself and sends our memories from short-term into long lasting memories. Playing binaural beats in the delta range of 0.5 to 4 Hz can increase the amount of slow wave sleep. This is the type of sleep we need to be refreshed in the morning and many people miss out on with daily stresses. It’s also the type of sleep we need to store non-emotional fact-based memories. So, if you think your friend is wrong, just assume they didn’t get enough slow wave sleep, because of course you are right."}, {"type": "sentence", "content": "Binaural beats can also improve memory while awake. Binaural beats increase memory by as much as classical music, at least in high school students. Using a range of 4–7 Hz can improve learning and memory encoding, 13–30 Hz can improve word recall and long-term memory, and 30–50 Hz can improve short-term memory."}, {"type": "subtitle", "content": "How Do You Use Binaural Beats?"}, {"type": "sentence", "content": "All you need to experiment with binaural beats is binaural beat audio (thank the Youtubers again for the plethora of options) and a pair of headphones or earbuds. As mentioned earlier, for a binaural beat to work, the two tones have to have frequencies of less than 1000 Hz, and the difference between the two tones can’t be more than 30 Hz. You can experiment with the length of time you listen to the binaural beats to find out what works for you. (Binaural beat technology could be a problem if you have epilepsy, so you should speak to your doctor before trying it.)"}, {"type": "sentence", "content": "Note: Nothing was found about binaural beats tackling wrinkles, so I guess botox wins out this time. Though better sleep equals better skin."}], "topic": "neuroscience"}