{"title": "Lessons from the Trenches: Building a Deep-Tech Startup", "data": [{"type": "sentence", "content": "Almost three years in the startup world, especially in the deep-tech space, has been quite the roller coaster ride. It has also been packed with valuable experiences. In this article I will share some lessons learned along the way, which I hope will be useful for prospective tech entrepreneurs."}, {"type": "image", "content": "https://miro.medium.com/max/3802/1*lQemZQ4YOZ31yAne5EV24A.jpeg"}, {"type": "subtitle", "content": "Validation First"}, {"type": "sentence", "content": "Entrepreneurs are dreamers. We dream of a future improved by our ideas, and we work hard to make them a reality. This desire to ‘disrupt’ the status quo and impart change is inherent in all entrepreneurs."}, {"type": "sentence", "content": "However, dreaming without an objective mindset could, more often than not, lead to tunnel vision, and ultimately failure. Even dreams need to be measured up against the cold reality of the market. Sometimes that means the market is not ready for the solution, or the need is not as pronounced as you thought, or the barriers to entry are high, etc… Did you know that the number 1 reason startups fail is because there is no real market need for the solution?"}, {"type": "sentence", "content": "I had to learn to be more objective from the get-go, and that was hard work. It is hard not to force your biases on reality, especially with a tech idea close to your heart. But one has to let go of that attachment to be able to step back and validate the idea objectively. This is why I strongly believe in validation first. The more time spent developing a solution prior to validation, the more attachment one has to it, and the less objective one is."}, {"type": "subtitle", "content": "Long Product Development Cycle"}, {"type": "sentence", "content": "Many deep-tech solutions originate in academic institutions, where time is abundant, labor is cheap (Masters and PhD students), and infrastructure is readily available. Thus, spin-off startups from academic institutions do not spend the bulk of their time on product development, since most of the research has already been done."}, {"type": "sentence", "content": "We on the other hand, wanted to validate first, which meant that the entire product development cycle was going to take place within the company. This created a challenge for us, since unlike academia we did not have the luxury of time, money or research infrastructure. We had some initial ideas on how to develop the product (given our technical training), we got a few grants, hired our first employee, met weekly to discuss progress, and outsourced experiments when possible in order to make it happen. We managed to develop a proof of concept after 2 years of hard work and limited resources, which was no small feat."}, {"type": "subtitle", "content": "The Right Team"}, {"type": "sentence", "content": "I cannot emphasize enough the importance of the team, especially in the early days of a startup. I am not talking here about the co-founders, since that is a separate topic, but rather the team assembled around the co-founders. We learned quite early on that in addition to technical expertise, it is imperative that our employees have the right attitude. Here are three characteristics that we have found to be very important in addition to technical skills:"}, {"type": "sentence", "content": "1. Willingness to face challenges and to problem solve creatively. It is normal for us to feel discouraged when faced with difficulties, and believe me there are lots of those in the startup world, but it is dangerous if we remain in a state of discouragement. Therefore, employees working in deep-tech startups need to understand that there will be more challenges, and they will need to be driven towards finding creative solutions, and not to get stuck in a state of discouragement."}, {"type": "sentence", "content": "2. Going beyond the call of duty. This is to be expected when working in a startup environment. There will be times when we have to meet tight deadlines or deal with unexpected circumstances, and employees have to be comfortable with going the extra mile. From experience, those who are passionate about the work they do and the company’s values, are the ones who are willing to go all in during times of need. This attitude pays off in the form of career growth within the company."}, {"type": "sentence", "content": "3. Fostering a Positive Team Spirit. The team needs to have an understanding that everyone is in it together, and that the success of a startup is dependent on each and every member. This is particularly true in the early days of a startup, when every individual has a significant impact on its success or failure. This sense of unity is more than doing team activities, it is about truly caring for each other and being there when needed."}, {"type": "subtitle", "content": "Not All Money is Useful Money"}, {"type": "sentence", "content": "Startups love free money, but not all money is useful. We have refused tempting government grants and subsidies because they had strings attached or would not add value. This might sound strange — I’ll give you an example. There was a government wage subsidy to hire grad students/Postdoctoral fellows to work on a project in collaboration with academia. While that sounds good in principle, there were many uncertainties: who would own the Intellectual Property, would we have a say in publishing company-specific proprietary information, would the student/Postdoc prioritize other projects and not focus on ours, etc… So we decided it was not the right time for this grant. I believe in being very discerning as to where we spend our time and effort. Just because it is free does not mean it is useful."}, {"type": "subtitle", "content": "Getting Involved in the Startup Ecosystem"}, {"type": "sentence", "content": "We would definitely not be here today if it weren’t for the Canadian startup ecosystem. From District 3, the Concordia-based incubator that believed in us when we first started, to other organizations (MEI, Ecofuel, Innovacorp and others) that funded us, introduced us to mentors, and provided valuable resources, we have benefited enormously from Canada’s startup network. Being an active participant in the ecosystem puts you on the radar for future investors, customers, mentors, employees and even co-founders. It is amazing what a ‘small world’ this network is. For example, word about our success in the Creative Destruction Lab program spread quickly, generating excitement around us. Do not build a startup in isolation when you have access to a remarkable startup network; tap into it."}, {"type": "sentence", "content": "Part of being an active participant also means giving back to the community. I am a regular speaker at District 3, talking to prospective tech entrepreneurs about our journey and the challenges we have been facing so far. I also started coaching graduate students who aspire to become entrepreneurs. It is rewarding to see a new generation of scientists who are taking entrepreneurship seriously and believe in commercializing their research."}, {"type": "sentence", "content": "One last word, and probably the most important thing to mention, one should always have the mindset of a student rather than an expert when it comes to entrepreneurship. The reason is simple. Things around us are constantly changing, and that rate of change is accelerating. Not only that, but unexpected events like the COVID-19 pandemic have pulled the rug out from under our feet, and demanded that we re-think all our future plans and strategies."}, {"type": "sentence", "content": "A thirst to learn, an openness to change, and a humble attitude can go a long way in this journey."}], "topic": "startups"}