{"title": "Your Very Detailed Guide to Safe Summer Road Trips", "data": [{"type": "subtitle", "content": "The good news: Cars may be the safest way to go right now — just pack your hand sanitizer"}, {"type": "image", "content": "https://miro.medium.com/max/10928/1*rt9sKnF9TUJz3zWXKubiaA.jpeg"}, {"type": "sentence", "content": "As states begin to reopen, and air travel remains risky, travelers and health experts alike seem to agree that this may well be the Summer of the Road Trip."}, {"type": "sentence", "content": "“Out of all the possible travel scenarios, a road trip has to be one of the best options,” says Jack Caravanos, DrPh, a clinical professor of environmental public health sciences at New York University School of Global Public Health. “Rental cars are heavily sanitized these days and of course, if it’s your own car you know it’s a safe environment.”"}, {"type": "sentence", "content": "Still, traveling safely during this time will require much more planning than usual, says Marissa Levine, MD, the director of the Center for Leadership in Public Health Practice at the University of Southern Florida. “It’s going to take a lot to create your best trip while also being adaptable to uncertainty.”"}, {"type": "sentence", "content": "Here’s what you need to know."}, {"type": "subtitle", "content": "Navigating rental cars"}, {"type": "sentence", "content": "In response to concerns about the coronavirus, most rental car companies are taking serious cleaning and disinfecting measures. Hertz recently announced that all cars will receive its “Gold Standard Clean,” an in-depth, CDC-compliant cleaning and disinfecting procedure. National launched a similar initiative with its “Complete Clean Pledge” and Avis also advertises an in-depth cleaning protocol on its site. Before booking a rental car, it’s worth doing some research to verify that the rental company you’re considering is going the extra mile to sanitize vehicles between customers."}, {"type": "sentence", "content": "If you want to err on the side of caution, you could drive with the windows down in a rental car if it makes you feel more comfortable. However, multiple experts note that this is really not really necessary. “We don’t see much evidence of the virus living in the air of the car or in the ducts of the vents,” says Kumi Smith, PhD, an assistant professor of epidemiology and community health at the University of Minnesota. “From what I know right now, I personally wouldn’t be too concerned about driving with the AC on in a car or driving with the windows up.”"}, {"type": "subtitle", "content": "How to handle bathroom breaks"}, {"type": "sentence", "content": "Finding and using a public restroom is a necessary risk on the road. Two recent road trippers I spoke to both told me it was more difficult than usual to find places to stop along their respective routes given the number of establishments still closed to dine-in customers. Both cited the gas station chain Pilot as having multiple locations along the routes they took — and clean-looking facilities, no-touch fixtures, hand sanitizer stations outside the restrooms, and signage about the extra precautions. Of course, even the cleanest-looking restroom could still contain the coronavirus, but precautions like these do seem to indicate a facility is taking the situation seriously and doing their best to keep customers protected."}, {"type": "sentence", "content": "“I don’t think you need to wear gloves [in a public restroom], but you need to immediately wash your hands thoroughly after using the facilities,” Caravanos says. Once you step out of a public restroom, he also recommends always using hand sanitizer as an additional disinfecting precaution."}, {"type": "sentence", "content": "“We do have some evidence that the virus might be present in fecal matter,” adds Eleanor Murray, ScD, assistant professor of epidemiology at Boston University’s School of Public Health. “Because a lot of public restrooms don’t have lids that close, they can generate a spray of viral particles when you flush,” she says. To minimize risk on that front, Murray suggests taking a few precautions beyond just hand sanitizing: wear a face covering and don’t use the hand dryer (it can cause virus particles to circulate)."}, {"type": "sentence", "content": "Both Murray and Levine think it’s also a good idea to pack your own supply of paper towels to use in public restrooms in the event that none are available. Put these in your pocket before entering and use one to shut off the faucet and open the door. Then, immediately discard that paper towel and use hand sanitizer."}, {"type": "sentence", "content": "Last, remember that social distancing rules still apply in public restrooms. If there is a line, make sure each person is six feet apart. If it’s incredibly crowded, it may be worth trying to find an alternative place to go. Murray recommends seeking out single-stall restrooms whenever possible. Not only will it mean less exposure to other people, but it will also mean less frequent flushing which will lower the risk of potential viral particles circulating in the air."}, {"type": "subtitle", "content": "Where to eat"}, {"type": "sentence", "content": "A road trip won’t quite feel like a road trip if you can’t stop at restaurants along your route. If you are in a state where restaurant dining rooms are open, and proper protocol is being taken (employees wearing face masks, six feet of separation between tables, etc.) Caravanos says, “I don’t think it’s terribly risky to eat there.” (Of course, if dining in makes you too nervous, takeout remains fairly low-risk.)"}, {"type": "sentence", "content": "Being as safe as possible when dining out will require some additional planning. The first thing you’ll need to know is if you’re in a state or a city that allows dine-in customers. The best place to look for this information varies from state to state. Some states have reopening information available on dedicated pages about the coronavirus (like this) while others are sharing reopening guidelines on their department of health websites (like this)."}, {"type": "sentence", "content": "Levine suggests calling the restaurant you have in mind ahead of time to find out exactly what precautions the facility is taking to protect against Covid-19. (You can get an idea of what protocols the CDC suggests here.) “Have some idea of what either the local or state order requires and then gauge how well the facility is meeting it,” she says. “If you walk into a place and it doesn’t look like any of that is being done, be ready to walk out.”"}, {"type": "subtitle", "content": "How to safely stop for gas"}, {"type": "sentence", "content": "The biggest risk you’ll face when filling up on gas is exactly what you might expect: The virus particles that may be present on the gas pump and credit card touchpad. Caravanos says using hand sanitizer immediately after either of these should be enough of a preventive measure."}, {"type": "sentence", "content": "As far as what to do about using your credit card at a pump, that’s sort of a gray area. “I struggle with this, honestly,” says Caravanos. Should you wipe it down even after placing it in a credit card slot? “It certainly can’t hurt,” he says."}, {"type": "sentence", "content": "In states like New Jersey and Oregon where you cannot pump your own gas, Caravanos recommends asking if you can swipe your own credit card rather than handing it over to an attendant. If you do have to hand your card over, this is a time when you definitely should disinfect it before placing it back in your wallet."}, {"type": "subtitle", "content": "Where to sleep"}, {"type": "sentence", "content": "The health experts I spoke to had varying takes on just how risky staying in a hotel or motel room might be this summer. Caravanos says that given the increased sanitation measures hotels are taking to make customers feel comfortable, the risk is quite low. Murray, on the other hand, is hesitant about the idea of staying in a different hotel every night. More movement means more potential exposure."}, {"type": "sentence", "content": "If campgrounds are open by the time you embark on your trip, this could be a slightly safer option as campsites are more isolated than hotels and are primarily outdoors. However, Murray notes that the shared restrooms and eating areas commonly found in campgrounds are still places where you would want to be extra careful. As an alternative to larger, state-run campsites, travelers could consider finding a campsite through something like HipCamp, an Airbnb-like service that allows customers to camp out on private land. These campsites sometimes come with private restrooms and picnic tables."}, {"type": "sentence", "content": "As a happy medium between these two options, Murray thinks this could be an ideal time to bring back RV travel, if you’re able to find one to rent, given the recent 650% increase in RV rental reservations. In this more controlled scenario, you can hit the road with a private restroom and built-in accommodation in tow. “All you have to worry about is what the local rules are in terms of which sites you can visit and whether or not you need to wear a mask,” Murray says. Meals would still be one of the risks here, whether you’re going into grocery stores or eating out. “It’s a little tricky in that if someone does get sick because you can’t isolate in an RV, but then, I suppose if someone does get sick you can just drive home.”"}], "topic": "travel"}