{"title": "Biofuels, a way into the future?", "data": [{"type": "subtitle", "content": "Biofuels are here to stay, but are they really helping?"}, {"type": "image", "content": "https://miro.medium.com/max/8512/1*7yYpdJ9i_EwhCanzzIdVYw.jpeg"}, {"type": "sentence", "content": "Oil is problematic. It pollutes the environment, it’s limited in supplies, and the supplies that we do have are mostly controlled by a few key players. Unsurprisingly, there have been many, many developments over the years to solve these issues, ranging from cars powered by batteries to hydrogen cells, and biofuels. Of course, nowadays electric cars are undoubtedly more popular than the other alternative sources of mobile energy, with sales that seem to want to grow exponentially forever, and an ever-expanding selection of vehicles. Yet, it’s worth talking about biofuels, as they’ve managed to gain quite a foothold in our current energy usage for transportation, and they represent a big part of the carbon reduction strategies of many countries going forward. Knowing this, are biofuels a good option for our future?"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*M1TxMDpVgSzT2M4UmR_9Rg.jpeg"}, {"type": "subtitle", "content": "What are biofuels, and where do they come from?"}, {"type": "sentence", "content": "While there are many types of biofuels, we’ll focus on ethanol and biodiesel, the two that are most commonly used in transportation, at least in terms of ground transport. There are also biofuels for planes and boats, but those are quite rarely used in comparison."}, {"type": "sentence", "content": "Ethanol, also known as bioethanol, has become quite ubiquitous, owing to the fact that many countries have set out targets for blending gasoline with ethanol, with many making it mandatory to reach these. With car manufacturers on board, most modern cars are capable of easily running a 10% blend, often called E10, which explains why you’ll often find it at many of the pumps you’ll run across. Sourced by fermenting the sugars that can be found in biomass, it can be made from a wide variety of crops, such as corn (most popular in the United State), sugar cane (most popular in Brazil), or even wheat (most popular in Europe), making it easy to find a crop that suits the local climate."}, {"type": "sentence", "content": "Whereas ethanol is sourced from fermenting sugars, biodiesel comes from vegetable oils, or even animal fats. Biodiesel’s popularity varies strongly depending on where you are, as diesel vehicles are not as frequently found everywhere. For instance, Europe’s most common biofuel, by a wide margin, is biodiesel, but it also has one of the largest fleet of privately owned diesel cars anywhere in the world. Meanwhile, in the United States, biodiesel production represents only a small fraction of bioethanol production. While not all diesel engines can run at high blend levels, with a lot staying under 5%, it is quite common to find vehicles running B20, or a 20% blend."}, {"type": "image", "content": "https://miro.medium.com/max/7252/1*UoHsbyIhc6kM6U5TAjjfLA.jpeg"}, {"type": "subtitle", "content": "A stable supply of energy?"}, {"type": "sentence", "content": "As you might expect from the fact that most biofuels are blended with regular gasoline or diesel before being used, there is no way for them to guarantee, on their own, a stable supply of energy. In 2018, the United States consumed roughly 143 billion gallons (541 billion litres) of finished motor gasoline, with only about 10% of that amount coming from fuel ethanol. Similarly, Europe was estimated to have 7.3% of its biofuel use in transportation come from biofuel, with a target for 10% in 2020, and 14% in 2030. As a point of comparison, nearly 27% of Europe’s oil imports came from Russia alone. There’s no denying that biofuels are helping to diversify the sources of energy for transportation, but its total impact remains relatively small when contrasted to how much control certain countries have over the world’s oil supply."}, {"type": "image", "content": "https://miro.medium.com/max/10186/1*ELjGUZ39OCVxRHZhmcZxvw.jpeg"}, {"type": "subtitle", "content": "Food prices"}, {"type": "sentence", "content": "Since biofuels often come from edible crops, it’s not surprising that almost any conversation about biofuels will inevitably lead to the question of food prices. Fortunately, this also means that a decent amount of thought and research has been put into this issue. The answer, while not as clear-cut as you might expect, is that yes, increasing biofuel production also increases the cost of food. For instance, a review of 157 estimates on the impact of ethanol production found that increasing the production of corn ethanol by one billion gallon (3.79 billion litres) in the United States would lead to a 3% to 4% increase in the cost of corn."}, {"type": "sentence", "content": "Still, as mentioned, there are variables that can make these numbers change in ways that make them a lot less drastic. For one, biofuels can be produced from a multitude of crops, not all of which are fit for human consumption, and some of which can be grown where otherwise nothing of value could. There is also a growing trend to produce biofuels from feedstock that would otherwise have gone to waste, called cellulosic ethanol. It makes use of the crop’s fibre, rather than its fruit. It’s also possible that rising prices may be partially mitigated by the creation of jobs through biofuels’ crops farming. Finally, it’s worth keeping in mind that the local conditions can affect the impact on food production greatly, and that a well-managed feedstock could very well have a much lesser impact on food prices."}, {"type": "image", "content": "https://miro.medium.com/max/8688/1*qmeUZ15LEWrhrmdl-a_rvQ.jpeg"}, {"type": "subtitle", "content": "Pollution"}, {"type": "sentence", "content": "Biofuels are a popular method of reducing carbon emissions because their tailpipe CO2 emissions are lower. However, there are many more types of emissions than just CO2, and even that needs more things considered than simply the driving part of the equation. A study estimating the total costs to the environment and our health calculated that gasoline currently costs US$469 million for gasoline, while being US$472 million to US$952 million for corn ethanol. Not quite the success story one might expect. This is partially due to two things. First, the emission of particulate matters (PM2.5) is much higher with ethanol, both during usage and production. Particulate matter is a major source of breathing problems, so you can see how that would impact healthcare costs. Second, the amount of fossil fuels and fertilizers required to grow the corn has a massive impact on the lifetime emissions of ethanol, causing more damage to the environment than otherwise might have been done."}, {"type": "sentence", "content": "Thankfully, not all biofuels are this way, and the impact, for example, of cellulosic ethanol may be as low as US$123 million to US$208 million. As mentioned before, cellulosic ethanol makes use of the plant’s fibre, rather than the fruit. This leads to much lower emissions overall, and therefore a much better impact on the environment."}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*PpEElVP8XYkwk8HnOS4xDA.jpeg"}, {"type": "subtitle", "content": "Land usage"}, {"type": "sentence", "content": "Equally important to both food security and pollution, is the issue of land use. Once again, this can either have a positive effect, or a very negative one. The potential benefits of biofuels will depend almost entirely on the possibility to make proper use of land for different feedstock. If the biofuel is produced on what used to be tropical rainforest, such as is the case in nearly a third of all new plantations in Indonesia, then the resulting negative environmental impacts will speak for themselves, ranging from higher CO2 emissions to desertification and loss of biodiversity. Meanwhile, a production that is sustainably added to the regular crop rotation, such as is the case in Germany, will bring about the issue of limiting the potential production, but will also produce less negative environmental impacts."}, {"type": "subtitle", "content": "Is it worth it?"}, {"type": "sentence", "content": "There is no doubt that, going forward, biofuels will continue to be an important part of our energy supply for transportation. Whether this will have a positive or a negative impact will depend entirely on the regulations that will frame the production of feedstock for producing bioethanol and biodiesel. As it stands, they bring with them both positives and negatives, and we need to frame their future in very solid, and enforced, sustainability criteria if we want this endeavour to be a good one for the environment, and for our health."}], "topic": "science"}