{"title": "5 Things to Avoid Saying to Adult Survivors of Child Abuse", "data": [{"type": "sentence", "content": "I was speaking with a new family member that has been dating my parent about some traumatic incidents that had recently occurred."}, {"type": "sentence", "content": "As an adult survivor of child abuse, the nature of my relationship with my parents is very complex. I basically brought up the fact that the parent that this person was dating had been abusive throughout my life and recently did an abusive thing to another family member. This person became enraged."}, {"type": "sentence", "content": "Having never experienced abuse in her life, she reacted emotionally instead of rationally to the news. I tried to explain to her that I was fine now, that after fourteen years of therapy, I’ve forgiven all three of my abusers, including this one, and that I put it in the past. But she just did not let it go and started to victim blame me among other things."}, {"type": "sentence", "content": "These are things I have heard before. So, I’ve compiled a list of five things to avoid saying to adult survivors when becoming aware of their complex situation."}, {"type": "subtitle", "content": "1. “You’ve said good things about them, so how can they abuse you?”"}, {"type": "sentence", "content": "Abusive people are not black and white. Abuse also does not occur in clear caricatures like you see in the movies. Abusive parents especially can be at the same time nurturing and damaging."}, {"type": "sentence", "content": "Even though all abuse often occurs together, parents can be emotionally abusive while being physically safe. Parents can also be sexually abusive while treating their children with gifts and financial support to manipulate them into being loyal to the child’s abusers."}, {"type": "sentence", "content": "This often creates conflicting feelings about the survivor’s situation. The survivor may feel guilty for bringing up abuse when the parent has helped them in other ways, but abuse and care can occur at the same time."}, {"type": "sentence", "content": "Therapy clients often come into therapy telling their therapists one thing and then saying a conflicting thing the next week. The best thing a therapist has said to me while I was going through this phase was “I just want to let you know that if you change your mind next week, that is perfectly fine with me and you are safe here.” Over time then, I was able to accept my mixed feelings without guilt and hold a mature, rational, and complex understanding about the nature of the parent-child relationship, and ultimately, humanity."}, {"type": "subtitle", "content": "2. “You’re tarnishing their image by telling me this!”"}, {"type": "sentence", "content": "If a person says this, they obviously have had no experience with the complex and diverse capacity of human behavior."}, {"type": "sentence", "content": "The truth is, most people are complex. Evil and goodness can exist in one and the same person. In fact, in rehabilitation programs, prison inmates who have committed violent crimes can show affection towards animals and other living creatures, so we know the capability for both affection and violence is there."}, {"type": "sentence", "content": "We are not trying to hurt your relationship by telling you the person you love has done bad things. We are simply telling our truth, and we deserve just as much as our abusers to tell our side of the story in our lives. We understand that again, living with abusive parents is complex, and we may still forgive our parents actions and move on from the past. Just because you cannot doesn’t mean you can blame us for ruining your perfect rosy image of the world."}, {"type": "subtitle", "content": "3. “I would have called the police! Why didn’t you do that?”"}, {"type": "sentence", "content": "As my friend who works in activism says, “Calling the police isn’t always the best option.” Because again, it doesn’t boil down to an easy fix."}, {"type": "sentence", "content": "Calling the police and pressing charges has severe and long lasting consequences for the family. The survivor has to weigh on questions like, “What if my parent never talks to me again?”, “I would feel guilty for reporting my parent when they have done x, y, and z for me.”, and “Will I ever get to see my parent again if they go to jail?”"}, {"type": "sentence", "content": "You may think that the survivors may never want anything to do with their parents again after abuse. But not all cases result in a severing relationship. Sometimes, the parent heals, reflects, and changes on their previous actions. And you cannot underestimate the biological drive to forever keep your relationship with your only parents. Underestimating the natural desire to want a healthy, close relationship with one’s parents (even after abuse), is unrealistic and damaging."}, {"type": "sentence", "content": "Ultimately, the relationship will be complex."}, {"type": "subtitle", "content": "4. “I would have lived in a homeless shelter than live with someone who was abusing me!”"}, {"type": "sentence", "content": "First of all, it’s not your life and you aren’t in the victim’s situation. I’ve heard this comment mostly from adults who have never had to deal with abuse growing up, so they think the situation can be resolved by an easy all-or-nothing solution."}, {"type": "sentence", "content": "The truth is, mental hospitals, homeless shelters, and halfway houses are often overcrowded, lacking funding, and lacking resources to adequately aid the needs of the high rates of survivors. If there is the option of being able to live with the parent and working things out, then that would be a much better option emotionally and for the sake of maintaining family ties."}, {"type": "subtitle", "content": "5. “Why do you still live with them?”"}, {"type": "sentence", "content": "Similarly, the relationships between adult children and their abusive or previously abusive parents are complex. Adult survivors know all too well that they only have one mom and one dad, and the bond that is formed in childhood is so strong that some people would not give up a relationship with their parents even if they abused them."}, {"type": "sentence", "content": "Adult survivors develop disabilities like mental illness or stunted life skills that make them unable to function in the working world. So, they must rely on their familial support for financial help and shelter. If the abuse was in the past, the survivor may be able to put that in the past in order to get the help they need for surviving the present."}, {"type": "subtitle", "content": "Accepting Reality as it is"}, {"type": "sentence", "content": "Obviously, there are certain times when to be proactive and take charge about abuse. If the abuse is occurring in the present regularly and out of psychopathy, it is important to intervene. But intervene with a professional and carefully! And know the difference between rarer occurrences and abuse that happens out of situations that have gotten violently out of control. Know that the capability of violence exists within all of us."}, {"type": "sentence", "content": "If you know someone who has been abused and they still have a relationship with their family, know that 1) Every survivor’s situation and experiences are unique and the solutions are also. 2) It is not your place to input your life advice or your opinions and judgments on how the adult survivor is handling the situation. 3) If the survivor is being responsible for their healing by going to therapy regularly and treating their conditions, know that they are doing everything they can to give themselves a better life than what they had, and get to know exactly how they are helping themselves."}, {"type": "sentence", "content": "If anything, as an outsider to abuse and your friend’s, colleague’s, or acquaintances situation, you should talk to them with an open mind, learn to separate your opinions and reactionary emotions, and realize that long term abuse is something you cannot help with a simple fix. Adult survivors likely have developed more skills than you to know how to navigate their complex situation, and it is the survivor and the therapist that are more knowledgeable on how to recover safely, gradually, and minimally dramatic."}, {"type": "sentence", "content": "So, be compassionate. Offer to listen. Minimize your reactions. And let them take the lead."}], "topic": "mental-health"}