{"title": "How to Monetize Your Tech Skills from Your Couch", "data": [{"type": "image", "content": "https://miro.medium.com/max/12932/1*HOagd9Acj4fWasapLfDUiw.jpeg"}, {"type": "sentence", "content": "The current economic environment around the world is providing a catalyst for swift changes in how we work, how we learn, as well as ways to diversify income sources. If you currently work in or recently worked in tech, usually it means you have valuable skills that are not 100% capitalized on. This article is intended to provide an opportunity resource list for these two types of tech workforce in today’s world:"}, {"type": "subtitle", "content": "Category #1: Passive Income"}, {"type": "sentence", "content": "Passive income means once you put in the initial efforts to completing a project, the work speaks for itself (and makes money). There is simply zero follow-up work needed from you. You just sit there and watch the numbers grow. Pretty cool, huh?"}, {"type": "sentence", "content": "If you are a designer or coder of any kind, this is the time to look back on the hard work you’ve spent hours, days, weeks on and evaluate if they have the potential to be sold and re-used by others. If you have the time and want to create new work, even better! Here are a few platforms that I’ve personally used:"}, {"type": "subtitle", "content": "The Noun Project"}, {"type": "sentence", "content": "If you’ve created icons before and they are just sitting around, use them to generate passive income! Simply upload them to the platform and you earn money every time they’re purchased by someone."}, {"type": "subtitle", "content": "Adobe Stock"}, {"type": "sentence", "content": "This is one of highest-quality creative platforms on the Internet. It’s owned by Adobe so anyone with an Adobe Creative Cloud license will potentially see your work and consider purchasing it. The upload process is easy and you know you can trust the brand."}, {"type": "subtitle", "content": "Shutterstock"}, {"type": "sentence", "content": "Similar to Adobe Stock, Shutterstock is another well-known platform for selling creative projects. You can even sell music creations if you’ve got the skill under the belt."}, {"type": "subtitle", "content": "Envato Market"}, {"type": "sentence", "content": "This is probably the most versatile platform I am aware of. You can buy / sell everything from logos, icons to code snippets and templates, even 3D printing models! The breadth of content is truly amazing."}, {"type": "subtitle", "content": "Category #2: Remote Teaching"}, {"type": "sentence", "content": "I suspect the remote learning market demand is now bigger than ever. As tech workers, we have the advantage to contribute to this positive change by sharing our knowledge. Not to mention that teaching is such a rewarding experience."}, {"type": "subtitle", "content": "Springboard"}, {"type": "sentence", "content": "There are many positions open for teaching Data Science, Machine Learning, Software Engineering or UX Design. You can either apply to be an instructor, or if you are not ready yet to take on the challenge, consider becoming a mentor or teaching assistant! The commitment is mostly part-time and flexible with your own schedule."}, {"type": "subtitle", "content": "Lambda School"}, {"type": "sentence", "content": "This online coding school has recently gained traction. You have the option to become a full-time employee, or part-time contractor."}, {"type": "subtitle", "content": "Flatiron School"}, {"type": "sentence", "content": "This is another coding school based in Colorado. They offer in-person classes but I would not be surprised if online learning becomes the norm. They now have positions open to teach Data Science and Software Engineering online from a remote location."}, {"type": "subtitle", "content": "General Assembly"}, {"type": "sentence", "content": "GA is one of the largest technology education companies in the United States. They have physical locations all over the country and used to host a lot of events. Many remote full-time and part-time positions are currently open."}, {"type": "subtitle", "content": "Category #3: Product Testing"}, {"type": "sentence", "content": "Full disclosure: This category is not going to pay for your mortgage. Because these product and usability testing tasks require little to no tech skill, the payoff is not going to be nearly as high as category #1 and #2. All you need to do is constantly checking the sites for new opportunities, filling out lots of forms and counting on luck to be picked for these studies. The amount of available tests has been growing since companies can no longer conduct in-person sessions, so it’s a good time to jump in!"}, {"type": "subtitle", "content": "UserTesting"}, {"type": "subtitle", "content": "UserCrowd"}, {"type": "subtitle", "content": "Userlytics"}, {"type": "subtitle", "content": "Respondent.io"}, {"type": "sentence", "content": "To all the tech workers out there, happy earning from the comfort of your own home! The possibilities are endless."}], "topic": "freelancing"}