{"title": "Her Camera Caught Ruined Smiles —", "data": [{"type": "subtitle", "content": "Until she looked more closely."}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*PFQ81ILLSf28OPEpDqGY9Q.jpeg"}, {"type": "subtitle", "content": "Fiction Friday"}, {"type": "sentence", "content": "Jacie stood up, rubbing her back. “I can’t do this any longer, Kenna. Don’t you have what you need yet?”"}, {"type": "sentence", "content": "“Almost, not quite. Another half hour?” Kenna’s camera whirred."}, {"type": "sentence", "content": "“But you promised…” Jacie heaved in a long breath. “Never mind. Give me a minute?”"}, {"type": "sentence", "content": "“One minute,” said Kenna, rolling out of her crouch. “We’ll lose the light.”"}, {"type": "sentence", "content": "“I’ll lose my mind,” muttered Jacie, wrenching open another bottled water. She stared at her phone."}, {"type": "sentence", "content": "“Excuse me?” Kenna inspected the camera lens."}, {"type": "sentence", "content": "“Nothing,” said Jacie. “I need to…” Her fingers tapped, paused incredulous."}, {"type": "sentence", "content": "Kenna glowered, aimed the camera at Jacie again. “Thirty seconds.”"}, {"type": "sentence", "content": "Jacie’s swift tapping ceased. She pressed SEND, pirouetted to the ground, and draped herself over tangled blankets."}, {"type": "sentence", "content": "“Despair! He’s left you again!”Kenna commanded, holding camera to her face and waving her free hand."}, {"type": "sentence", "content": "Jacie’s face sagged. A tear snaked down her cheek."}, {"type": "sentence", "content": "“Perfect!” Kenna’s voice swelled with admiration. “Love the tears!”"}, {"type": "sentence", "content": "Head drooped and hair shielding face, Jacie snuck peeks at her phone. Genuine tears flooded fake ones."}, {"type": "sentence", "content": "Forty minutes later, Noah strode past lights, cords, and boxes."}, {"type": "sentence", "content": "“Babe!” He raised a hand to block the strobe lights, walking to Jacie. “I am so sorry!”"}, {"type": "sentence", "content": "“Get out!” Kenna roared."}, {"type": "sentence", "content": "Noah clasped Jacie’s arms, helped her up from the wretched blankets. He wiped her face with his shirtsleeve, held her close, and murmured into her hair."}, {"type": "sentence", "content": "Seconds later, he roared at Kenna. “Jacie’s freezing! What is wrong with you?”"}, {"type": "sentence", "content": "Motionless, Kenna kept her camera whirring. Her mouth creased into rare smile."}, {"type": "sentence", "content": "Noah pulled off his shirt and sheltered Jacie. She smiled and touched his cheek. Noah bowed his head and closed his eyes."}, {"type": "sentence", "content": "“We’re almost done and then you and me can find dinner,” said Jacie, stepping back and handing Noah his shirt. She looked at Kenna for agreement."}, {"type": "sentence", "content": "Kenna grinned at them. “We’re done. Got what I need.”"}, {"type": "sentence", "content": "“Break-up to Make-Up,” Kenna explained to the judges. She waved at the series of photographs."}, {"type": "sentence", "content": "She sang the old song, nodding encouragement when the panel sang along."}, {"type": "sentence", "content": "The crabby old guy at the end of the table sang loudest, wiping unabashed tears at true love."}], "topic": "fiction"}