{"title": "Helping A University Health System Website Do Its Job", "data": [{"type": "sentence", "content": "How much time did you spend the last time you had to find and select a primary care provider? Where did you look? What factors did you consider? What about when you had to find your way to the first appointment with that doctor? How easy was it to locate their office, get directions, and figure out where to park once you got there?"}, {"type": "sentence", "content": "These are questions many people look to their local hospital website to answer. And, sadly for all of us, it’s often pretty tough to find answers due to the way the information on complicated websites is organized and presented."}, {"type": "sentence", "content": "It was just these sorts of problems that a university web services team came to us with last summer. They were migrating their large, complex website from one backend platform to another, and they took that opportunity to assess its usability. We convinced them to try our collaborative method of research analysis, and they were so pleased with the results that they recently asked us to come back and do it again with a different team."}, {"type": "subtitle", "content": "Approach"}, {"type": "sentence", "content": "We did three types of research for this project. Our primary research was qualitative usability testing, which is our preferred method. We also did some supplementary research, which we’ll cover more about below. First, the qualitative research:"}, {"type": "subtitle", "content": "Qualitative research"}, {"type": "sentence", "content": "To design this research, we collaborated with our main point of contact to come up with a set of scenarios for people to test on the website. We settled on 5 common scenarios including:"}, {"type": "sentence", "content": "Those often took some time within our research sessions, but if we had time we also ran through one or more of the following scenarios:"}, {"type": "sentence", "content": "Next, we conducted the research remotely with 6 people local to our client. It was a smaller town and we wanted to get a diverse, representative group, so we took some time with the recruitment task on this one. We screened candidates until we had just the right demographic mix and mix of desktop/mobile users. Recruiting is often the tricky part, and this project was no exception!"}, {"type": "subtitle", "content": "Quantitative research"}, {"type": "sentence", "content": "To supplement our qualitative usability testing, we also conducted 2 types of quantitative research: a website survey and session replay analysis. For the survey, we captured 636 responses from 10 website surveys with 1 to 3 quick questions about how easy the site was to use. If users said it was difficult, we asked them to explain."}, {"type": "sentence", "content": "For the “session replays,” aka brief screen capture videos of individual user sessions showing scroll, click, navigation and other behavior, we used software called FullStory to capture 5,000 user sessions on the site. Don’t worry — to protect people’s privacy, we masked form fields with PII. Session replays lack the ability to know what’s in the person’s head or understand their full intent, but we can often piece together a story with the knowledge we’ve gained from other research methods. That’s what we did here."}, {"type": "subtitle", "content": "Analysis as a team"}, {"type": "sentence", "content": "If we’ve said it once, we’ve said it a thousand times: we can help people follow usability best practices in a broad sense, but our client teams are the real experts. The ones who eat, sleep and breathe this stuff every day, who likely talk to people trying to use the site and who definitely talk to stakeholders about what’s on the site. So the best way we know how to make a website do its job better is to show our client teams people trying to use the site. And that’s just what we did!"}, {"type": "sentence", "content": "In August last year, I got on a plane and met a couple of colleagues for a day-long analysis workshop with nine stakeholders from this client’s team. We spent the morning reviewing the research together:"}, {"type": "sentence", "content": "In the afternoon, we took our notes and put them through a collaborative grouping and prioritization exercise up on the walls of the conference room. This helped us whittle it down to three key takeaways:"}, {"type": "subtitle", "content": "1. Search needed help"}, {"type": "sentence", "content": "It was clear from all of the research that the site’s search filters were not always helping people find what they were looking for."}, {"type": "image", "content": "https://miro.medium.com/max/2758/0*A_DEE6ApNRka-Zpx"}, {"type": "subtitle", "content": "2. Some content was confusing"}, {"type": "sentence", "content": "We also found that some of the important content on the site was not presented in such a way that people were able to easily find it."}, {"type": "subtitle", "content": "3. Other content was MIA"}, {"type": "sentence", "content": "And third, we found that some important content that people needed to complete their tasks was just not there."}, {"type": "subtitle", "content": "Getting to next steps"}, {"type": "sentence", "content": "We spent some time in the afternoon brainstorming solutions and discussing who could take the most valuable next steps, and when."}, {"type": "sentence", "content": "As you might imagine, serious work on the search functionality of a major website is not what you might call “low hanging fruit,” but our client stakeholders were armed with solid evidence from our work together and were able to use that information to argue for the right next steps to get those balls rolling. In the meantime, we found plenty of usability issues that were low-hanging fruit to keep the team busy!"}], "topic": "ux"}