{"title": "How Stew Leonards Jacked a Career Fair", "data": [{"type": "subtitle", "content": "A business lesson for everyone"}, {"type": "image", "content": "https://miro.medium.com/max/6400/1*u7da4EZTOQF18M9dTwjmPw.png"}, {"type": "sentence", "content": "Stew Leonard was running some errands on a weekend evening."}, {"type": "sentence", "content": "He was a well-known entrepreneur in the area, working in the dairy business. He had just opened his first grocery store."}, {"type": "sentence", "content": "While walking the aisles of a convenience store, he bumped into the principal of the local elementary school. The principal said, “Why don’t you come out for a career day? I’m sure the kids would love to know about your business.”"}, {"type": "sentence", "content": "Stew declined. He is a humble man. He knows that dairy farming isn’t glamorous. He didn’t want to put the starry-eyed kids to sleep with the subject."}, {"type": "sentence", "content": "The principal pressed him further, insisting, saying the kids would really love to hear his story."}, {"type": "sentence", "content": "Being a good sport, he agreed to come in."}, {"type": "sentence", "content": "The next week, he arrived at the school and a fire truck was planted out in front of the building. He was immediately demoralized knowing he’d have big shadows to stand in."}, {"type": "sentence", "content": "As he walked down the school hallway, he saw signs in front of each classroom, with different professionals talking to rooms full of smiling kids."}, {"type": "sentence", "content": "A pilot was talking about flying his jet and all the missions he’d been on. A police officer was discussing fighting crime. A doctor was talking about his life, studies, and treating patients."}, {"type": "sentence", "content": "Stew would be competing with people who had fast, electric jobs."}, {"type": "sentence", "content": "Finally, he arrived at his room, where a sign was taped to the wall by his door, “Dairy Farmer.”"}, {"type": "sentence", "content": "In his classroom, there were only a handful of kids, most of whom were the children of his employees. Translation: their parents made them attend."}, {"type": "sentence", "content": "He went and gave his presentation, discussing life as a dairy farmer, raising and managing cattle, and later opening his first business. Then, later, a second tiny group of kids came in and he did another presentation."}, {"type": "sentence", "content": "At the end of the day, he was getting ready to leave and he bumped into the principal in the hallway. The principal had a funny look on his face and asked Stew, “What did you do?”"}, {"type": "sentence", "content": "The principal then said, “We’ll need a much bigger room for your next talk. You cleaned out the other rooms. All the kid want to come to your talk now.”"}, {"type": "sentence", "content": "Stew smiled and held up his hand. In it was a bunch of coupons."}, {"type": "sentence", "content": "At the end of Stew’s talk, he’d given each kid a coupon for free ice cream at his new grocery store."}, {"type": "sentence", "content": "In doing this, he’d become a rockstar that outshone all the other people at career day. Suddenly, all the kids seemed to have wanted to become dairy farmers."}, {"type": "sentence", "content": "The kids had left his room and skipped down the hallway, waving their ice cream coupons like a flag to tease their peers."}, {"type": "sentence", "content": "His story is a simple lesson for you: the power of spontaneous generosity."}, {"type": "sentence", "content": "If you are promoting, doing anything, providing unexpected add-ons and gifts can make a huge impact on your business and help spread the word-of-mouth advertising."}, {"type": "sentence", "content": "Remember this acronym: WIIFM It means, “What’s In It For Me”"}, {"type": "sentence", "content": "I say this in the nicest way possible — everyone is always out to get something. It could be a feeling, a physical product, a massage, great information. It’s always something."}, {"type": "sentence", "content": "Obviously, using free ice cream coupons wouldn’t fill up a room of adults for an hour. And it may not be an economical strategy to scale."}, {"type": "sentence", "content": "But it should get you thinking about the possibilities that come with free add-ons. Provide value to people and people will give you that window of opportunity."}, {"type": "sentence", "content": "Today, Stew Leonards has expanded to multiple stores and makes $341 million in annual revenue. They did it in no small part to Stew’s kindness and ability to think on his feet."}, {"type": "sentence", "content": "And with regret, no, I do not have free ice cream to offer you today. Only an air high five."}], "topic": "business"}