{"title": "How to Sustain Hope Through Difficult Times", "data": [{"type": "subtitle", "content": "Why hope is the key to our sanity and survival"}, {"type": "sentence", "content": "Lately, so much has been postponed, closed, or canceled. But not everything."}, {"type": "sentence", "content": "Hope has not been canceled, closed, or postponed."}, {"type": "sentence", "content": "Self-forgiveness has not been canceled, closed, or postponed."}, {"type": "sentence", "content": "Love has not been canceled, closed, or postponed."}, {"type": "sentence", "content": "Right now is an opportunity to remember the little things that matter most."}, {"type": "subtitle", "content": "Why do we hope?"}, {"type": "sentence", "content": "Because to be human is to be a miracle of hope, conscious of its own miraculousness, a poignant consciousness for which we have paid with an awareness not only of our own improbability but of our incomprehensible vulnerability of how precarious our survival is. And in order to make that awareness sustainable, we have created an ability that might just be one of the greatest miracles of our consciousness: hope."}, {"type": "sentence", "content": "Optimism, faith, and the enlightened activity that they produce can balance out the unrest we can feel from our immortality and fragility. We live within a constant flux of chance and choice, and yet we continually hope and continue along our unique path."}, {"type": "image", "content": "https://miro.medium.com/max/5000/0*gEy2KB6e798wxlI_"}, {"type": "sentence", "content": "Our earthly experience is filled with love, creativity, joy, passion, connection, compassion, laughter, and the taste of fudge brownies. But because we learn, grow, and evolve through life’s triumphs and hurdles, our experience also includes an abundance of challenging situations that help us to progress on our ephemeral journey."}, {"type": "sentence", "content": "A research study conducted by Michael Milona, Postdoctoral Fellow at Cornell University, supports the theory of the psychological nature of hope, which is consistent with hope playing a central role in guiding our lives. Milona states that hope is essentially a desire for something plus a sense of possibility. He contends that hope is how we learn which life to pursue."}, {"type": "sentence", "content": "The key right now is to not let life’s challenges get you down and to hold onto hope."}, {"type": "sentence", "content": "Take a second and think about the most uncomfortable situations that you’ve endured in your past. Doing so probably brings up some very disconcerting emotions like sadness, anger, and anxiety. We all go through this."}, {"type": "sentence", "content": "How would you feel if you released those feelings and the subsequent suffering over what you cannot control? Although it isn’t easy, I can tell you that it is entirely possible, because I’ve made peace with many difficult, heartbreaking, and uncontrollable situations in my past."}, {"type": "sentence", "content": "So what’s the secret? There isn’t a universal answer, for we all must discover our own truth in our own time, but all of the possible answers start with:"}, {"type": "subtitle", "content": "Releasing Judgment"}, {"type": "sentence", "content": "The truth is that it’s impossible to get over a difficult situation — to truly let it go — if you’re still judging it and comparing it to something else. Revisit one specific difficult situation from your past and then ask yourself:"}, {"type": "sentence", "content": "If you caught yourself thinking “yes” to any of those questions, then what’s prolonging your suffering and preventing you from getting over it is judgment. Your judgments about what “should” be the case continue to postpone the love, hope, and self-care that you are capable of practicing."}, {"type": "sentence", "content": "Now you may be thinking, “What happened was unbelievably horrible! I could never get over it. Doesn’t that condone the behavior or situation?” But releasing your judgment does not mean that you’re pleased with what happened, or that you support it; rather, that you are eliminating the negative burden being carried by perpetual judgment. This is powerful."}, {"type": "sentence", "content": "When you let go of negative judgments, you automatically replace the victim mentality with acceptance and presence. And acceptance and presence together will free your mind and move you forward."}, {"type": "sentence", "content": "This same principle applies to our society’s present challenges with COVID-19, especially for those of us who are not ill."}, {"type": "sentence", "content": "When we think more objectively about our circumstances, we live better in spite of them."}, {"type": "sentence", "content": "There is no reason to delay your peace of mind. Now is the time to practice being more mindful of your judgments and how you respond to life. Of course, doing so is much easier said than done."}, {"type": "sentence", "content": "Mindfulness as a daily ritual is the ultimate challenge. It’s a way of living, of being, of seeing, of tapping into the full power of your humanity, without judgment."}, {"type": "subtitle", "content": "Essentially, mindfulness is:"}, {"type": "sentence", "content": "Above all, what you need to remember is that where you are and what you’re doing at any given moment is absolutely essential."}, {"type": "sentence", "content": "Because it is the only moment guaranteed to you."}, {"type": "sentence", "content": "You are not on your way somewhere else."}, {"type": "sentence", "content": "You are not progressing to a more important time or place."}, {"type": "sentence", "content": "The present is not just a stepping-stone — it is the ultimate destination."}, {"type": "sentence", "content": "This moment is where your greatest opportunity lies."}, {"type": "sentence", "content": "This moment is your life."}, {"type": "sentence", "content": "It might seem obvious, but we forget more often than we’d like to admit."}, {"type": "sentence", "content": "All day, every day, many of us feel like the present isn’t enough — like our life right now simply isn’t worthy of our full presence. And because of this, we judge it harshly and miss out on most of life’s present beauty."}, {"type": "sentence", "content": "But what if we did the opposite?"}, {"type": "sentence", "content": "What if we accepted this moment — no matter how imperfect — as exactly enough?"}, {"type": "sentence", "content": "What if we accepted the “bad” with the good, the letdowns with the lessons, the heart-wrenching with the interesting, the anxiety with the opportunity, as part of a package deal that this moment alone is offering us?"}, {"type": "sentence", "content": "What if we paused right now, and saw everything with perfect clarity?"}, {"type": "sentence", "content": "Would we live more meaningful and memorable lives in the days and weeks ahead?"}, {"type": "sentence", "content": "Would we have more beautiful stories to cherish and share?"}, {"type": "sentence", "content": "I believe that we would."}, {"type": "sentence", "content": "And so, now is the best time to start."}], "topic": "mindfulness"}