{"title": "Philia", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "image", "content": "https://miro.medium.com/max/6952/1*ImnEUykvOSSVrWUOHnsA6A.jpeg"}, {"type": "sentence", "content": "My phone buzzes. Anna again. Should we head out soon?"}, {"type": "sentence", "content": "“Yes, meet there in half an hour,” I type back."}, {"type": "sentence", "content": "It’s one of our first weekends in Granada during our study abroad trip, and Anna and I are the only ones in town. The rest of our group bought Lederhosens and cheap last minute flights to Munich for a weekend of Oktoberfest, forcing us to hangout alone for the first time."}, {"type": "sentence", "content": "It’s not that I am nervous to hangout with her alone, just that conversations often flow so naturally in a group. When there’s only two people, you’re either the interviewer or the interviewed, and I personally don’t like being either."}, {"type": "sentence", "content": "I spend ten minutes gelling my hair just right. I need to look as European as possible, right? When in Rome, I suppose."}, {"type": "sentence", "content": "I arrive at the bar to find her already accompanied by a pitcher of sangria and a few plates of tapas. I will admit, she does have an energy to her that’s quite contagious. She just always seems so present in the moment. I admire that."}, {"type": "sentence", "content": "“What’s going on?” she asks."}, {"type": "sentence", "content": "“Nothing much,” I reply. “I’ve heard this bar has some of the most authentic flamenco starting at midnight.”"}, {"type": "sentence", "content": "The bar was unlike anything I’d seen back in the states. Long wooden picnic tables were the only option for seating. The only light came from the strings of lights hanging about the rafters and from the candles forming a line down the middle of each picnic table. At the end of the tables sat a small wooden stage, waiting for the flamenco dancers to arrive and stomp the crowd into action."}, {"type": "sentence", "content": "Anna poured two cups of sangria for us and raised her glass."}, {"type": "sentence", "content": "“To our first weekend in Spain that we finally aren’t jetlagged,” she says with a laugh."}, {"type": "sentence", "content": "“That’s a good point,” I say back, raising my glass to hers."}, {"type": "sentence", "content": "“This kind of seems like a date night, huh?” she says."}, {"type": "sentence", "content": "“Whoa, let’s not jump to that quite yet,” I replied with a smirk."}, {"type": "sentence", "content": "“I’m only kidding… do you have a sweetheart or something waiting for you back in the US?”"}, {"type": "sentence", "content": "I take a long sip of my cocktail, trying to buy some time to come up with a response to her blunt question."}, {"type": "sentence", "content": "“I don’t really want to dive into that tonight,” I reply."}, {"type": "sentence", "content": "“Oh, c’mon, we better get to know each other before spending the next four months together in this foreign country,” she says."}, {"type": "sentence", "content": "I could tell I wasn’t going to escape this question. Remember what I said about either being the interviewer or the interviewed?"}, {"type": "sentence", "content": "I cave. I tell her all about the girl I had been dating back at school last spring, and how she promised we’d survive as a long distance couple. I told her about how we were doing well with long distance for the first few weeks, but the more time we spent apart, the less probable it seemed that we’d make it. By the time June came around, we really started to have issues. We’d go days without talking to each other, holding out, waiting for the other person to cave so that we’d feel like we held some imaginary upper hand in the relationship. That, mixed with all night FaceTimes where neither of us we’re quite in the mood to work things out, sealed our destiny as a couple. The night before I boarded my flight, we decided a four month break could be a good thing for us. We agreed the relationship could be paused until Christmas break, but I don’t think either of us truly felt that we’d ever revisit things."}, {"type": "sentence", "content": "I tell Anna every detail of it, and she listens intently. The whole story takes enough time for us to go through a whole new pitcher of sangria."}, {"type": "sentence", "content": "“So, I take it your jetlag was accompanied by some seriously exhausting grief?” she asks."}, {"type": "sentence", "content": "“I guess you could say that,” I replied."}, {"type": "sentence", "content": "I explain to Anna that even though this does feel like a date night, the last thing I want to go through is another confusing fling, especially when we only have a few months to try and experience everything here that Europe has to offer. She nods in agreement. We agree to experience the semester solely as friends. To ignore the world’s doubt in truly platonic friendships. She calls me her Spanish Partner in Crime. I kind of like that."}, {"type": "sentence", "content": "The flamenco dancers arrive and start dancing around 12:45. Gotta love European punctuality. Just after the first set finished their performance, a large group of American men shuffled their way into the picnic table beside us. Normally, I wouldn’t presume where a group came from, but this group was obvious. They all were dressed in white button down shirts, as if they had left their high-rise offices in Manhattan and flown straight to this bar in Southern Spain. In very poor Spanish, they order four pitchers of rebujito, a classic Andalusian cocktail."}, {"type": "sentence", "content": "“Where are you guys from?” Anna asks. She’s so straightforward."}, {"type": "sentence", "content": "“Texas!” they exclaim simultaneously."}, {"type": "sentence", "content": "We get to talking to them for a while. In a way, it was refreshing to hear English again. We find out that they all live in the same high-end neighborhood of Dallas together. One of the men was turning sixty this weekend, and rather than going to some boring-old-Texas rodeo, they wanted to see a full on bullfight in Spain. This was the last weekend of bullfighting season in Spain before winter, so they hopped on a last minute flight and would only be in town for the weekend. As a whole, they were a pretty friendly group. They kept buying us rounds of drinks, and seemed genuinely interested in our studies abroad."}, {"type": "sentence", "content": "Eventually the flamenco ended and the place started clearing out, prompting us to do the same. The group of Texans were itching to go to a Spanish nightclub until the sun came up, but we were ready to hit the hay. A strange twist in social norms."}, {"type": "sentence", "content": "Anna went to the bathroom before we were going to walk home and when she left, the man who had been seated closest to me came over and put his arm around my shoulders."}, {"type": "sentence", "content": "“You two sure make a good couple. I’d pay a lot of money to be in my twenties again,” he says."}, {"type": "sentence", "content": "I quickly replied, “Oh, no, no, no. We are just friends.”"}, {"type": "sentence", "content": "“Wait a second! You mean…you aren’t hittin’ that?” he says in disbelief."}, {"type": "sentence", "content": "I step away, taking his arm off of my shoulder. He clearly had too much to drink."}, {"type": "sentence", "content": "“No, we just met, and we’re just good friends, that’s all there is to it,” I reply firmly."}, {"type": "sentence", "content": "He grabs my shoulders and pulls me in close to him."}, {"type": "sentence", "content": "“Listen, kid. She’s into you. I can tell these sorts of things,” he whispers to me, as if revealing some grand wisdom. “Take this…a gift from me,” he slips a wad of Euros into my shirt pocket."}, {"type": "sentence", "content": "“Take her out for a nice dinner, with some good wine, and show her a good time, if you know what I mean,” he says with authority."}, {"type": "sentence", "content": "Disgusted by his implications, I back away. I am relieved to see Anna coming back from the bathroom. We say goodbye to the group, and thank them for the drinks. I shake the gift-givers hand with reluctance, and he smugly nods at me."}, {"type": "sentence", "content": "“I’m serious,” he says with an immoral wink."}, {"type": "sentence", "content": "Walking Anna home, I’m hesitant to tell her what the man had said to me. I feel the need to vent about his obnoxious advice, but also don’t want to taint her perception of the group. I decide to hold off. She’s had a lot to drink anyways, and I doubt the details will stick to her memory."}, {"type": "sentence", "content": "The next morning she texts me, asking if I want to go grab some breakfast. I agree, and we meet at a cafe around the corner. I feel guilty for not telling her what was said during her trip to the bathroom, and decide to share. She, too, is disgusted by his advice. She asks what I did with the money he handed me."}, {"type": "sentence", "content": "“Well, it’s still in my shirt pocket I guess,” I say."}, {"type": "sentence", "content": "Her suggestion: go out for the dinner that he envisioned for us. I like the way she thinks."}, {"type": "sentence", "content": "And that we did. We ate tapas that would normally be much too expensive for a college student’s budget. We drank wine that we normally wouldn’t even think to order. We spent the night exactly how he envisioned, just minus the end of course. We did so on the dime of our generous Texan friend, and by doing so, honored every platonic relationship that has once heard the question…"}, {"type": "sentence", "content": "“Why aren’t you guys more than friends?”"}], "topic": "fiction"}