{"title": "Here’s why the flag of the USA is burned in Teheran", "data": [{"type": "subtitle", "content": "Iran | America | Politics"}, {"type": "sentence", "content": "Two tourists from the West in an anti-West demonstration in downtown Teheran, November 2017"}, {"type": "sentence", "content": "‘Hello! How are you?’, a little girl shouted. Her big smile did not go unnoticed. The group of girls surrounding her were smiling and waving. These young teenage girls would not miss this opportunity to greet two foreigners. Sanne and I were both startled. Our first introduction to true Persian hospitality. Never before where we met with so much enthusiasm by a group of girls completely covered in chadors. We were walking along the walls of what the current government of Iran calls ‘the Den of Espionage’. The group seemed to be a school class of girls following their teacher. They were walking towards some kind of gathering. We were drawn towards the commotion, a couple of hundred meters ahead."}, {"type": "sentence", "content": "Iran is one of the most influential countries and cultures in the world and what we were about to experience, taught me a lot about this country’s history and current political situation."}, {"type": "sentence", "content": "No man in the crowd was without a mustache. All the women were dressed in black or dark blue chadors, the men wore black jeans and black leather jackets. At the end of the wall we were stopped by a collection of mostly men. In Iran, unmarried women are not allowed to touch or talk to men in public, but they looked on with curiosity at our exchange."}, {"type": "sentence", "content": "The men didn’t want to deny us entry to the demonstration, but were perhaps wary, about the reaction of a couple of foreigners to what we were about to see. Upon rounding the corner of the wall we saw a twenty-meter tall rocket standing upright in the middle of the street surrounded with tanks and military trucks. An unusual sight in any given city center."}, {"type": "sentence", "content": "We looked out of place. A group of twenty individuals gathered all around, smiling, touching, and surprisingly, they all wanted to take selfies. Sanne and I went along with it and of course returned the favor."}, {"type": "sentence", "content": "There we were, two Dutch adult adventurers, in front of the den, downtown Teheran, the capital of Iran, in a demonstration with around four to five hundred people, flags of the USA and Israel were being burnt in front of our noses. The Den of Espionage is where the infamous hostage of the American embassy took place in 1979–1981."}, {"type": "sentence", "content": "The crowd present seemed to be protesting against a quote made by President Trump a few weeks earlier. I saw a Trump dummy on a stick held up by a little girl."}, {"type": "sentence", "content": "We asked somebody what was happening. ApparentlyTrump had used the word ‘Arabic Gulf’ instead of the ‘Persian Gulf’. People held posters in the air about the Persian Gulf and not the Arabic Gulf. The words ‘Arabic Gulf’ had a big red cross running through it. Why would people go through so much trouble about the adjective of the name of a sea?"}, {"type": "sentence", "content": "Whether the Gulf is called Arabic or Persian, makes a huge difference. To whoever the adjective refers can control a body of water through which one-third of the world’s oil is exported."}, {"type": "sentence", "content": "As I was taking some pictures and walking around, I noticed the age of the crowd. Most people present were young, around eighty percent would be considered minors. Though I wanted to get closer to the flags being burned, Sanne rightfully questioned if that was a wise decision. I felt different energy; There was zero aggression towards us and people were genuinely interested in who we were and what we were doing there."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*Uts59a6DpBblC7yzjJRTTw.jpeg"}, {"type": "sentence", "content": "Fast forward five days later. Sanne and I found ourselves in a place called Mesr. Mesr was located in the middle of the largest Iranian desert, the Dasht-e-Kavir, a couple of hours east of Esfahan. It was only on the first morning in Mesr, that we realized we were about to enjoy the weekend of Iranians living life in the desert."}, {"type": "sentence", "content": "On our arrival day, the village street was just another empty street of approximately fifty houses. However, the next day on Thursday morning, it had turned into a parking lot for touring cars full of Esfahani and Teherani city dwellers. Huge groups arrived and the face of the village changed in a few hours."}, {"type": "sentence", "content": "Mothers with their daughters walked through the village without wearing headscarves. We learned that the owner of our guesthouse used to organize illegal festivals in the desert for more than one thousand people."}, {"type": "sentence", "content": "The visitors were drinking coffee from Italian espresso machines, used Instagram for every second of the day and many of them asked me for my Facebook, Instagram, and YouTube accounts."}, {"type": "sentence", "content": "This was not the Iran that I had seen in front of the Den of Espionage. We watched ladies dance with abandon in front of the campfire, no headscarves insight."}, {"type": "sentence", "content": "We got drunk while two dudes from Teheran were constantly rolling joints. ‘We produce weed in a plantation in Teheran.’ One said. Yes, my dear audience, they produced weed!"}, {"type": "sentence", "content": "‘What is the punishment for weed production?’ Sanne asked. ‘The death penalty’, one of the stoners replied while casually taking another toke."}, {"type": "sentence", "content": "We expected a quiet night in a tent under the stars of the Iranian desert, it turned into an evening all about meeting Iranian people with real Iranian stories. With the smell of burning weed in our noses, at a campfire with drunk Iranian families who were singing and dancing, the front door of Iran was opened to us."}, {"type": "image", "content": "https://miro.medium.com/max/2920/1*uWXjnStGcnBHkUfPqClFCQ.jpeg"}, {"type": "sentence", "content": "The desert introduced the true face of Iran, the face which is hidden from the public streets, behind the front door of every house in Iran. A face we were lucky enough to see multiple times more in the weeks to come."}, {"type": "sentence", "content": "For it is in the desert, where the Iranians go to live their lives. Spending the weekend in Mesr is where we truly discovered the soul of Iran and the true hospitality spirit of the Persians. After this weekend we were invited by some Iranians from Esfahan to stay in their house."}, {"type": "sentence", "content": "At the campfire we showed our pictures of the demonstration in front of the Den for the first time to other Iranians. Upon looking at our photos, the people observing them started laughing."}, {"type": "sentence", "content": "‘Aaah, you’ve been to the theatre!’ one said ‘Aaaaah you’ve been to the puppet show!’ said another."}, {"type": "sentence", "content": "Whenever we showed the pictures to other Iranians to see what kind of reaction they would give, the same reaction surfaced."}, {"type": "sentence", "content": "‘That is all fake’, the next said, ‘that is put up by the government’, another told us."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*YxraQxcJIG2KTzF9NhQQYg.jpeg"}, {"type": "sentence", "content": "For the next weeks, by talking to the people of Iran, we learned that the government in Teheran sends letters to schools in the vicinity of the Den of Espionage and commands the teachers to take their class on time x and day x to be present at the demonstration. The cameras do the rest. On television, these black chador and mustache wearing crowds seem impressively large."}, {"type": "sentence", "content": "‘And the people burning the flags?’, we asked."}, {"type": "sentence", "content": "‘They get paid by the government to do this’, was the reply."}, {"type": "sentence", "content": "This made sense in a country where the unemployment rate has been above ten percent over the last decade. Burning flags is, sad as may be, for some people an actual job in Iran. Of the eighty million people in Iran only five hundred of them are summoned by the government and around fifty of them are paid to do some things they probably don’t think highly of themselves, but it’s most likely their only source of income."}, {"type": "sentence", "content": "I was struck by the huge gap between the perceived image of Iran in the West and the reality. The image the government wants the world to see of Iran is completely contradictory to the hospitable nature of the average Iranian citizen."}, {"type": "sentence", "content": "From all the places I’ve been from all the places I’ve seen, the Iranians are easily the nicest, warmest and most welcoming people of this planet. Hospitality is their middle name, inviting guests is in their culture, their history. When I left Iran seven weeks later I felt guilty. For I had received so much and what did I give back to Iran?"}, {"type": "sentence", "content": "Not once did I meet a person in Iran who spoke high of its government. The last news item relating to the subject of how Iranians hate their government was in December 2019. ‘1500 people dead in protest against the Iranian government’. There are no other people in this world who would like a different government than the Iranians."}, {"type": "sentence", "content": "Going to the puppet theatre has never been this educative. So please, next time, when you see a street full of people who are burning an American or Israelian flag on your screen, think again."}, {"type": "sentence", "content": "This is my way of saying, thank you Iranians. In my way, I want the world to know: think twice before you judge, read, study first, don’t believe what the cameras tell you."}, {"type": "sentence", "content": "Thank you for reading this article. Ralph Deckers is a Dutch historian. He’s been traveling and guiding for years and has explored over 65 countries. Due to the corona crisis his tour leading work evaporated and so he decided to start writing on Medium."}], "topic": "travel"}