{"title": "What It Takes to Have a Crisis-Resilient Company Culture", "data": [{"type": "image", "content": "https://miro.medium.com/max/2800/1*EVgY9kwoRfRtt4F_z-6e4A.png"}, {"type": "sentence", "content": "“Only the strong survive,” as they say. While so many factors influence the success, failure, and survival of a company, culture is significant. It should be the reason for an organization’s strength, not its vulnerability. It takes more than a list of individual characteristics. It requires a culture carefully cultivated and reflected in shared experiences, throughout the company, in its entire system. As written before, there’s no such thing as cherry picking adjectives for something as all-encompassing as culture, like a “safety” culture, or a “team-oriented” culture, or even a “crisis-resilient” culture. A whole culture is so much more. It includes “all things that have the power to influence behaviors, interactions, and perception…[that] determine the boundaries of what is acceptable and not acceptable,” as defined in Culture Your Culture: Innovating Experiences @ Work. Look at the patterns of what is rewarded, punished, condoned, or accepted — these are what define a company’s culture. The aim is to embody a set of interconnected key capabilities that makes a company crisis-resilient as a whole — one that rises to the occasion and recovers quickly. These are the conditions that must be in place:"}, {"type": "image", "content": "https://miro.medium.com/max/500/1*RvR3HiZxrOJnfwuPWCnwUQ.png"}, {"type": "sentence", "content": "Connected. This is a less obvious, but necessary first choice. A company that is connected internally and to the outside world has access to knowledge, resources, and people, such as: information, talent, external stakeholders (especially customers), leaders as well as current, past and potential employees. It’s not about having as many connections as possible so much as the right connections. To illustrate, neuroscientists have proven the common misconception that intelligence is determined by the size of a brain and the number of connected neurons. Smarter brains actually have “sparsely” connected neurons that are ultra-efficient. The same is true for organizations. Mutually strong, continually reinforced, and positive relationships sustain connectedness. It is not only an essential characteristic of engagement, but also crisis-resilience."}, {"type": "image", "content": "https://miro.medium.com/max/1256/1*dC6fOoN0QEpIjZ_WfDhBPQ.png"}, {"type": "sentence", "content": "Strategic. Businesses that are well connected have the intelligence for broader perspective. They can see how change in one area might impact other areas or uncover game changers before others. Awareness triggers action. A recent headline reads, “When It Comes to the Future of Work, We Only Know What We Don’t Know.” Agree or not with that conjecture, most people would rather know than be ignorant and caught unaware. Being strategic means having the knowledge and being able to bring together the different parts to work toward the whole. This is especially important in the middle of crises."}, {"type": "sentence", "content": "Trustworthy. Strong positive relationships that come with being connected are sustained by trust. This happens when people believe they will not be exploited, as defined in the Academy of Management. Trust builds reputations, followership, comradery, assumes best intentions, and willingness to overcome the benefit of the doubt. One can’t be successful without it, for it affords the much-needed social capital to get anything and everything done."}, {"type": "image", "content": "https://miro.medium.com/max/1244/1*6mBBKySgZzyocbeOJoB_TQ.png"}, {"type": "sentence", "content": "Flexible. Being both strategic and trustworthy allows for flexibility. It’s the opposite of rigidity. Those that are strategic have flexibility in perspective — they can switch their aperture between the details and the big picture. And because of trust, people, en masse, are willing to listen and consider what they may not do on their own. A flexible organization is always ready for change, especially one brought on by a crisis. It is what allows a successful startup to take off, an established company to remain relevant and competitive, and individuals to learn."}, {"type": "image", "content": "https://miro.medium.com/max/1236/1*y_-NAHdO2KuBwXjRnT53qg.png"}, {"type": "sentence", "content": "Creative. A culture that is described as creative has the ability to “use imagination to create something new in the world” on a large scale. There are numerous conditions necessary in order to unleash creativity, but one of the biggest barriers at the organizational level is the lack of psychological safety, or a fear of reprisal. Though they are distinctly two different concepts, trust is necessary for psychological safety to exist. As described in Creative Confidence, it’s about keeping “the creative momentum going instead of cutting off the flow of ideas. Throwing cold water on one person’s contribution can bring the conversation to a halt…” Would a company need creativity overcome a crisis and/or recession? Yes."}, {"type": "sentence", "content": "Learning Agile. Agility alone is not enough. Being learning agile means new knowledge can be quickly synthesized, incorporated, and demonstrated. Dr. W. Warner Burke of Columbia University delineates two equally important components of learning agility. The first is skill. In his words, it’s “what you do when you don’t know what to do.” That is the application of knowledge and learning. The other is motivation, the “willingness to take risk in novel situations.” Of the nine dimensions in the Burke Learning Agility Inventory (BLAI), speed and flexibility are the most powerful. When there are so many moving and unknown parts during a crisis, a culture that practices learning agility makes a tangible difference. It builds the capability to be innovative and resilient."}, {"type": "image", "content": "https://miro.medium.com/max/1244/1*LILeXj34Xnh8Ly-YYwBvCg.png"}, {"type": "sentence", "content": "Innovative. The relationship between creativity and innovation are well known. “Where creativity is the ability to come up with ideas, innovation connects ideas to other people, where it is shaped, adopted, and realized,” as written in Culture Your Culture: Innovating Experiences @ Work. In Creative Confidence, Tom and David Kelley put it more simply: “creativity manifests itself as innovation.” Linda Naiman of Creativity at Work wrote, “For innovation to flourish, organizations must create an environment that fosters creativity; bringing together multi-talented groups of people who work in close collaboration together — exchanging knowledge, ideas and shaping the direction of the future. Organizations led by creative leaders have a higher success rate in innovation, employee engagement, change, and renewal.” Most companies want to be innovative (hence the overuse of the word), but the few who truly are have a competitive advantage. They can actually innovate their way out of the biggest challenges."}, {"type": "sentence", "content": "Resilient. Just like resilient people, a resilient company is better positioned to bounce back in the face of adversity. Prof. Larry Mallak of Western Michigan University wrote: “For your organization to be resilient, it needs people who can respond quickly and effectively to change while enduring minimal stress.” The standard has long been established as this was written over 20 years ago. There’s no adversity like a crisis at the scale of a pandemic. Unsurprisingly, the topic of resilience has seen more writing and discussion lately. It’s the answer to stress, which is known to be counterproductive in so many ways. Mallak continues, “The resilient organization designs and implements effective actions to advance the organization, thereby increasing the probability of its own survival.” And that’s what organizations need to do during a crisis: survive."}, {"type": "image", "content": "https://miro.medium.com/max/1276/1*1rlorAXUSO9aEv1CpjxcGA.png"}, {"type": "sentence", "content": "Action-oriented. All this depends on operationalizing the above as knowledge, mindsets, capabilities, and cultural norms across the organization. Execution is key. The term “strategic speed” from the eponymous book is “where urgency meets execution; it’s about implementing plans and strategies not only quickly but well.” That’s what this kind of action is all about. As a behavioral competency, it’s Korn Ferry/Lominger’s Drive for Results, “communicating a vision, setting priorities, developing and executing plans that achieve the desired outcome — for the organization and the world.” Action becomes a part of the culture when it is implemented in alignment and coordination throughout the company."}, {"type": "image", "content": "https://miro.medium.com/max/1416/1*mdhw-Oklb-wlFgek6DbU6g.png"}, {"type": "sentence", "content": "Prepared. This is not to be assumed as a result. It is a constant state that must be maintained and sustained, where an organization is always ahead, anticipating and set up with systems and plans already in place. A prepared culture builds confidence and calm in a chaotic world. Better prepared organizations will have the least negative impact and a shorter road to recovery. Likewise, before, during, and after a crisis, a company’s culture when it comes to preparedness will influence outcomes."}, {"type": "sentence", "content": "Connected, strategic, trustworthy, flexible, creative, learning agile, innovative, resilient, action-oriented, and prepared — all these work together as an antidote for the kind of fear that kills company culture and businesses even under normal circumstances. These cultural capabilities not only make a company crisis-resilient, but also ready for the unavoidable Future of Work. Incidentally, companies listed on the Acadian Ventures’ new Future of Work Index “has performed extremely well during this time of uncertainty, market volatility, and looming recession,” per Enterprise Irregulars."}, {"type": "sentence", "content": "There is no bad time to start a culture initiative, and now is an especially good time. It’s worth checking for early organizational “cancer cells,” addressing gaps, further developing/using capabilities, and increasing employee engagement right now. Design of Work Experience, as explained in Culture your Culture, provides the much needed, step-by-step “how to” for this culture work. With answers in hand, all companies need to do is make it happen. They have the choice today. They may not have it tomorrow."}, {"type": "sentence", "content": "About the Author:"}, {"type": "sentence", "content": "Karen Jaw-Madson is principal of Co.-Design of Work Experience, author of Culture Your Culture: Innovating Experiences @ Work (Emerald Group Publishing, 2018), founder of Future of Work platform A New HR, and instructor at Stanford University’s Continuing Studies Program."}, {"type": "sentence", "content": "References:"}, {"type": "sentence", "content": "Clements, D. (2020, April 10). When it comes to the future of work, we only know what we don’t know. Insight. https://workplaceinsight.net/when-it-comes-to-the-future-of-work-we-only-know-what-we-dont-know/"}, {"type": "sentence", "content": "Corsello, J. (2020, April 13). How Do Future of Work Companies Perform in a Crisis. Enterprise Irregulars. https://www.enterpriseirregulars.com/153678/how-do-future-of-work-companies-perform-in-a-crisis/"}, {"type": "sentence", "content": "Davis, J. R., Boswell, E. H., & Frechette, H. M. (2010). Strategic speed: Mobilize people, accelerate execution. Harvard Business Press."}, {"type": "sentence", "content": "Ferry, K. (2014). FYI For Your Improvement. Korn Ferry."}, {"type": "sentence", "content": "Genç, E., Fraenz, C., Schlüter, C., Friedrich, P., Hossiep, R., Voelkle, M. C., … & Jung, R. E. (2018). Diffusion markers of dendritic density and arborization in gray matter predict differences in intelligence. Nature communications, 9(1), 1–11."}, {"type": "sentence", "content": "Jaw-Madson, K. (2018). Culture Your Culture: Innovating Experiences@ Work. Emerald Group Publishing."}, {"type": "sentence", "content": "Jaw-Madson, K. (2017, May 24). A Culture of “This or That.” Medium. https://medium.com/innovative-ideas-for-organizational-cultures/a-culture-of-this-or-that-e312666cfb81"}, {"type": "sentence", "content": "Jaw-Madson, K. (2015, October 22). The Latest from W. Warner Burke on Learning Agility. Medium. https://medium.com/innovative-ideas-for-organizational-cultures/the-latest-on-learning-agility-d573278508a4"}, {"type": "sentence", "content": "Jones, G. R., & George, J. M. (1998). The experience and evolution of trust: Implications for cooperation and teamwork. Academy of management review, 23(3), 531–546."}, {"type": "sentence", "content": "Kelley, T., & Kelley, D. (2013). Creative confidence: Unleashing the creative potential within us all. Currency."}, {"type": "sentence", "content": "Mallak, L. (1998). Putting organizational resilience to work. INDUSTRIAL MANAGEMENT-CHICAGO THEN ATLANTA-, 8–13."}, {"type": "sentence", "content": "Naiman, L. (2020) Creativity at Work Landing Page. https://www.creativityatwork.com"}], "topic": "leadership"}