{"title": "without title", "data": [{"type": "image", "content": "https://miro.medium.com/max/2034/1*ddHYeGjkTJ12lRTVGr1l2g.png"}, {"type": "sentence", "content": "Dozens of FYC campaigns come and go every year, many using intuitive and compelling methods and arguments to get voters’ attention and affirmation. Yet one campaign has stuck with me over the past few years; one that made headlines for its clever ‘piggybacking’ on an existing social movement to garner glory for a film."}, {"type": "sentence", "content": "The film in question is Morten Tyldum’s The Imitation Game, a biopic of World War II British codebreaker Alan Turing, a mathematical and computer scientist who played a significant role in the Allies’ victory but was prosecuted for homosexuality and tragically died at 41. Benedict Cumberbatch stars as Turing, and Keira Knightley as his close friend Joan Clarke."}, {"type": "sentence", "content": "The film’s awards campaign — run by Harvey Weinstein three years before he was ousted from the industry in the wake of sexual abuse revelations over which he has since been prosecuted— used a platform of ‘honouring Turing’s life and work’ to seek support from industry voters, a tactic that attracted a reasonable amount of media critique."}, {"type": "sentence", "content": "A major element of PR analysis is the conceptual ‘Stakeholders’ whose needs must be met by a campaign. To satisfy all relevant stakeholders, The Weinstein Company’s campaign needed to"}, {"type": "sentence", "content": "A key piece of writing on stakeholder theory is Mendelow’s matrix of stakeholders. Mendelow’s grid sets two axes for stakeholders — power and interest — and determines how much attention should be paid to stakeholders’ needs based on their value on each of these scales."}, {"type": "image", "content": "https://miro.medium.com/max/1800/0*At4D-TeL_NDL2_zc"}, {"type": "sentence", "content": "Addressing the role of earned media in the campaign brings us to the issue of ‘newsjacking’ — or ‘piggybacking’ — wherein a PR campaign will capitalise on a topical or heated issue or media discussion in order to attach the campaign consciously or unconsciously in audience’s perception to a subject they may have strong emotional attachment to. A campaign that executes newsjacking might rely on receiving unpaid attention from news outlets that will incorporate the campaign into coverage of the broader topic in question."}, {"type": "sentence", "content": "In the case of The Imitation Game, the film was bound to capitalise on the social history it is based on, and the continuing public discourse surrounding Alan Turing and his treatment by the British legal system. Turing’s legacy and significance as a war hero were, of course, what initially led the film to be greenlit and formed the central basis of its marketing campaign."}, {"type": "sentence", "content": "Ultimately, the importance of the Turing name provided a starting point for The Weinstein Company to position the film as a key contender in the Oscars race and to argue, to complicated public reception, that to shower the film with awards for its craft and quality would be a suitable method of finally honouring Turing for his services to the Allies seventy years earlier."}, {"type": "sentence", "content": "The film broke new ground in affiliating with a broader sociopolitical campaign with the publication of an open letter to the British government in several major newspapers on behalf of the Pardon49K campaign. Co-signed by Morten Tydlum, Benedict Cumberbatch, Stephen Fry, Alan Turing’s niece and Matthew Todd (the then-editor of gay magazine Attitude), the letter outlined Turing’s heroism and suffering and called for the government to pardon all 49,000 men convicted under the “gross indecency law and other discriminatory anti-gay legislation”."}, {"type": "sentence", "content": "The letter sparked a great deal of news coverage given the high profile of the signatories, and the images overwhelmingly used to accompany these reports were — unsurprisingly — of Cumberbatch in character as Turing in the recently-released film. It was an orchestrated act of mutually-beneficial PR genius: the popularity of The Imitation Game would increase interest in the Pardon49K campaign, but more importantly for Weinstein, the strong ethical movement behind the campaign would create a warm environment for the film to flourish as a piece of political art and — hopefully — be seen as such by Oscar voters."}, {"type": "sentence", "content": "The first step to successfully convince Oscars voters to support your film is by easily allowing them to see the film. There are two ways that voters are able to see relevant films for free before casting their ballots: ostentatious private screenings held in Los Angeles and occasionally New York throughout Autumn and Winter where guests are offered dinner and wine before enjoying the relevant film; and DVD screeners that are sent by post to all eligible voter households, often before the film has even been released widely in cinemas."}, {"type": "sentence", "content": "Manufacturing and shipping screeners — usually accompanied by literature with information on the film — is relatively costly, and puts the film at high risk of piracy. Films with DVD screeners sent to voters early typically end up leaking on illegal internet streaming and download websites before or around their time of cinema release, which can be detrimental to box office performance."}, {"type": "sentence", "content": "In the case of flashy VIP screenings, The Imitation Game’s most attention-grabbing event was the screening hosted by Mark Zuckerberg for his tech industry friends in Silicon Valley. This event was internally successful in reaching influential Californians with the film: people not necessarily affiliated with the film industry, but who would have many friends and colleagues within the Oscar voting body. It also attracted public media attention for the film’s campaign, when a Vanity Fair piece quoted Keira Knightley on the number of hoodies worn by the wealthy tech innovators in attendance: associating Mark Zuckerberg’s powerful brand with the film was a brilliant coup."}, {"type": "sentence", "content": "When it came to actually appealing for votes, Weinstein splashed a unique and attention-grabbing message across the film’s For Your Consideration material: “Honor The Man. Honor The Film.”"}, {"type": "sentence", "content": "They were not holding their cards close to their chest with this: awarding The Imitation Game in Best Picture, Best Actor and other categories it was specifically targeting would — they emphasised — be a heroic statement of admiration towards the man who inspired it."}, {"type": "sentence", "content": "The slogan was seen on enormous billboards around L.A., juxtaposed with a striking image of Cumberbatch against a white background. Weinstein also took out several full-page ads in Hollywood trade publications Variety and The Hollywood Reporter, arguably the best direct route for appealing to voters who comprise a huge proportion of those magazines’ readership. Critic and journalist Mark Harris tweeted a photo of the magazine ad and described it as “Oscar overreach and a vulgar pander. The Weinstein Co. is apparently campaigning for Alan Turing to win Best Martyr.”"}, {"type": "image", "content": "https://miro.medium.com/max/1252/0*YP67RCtqOmpayVA-"}, {"type": "sentence", "content": "Social media is less important in FYC campaigns than typically in modern PR, given the specificity of the target audience as well as the older demographic that makes up the Oscars’ voting body: in 2014 the average age of a voter was 63, though this has shifted younger in the five years since The Imitation Game was competing. Social media simply isn’t as effective a method for communicating with 60 to 70 year-old members of the film industry as organising screenings, mailing out DVDs or taking out print spreads in the trades. However, the film’s promotional social media accounts did actively encourage support for its awards campaign, with the official Twitter account @ImitationGame persistently posting reminders of various critical praise and accolades the film had received. The account also retweeted many posts relating to the open letter and the Pardon49K campaign. One notable post from Human Rights Campaign’s verified account (@HRC), calling for the 49,000 men to be pardoned, features a quote about Alan Turing from HRC resident Chad Griffin beside the photo of Cumberbatch used in the film’s FYC material: an interesting optical choice that once again linked the film’s prestige with the principle of the pardon campaign."}, {"type": "image", "content": "https://miro.medium.com/max/2052/1*4i24VDkhE2poHM-3Wn1kJA.png"}, {"type": "sentence", "content": "The most valuable image for The Imitation Game’s campaign was, of course, the face of the film’s marquee star. Benedict Cumberbatch was, in late 2014, one of the most recognisable men in British film, having risen to prominence in the BBC series Sherlock followed by a string of key roles in War Horse, Tinker Tailor Soldier Spy and 12 Years a Slave. What all of these films shared was a sense of cultural importance particularly within the British broadsheet media, tackling historical subjects with a formality and uprightness that Cumberbatch somewhat came to represent. If a filmmaker needed an eloquent, physically imposing and admired young actor with a profoundly anachronistic face, Cumberbatch was the first choice."}, {"type": "sentence", "content": "The close-up image of him that adorned the initial marketing campaign for The Imitation Game conveyed a significance, a ‘worthiness’ to the project, as well as appealing to Cumberbatch’s notable online following among young people — young women and gay men formed large online communities and labelled themselves ‘Cumberbitches’. To appeal to Oscar voters was another matter: Cumberbatch comes from a TV and theatrical background and was competing in 2014 with iconic actors’ faces like Michael Keaton in Birdman and Bradley Cooper in American Sniper. Nevertheless, and in spite of The Imitation Game co-starring the equally famous Keira Knightley, Cumberbatch looking deep in thought with his hand raised to his chin was the central image of the film’s FYC campaign."}, {"type": "image", "content": "https://miro.medium.com/max/1236/0*sY9kEjg9xTaz5J1a"}, {"type": "sentence", "content": "The most impactful numerical element of the campaign was the 49,000 gay men convicted of homosexuality in Britain yet to be pardoned. The film became closely affiliated with the Pardon49K campaign when its director and star signed an open letter to the British government calling for the men to be pardoned and referencing the film’s recent depiction of Alan Turing. Weinstein aimed to draw a parallel between the striking and sad fact of the injustice executed by the British government against so many men, and the message promoted by The Imitation Game in glorifying one of those men and rightfully contextualising Turing as an intellectual war hero."}, {"type": "sentence", "content": "Given the extensive length of the awards season news cycle, and the ‘clickbait’ value of publishing Oscars-related articles, it is rare for a film in the Oscars conversation to not attract some variety of political criticism during its campaign."}, {"type": "sentence", "content": "In the case of The Imitation Game, it was the fact that the film’s narrative almost totally ignored Turing’s gay lifestyle, focusing instead on his friendship with Keira Knightley’s character, yet in its marketing it was framed as a progressive film with a gay empowerment theme. This was raised as an issue by gay journalists like Tim Teeman of The Daily Beast and attracted a defensive response from the director, who said “I’m not shying away from it. His whole relationship, how he falls in love and the importance of him being a gay man, was all about secrecy.” This minor media backlash, handled well by the filmmaker, was not fatal for the film’s Oscar campaign, which leaned more heavily on the specific tragedy of Alan Turing than a more general LGBT theme. Yet there is a possibility it lost the film votes from some LGBT voters who, upon reconsidering the film, may have assessed that it was not making quite as much of a statement as it claimed."}, {"type": "sentence", "content": "Unsurprisingly given Weinstein’s murky shadow, there are ethical questions at the heart of how this campaign was run. Was it fair to suggest to the public that voting for The Imitation Game at the Oscars would have any tangible impact on Alan Turing’s legacy or, as was subtly implied, the effort to pardon the other 49,000 men? Subtlety is key here, however, and subconscious implication is almost unavoidable in communicating through PR. Weinstein’s campaign did not make false claims, it merely highlighted parallels between Oscar victory and honouring Turing’s legacy that Oscar voters would likely have concluded themselves. It appealed to their sense of importance and influence by suggesting that they had the power to “Honour” a war hero by voting for a film."}, {"type": "sentence", "content": "On January 15, 2015 the year’s Oscar nominations were finally announced and The Imitation Game fared extremely well with eight, the second-highest count of any film. These included nominations for Best Picture, Best Director for Morten Tyldum, Best Actor and Supporting Actress for Cumberbatch and Keira Knightley, Editing, Production Design and Original Score. It seemed as though the film had been acknowledged as an achievement both in technical and dramatic terms."}, {"type": "image", "content": "https://miro.medium.com/max/2052/1*jQjLfdxrV06c4peniNvcdw.png"}, {"type": "sentence", "content": "Weeks later, the night of the show arrived, and the talent arrived to watch their film be showered with golden glory. It didn’t go quite as Weinstein and co. would have hoped: the film picked up only one award. Yet the impact of screenwriter Graham Moore’s speech after winning for Best Adapted Screenplay — in which he addressed a suicide attempt from his teenage years and dedicated the award to teenagers watching at home who “feel weird” — was enough to make the film’s presence strongly felt on the night. In just a few seconds, Moore was able to encapsulate so much of the spirit Weinstein had been trying to manufacture with expensive PR, just by being his honest self."}, {"type": "sentence", "content": "Two years later, the Pardon49K campaign succeeded and the British government introduced a ‘Turing Law’ to repeal the convictions of gay men for ‘gross indecency’. There is no evidence, although Weinstein would quite possibly argue, that The Imitation Game’s success in cinemas and at the Oscars had any impact on this decision, yet it’s worth noting that both campaigns I’ve discussed in this essay did achieve their visible goals: the film received an Oscar, and the pardons were awarded."}, {"type": "sentence", "content": "The Weinstein Company were clearly masters of this specific kind of PR campaign, and earned great success for many years at the Oscars, but when horrifying private behaviour was brought to light, no PR could keep Harvey Weinstein in the industry where he had caused so much personal destruction. Hence, The Imitation Game was one of the last major campaigns he ever ran, yet it will remain a template for campaign strategists looking to attach their film’s brand to a sense of collective voter conscience."}], "topic": "marketing"}