{"title": "A self-reflection framework", "data": [{"type": "sentence", "content": "5 years ago, I was entering a more senior stage of my career and struggling at finding rolemodels. I felt directionless, disillusioned, and didn’t trust my own voice. I saw peers succeeding around me, and didn’t understand why I was plateauing. After a long period of existential angst (a story much better told over a drink), I finally found new momentum in my career. A few instances contributed to that:"}, {"type": "sentence", "content": "To help others fast forward through this phase, I developed a workshop that I’ve been running internally at Facebook. It’s focused on reflection, goal-setting and self-advocacy. It’s celebrating milestones, understanding your strengths, identifying growth areas, and being able to articulate it to the people who can help you along the way. After 4 years of procrastinating, I’ve finally publicly published it for a broader audience (thanks for continually pushing me, Vivian Ma)."}, {"type": "subtitle", "content": "The Map"}, {"type": "sentence", "content": "The foundation of this framework is a self-reflection map. The map is built upon 3 dimensions to help pull apart different areas to explore:"}, {"type": "subtitle", "content": "The Past"}, {"type": "subtitle", "content": "Review"}, {"type": "sentence", "content": "To begin, review your breadcrumbs (calendar, Workplace/Slack, TODO lists, etc) and recall everything you’ve done for the past half. Focus on being comprehensive. For every coffee meeting, every 1:1, every email or post, ask yourself:"}, {"type": "subtitle", "content": "Map"}, {"type": "sentence", "content": "Plot everything onto the top half of your map. To add more insight to your map, ask yourself:"}, {"type": "subtitle", "content": "Identify themes"}, {"type": "sentence", "content": "At this point, themes will start to emerge. You may see trends based on the scope of work that you’re most comfortable in, or perhaps you find joy in teaching others. Share your progress with trusted friends and see if they agree with what you’ve discovered about yourself, or if they see any themes that you missed. Here’s a few examples of the type of insights you may uncover:"}, {"type": "subtitle", "content": "Craft your personal narrative"}, {"type": "sentence", "content": "Look over everything you’ve done and craft your personal narrative, or your personal elevator pitch. Here’s a few prompts to get you started:"}, {"type": "subtitle", "content": "The Future"}, {"type": "subtitle", "content": "Setting the foundation"}, {"type": "sentence", "content": "Now that we understand where we’ve been, we can start planning for the future. The bottom half of the map is for planning your next half. To begin, transfer all the things you know you will continue doing."}, {"type": "subtitle", "content": "Identify growth opportunities"}, {"type": "sentence", "content": "To fill out the rest of the map, add any new projects or interests that align with your strengths or push you out of your comfort zone. If you have an empty quadrant, try something new! What is something you’d like to learn or someone you’d like to learn from? Ask the people around you for ideas or collaborations."}, {"type": "sentence", "content": "Beyond identifying new projects, consider ways you can double-down on the things that you love. For something you’re strong in, how can you expand it to a larger scope? For each of these, what role are you operating in and how can you move from learning to doing, or leading to teaching?"}, {"type": "subtitle", "content": "Rebalance your time"}, {"type": "sentence", "content": "At this point, you’ll probably be getting excited about all the new opportunities, but also start feeling overwhelmed because there is a lot of opportunity. With the help of your manager voltron, decide how you want to rebalance your time."}, {"type": "subtitle", "content": "Gaining Support"}, {"type": "sentence", "content": "Once you have a clear vision of where you want to focus next, then it’s all about followthrough. Co-conspirators and accountability buddies are key. Share your goals and intentions with your friends. Find people who have similar goals and go after them together. Draft it into a goals doc and share it with your manager, your team, and your peers. Who knows, you might inspire someone else to think about their own goals a little differently."}], "topic": "ux"}