{"title": "Have You Celebrated YOU Today?", "data": [{"type": "subtitle", "content": "SELF"}, {"type": "subtitle", "content": "We Don’t Take Enough Time to Be Proud of Ourselves"}, {"type": "sentence", "content": "Sometimes we forget to simply be proud of who we are."}, {"type": "sentence", "content": "We calculate all of the things that went wrong and what we could have done better. We think about our mistakes or we harbor unbearable guilt. We forget about all of our achievements or accomplishments, no matter how great or small — because we are too busy focusing on the parts we messed up."}, {"type": "sentence", "content": "I’ve messed up a whole lot in my life. I’ve also suffered greatly for it."}, {"type": "sentence", "content": "Like when my first husband proudly announced that he dreamed of owning a double-wide trailer on a piece of land big enough to have his own junkyard on his own property and I realized — that would be my worst nightmare of a life. I had a baby with this man, married this man, and it didn’t take me long to see our future come crashing down around me. So much for giving my son that family life I felt I owed him, right? I felt like a complete failure."}, {"type": "sentence", "content": "Or when my second husband threw me into a wall and told my children what a whore I was. Or when he apologized to me for marrying “damaged goods.”"}, {"type": "sentence", "content": "Yeah, I’ve been through some real shit. The kind of stuff some people never come back from."}, {"type": "sentence", "content": "Yet here I am, a survivor. A generally happy person. My two boys are grown, productive members of society with a big capacity to love others. I do my best even in tough circumstances. And I’ve learned a lot about healing, about empathy, and about perseverance. I’d call that a win."}, {"type": "sentence", "content": "I can’t take the ugly parts back. And guilt will only serve to destroy my present and taint my future."}, {"type": "subtitle", "content": "We do not spend nearly enough time celebrating the things we have done right."}, {"type": "sentence", "content": "We don’t take the time to lift ourselves up, give ourselves an “atta boy” and forgive ourselves for our own trespasses against ourselves."}, {"type": "sentence", "content": "Why do we do this? Why do YOU do this to yourself?"}, {"type": "sentence", "content": "Can any one past poor decision be changed? If it can’t be changed then we must simply learn what we can from it and move on. Make amends where necessary — but then let the ugly stuff go."}, {"type": "subtitle", "content": "Take the time to think about the good things."}, {"type": "sentence", "content": "When I started college I was freshly separated from my second husband and still reeling from PTSD. I’m not entirely sure I was mentally sane for the first 2 years of college and while I was sleeping 4 hours a night and working between classes I was also single-parenting my way through my children’s childhoods."}, {"type": "sentence", "content": "There was a lot of time I was not there for them like I should have been. But let’s face it, I wasn’t able to be. I can harbor this guilt for the rest of my life. It can devalue my relationships with my sons. Or I can do my best to make peace with it and focus on the present. Celebrate the outcome, the destination, not the bumpy road."}, {"type": "sentence", "content": "So, I take time to think about the present. The best of things. The small things I have done with my day that I can be proud of — and you should too."}, {"type": "subtitle", "content": "Here are a few ways you can take time to celebrate YOU today"}, {"type": "image", "content": "https://miro.medium.com/max/2836/1*Mi7bzUAV7KMuvoKRfWLipA.jpeg"}, {"type": "sentence", "content": "I haven’t always had the best attitude. I’ve let life beat me down until I thought I belonged there; down. But life does this in variable measures to everyone. I cannot expect that whining about it will make anything different — only that it keeps me stuck in the down."}, {"type": "sentence", "content": "Don’t do this to yourself. Take the time— today, now, to celebrate your life, your mind, your gifts to this world. You are not defined by your mistakes — you are defined in your rising."}, {"type": "sentence", "content": "Thank you so much for reading."}, {"type": "sentence", "content": "If you enjoy journaling to stay positive and keep yourself on track, I am working my way through the Monk Manual, which has been a great experience for me. I wrote about the journey here:"}, {"type": "sentence", "content": "Christina M. Ward is a well-living blogger and poet from North Carolina. Her work has been featured in numerous blogs and poetry journals. You can follow her work here on Medium or on social media."}], "topic": "mindfulness"}