{"title": "Escape from the Uncanny Valley", "data": [{"type": "subtitle", "content": "Why some video game characters make you feel uneasy"}, {"type": "sentence", "content": "For years, the video game industry has been fighting against what’s known as “the uncanny valley.” The term “uncanny valley” is used in reference to the phenomenon whereby a computer-generated figure or humanoid robot bearing a near-identical resemblance to a human being arouses a sense of unease or revulsion in the person viewing it. It was coined in 1970 by Japanese roboticist Masahiro Mori, as he hypothesized that the human reaction to a robot with humanlike features would go from empathy to revulsion since robots could try — but ultimately fail — to realistically resemble humans. It’s a phenomenon anyone who’s played games or watched particularly dodgy (or aged) CGI in a movie or television show has felt. The uncanny valley is that strange feeling that sits in the back of your brain when you see something that almost looks real, but doesn’t quite hit the mark. Perhaps the eyes don’t move smoothly enough, or the mouth articulations don’t quite sync up to the dialogue on screen. Maybe the emotions are too exaggerated, or not zoetic enough. Either way, your brain is telling you that what you’re looking at isn’t quite right, and it reacts accordingly."}, {"type": "image", "content": "https://miro.medium.com/max/1260/1*CrUGUXkAepcMQsOkzH3b_Q.jpeg"}, {"type": "sentence", "content": "Mori conceived the term “uncanny valley” (despite the fact that this translation is slightly incorrect) because he believed there is a certain point where familiarity fails and we fall into a “valley” of unease. Ayse Saygin, a cognitive scientist at the University of California, believes this is due to the brain’s expectations. Saygin explains that when an image or robot appears particularly humanlike, it sets up certain expectations for the brain. When those expectations fail, such as when we notice a jerky movement, our brain instantly realizes what we’re looking at is decidedly inhuman, thus causing the unease. Mori suggested a potential reason for the uncanny valley, but it should be noted that his hypothesis was created in 1970, and was devised entirely of his own expectations of responses rather than scientific studies. According to Mori, the unease we feel at seeing computer generated images or robots that don’t quite appear real is because they remind us of corpses, and thusly activate a natural human fear of death. As such, Mori placed corpses and zombies at the bottom of his graph for human likeness — seen below — as our brains almost immediately feel unease when we interact with them."}, {"type": "image", "content": "https://miro.medium.com/max/60/0*eZSDoCz3aT6LnOHq"}, {"type": "image", "content": "https://miro.medium.com/max/1146/0*b2aDtDfi_V7pF3d1.png"}, {"type": "sentence", "content": "Another study conducted by Thalia Wheatley, a psychologist at Dartmouth College, found that the uncanny valley is a multicultural phenomenon. Her study found that students at Dartmouth were able to tell when the face presented in front of them was morphed using computer generated imaging (CGI), and the same results were shown when the test was run in a remote tribe in Cambodia. The participants claimed that a face only seemed more a living human’s than a doll’s if it was 65% or more human. One of the most interesting caveats to this is that the tribe was only able to acknowledge the subtle differences in the faces that were more familiar to the culture. If faces were shown of people they may not have encountered before — such as individuals from Europe — it was more difficult for the tribe to discern which ones were alive and which ones were CGI. Wheatley’s studies additionally displayed the significance eyes have in detecting the likelihood of a face being real. It would seem that the musculature in and around the eyes are imperative to real world emotional communication, as we look to the eyes to help us understand the intentions of the person we are communicating with. Eyes have been described as “the window to the soul,” and for good reason. As a result, most artificial eyes are seen as lifeless, soulless, or hollow, as they can’t replicate the exact emotions our eyes can, regardless of how well they’re animated."}, {"type": "image", "content": "https://miro.medium.com/max/1344/1*3KcC5w-o2UnOi7WiKOp2lA.jpeg"}, {"type": "sentence", "content": "The gaming industry has been trying for years to render something as close to real life as possible, with things like motion capture and advanced animation technology making games more realistic than ever thought possible. However, it’s probable that time will make these games look much more unsettling than we perceive today. A perfect example would be the picture of Aerith above from Final Fantasy VII. The image on the left is of Aerith when Final Fantasy VII released in 1997. On the right is a still from the recently-released remake. Final Fantasy VII was received incredibly well when it was released in 1997, with review aggregate Gamespot saying, “Never before have technology, playability, and narrative combined as well as in Final Fantasy VII… This is the most dazzling visual experience to date on any console. Film-quality computer-generated cinematics blend seamlessly with pre-rendered background artwork to create the strikingly realistic world of Final Fantasy VII, both beautiful in its grandeur and terrifying in its detail.” Twenty years ago, the graphical output of a game like Final Fantasy VII was unparalleled and created an impressive and almost unfathomably realistic immersion. By today’s standards — especially when put up against its own remake — characters from Final Fantasy VII can almost be likened to dolls, while the remake is nearly lifelike. 1997’s Aerith falls nearly perfectly into the uncanny valley, so it would appear that familiarity isn’t the only factor in understanding this phenomenon; time and experience are key factors too."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*-94G6u4raEn1UQNw5it9Zg.png"}, {"type": "sentence", "content": "An important detail to note is that, despite what all the studies and explanations have shown, the uncanny valley isn’t even proven to exist at all."}, {"type": "sentence", "content": "It would seem that the evidence examined can’t really confirm or deny its existence, as the findings are typically inconsistent. Basically, the extent of feelings of unease, if any exist at all, vary wildly from person to person. To take a quote from the paper The Uncanny Valley, Does it Exist?, “The existence of an uncanny reaction does not validate the valley model.” This is essentially stating that just because things resembling human beings tend to elicit a natural state of unease or repulsion does not indicate that the feeling itself can be quantified into one classification. This is paramount when discussing how the uncanny valley relates to our media and our entertainment. If there truly is no uncanny valley to best, and only an uncanny phenomenon to contend with, it may eventually be possible to trick our brains into thinking the games we’re playing are truly real. The end result would be a much more integrated connection, both personally and emotionally, between the human race and the artificial and synthetic lifeforms we create."}, {"type": "image", "content": "https://miro.medium.com/max/1996/1*3lf9Y6mHxoxpSSFOw6gjlw.png"}], "topic": "neuroscience"}