{"title": "Finding Time Is Easy, Defending It Is Hard", "data": [{"type": "subtitle", "content": "It’s not just about priorities, but about authentic communication."}, {"type": "sentence", "content": "“But how do you communicate these boundaries?” The smoke from his cigarette lingered in the air for a while before vanishing as if to underline the significance of his question."}, {"type": "sentence", "content": "I met with my Mastermind a few days ago and one of the members told us he had problems carving out time for the activities important to him. Communicating his schedule to other people without them getting hold of the wrong end of the stick and taking it personally proved to be a real challenge."}, {"type": "sentence", "content": "I could relate because I went through the exact same troubles when I started to write. At first, it was hard to find extra time for it since my days were already packed. Once I put other activities and people on the backburner, they would get upset, take it personally, and assume I didn’t like them anymore."}, {"type": "sentence", "content": "You, like everyone else, have interests you want to pursue — whether it’s to learn an instrument or a language, read, build a business on the side, walk your dog, or some good old me-time."}, {"type": "sentence", "content": "The problem is that you have a hard time carving out the extra hours you’d need. Distractions in the form of people and other activities come in between and before you know it, it’s half a year later and you haven’t made any progress at all."}, {"type": "sentence", "content": "I don’t blame you. When life happens, it can be super hard to carve out extra time if you don’t have a bulletproof way of doing so."}, {"type": "sentence", "content": "Even if you manage to schedule extra time for your interests, it can be very hard to protect it and communicate your boundaries. If you don’t communicate it properly, it’s easy to make people close to you feel bad and like you don’t want to spend time with them."}, {"type": "sentence", "content": "That’s why you need to learn two things. One, block time for what’s important to you so nothing comes in between. Two, communicate these boundaries in an assertive way without killing your relationships."}, {"type": "subtitle", "content": "Manage Your Time Backward"}, {"type": "sentence", "content": "Most people try to fit their desires and projects in between other commitments. They plan to spend an hour on it after they met with their buddy Mike and another two hours on Saturday afternoon. The problem? Life will get in the way. One beer with Mike turns into five and when your neighbor invites you to a barbecue on Saturday, you’re quick to shift your plans to “somewhen next week”."}, {"type": "sentence", "content": "What you need to do instead of trying to find time for pursuing your interests in between everything else is to manage your time backward."}, {"type": "sentence", "content": "Block time for what is important to you and what needs to happen in advance, then schedule everything else around it. Protect this time block like a tiger mother her cubs. Make it a priority and make sure nothing else gets in between. New appointments and other activities can wait until you’re done with what matters."}, {"type": "sentence", "content": "Do this on a regular basis — e.g. an hour per day for reading after you get up or an hour after work for the gym. Make it a part of your regular schedule and don’t let anything else come in between. You’ll be surprised how many things can wait and aren’t as urgent as you thought."}, {"type": "sentence", "content": "My day now largely consists of time blocks to make sure I get everything done that I want to get done."}, {"type": "sentence", "content": "One hour for my morning routine and three hours for writing after that."}, {"type": "sentence", "content": "In the afternoon I’ve got another three-hour block for editing before I work out for one to two hours and run errands."}, {"type": "sentence", "content": "Only after all this is done, I turn towards other endeavors like mail and phone calls, hanging out with friends, or cleaning my room."}, {"type": "sentence", "content": "You have to understand that time will not magically appear out of thin air — instead you have to take it, block it off in advance, and make sure nothing gets in between."}, {"type": "sentence", "content": "If you work a regular schedule, figure out where you can block off time — either in the morning before you go to work or in the afternoon or evening."}, {"type": "sentence", "content": "Time management is simple: You want it, so make time for it. If you don’t claim your time, other people will."}, {"type": "sentence", "content": "I know what you’re going to say. “My day is so full, I can’t find time to block!” If that’s the case, I suggest that you do some reflection and reevaluate all the things that are going on in your life. Are they really more important than making time for your passions, your education, your learning, your business, your kids, or whatever you want to make time for?"}, {"type": "sentence", "content": "In the end, time isn’t about time — it’s about priorities."}, {"type": "subtitle", "content": "Yes, You Can Say No"}, {"type": "sentence", "content": "What I have found is most people not only struggle with blocking time but rather with communicating their boundaries and schedules to other people."}, {"type": "sentence", "content": "When you block time for one activity, it means you have less time for another. Simple math."}, {"type": "sentence", "content": "Sooner or later, this will lead to conflicts. Someone will ask you to go out on a Friday but you have already blocked your Saturday morning for your guitar sessions or unicycle practice."}, {"type": "sentence", "content": "The problem here isn’t the time itself — it’s that most people don’t take a “no” very well. They take it personally. They feel unwanted and like you don’t want to spend time with them. They ask “Why are you so busy? Can’t you do this another time? You’re so selfish.” They don’t understand that they are not the center of your world."}, {"type": "sentence", "content": "They don’t understand you actually would love to knock back a few beers with them or watch a movie, but you have other priorities right now."}, {"type": "sentence", "content": "Even if they are understanding, saying “no” to someone is still hard."}, {"type": "sentence", "content": "It’s time for a harsh truth. When you can’t say “no” to someone, it’s not because you can’t — it’s because you don’t want to."}, {"type": "sentence", "content": "Deep down, you feel like you don’t have a valid reason to say no."}, {"type": "sentence", "content": "When people pressure you and take your refusal to heart, it makes things worse. You start to doubt yourself. Is this really the right thing to do? Am I being selfish? Do I have a valid reason to say no and reject people?"}, {"type": "sentence", "content": "Let me tell you something. You have the most valid reason there is. It is your life. It is your time. Both are incredibly precious and valuable."}, {"type": "sentence", "content": "Don’t feel bad for being what other people call “selfish”. It is your life and nobody is going to live it for you. You have all the right in the world to decide how you spend your time and how not. Period."}, {"type": "subtitle", "content": "It’s What You Say and How You Say It"}, {"type": "sentence", "content": "Just because you are the master of your own time doesn’t mean you have to be a dick about it. You have to walk the tightrope. Be assertive, but polite. Make yourself a priority, but make other people feel valued. Do it your way, but explain why."}, {"type": "sentence", "content": "There are four key elements to a good rejection. The goal is to communicate your boundaries without leaving room for negotiation, get people to understand it’s nothing personal, and make them feel valued nonetheless."}, {"type": "sentence", "content": "Maintain a polite, but assertive tone."}, {"type": "sentence", "content": "Put these four elements together and you have a much higher chance someone respects your boundaries but won’t feel hurt."}, {"type": "sentence", "content": "“Hey Jim, thanks a bunch for the invite to your barbecue, but I’ll have to decline. I’d really love to join and I’m sure it’s going to be fun, but I’ve committed to an important project and don’t have much free time before I’m through with it, nothing personal.”"}, {"type": "subtitle", "content": "For the hard cases"}, {"type": "sentence", "content": "Even if you do everything right, sometimes people will still have a hard time understanding and take it personally. Your girlfriend, family, or best friends are used to getting a chunk of your time, so the rejection hits extra hard."}, {"type": "sentence", "content": "In these cases, it’s important to establish a we frame instead of a you vs. me frame. You’re not working against them but trying to find a compromise with them."}, {"type": "sentence", "content": "The crucial point is that your priorities are not open for debate — it’s your life. But since the other person is important to you, you can work on a solution and find an alternative date together."}, {"type": "subtitle", "content": "Master Your Time or Other People Will Do It for You"}, {"type": "sentence", "content": "Time doesn’t stop or wait for anyone. We all have 24 hours every day and you have to try to make the most out of yours."}, {"type": "sentence", "content": "It can be hard to put in extra hours without giving in to distractions and feeling like you’re missing out on something. It can be hard to say no to people and reject them."}, {"type": "sentence", "content": "But without these two things, you won’t achieve what you want to achieve and won’t get where you want to get."}, {"type": "sentence", "content": "It’s your life. You have to take charge. You have to decide how to use your time or else other people will do it for you."}, {"type": "sentence", "content": "Do what you think is right and important to you."}, {"type": "sentence", "content": "Communicate in a polite, but assertive way."}, {"type": "sentence", "content": "Take charge of your time."}, {"type": "sentence", "content": "Once you have found time for something, it’s important to not waste it and make the most out of it. This one will help:"}, {"type": "sentence", "content": "PS: If you like my style of writing and don’t want to miss out, feel free to subscribe to my tiny little newsletter."}], "topic": "productivity"}