{"title": "The Severity Gap in Accessibility", "data": [{"type": "image", "content": "https://miro.medium.com/max/9924/1*r7Ascg08iL6e05BVgrzdrQ.png"}, {"type": "sentence", "content": "Today is Global Accessibility Awareness Day (GAAD). This is a day where those of us who work in accessibility attempt to draw even more attention to the impact and value of removing barriers for people with disabilities. But, as Sheri Byrne-Haber (Head of Accessibility for VMware) said earlier this week “GAAD is not a marketing event. GAAD is a day where you should be asking yourself can I do something to make the content/product I am putting out there more accessible”. So, in the spirit of that, today I’d like to explore what I’ve started calling “The Severity Gap in Accessibility”."}, {"type": "sentence", "content": "I’ve spent almost 20 years working in software development and technology. Every single company I’ve ever worked for has policies around how to address those “severity 1” or “severity 2” issues that occur in the systems we develop. Often times that means “drop everything and get it fixed”. At a high level, severity 1 issues are usually limited to those issues that fundamentally prevent customers from using your system — meaning it’s crashed and is down and no one has access to it. It’s a big deal, you’re losing business. You must get it fixed. Severity 2 issues, are usually one step removed from that. Perhaps the system isn’t entirely down, but some serious defect has been reported that is severely hampering functionality or eroding the trust you have with customers. Resolving the issue, figuring out why it happened, and making sure it never happens again suddenly becomes top priority. You put your top people on it, other things get delayed. Nothing anyone is working on is more important than getting the system back to peak performance. The factors that go into classifying something as a severity 2 issue vary greatly at most companies. But often times it comes down to the volume of customers who are reporting the issue in a short period of time, and how serious these customers consider the issue. I’ve seen companies drop everything to resolve a relatively minor issue because 100 customers reported it over a 3-day period. The assumption being, if 100 people reported it, 1000 must have experienced it, and 10,000+ COULD experience it in the next 3-day period. If I was to tell you that the 10,000 people represented approximately 50% of the company’s customer base, it would make perfect sense to drop everything and fix it right? What if that group of 10,000 only represented 1% of the customer base. Does it still make sense? Maybe not. But for most major companies, the potential exponential impact to brand, reputation, and customer trust often outweighs the specific data in these scenarios. For argument sake, let’s say that most companies would drop everything and resolve any issue that was projected to negatively impact 10% of their customers. Why then do many companies continue to defer and de-prioritize investing in accessibility efforts when more than 15% of the global population has at least one disability? This is the severity gap in accessibility. Closing this gap requires a shift in mindset, and a broader understanding of how severity is defined."}, {"type": "subtitle", "content": "What is Severity?"}, {"type": "sentence", "content": "In the dictionary, severity is defined as “the quality or state of being severe: the condition of being very bad, serious, unpleasant, or harsh”. When it comes to software development, severity is often defined as “the degree of impact a Defect has on the development or operation of a component or application being tested”. For those of us who work in software development, we usually assess severity against a pretty simple grid which classifies both impact and priority, like the one shown below."}, {"type": "image", "content": "https://miro.medium.com/max/3160/1*0TBdKXdofslIwkNPVktiEw.png"}, {"type": "sentence", "content": "In most cases, impact is usually determined by quality assurance teams while priority is often defined by business teams. The impact of a bug assesses the negative effect it has on the overall customer experience and perceived quality of the feature. Priority is generally about how important it is to fix an issue right away. These two data points, impact and priority, are combined to determine the severity of an issue using a simple rating system. Things that are considered to be “high priority” and “high impact” are given the highest severity ratings (SEV1). While things that have low impact and low priority get, you guessed it, low severity ratings (SEV 4). This approach can allow teams to quickly assess defects that are found by internal, pre-release, testing and ensure they are focused on fixing the highest impact defects prior to release. The same approach is frequently used to assess defects that are found post-release by customers who are using products and reporting issues. As I mentioned earlier, companies, and software development teams, develop standard operating procedures around how to respond to issues in each level of severity. But what factors into the assessment of impact and priority for any issue?"}, {"type": "sentence", "content": "Before we can dig into how we assess impact vs priority of any defect, let’s step back and understand what “defects” really are. Generally speaking, defects occur any time a system is observed to be behaving differently than it is expected to behave. In my experience defects can be categorized into four major buckets."}, {"type": "subtitle", "content": "Functionality Defects"}, {"type": "sentence", "content": "In most cases, the functional expectations for the customer experience are defined by product managers. They define the user stories the system should support, the tasks they want customers to accomplish, how they want customers to accomplish them, etc. When things don’t work as intended, you get functionality defects. This could be things like when a link that goes to the wrong place or a button executes the wrong action, or the result of an action isn’t correct."}, {"type": "subtitle", "content": "Design Defects"}, {"type": "sentence", "content": "Design typically focuses on three key areas: interaction design, visual design, and content design. Interaction design focuses on the ways in which a customer interacts with an experience, the way pages refresh or content moves, how a customer is moved through an experience. Visual design focuses on how the experience looks, the color choices, the text styles, the layout, the button shapes and styles, the icons and imagery being used in an experience. Content design focuses on the actual words being used, the language, the tone, the simplicity and clarity of the content being presented. Design defects occur when interactions don’t work as expected (e.g. the flow of a customer through the system isn’t correct). They can occur when the specified visuals don’t match expectations (e.g. the wrong colors or icons are used, the layout isn’t accurate, things are visually misaligned). And they can even be the result of grammatical errors or typos in the content."}, {"type": "subtitle", "content": "System Defects"}, {"type": "sentence", "content": "To build a system that accomplishes the functional and design objectives created by product managers and designers, engineers needs to define system architectures, low level technical designs (data classes and business logic and application components). System defects occur when there are errors in the business logic, or the architecture doesn’t scale, or the system crashes, or performance is impacted, or a variety of other technical issues that impair a customer’s ability to successfully use the system."}, {"type": "subtitle", "content": "Communication Defects"}, {"type": "sentence", "content": "Communication defects occur when information a customer needs to know to complete the task isn’t available to them. This could mean missing instructions or help text, unclear or inaccurate labels or menus, or missing feedback when errors occur in the system. But these defects can also occur when features exist that customers are not aware of, or when features that customers expect to be there, are missing entirely."}, {"type": "subtitle", "content": "Assessing Severity"}, {"type": "sentence", "content": "Earlier, I talked about impact and priority being primary factors in assessing severity. But, like most things in technology development, there are levels to impact and priority. There are many different scales that can be used for each of these, but for simplicity, let’s rely on the two I use most often in my work."}, {"type": "sentence", "content": "Impact Levels:"}, {"type": "sentence", "content": "· Blocker: Defects that completely block a customer from moving forward."}, {"type": "sentence", "content": "· Critical: Defects that severely hamper a customer’s ability to succeed or create undue burden on their use of the system."}, {"type": "sentence", "content": "· Major: Defects that cause problems in primary workflows but do not considerably impede progress."}, {"type": "sentence", "content": "· Minor: All other defects."}, {"type": "sentence", "content": "Priority Levels"}, {"type": "sentence", "content": "· Critical: Defects that must be fixed immediately or are in business-critical components of the system."}, {"type": "sentence", "content": "· High: Defects that impact business-critical or high-value components of the system and must be fixed as soon as possible."}, {"type": "sentence", "content": "· Medium: Defects that impact high-value components of the system but can be delayed to a future release."}, {"type": "sentence", "content": "· Low: All other defects."}, {"type": "sentence", "content": "If we come back to that severity assessment grid that we looked at earlier and plot some of these combinations you can see that assessing severity isn’t always as straightforward as a 2x2 grid can make it seem."}, {"type": "image", "content": "https://miro.medium.com/max/3160/1*Qt2WnRcBbuGHodKbNLp6uw.png"}, {"type": "sentence", "content": "The highest level of severity is reserved for issues that completely block a customer’s progress in a business-critical component (blocker/critical). Severity 2 issues can be either blocking issues in high-value components (blocker/high; critical/high) or issues that severely hamper a customer’s ability to succeed in any part of the system (critical/critical). Severity 3 issues are those that have a significant impact on a customer’s use of the product, but can wait to be fixed at a later date (major/critical; major/high). All other defects are assessed at severity 4. While there will always be outliers, you can generally use this approach to assess the severity of defects in every category outlined above. So, what does this mean for the severity gap?"}, {"type": "subtitle", "content": "Accessibility Defects"}, {"type": "sentence", "content": "If you’re at all familiar with the basic foundations of accessibility, you have already figured out that accessibility defects can be found in every single category we’ve been talking about. Functionality defects occur when assistive technology doesn’t work as expected. Design defects exist when colors don’t meet contrast requirements, or fonts are too small or too thin. System defects can occur when enabling assistive technology degrades performance, or crashes the application. Communication defects exist when customers don’t have the right labels on controls or usage hints to know what to do with those controls. And on and on. If we apply our framework for assessing severity of these issues, where do you think most accessibility defects would be placed? If we objectively assess the priority and impact of these issues, many of them would actually land in the severity one or severity two buckets. But have you ever actually seen an accessibility bug classified that way? My guess is that you have not. Neither have I. Have you ever asked yourself why?"}, {"type": "subtitle", "content": "The Severity Gap"}, {"type": "sentence", "content": "When we assess severity, it’s easy to stay objective about impact. Either someone is blocked from moving forward, or they are not. But there is a rather subjective element to assessing priority. Priority is determined by what’s deemed most important to the business. This is usually driven by a business’ understanding of who their customers are, what customers expect from the system, and what value the business wants to offer to those customers. If a business is completely unaware that people with disabilities account for a core segment of their customer base, they simply cannot factor these customers into their prioritization framework. This means that even if accessibility defects are discovered by internal teams, or reported by customers, they are written off as having “minor impact” and “low priority”. The severity gap is created when product teams and businesses have a limited view of who their customers are."}, {"type": "sentence", "content": "I believe that closing the severity gap in accessibility has three parts. First, we need to reset who comes to mind when businesses think about their customers so we can change their prioritization framework. Second, we need to ensure they have an objective understanding of the barriers created by accessibility defects, so they can properly evaluate impact. Finally, we need to help leaders understand the business value of investing in accessibility, so we can influence their perception of severity."}, {"type": "sentence", "content": "Over the next several weeks I’m going to explore each of these topics in more detail. But for those less familiar with accessibility, I’ll leave you with a few key facts to think about while you wait for my more detailed explorations."}, {"type": "sentence", "content": "1. The World Health Organization estimates that 15% of the population (1 Billion people) have one or more disabilities."}, {"type": "sentence", "content": "2. More than 74% of people with disabilities do not demonstrate any visible signs of disability."}, {"type": "sentence", "content": "3. People with disabilities, and their network of family and friends, have access to more than 8 Trillion dollars in discretionary spending potential."}, {"type": "sentence", "content": "4. A 2017 study by Cone Communications revealed that 90% of consumers believe companies need to operate in a way that protects and benefits society and the environment."}, {"type": "sentence", "content": "Closing the severity gap in accessibility is just good business."}], "topic": "design"}