{"title": "This Is the Most Hated Stock Market Rally Of All Time", "data": [{"type": "subtitle", "content": "All political persuasions despise crony capitalism’s nest egg"}, {"type": "sentence", "content": "Just about everyone across the political spectrum is loathing the latest stock bear market rally."}, {"type": "sentence", "content": "Socialists hate it because soaring stock prices add to the ever-growing inequality divide. With the bottom 90% owning 12%, the top 10% owning a whopping 88%, and, within that, the top 1% owning 54% of the stock market, for each green day, the rich get richer and the poor stay poor."}, {"type": "sentence", "content": "Capitalists hate it because governments and central banks continuing to prop up stock prices inhibits true price discovery. The purpose of a market, after all, is to find the right price for an asset whether that’s a barrel of oil, a carton of frozen orange juice, or a share of Amazon, Netflix, or J.C Penney."}, {"type": "sentence", "content": "Speculators hate it because the stock market is climbing while data reveals we're heading into the biggest depression on record. In the latest bear market rally, the smart money has become the dumb money: Hedge funds maintain a huge net-short position while retail investors profit from piling into risky sectors like cruise liners, airlines, and oil."}, {"type": "sentence", "content": "Anarchists hate it because, well, they’re anarchists. A state and central bank-sponsored Ponzi scheme is a top priority on their overthrow list."}, {"type": "sentence", "content": "One group, however, is championing the latest market pump: the croniest of crony capitalists: the hidden financial elite controlling most of the global wealth; members of an exclusive club with connections and influence in high places. How you enter this club remains a mystery, you’ll never meet any of its members or find out who they are."}, {"type": "sentence", "content": "The somewhat controversial, now-deceased comedian George Carlin gave us sufficient warning about silent financial oppression."}, {"type": "sentence", "content": "Carlin and the elites, however, failed to anticipate a global pandemic. COVID-19 disrupted the elite’s wealth distribution plan, forcing them to rescue asset prices via excessive money printing via QE and other Fed programs, bailing out companies backing their risky investments while crushing the purchasing power of savers."}, {"type": "sentence", "content": "Their primary aim is to recoup losses from the stock market. Due to loose monetary policy limiting returns elsewhere, they have parked most of their wealth in equity indices such as the S&P500: the embodiment of a fake market — Bernie Madoff will be proud. The index is already back to its repo market crisis levels of 2019, despite the Atlanta Fed expecting GDP growth to drop -41.9% next quarter, and five stocks equalling 20% of its weighting: Apple ($AAPL), Amazon ($AMZN), Facebook ($FB), Microsoft ($MSFT), Google ($GOOG), all possessing awful forward-looking fundamentals."}, {"type": "sentence", "content": "Apple trades 2% off its all-time highs despite the company not offering guidance and iPhone sales down 77%. Facebook trades 1% off its all-time highs despite advertising revenue — the company’s main source of income — being “approximately flat compared to the same period a year ago, down from the 17% year-over-year growth in the first quarter of 2020,” according to their Q1 2020 earnings report. Amazon trades above $2400 per share despite Jeff Bezos admitting COVID-19 will eliminate all operating profits in the second quarter of 2020. “We expect to spend the entirety of that $4 billion, and perhaps a bit more, on COVID-related expenses.” $2400 buys either one Amazon share, one luxury Tag Heuer Carrera 5 watch, or one month’s rent in a swanky Brooklyn apartment. In these tough times, what would you choose?"}, {"type": "sentence", "content": "The phrase “the stock market is not the economy,” remains truer than ever as the disconnect between economic fundamentals and stock prices reaches record levels. The stock market has become a wealth transfer mechanism. Once-unconventional, now-standard monetary policy tools like dropping interest rates to zero, printing trillions of dollars into existence, and implementing quantitative easing, shift wealth into “certain hands.”"}, {"type": "sentence", "content": "The people, however, aren’t just sitting back and letting the financial elites implement their agenda without a fight. Each day, more and more people wake up to the truth. The people want stability, the ability to save, positive not negative interest rates, and a stock market that reflects a booming, real economy, not what we have right now. Thus, the escape from financial repression has begun."}, {"type": "sentence", "content": "To combat financial repression you have to either bet against the system or withdraw from it completely. The high-risk, less desirable approach is shorting, because, for years, bold measures to prevent a market collapse have bankrupted many bearish speculators. Then, there’s the less high-risk method of parking your money in cryptocurrencies. Investors are pulling money from the megabanks and putting it to work in the crypto space because who wants to receive 0.11% interest from a savings account, right? Then, of course, there’s the tried-and-tested, low-risk escape to precious metals. Gold is up 52% from it’s 2018-lows as it continues to protect people’s purchasing power."}, {"type": "sentence", "content": "The stock market, however, is losing its credibility and legitimacy. Its fate lies in the hands of whether we want to profit from irrationality and inequality: the catalysts driving the latest equity market rally. Maybe it’s time we embrace one of the other monetary paradigms gaining popularity in modern-day society. Predicting whether that’s crypto, gold, or something else entirely remains a challenge, but with COVID-19 rapidly increasing the pace of societal change, the answer will come sooner rather than later."}, {"type": "subtitle", "content": "Want more analysis and ideas? Subscribe to my mailing list."}], "topic": "economy"}