{"title": "The Fundamental Theories Behind Artificial Intelligence", "data": [{"type": "subtitle", "content": "Learn about the history, the people, and the technologies driving AI today"}, {"type": "image", "content": "https://miro.medium.com/max/10000/1*KawUV6QkG5fE-zQCNCNgDQ.jpeg"}, {"type": "sentence", "content": "Artificial intelligence has been a very buzzy topic for a while now. Sometime in the last decade, I’m not sure when exactly the tipping point was, the tech world started to truly blur the line between science fiction and reality. Cars learned to drive themselves, robots began delivering takeout food, watches began resembling a James Bond toy, and virtual home assistants sat ready to answer any question that we could dream up."}, {"type": "sentence", "content": "The implications of artificial intelligence have been both rapid and massive, to say the least, but how did it get to where it is now? What were the initial goals of artificial intelligence, and what technologies have allowed for its advancement? What brought AI out of science fiction and into our living rooms?"}, {"type": "subtitle", "content": "The Early Days"}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*7c4Q_s6gbiBhB7Y23nyS3w.png"}, {"type": "sentence", "content": "The field of AI dates back much further than you may think — all the way to the 1950s. In August of 1955, John McCarthy (Dartmouth), Marvin Lee Minsky (Harvard), Nathaniel Rochester (IBM), and Claude Elwood Shannon (Bell Telephone Laboratories) completed “A Proposal For The Dartmouth Summer Research Project On Artificial Intelligence,” officially coining this term and lighting the first spark of what we know as AI today."}, {"type": "sentence", "content": "The proposal outlines what these four saw as the problems standing in the way of advancements, their relevant experience thus far, and expectations of the research project. The founding four believed that all in all, they could make “significant advancements” in two months, with the right ten people in the room, and a whopping $13,500. The vision for the summer was described as such:"}, {"type": "subtitle", "content": "The Roadblocks"}, {"type": "sentence", "content": "In order to understand the design of the research project, we must first understand what problems it was designed to solve and accomplishments it was designed to achieve (bear with me — we need some context to understand anything further, but I will make it as painless as possible). The main points initially outlined in relation to the “artificial intelligence problem” were as follows:"}, {"type": "sentence", "content": "I highly recommend reading their brief summaries of each of these (which can be found on page two of the original proposal), but even without reading, some of this likely looks familiar to you. Here, in the first discussions of artificial intelligence, we see neuron nets (now related to neural networks/deep learning), self-improvement (an important goal of today’s machine learning field), and automatic computers (the issue of computational limits and our ability as engineers to fully optimize their abilities)."}, {"type": "subtitle", "content": "The Brains"}, {"type": "sentence", "content": "Each founding member brought with him a unique expertise, all of which could take aim at a particular problem above."}, {"type": "sentence", "content": "Claude Shannon had a background in designing “machines that learn,” as well as extensive experience working with the theory of Turing machines (if you are not familiar with this theory, I recommend that you briefly check out the Stanford Encyclopedia of Philosophy entry on it). Shannon was a perfect candidate to tackle the field’s self-improvement problem."}, {"type": "image", "content": "https://miro.medium.com/max/400/1*1W7L2FYYOYx1AbI7FttQ_A.jpeg"}, {"type": "sentence", "content": "Marvin Lee Minsky had already written his Princeton Ph.D. thesis on the topic of neural nets, titled “Neural Nets and the Brain Model Problem.” Already having built a learning machine using nerve nets, he could focus on the neuron nets problem."}, {"type": "image", "content": "https://miro.medium.com/max/400/1*E00ue-hVMPVkyPPUPrUdSg.jpeg"}, {"type": "sentence", "content": "Nathaniel Rochester and another IBM engineer are credited with the creation of one of the most popular, large scale automatic computers of the time, called the IBM Type 701. This knowledge, along with his experience in building technology that gives computers the ability to do human tasks, would position Rochester well to tackle both the problems of automatic computers and programming a computer to use a language."}, {"type": "image", "content": "https://miro.medium.com/max/400/1*GWeXtXt9Tr003IeUXjgdNw.jpeg"}, {"type": "sentence", "content": "John McCarthy, whose work was largely centered around the question of mathematics and how it relates to the human thought process. Both gave him a great overall perspective on the roadblocks ahead and were of great value to the artificial intelligence problems of randomness and creativity."}, {"type": "image", "content": "https://miro.medium.com/max/540/1*ohye7UIOqHoQbbCWyAoZBA.jpeg"}, {"type": "sentence", "content": "Now, I am not saying that they each worked only on those problems listed — you can actually read, starting on page five of their proposal, individual writing from each team member on his focus and intentions. Rather, I find that their expertise makes it clear why this team was primed to take on such a complex question."}, {"type": "subtitle", "content": "AI Today"}, {"type": "sentence", "content": "As we saw earlier, much of what was discussed in that initial proposal is reminiscent of the current dialogue surrounding AI. In fact, it was advancements in some of these original ideas that allowed companies like Google, Amazon, and Apple to build their AI technologies."}, {"type": "subtitle", "content": "Neural networks"}, {"type": "sentence", "content": "At its most basic level, a neural network is a set of algorithms — but this is sort of like saying that a human brain is a collection of atoms. Algorithms are the building blocks, though, and these groups of algorithms are specifically modeled (loosely) on the human brain."}, {"type": "sentence", "content": "A neural net can include thousands or even millions of individual, complexly interconnected processing nodes. These nodes are designed to recognize patterns, much like the human brain does. The advancement of neural networks has made possible advancements in the field of deep learning — a branch of machine learning, and an integral part of modern AI."}, {"type": "subtitle", "content": "Machine learning and deep learning"}, {"type": "sentence", "content": "If I had to point to one field and say, “That was it. That is what made modern AI possible,” it would be machine learning. Machine learning is the idea that computers can learn from experience. These algorithms use statistics and massive amounts of data to identify and utilize patterns."}, {"type": "sentence", "content": "You’ve likely heard about the many, many privacy issues plaguing users on the internet today. We all know why companies want to harvest our data — money. But how does my data translate to dollars and cents? Some companies sell data for profit. Others, though, feed all of that data — every mouse click, every video watched, the length of time the video was watched, where I went next after the video was over, etc. etc. — into these algorithms. These highly sophisticated, perfectly tuned algorithms digest all of these patterns to create startlingly accurate predictions of user behavior. The ingestion and analysis of this data is how we get suggestions on what to watch next, and end up watching for hours and hours and hours."}, {"type": "sentence", "content": "If this wasn’t complex enough already, deep learning is an even more complex, more evolved version of machine learning. It involves the most sophisticated neural networks and is capable of picking up on the most subtle behavioral patterns."}, {"type": "subtitle", "content": "Supercomputers"}, {"type": "image", "content": "https://miro.medium.com/max/1000/1*83URj_a_oeQtLmu1zlEknw.jpeg"}, {"type": "sentence", "content": "If you’ve ever heard your MacBook Air start making odd sounds and heating up after one of these long Netflix binges, you may be asking yourself how in the world this type of computing is possible. For a very long time, it simply wasn’t."}, {"type": "sentence", "content": "Above is a picture of a MacBook from 1995. Now consider whatever device you are reading this on right now, and think how far we have come in even just my lifetime. This feat is nothing short of awe-inspiring. Now think about how far we have come since McCarthy, Minsky, Rochester, and Shannon spent their summer at Dartmouth. Wild."}, {"type": "sentence", "content": "These advancements in computing power have been crucial to the success of AI. It takes incredible computing power to be able to run the machine learning algorithms needed for artificial intelligence. Some people don’t realize this, but computing power is a significant source of the limits in technology. For instance, modern password guidelines and encryption are only secure because we don’t have computers that are capable of brute force hacking them (yet). Sure, it would take billions of years to do it, but that is based on today’s computing forces. As computers become more powerful, that timeline shrinks."}, {"type": "subtitle", "content": "Big data"}, {"type": "sentence", "content": "Everything above really comes down to one thing: data. The unimaginably massive volume of user data that exists is the fuel in the rocket ship that is artificial intelligence. Yes, without neural networks, machine learning, and computers capable of running both, the data would be relatively useless."}, {"type": "sentence", "content": "But the data is really what machines learn from. The more that a machine gets, the smarter it becomes — the more refined its knowledge is and the more accurate its predictions are. Everything that we think of when we think of AI, whether it's talking to our Google Home or getting creeped out upon seeing an advertisement for that thing you were thinking about this morning, is born out of analyzing data sets that are so massive, they can guess how to successfully interact with you. Maybe you’ll be a little nicer to Siri next time she doesn’t know how to respond."}, {"type": "subtitle", "content": "The Future"}, {"type": "sentence", "content": "I am not going to pretend to know what the future of AI will look like. What I will say is that we have only just begun to see its effects on our world, and while the risks are insignificant if Google gets my Spotify request wrong, it’s quite a different story when we start talking about medical advice, financial handlings, teaching, and more. In addition, the fight for more data privacy is full-steam ahead, and a consistent influx of data is essential for further advancements. As the algorithms and computers advance, they will be able to do more with less. But still, they need their fuel."}], "topic": "artificial-intelligence"}