{"title": "TikTok Just Restricted Music for Brands. Are Influencers Next?", "data": [{"type": "image", "content": "https://miro.medium.com/max/2400/0*GFP-GvWxoZj4gUoq.jpg"}, {"type": "sentence", "content": "Last week, Business Insider reported that TikTok had restricted the music available to brands on the platform. Until this development, companies like Chipotle were able to cultivate huge followings by tapping into the latest trends, which were more often than not tied to music that was readily available on the platform."}, {"type": "sentence", "content": "If these brands had attempted to share their TikTok creations on platforms like YouTube, Twitter, or Instagram, they would have faced scrutiny from labels and publishers, who often charge hefty fees for companies to include music in ad campaigns. Instead, because of the music-driven nature of TikTok as a platform, businesses felt that additional licensing was not necessary when including music in their TikTok content. These changes surrounding the commercial use of music on the platform are a good start for ensuring that artists and writers are compensated fairly for their work, but if brands are being held to these new standards on TikTok, will influencers be held to these same standards next?"}, {"type": "subtitle", "content": "TikTok’s Precarious Licensing Situation"}, {"type": "sentence", "content": "TikTok has been in hot water with the music industry since it rose to prominence in 2018. Like any new technology that relies heavily on music, licensing remains the most significant barrier to entry. For an application to legally use music in its functionality, the company behind that application has to secure a variety of different licenses that largely depend on the use case. Even companies like Spotify and Apple Music are continually negotiating new deals and extensions to maintain the catalogs that create their inherent value."}, {"type": "sentence", "content": "For this article, four stakeholders have interests in how brands use music on TikTok:"}, {"type": "subtitle", "content": "The Labels"}, {"type": "sentence", "content": "The labels, who often receive the most focus for licensing issues, control the master recordings for the majority of popular music. A 2018 Midia report stated that Warner Music Group, Sony Music Entertainment, and Universal Music Group control about 70% of the global music market. With incomplete catalogs serving as a death sentence for music-focused products, securing licenses from the big three labels is paramount to a music-focused application’s viability."}, {"type": "subtitle", "content": "The Publishers"}, {"type": "sentence", "content": "The publishers control catalogs of compositions. They differ from the labels in the fact that they control songs — not recordings. The easiest way to think about it is that publishers control the sheet music, and the labels control the recordings of people playing that sheet music. Publishers are about 50% of the battle when it comes to securing the right to use songs within an application. The big three labels also have publishing arms, but unlike the label side, there is far more competition — companies like Downtown Music Publishing and Concord control interests in some of the most important songs of the last 50 years."}, {"type": "subtitle", "content": "TikTok"}, {"type": "sentence", "content": "TikTok is the result of ByteDance acquiring Musical.ly and repackaging the teen-friendly application as a new phenomenon. Musical.ly itself was tactical about how it secured licenses for its platform, striking a deal in 2016 to use music from Warner’s catalog."}, {"type": "subtitle", "content": "The Brands"}, {"type": "sentence", "content": "Every company from McDonald’s to your favorite local shop wants to use music to advertise their company, but they want to avoid paying when they do not have to."}, {"type": "sentence", "content": "With these players in mind, one can see how official brands joining TikTok presented an issue to the licensing status quo. As recently as a month ago, David Israelite of the National Music Publishers Association told the Financial Times that he “estimated more than 50% of the music publishing market was unlicensed with TikTok.” With thousands of publishers across the world, it makes sense that TikTok would need some time to license all the songs available on its platform properly. However, asking for forgiveness rather than asking for permission does not always bode well-just ask Napster."}, {"type": "sentence", "content": "While the specifics of TikTok’s existing licensing deals are not publicly available, it’s reasonably safe to assume the licenses focus on allowing regular, non-brand users to add songs to their content. The core use of music on the platform is to synchronize songs to video, so the basis of the licensing deals would be a synchronization license that finds a way to monetarily reward the music stakeholders — likely based on the scale of how many times a song is used and played."}, {"type": "sentence", "content": "The existing deals and to-be-negotiated deals might be fine in a regular user’s use-case, but these deals cross a line when they allow brands to use music for free. Labels and publishers make millions of dollars a year securing sync deals for their catalogs, and brands wishing to use music in something as innocuous as an Instagram video have to pay to have that media cleared for public consumption. TikTok allowing brands to access every song, however, created a situation where major corporations could use the hard work of musicians to advance their brands while dodging the fees and licenses that would ordinarily be required."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*GuHFScbW7yKWf3KU.png"}, {"type": "subtitle", "content": "TikTok Influencers and the Music Industry"}, {"type": "sentence", "content": "The music industry is obsessed with TikTok right now. From shooting music videos at The Hype House to packaging a challenge with each single, record labels are trying every tactic at their disposal to make their songs the next “TikTok Song.”"}, {"type": "sentence", "content": "Although the barrage of challenges and dances being thrown around can be exhausting, it makes sense why labels keep attempting to exploit their tracks on TikTok. Looking at the Billboard Hot 100 over the last year, it is undeniable that TikTok has played a significant role in how music disseminates to the masses. While some songs, like Drake’s “Toosie Slide,” enjoy immediate success on the platform, there are plenty of “slow-burn” hits created on TikTok — like Trevor Daniel’s “Falling,” which currently sits at №28 on the Hot 100 despite its October 2018 release date."}, {"type": "sentence", "content": "Of course, it is unrealistic to expect that most songs will have organic success on the ByteDance-owned platform. The metrics that a “TikTok” song brings can launch an artist’s career, and for all these reasons, labels have started to pour their digital marketing dollars into influencer campaigns."}, {"type": "sentence", "content": "It is impossible to read about contemporary music marketing tactics without being inundated with articles about TikTok influencer marketing. Companies like UK-based FanBytes have a network of influencers on TikTok that they seed creative to, hoping their clients’ songs will blow up on the app. There is no way to tell what percentage of TikTok success is purely organic, but what we do know is that significant money is being invested into marketing on the platform, which requires paying content creators to use specific music."}, {"type": "sentence", "content": "This relationship between record labels, publishers, and influencers presents a significant problem in light of the new restrictions on music available to brands. TikTok’s decision to limit brands to royalty-free music is a political and legal move to ensure companies are securing the proper licenses for “advertising” with music. However, given that brands and companies are pouring millions of dollars into influencer campaigns on TikTok, official brand accounts only make up a small fraction of the “advertising” happening on the application."}, {"type": "sentence", "content": "A quick search for the hashtag #ad on TikTok reveals 9.5 billion views and #sponsored another 1.9 billion. These numbers are relatively small in the scheme of the views on the platform, but many campaigns do not overtly reveal they are paid advertisements. The FCC released a guide on how influencers should disclose their work with brands and products, but to this day, punishments for undisclosed sponsored content remain mostly unenforced."}, {"type": "sentence", "content": "If brands need a commercial license to use music on TikTok, shouldn’t sponsored content be held to the same standard? Chipotle using Doja Cat’s “Say So” to sell burritos is no different than an influencer using The Weeknd’s “Blinding Lights” to sell Fashion Nova. Yes, brands have the capital necessary to license a song correctly, but if brands are paying influencers to sell a product via a post, should the brands be responsible for properly clearing the music used in that influencer’s post?"}, {"type": "sentence", "content": "Platforms like Instagram have created additional sponsorship tools, where influencers can reveal paid partnerships and directly tag affiliated brands. Not only do these tools increase transparency, but they also increase accountability when problems arise. TikTok has taken the first step to ensure that musicians and writers are appropriately compensated for commercial use of their work, but offering complete music libraries to influencer advertisements requires additional adjustments to be made."}, {"type": "sentence", "content": "The music industry’s focus on TikTok marketing creates a conundrum on how to best move forward with commercial music licensing for influencers. On the one hand, companies paying an influencer should be held accountable for music used in that influencer’s post. On the other hand, the music industry does not necessarily want that level of accountability-because then these music-based campaigns would also fall under the same scrutiny. The situation presents a catch-22 for music stakeholders: they want to enjoy the perks of unenforced sponsored content when it comes to song-focused creative content, but they also want to ensure brands are fairly licensing music when it comes to product-focused advertising."}, {"type": "sentence", "content": "Where these music restrictions go will largely depend on how the music industry assesses TikTok as a marketing asset. If allowing sponsored content to use music freely means more sales and more streams, labels and publishers will likely look the other way. As long as the sponsored posts create a greater benefit than a detriment, it is unlikely that further restriction will come swiftly. With TikTok’s shaky licensing situation right now, there is no way to tell which way the pendulum will swing. Still, the music industry currently has a good thing going marketing-wise, and the labels and publishers will have to consider the ramifications of further restrictions before making additional changes to licensing on TikTok."}, {"type": "sentence", "content": "Follow Nathaniel Heller on Twitter at @FiveXT."}, {"type": "sentence", "content": "Originally published at https://djbooth.net on May 21, 2020."}], "topic": "social-media"}