{"title": "Graduating in Lockdown With No ‘Safety Net’", "data": [{"type": "subtitle", "content": "What happens next for graduates who can’t move back in with Mum and Dad?"}, {"type": "image", "content": "https://miro.medium.com/max/4096/0*TBZttU9fytEWokAX"}, {"type": "sentence", "content": "More than 400,000 students across the UK are about to graduate into, in effect, a national hiring freeze. As University semesters come to a close, so will student tenancies; many within the next few weeks. Of all the disappointments registered by final year students in the spring of 2019/20, the final one may be the inevitability of moving back into the family home— in fact, huge numbers have already done so."}, {"type": "sentence", "content": "But there exists a pocket of students about to graduate in lockdown, on the dregs of their final student loan payment, for whom the safety net of ‘Mum and Dad’ doesn’t exist: students who are estranged from their parents, and care leavers (young adults who have spent time in care as a child). Minimal data on estranged and care experienced students is collected, but the challenges they face are well documented. At the end of a usual final year the transition from student to graduate can be fraught. These students are lacking the countless forms of support a family provides, on top of the monumental and chronic stress of potential homelessness mixed in with classic exam worries."}, {"type": "sentence", "content": "Alongside estranged and care experienced graduates will be others for whom coronavirus has thrown up a wall between them and the family home; those from other countries, or those with an at-risk parent, for example. There is no data regarding these students/graduates, particular to the current situation."}, {"type": "sentence", "content": "What should we suggest to those graduates without a family home to retreat to, as they attempt to secure employment in the summer of lockdown?"}, {"type": "subtitle", "content": "The Government Response"}, {"type": "sentence", "content": "In their ‘Student Safety Net’ campaign launched on April 22, the NUS wrote that in the current crisis “students occupy the worst of all possible worlds”. They called for a specific support package for students including a hardship fund totaling £60m, and in addition, “an economic package for those who complete their qualifications during the current pandemic, providing access to a grant which can be used for training, reskilling or development.”"}, {"type": "sentence", "content": "As yet there has been no direct response to this call by the government. They did outline support to be provided to universities and students on May 4, and all but one of the ten measures outlined provided assistance to keep HE institutions afloat and running as usual. The single measure which directly addressed the financial needs of students themselves was permission given to universities to move money from elsewhere into existing hardship funds."}, {"type": "sentence", "content": "However, the money released is from other essential services such as ‘student premium funding’, ringfenced for expanding access for disadvantaged students’ entry into HE in the first place. Emma Hardy MP, Labour’s Shadow Minister for Further Education and Universities, said that using premium funding on student hardship specific to the pandemic “could further reduce the opportunities for disadvantaged students” in the coming year. Claire Sosienski Smith, NUS Vice President for HE, commented further:"}, {"type": "sentence", "content": "The government identified those students particularly at risk in the current pandemic as:"}, {"type": "sentence", "content": "The government and the Office for Students (OfS) placed the responsibility of providing supplies, accommodation and financial support for these students at the door of universities, which may feel to some like a brush off but at the very least makes some sense — students are ‘in their charge’ whilst they are enrolled. But this only seems to clarify that while there is minimal and questionable provision being made for students, there will be none for recent graduates. As May draws to a close and some of those at-risk young people cease to be students, where does the responsibility for supporting them lie? Sosienski Smith continues:"}, {"type": "sentence", "content": "What are the options for our new (wannabe-)taxpayers cornered between the removal of university support, minimal or non-existent family support, ending tenancies, a decimated job market, and an unreliable benefits service?"}, {"type": "subtitle", "content": "I Guess…Universal Credit?"}, {"type": "sentence", "content": "The limitations and complications of Universal Credit are well documented, and the system has been put under immense pressure during the first months of the pandemic. The number of new claims increased by six times between mid-March and early May, seeing 2m new claimants. If graduates choose to apply, they will have to wait until the semester officially ends and they are no longer a registered student, at which point they’ll quickly discover that built into the system is a five-week wait for the first payment."}, {"type": "sentence", "content": "The government has amended the amounts awarded with a slight annual increase, which works out at around an extra £20 a week. They’ve also abolished the need to physically attend the jobcentre for check-in appointments. But for single claimants under 25, the standard allowance remains at less than £350 per month, and the housing element does not cover average single room rent in most cities. This lack of provision is designed to encourage people to work alongside receiving benefits, of course."}, {"type": "sentence", "content": "It’s a cliché that many non-vocational course leavers, especially those who studied an arts subject, will go into the service industry while building a portfolio and contacts. According to Boris’ latest statement, the service industry looks to remain tentative at best (dormant/receding at worst) for the next few months. July was given as a tentative opening date for “some” hospitality businesses, “if the numbers support it”."}, {"type": "sentence", "content": "The benefits system is likely to be hit by yet another spike of applications as students across the country graduate. Many young people who might have relied on Universal Credit alongside service industry or gig economy work — at home or not — may find themselves reliant on only the standard allowance of a few hundred pounds a month."}, {"type": "subtitle", "content": "Nadia, Andrea, and Lina"}, {"type": "sentence", "content": "There are no existing data on students who may be unable to return home for reasons other than estrangement. It’s likely that no matter their social status, parents’ health may be a factor in many being unwilling to return home. But dynamics that prevent students from returning may have changed in countless ways. Two students I spoke to, on good terms with their families, told of complex, nuanced situations:"}, {"type": "sentence", "content": "Lina moved to the UK in 2015, shortly before Brexit. She has maintained part-time videographer work during her studies — from which she is currently furloughed — and a network of contacts amongst whom she’s hoping to build a freelance career post-graduation. All her work contacts are in the UK. Lina’s father passed away shortly after she moved here, so her mother subsequently moved into a one-bedroom apartment. Her mother lives alone with no room for Lina, who has been on a trajectory to apply for UK residency since she arrived in 2015. The process forbids her from leaving the country for more than 2.5 months, or her application will be rendered invalid on the grounds that she has not lived in the country consecutively for 5 years (meaning her time spent in the UK ‘resets’ to zero.) Above all this, an international move home would be an impossible expense on what is left of her student loan. Her tenancy ends Sep 5."}, {"type": "sentence", "content": "Andrea* had a job lined up at a charity. The position has now been defunded, and the offer revoked. Her parents, who used to live in a house provided by the church, separated during her studies; both have downsized as a result. In addition, Andrea’s mother has mental health issues, and it has been agreed that it is not appropriate or safe for her or her siblings to live with their mother. Andrea’s father’s house cannot accommodate her as well as her siblings. Her tenancy ends June 1."}, {"type": "sentence", "content": "Data gathered by Universities UK says that “[i]n 2016–17, more than 90% of graduates were in work or further study within six months of leaving university”. The data for the class of 2020 remains to be seen, but is likely to be nowhere near."}, {"type": "subtitle", "content": "The Specific Position of Estranged and Care Experienced Students"}, {"type": "sentence", "content": "Nadia Sajir is about to graduate from the University of Bristol with a joint-honours degree in English Literature and Film. During her three years as a student she has been a passionate advocate, setting up and representing the SU’s Care Leavers and Estranged Students Network and fighting for support from both the university and further afield for her fellow students."}, {"type": "sentence", "content": "Nadia says that as a care-leaver, she was initially discouraged by her social worker from attending university, and that when she did the options available to her were not outlined. It wasn’t until her final year that she found out about all of the financial supports that were in place. Nadia’s experience was different in ways her fellow students might be able to basically imagine — for example, having periods of homelessness — but also in other, more nuanced ways: by the time she does move into new accommodation, she has had to throw away most of her possessions as she has nowhere to store them. Despite her more isolating experiences, Nadia enjoyed and finished her degree, and credits her resilience in part to being care experienced."}, {"type": "sentence", "content": "When visiting Shenzhen with the university’s Summer Abroad programme, Nadia fell in love with China and its culture, and this year secured a job for herself as a Junior Producer at a television station there. The job didn’t originally start until October — and has now been pushed back to 2021. Her tenancy in Bristol ends on June 30, and she doesn’t yet know how she might bridge a financial and housing gap that will last several months:"}, {"type": "sentence", "content": "Student Finance England reports that there are currently 8,025 students across the UK who are registered estranged from their families, though it is very hard for students to evidence, and therefore officially register. The exact number of estranged students remains unknown."}, {"type": "sentence", "content": "Stand Alone, a UK charity that supports people who are estranged released a report in January titled ‘What Happens Next?’, an outline of the challenges faced by estranged and care experienced graduates. Stand Alone regularly supports care leavers, but also “LGBT+ students who have been rejected by family, abuse survivors, students who have been rejected by new step-parents after re-marriage or those who have different morals, values and beliefs to their immigrant parents.” Alongside the tangible absences of a roof over their heads and financial support, are other pillars that estranged young graduates will have to make their way without; everything from rent guarantors, to industry contacts, to emotional support and guidance. Stand Alone calls this ‘family capital’."}, {"type": "sentence", "content": "When I spoke to Nadia, she recognised that while there were students who might not be able to rely on the safety net of returning to the family home for specific reasons, those students may still have the ‘family capital’ of emotional support and financial support more generally"}, {"type": "sentence", "content": "Without a dedicated support package for graduates who have no guaranteed roof over their heads, we are staring at a clear crack through which some are going to slip. We ask “How did this happen?” when people are failed by our institutions. In this case, we can see a number of at-risk groups who are being provided for, however problematically. This group isn’t."}, {"type": "sentence", "content": "Stand Alone’s ‘What Happens Next?’ report states that “If we’re to use higher education as a lever for social mobility, or as a tool to create higher-earning graduates, it’s crucial that students aren’t left at a material cliff edge at the end of their degree, back to square one, unable to focus, and at risk.”"}, {"type": "sentence", "content": "The alternative to providing what the NUS is asking for, or some sort of equivalent graduate hardship fund, is to ask these young people to engage in any number of risky decisions, from signing up for a flat which they need to go into debt to maintain, to moving back in with parents whose lives they then risk, or from whom they themselves are at risk."}, {"type": "sentence", "content": "Becca Bland at Stand Alone says that all relevant institutions must come together — “the government, employers and universities working together to be responsible for these education leavers in an impossible position”. The ‘What Happens Next?’ report outlines the existing good practice of universities that act as ‘corporate parents’ for their estranged graduates."}, {"type": "sentence", "content": "As Nadia prepares to leave her position as representative for the Care Leavers and Estranged Students Network, she reflects back on her achievements. She instituted a talk for the freshers’ week programme in which arriving students are oriented to the specific struggles of estranged and care experienced students. She set up a graduation bursary so that students in the network could not only have their gown rental and photography paid for, but also a meal voucher for them and a friend in place of a celebration with family."}, {"type": "sentence", "content": "She also discussed her latest contribution:"}, {"type": "sentence", "content": "…something she resented given it only cost her £350 in total, and the university had recently completed a £5m makeover to their sports facilities."}, {"type": "sentence", "content": "Young people who have moved overseas to study in the UK, who have experienced great emotional unrest in the family, or who have had to grow up without a stable family at all often show incredible resilience. It needs to be recognised that this doesn’t mean they ‘get used to dealing with things on their own’. Ongoing financial and emotional difficulties do not transform people into superhumans devoid of needs, they lead to chronic stress, burnout, and being forced into dangerous scenarios."}, {"type": "sentence", "content": "After top-up fees, removal of maintenance grants, a lack of funding put towards widening participation and now the diverting of that funding to appease other hardships, it’s clear that more provision needs to be made and maintained for young people in precarity. Where’s the bailout for the kids who are becoming accomplished adults, largely alone, against the odds?"}, {"type": "sentence", "content": "Thanks to everyone who was willing to speak to me, particularly Nadia, Andrea, and Lina, and the other graduates I spoke to. Also Becca Bland from Stand Alone; Ed Rapley for guidance on UC; Rory Hughes, Zamzam Ibrahim and Claire Sosienski Smith from the NUS; and Aislinn Keogh from the Office for Students."}, {"type": "sentence", "content": "*Name changed."}], "topic": "education"}