{"title": "How Planes Fly", "data": [{"type": "subtitle", "content": "An explanation that even your grandmother will understand"}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*QZnV_aTeAxCeKEnD"}, {"type": "sentence", "content": "How do planes fly? This is a question that all children ask themselves, but also many adults. At least I have always asked myself that question, and here I will try to explain it as simply as possible."}, {"type": "sentence", "content": "There are an infinite number of factors that affect the flight of an aircraft: its shape, its weight, the distribution of its weight, how the weight distribution changes as the fuel is consumed, atmospheric pressure, temperature, wind speed and direction, altitude and much more. Years of engineering studies detail each of these factors, but what is really essential to keep an aircraft in the air is one thing only: the wings. It sounds obvious, everyone knows: without wings a plane can’t fly. But how do they actually lift tons of steel off the ground?"}, {"type": "subtitle", "content": "Bernoulli’s Principle in everyday life"}, {"type": "sentence", "content": "The answer to this question is Bernoulli’s principle. It’s true, I promised to give a simple explanation, so I won’t dwell on equations and diagrams. I will try to explain this law of physics with the help of a few intuitive examples."}, {"type": "image", "content": "https://miro.medium.com/max/9736/0*9nrbUXj2bgzn5sHg"}, {"type": "sentence", "content": "The explanation for this phenomenon is Bernoulli’s principle, which states that:"}, {"type": "sentence", "content": "This depression sucks in the body, applies a force. So the air that runs fast on the sides of the truck sucks the tarpaulin outwards, making it swell and wave. The strong hurricane winds create a depression above the roofs, where the air is faster, and an upward force is created. When we blow on the sheet of paper, the air above the sheet is faster than the air below the sheet, which is practically stationary, and the low-pressure area that forms makes the paper strip rise."}, {"type": "subtitle", "content": "The lift"}, {"type": "sentence", "content": "The wings of airplanes exploit the Bernoulli’s principle. The wing profile is designed in a very special way to ensure that the air flows faster in the upper part of the wing than in the lower part. The force created by the depression that forms is called lift. As the speed of the aircraft increases, the lift increases. When the lift is greater than the weight of the aircraft, it rises off the ground. Tons of metal, cargo and people are sucked upwards like the tarpaulin of a trailer, like an unlucky roof or like our sheet of paper."}, {"type": "sentence", "content": "Many other aircraft control devices exploit the lift. Flaps, for example, are moving parts designed to increase the wing area during take-off and landing, when the aircraft travels more slowly, to increase lift. The ailerons, elevators and rudder are moving parts mounted on the wings and tail of the aircraft that allow the airflow to be modified to control its roll, pitch and yaw."}, {"type": "image", "content": "https://miro.medium.com/max/8576/0*MnBswSMtJuP5wdXd"}, {"type": "sentence", "content": "After explaining the principle that allows aircraft to remain in the air, it becomes clear that a normal aircraft cannot fly upside down. The low pressure zone above the wing would in fact drag the aircraft down. Only aerobatic aircraft can perform this manoeuvre, because they are equipped with a special wing with a symmetrical profile, which allows to create lift on both sides, as needed."}, {"type": "sentence", "content": "It is therefore by exploiting Bernoulli’s principle that aircraft are able to counteract the force of gravity. This phenomenon is also leveraged in many other applications, primarily in some aerodynamic components of racing cars. These elements are basically inverted wings and are able to generate downforce, meaning downward lift. It allows to keep the cars pushed to the ground, to have more grip when cornering. Why do cars have more grip if they are pushed down towards the road? Maybe I’ll tell it another time…"}], "topic": "science"}