{"title": "How excessive restrictions on some psychiatric drugs create undue burdens for patients", "data": [{"type": "subtitle", "content": "A patient’s battle through the war on prescription abuse"}, {"type": "sentence", "content": "While working as a medical scribe at a local Urgent Care clinic, I frequently observed visits related to acute anxiety. Amongst some grim exacerbations of potentially deadly conditions, these visits just seemed to have the ideal resolution. Even in the short follow-up feasible at an Urgent Care, we could observe these patients feel more comfortable and empowered to get their life back on track. For instance, a forty-something woman presenting with an acute onset of insomnia due to stress at work. A wide smile from the physician plus a prescription for alprazolam (Xanax), no one thought twice about it."}, {"type": "sentence", "content": "In my first month or so as a scribe, I was working with a former ER doctor. A twenty-something college student came in with unbearable anxiety due to finals week and family stressors. While reviewing her history, I noted that she had a documented anxiety disorder. Right before the visit, the doctor’s face had somehow changed."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*qPgPmZ9eoRURio1w44d9IQ.gif"}, {"type": "sentence", "content": "Understandably, an ER doctor would be used to staying on high alert for drug-seeking behavior. To be quite frank, I was excited to learn how such cases are handled."}, {"type": "sentence", "content": "In the room, however, we met a tired young woman holding her mother’s hand tightly. While describing how the anxiety has affected her the past few days, the mother began crying. She said she couldn’t bear to see her daughter like that, yet she felt helpless."}, {"type": "sentence", "content": "At no point did the family mention medication. The physician brought it up first — quite early on in the appointment. He explained that since this was an Urgent Care, no prescription was available for cases like hers. Her only option in terms of benzodiazepines was a discussion with her family doctor after an extensive evaluation plus strict follow-up. With that, the appointment ended. Out of genuine curiosity, I attempted to ask why the medication was not indicated in this particular case despite a documented anxiety disorder and her seeming to be in some distress. I was simply told,"}, {"type": "subtitle", "content": "Emerging Prejudice in Healthcare"}, {"type": "sentence", "content": "I continued working as a scribe for eight months, with a new provider daily (due to odd scheduling at Urgent Cares). Across various types of providers and patients, some frustrating patterns emerged. Namely, it continued to be the case that patients over thirty-years-old were treated with much care and concern for their anxiety. However, in almost all cases of younger individuals, there was a predisposed skepticism not only towards prescribing medication but also towards the authenticity of the symptoms themselves. Most providers went into the room with a mindset of “are they faking it for the prescription?” At least, that was my impression from an outsider perspective (but in some cases, providers blatantly told me)."}, {"type": "sentence", "content": "It is also important to note that while the risk of addiction significantly higher in younger populations, medications such as alprazolam are not actually contraindicated for young adults for that reason (per FDA). In its section on Drug Abuse and Dependence, the FDA merely states in regards to addiction:"}, {"type": "sentence", "content": "This is regardless of whether the adult is 18 or 48-years-old. In many cases, the immediate risk of a mental health crisis far outpaces the potential of addiction in long-term use. Partly, the issue lies in the perception that abuse of benzodiazepines, amphetamines, and even codeine is purely a high school and college problem."}, {"type": "subtitle", "content": "The Waiting Game"}, {"type": "image", "content": "https://miro.medium.com/max/2892/1*e7AABDk3UAXwBncwOrVgBw.png"}, {"type": "sentence", "content": "Over the years, I noticed myself developing rather severe anxiety. Doctors insisted on putting me through trial after trial after trial of antidepressant medication, which only worsened it. Even with intense psychotherapy, I watched my hard-earned GPA plummet in just two semesters. I kept being told to wait. Wait a month for the antidepressant to kick in, wait for the referral to a psychiatrist . . . oh, that referral was denied? Wait another month for an appointment with your doctor to discuss why."}, {"type": "sentence", "content": "Yet, I didn’t have a month. My functioning even in basic self-care was at the absolute minimum needed to stay hydrated, merely. Moreover, these months have now added up to a year."}, {"type": "sentence", "content": "Amidst a severely intense week of anxiety (conveniently falling on a finals week in college, as it inevitably does for seemingly everybody), I met with a new provider who was able to schedule me in short notice to discuss the option of benzodiazepines. I almost felt ashamed for merely asking."}, {"type": "sentence", "content": "Could it come off as “drug-seeking?”"}, {"type": "sentence", "content": "That is the message I internalized during my time as a scribe, directly from the very medical professionals meant to help people like me. So, I was fully startled when she merely took a moment to acknowledge that what I’ve been feeling right then and there was"}, {"type": "sentence", "content": "The unfamiliar compassion coming from a physician was alone enough to get me through that week. It reminded me, for the first time in a year, what mental health services are for:"}, {"type": "subtitle", "content": "The Opioid Crisis, Fear, Compassion"}, {"type": "sentence", "content": "Substance abuse is a severe problem in the United States. Certain psychiatric medications are often linked to addiction and fatal outcomes when used recreationally. While restrictions are crucial in curbing the effects of mass addiction, the consequent hesitation and fear of liability from providers have, perhaps, unintentionally pitted healthcare professionals against their own patients."}, {"type": "sentence", "content": "The opioid crisis perhaps exemplifies both sides of the picture. Dr. Barbara L. McAneny, MD, President of the American Medical Association in 2018, told a tragic story of a patient being denied opioid pain medication by his health plan, then by a pharmacist. It escalated to the pharmacist calling the patient a “drug seeker.” After that event, with nothing to mitigate intense pain, the patient had attempted to take his life. Dr. McAneny was not notified of the denied prescription despite being the prescriber."}, {"type": "sentence", "content": "The same is emerging in the context of psychiatric drugs — perhaps due to the fact that symptoms needed to gain such prescriptions are rather easy to fake. Nevertheless, no one needs to tiptoe and carefully choose words when discussing Tessalon for an arguably inducible cough. So, why the apprehension towards Adderall?"}, {"type": "sentence", "content": "To make the conversation around controlled substances less tense for both parties, it is essential to return to the core of healthcare:"}, {"type": "sentence", "content": "And, most importantly:"}], "topic": "mental-health"}