{"title": "Music for Cognitive Enhancement — Effective for Some People", "data": [{"type": "subtitle", "content": "What does music do to our brains? It enhances cognitive development."}, {"type": "sentence", "content": "Music significantly influences human behavior by affecting different sections of the brain. People listen to music for many reasons and depending on the type or genre of the sounds, it affects them differently. Individuals use music to alleviate the emotional and psychological effects of different responses or feelings within the body, and some studies such as (Miendlarzewska & Trost, 2014) and (Nicolich, 2008) have shown that such techniques tend to promote cognitive performance. The idea of music enhancing cognitive performance has had exclusive attention in the research and studies of many scientists such as Gupta, Bhushan, and Behera, who have been trying to link it to how different types of music influence performance."}, {"type": "sentence", "content": "However, as much as there exists documented evidence of research that demonstrates different effects of music on the cognitive performance of various individuals, there has also been research that contradicts these findings (Nicolich, 2008). These studies suggest that music doesn’t enhance performance but, instead, is found to be destructive to the participants’ cognitive performances."}, {"type": "sentence", "content": "It’s advisable that you familiarize yourself with the theory behind cognitive enhancement. It is a term commonly linked to drug use or other methods/devices to enhance and develop cognition. This context aims to clarify how music enhances cognition and to review the various methods to which music has been used for promoting it."}, {"type": "subtitle", "content": "How does music influence cognition?"}, {"type": "sentence", "content": "To explain this, take a real-life example as an illustration. Have you ever heard of an earworm? It is also referred to as a brainstorm and is a catchy piece of music that continually repeats through an individual’s mind even after it is no longer playing. As much as the term worm sounds scary in your ear or brain, this phenomenon is a harmless occurrence that affects many music lovers. No matter how hard you try to ignore or forget it, the music sticks, and you’re forced to relive every lyric of that chorus until it finally dies off (Belland, Kim & Hannafin, 2013)."}, {"type": "sentence", "content": "Now compare this incident to reading a book. Have you ever read a story and found yourself repeating it word by word continually like the earworm? Your answer would probably be no. Music can positively affect the rate of learning in children more than books do. However, this serves as a research theory, and until further studies and advanced tests are conducted to give support to the claim, it can only be termed as a mere hypothesis."}, {"type": "subtitle", "content": "The brain on music"}, {"type": "sentence", "content": "Research by Miendlarzewska & Trost (2014) has shown that the art of making or composing music is directly connected to high levels of cognitive performance as musicians have better memory systems than non-musicians. For example, when an artist writes a song, they tend to connect the sound or context to specific emotional/visual elements and this helps build various memory skills. Similarly, children who are subjected to a more extended period of music training are capable of recalling a higher percentage of vocabulary words taught to them as compared to those without such training (Barnes, 2014)."}, {"type": "sentence", "content": "Whenever you listen to music, your brain shows more activity than the times when you’re not (Lawton, 2016). Likewise, whenever musicians play music, the targeted neurons become hyperactive, thus leading to more brain activity (Belland, Kim & Hannafin, 2013). When individuals are exposed to music at an early age, and especially young musicians, they tend to develop stronger general cognitive performance than the others as explained by (Miendlarzewska & Trost, 2014). Such individuals will have higher creativity levels and be innovative problem solvers, with a higher capacity for focus."}, {"type": "subtitle", "content": "“In the mood for music”"}, {"type": "sentence", "content": "Music is believed to stimulate brain development over the years, even though its benefits are often questioned. It is often linked to the mood on many occasions. A specific song can make you feel happy, sad, relaxed or hyper. It all depends on the genre of the music but most importantly, the listener’s preference and the type of emotion that is stimulated whenever they hear such a song. For example, sad songs are generally composed to put one in a low mood or help one relate to certain unpleasant events (Ulbricht, 2013). However, some find peace or relaxation in sad songs without having to connect to the message of the artist."}, {"type": "sentence", "content": "On the other hand, happy or hype songs are designed to make one energetic and active. However, some people often tend to use these types of songs to relax their minds and bodies because they have a different taste for its use, or it naturally stirs up different moods in them. Different types of music stir up different moods in different individuals and it is no surprise that music can thus, be linked to cognitive enhancement due to its manipulation of various feelings. This can be achieved by using it together with guided imagery to produce altered conscious states that enable experts to uncover hidden emotional responses in people (Ulbricht, 2013)."}, {"type": "subtitle", "content": "Feeding your imagination"}, {"type": "sentence", "content": "For the people with a massive imagination, music is the most potent stimulant to most visual imaginations. Take, for example, a hardcore rock song that’s booming through the speakers of your room. One would be enticed to dream or imagine themselves on a high stage with black makeup on, and the crowd cheering as you rock an electric guitar till the speakers blow up. Similarly, when listening to a love song, you would imagine seducing the love of your life with enticing words that are too good to turn down and which would have them running into your arms before snapping out of your daydream and realizing that you’re still single."}, {"type": "sentence", "content": "Creativity is also not reserved for musicians alone, as we all have the cognitive ability to come up with original and unique ideas. When you listen to music, you exercise your brain and as this happens your mind gets active and with time, you would be able to quickly come up with creative ideas for solving issues that would inspire people around you. Many writers such as Cox, (2016) have also claimed that during cases of writer’s block, which is a common problem affecting most writers at some point in their careers, they often tune in to their most preferred type of music. This helps to keep their brains active enough to organize new ideas in the right order for them to continue writing."}, {"type": "subtitle", "content": "“Focus” on the lyrics"}, {"type": "sentence", "content": "Many people claim to have a better concentration span and are capable of handling different tasks such as studying, doing chores, or working in the office only if there is a soundtrack playing in the background. They say that the music puts them in a better state or mood to do their jobs correctly. On the other hand, others say that they can’t get their heads around trying to concentrate on a single task at hand while at the same time enjoying the music in the background. However, different studies such as (Baker, 2007) have shown that music activates the areas in the brain linked to paying attention, though this may not apply to some individuals. Remember, different types of music work for different people when it comes to concentration levels. For example, different personalities prefer different tastes. A study was carried out by (Dobbs, Furnham & McClelland, 2011) on students to determine their performance levels on various tasks while listening to music, and how the effects of music were moderated by personality. While the extroverts completed their tasks better with music in the background, the introverts had a harder time focusing on their assignments with such “distractions” and preferred to work in silence (Cox, 2016)."}, {"type": "subtitle", "content": "Effects of music on various cognitive functions"}, {"type": "sentence", "content": "Research has shown that the experiences that a person undergoes during their childhood or adolescence are crucial to the development of multiple abilities during their adulthood (Miendlarzewska & Trost, 2014). This begs the question, whether or not musical training is a suitable decision for children and how it would affect their cognitive functions?"}, {"type": "subtitle", "content": "Music and executive functions"}, {"type": "sentence", "content": "Executive functioning is the way we stay focused on our objectives and the means used to achieve them together with the will to change our behavior in response to specific changes in the environment that may affect the targeted goals. Executive functions include attention, impulse inhibition, and task switching (Miendlarzewska & Trost, 2014)."}, {"type": "sentence", "content": "Music has different impacts on children. A study conducted by Bowmer et al. (2018) explains that music influences problematic behaviors among children. The study demonstrates that children, especially those who have antisocial behaviors, tend to be impulsive and disruptive. However, music helps them to control their actions and emotions via inner speech. Also, the study states that music helps in language development among children. The tendency of children reciting music makes it the perfect art form for learning to pronounce certain words and the language as a whole."}, {"type": "subtitle", "content": "Music and listening abilities"}, {"type": "sentence", "content": "There is a significant difference in the listening skills and auditory performances of musically trained children as compared to those who are untrained. Children who are subjected to music lessons at a young age are more sensitive to harmonies of different sounds and can pay attention better than untrained ones. Such findings show that musical influence can significantly enhance children’s auditory perception (Miendlarzewska & Trost, 2014). Also, through consistent practice from an early age, music students can develop the ability to recognize speech in noise (Miendlarzewska & Trost, 2014). Therefore, we can conclude that the listening skills of individuals and performance at processing the speech of others, is improved if they listen to music in the early stages of their life."}, {"type": "subtitle", "content": "Music and linguistic abilities"}, {"type": "sentence", "content": "Music has often been defined as a language of its own. This is somewhat true because music and literature, in general, have similar auditory compounds indicating that enhancing one’s skills in music can significantly lead to the improvement of abilities in the other. Musical activities are known to stimulate neural networks and require a certain level of focus; thus, the reason for good speech in many musicians (Li et al., 2016)."}, {"type": "sentence", "content": "Children who have been subjected to music training from an early age also stand a better chance of benefiting from verbal fluency, memory, and the acquisition of a second language (Miendlarzewska & Trost, 2014). The musical ability of individuals, both young and old, could also predict the linguistic skills of learning their second language as the pronunciation accuracy depends on artistic skills."}, {"type": "subtitle", "content": "Music and social skills"}, {"type": "sentence", "content": "It has been thought that musical training is capable of increasing one’s social competence. However, research is yet to prove the correlation between artistic skills and emotional intelligence. Studies have shown that musical training has enabled individuals to improve their perception and recognition expressed by the different human voices in society. This, however, needs to be further investigated by comparing various aspects that link musical education to emotional intelligence in society (Li et al., 2016)."}, {"type": "subtitle", "content": "Music and general Intelligence"}, {"type": "sentence", "content": "Engaging your child actively with music can result in a positive impact on their cognitive function as well as intelligence or IQ. Music lessons act as extra schooling for children that demands concentration, memorization, and the ability to learn and master a specific skill (Li et al., 2016). When a child acquires such skills/abilities from music lessons, they are capable of transferring them to other designated subjects in their lives or academic careers to better their results (Miendlarzewska & Trost, 2014)."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "Musical influence on the brain of an individual can have a beneficial impact on their cognitive performance. With the above results and findings, it is, therefore, safe to say that music can be a significant factor contributing to the improvement of cognitive functions for human beings. However, these results can only be valid at specific sensitive periods of an individual."}, {"type": "sentence", "content": "Parents are, therefore, advised to encourage musical or instrumental training for their offspring, especially during childhood as this period offers long-lasting benefits. This will enable children to develop inspiring skills and abilities and thus enhance their cognitive functions."}, {"type": "subtitle", "content": "References"}, {"type": "sentence", "content": "Baker, M. (2007). Music moves brain to pay attention, Stanford study finds. news release, Stanford School of Medicine, http://med.stanford.edu/news_releases/2007/july/music.html., 16"}, {"type": "sentence", "content": "Barnes, T. (2014). Science Shows How Musicians’ Brains Are Different From Everybody Elses’. [online] Mic. Available at: https://www.mic.com/articles/96150/science-shows-how-musicians-brains-are-different-from-everybody-elses#.mtVwercnl [Accessed 10 Feb. 2020]."}, {"type": "sentence", "content": "Belland, B. R., Kim, C., & Hannafin, M. J. (2013). A framework for designing scaffolds that improve motivation and cognition. Educational psychologist, 48(4), 243–270."}, {"type": "sentence", "content": "Bowmer, A., Mason, K., Knight, J., & Welch, G. (2018). Investigating the impact of a musical intervention on preschool children’s executive function. Frontiers in psychology, 9, 2389."}, {"type": "sentence", "content": "Cox, A. (2016). Music and embodied cognition: Listening, moving, feeling, and thinking. Indiana University Press."}, {"type": "sentence", "content": "Dobbs, S., Furnham, A., & McClelland, A. (2011). The effect of background music and noise on the cognitive test performance of introverts and extraverts. Applied cognitive psychology, 25(2), 307–313."}, {"type": "sentence", "content": "Gupta, A., Bhushan, B., & Behera, L. (2018). Short-term enhancement of cognitive functions and music: A three-channel model. Scientific reports, 8(1), 1–12."}, {"type": "sentence", "content": "Lawton, G. (2016). How Music Affects Your Concentration. [online] Bustle. Available at: https://www.bustle.com/articles/199972-how-music-affects-your-concentration-according-to-science [Accessed 10 Feb. 2020]."}, {"type": "sentence", "content": "Li, H. C., Wang, H. H., Chou, F. H., & Chen, K. M. (2015). The effect of music therapy on cognitive functioning among older adults: A systematic review and meta-analysis. Journal of the American Medical Directors Association, 16(1), 71–77."}, {"type": "sentence", "content": "Miendlarzewska, E. A., & Trost, W. J. (2014). How musical training affects cognitive development: rhythm, reward, and other modulating variables — frontiers in neuroscience, 7, 279."}, {"type": "sentence", "content": "Nicolich, J. (2008). Music’s Influence on Cognitive Development."}, {"type": "sentence", "content": "Ulbricht Pharm.D., C. (2013). Music Therapy for Health and Wellness. [online] Psychology Today. Available at: https://www.psychologytoday.com/us/blog/natural-standard/201306/music-therapy-health-and-wellness [Accessed 9 Feb. 2020]."}], "topic": "neuroscience"}