{"title": "How Scandinavian Airlines Is Paving The Way For Sustainable Air Travel", "data": [{"type": "sentence", "content": "A personal perspective from before the pandemic"}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*PU1OsRkjK5vG1qwf"}, {"type": "sentence", "content": "As a quintessential millennial, I worry about the environmental sustainability of our current business practices and personal choices. In order to control and reverse the environmental damage we, as a species, are imposing on Earth, we need to reform entire industries."}, {"type": "sentence", "content": "It is no longer good enough to simply recycle and take public transport in our daily commutes."}, {"type": "sentence", "content": "I do not live in my native country which, adds a different layer of complexity to my efforts of being as sustainable as possible. Visiting my family only once a year, to reduce my carbon footprint is also not an option. I am sure many people in my age group are also frustrated with this conundrum of wanting to go back to their home country for Easter, Summer and Christmas holidays but realizing how much carbon flying back and forth can emit."}, {"type": "sentence", "content": "This was the situation I was in, a few months back. At the time, while checking flights for my next trip back home, I came across Scandinavian Airline’s website (SAS). One of the tabs on their website was concerning sustainability so I was of course drawn to it. There they presented an add-on that any traveler could purchase to their flight: Biofuel."}, {"type": "sentence", "content": "As of 2019, only a handful of airports offered the option to fuel aircraft with biofuel, also called sustainable aviation fuel (SAF). These airports included Caen Airport in France, Amsterdam Airport Schiphol, Bergen Airport, Brisbane Airport, Los Angeles International Airport, Oslo Airport, and Stockholm Arlanda Airport."}, {"type": "sentence", "content": "The concept of biofuel is not necessarily new to society as a whole. Many of us have seen it mentioned on TV or elsewhere as an alternative to gas or gasoline for motor vehicles, mostly cars. However, this sustainable fuel option has not yet been available to consumers in the aviation industry especially in commercial travel."}, {"type": "sentence", "content": "According to the International Energy Agency (IEA), in 2030, the aviation industry will account for 3.5% of the global energy-related CO2 emissions."}, {"type": "sentence", "content": "These predictions can be seen as rather redundant in these tumultuous and uncertain times when large aviation companies are cutting thousands of flights and jobs, with some even filling bankruptcy claims."}, {"type": "image", "content": "https://miro.medium.com/max/8064/0*3tx24oL4xPQUnTnr"}, {"type": "sentence", "content": "Yet, I think it is important to bear this number in mind so we as a society understand where our behavior and consumer choices were leading us towards. Let us see this number as a reminder that the path we were on was not sustainable in the first place and use it to prevent us from falling into the same patterns."}, {"type": "sentence", "content": "Several airlines such as TAP Portugal, Wizz Air, and American Airlines are starting to pick business up suggesting that the issue of conventional jet fuel’s high CO2 emissions will be back on the table soon. A 2019 article from IEA states:"}, {"type": "sentence", "content": "The agency also anticipates that biofuel will comprise 10% of fuel demand from the aviation industry in 2030."}, {"type": "sentence", "content": "The case for biofuel lies in the fact that it can emit up to 80% less CO2 than conventional jet fuel. This is particularly significant in an industry that influences billions of lives and without whom society could not function in the same efficient and fast-paced ways. It is undeniable the weight and presence that this industry has in our lives from providing great mobility between cities, countries, and even continents."}, {"type": "sentence", "content": "As the commercialization of biofuel for commercial air travel is still scarce, I was curious to see how much, in practice, it would cost for the end consumer. To understand the implications for me as a passenger, I run a little scenario on SAS’ online booking system."}, {"type": "sentence", "content": "On their website, SAS prices biofuel per 20-minute time slot at 10 EUR apiece. This means that for a standard 80-minute flight between Copenhagen (CPH) and Frankfurt (FRA), the cost of adding 100% biofuel is 40 EUR, which is an extra to the original ticket price between the two cities. However, this is the “best possible case scenario”. Consumers can choose to add anything between 5% to 100% of biofuel, depending on the flight’s duration. For the CPH-FRA flight, the percentage ranged between 25%-100%."}, {"type": "sentence", "content": "To comply with IEA’s prediction of biofuel demand for 2030, a person would have to spend merely 4 EUR extra for this particular flight. From my perspective, this amount is extremely low for the impact it has. Making this small consumer change now, in the year of 2020, would show SAS and the aviation industry as a whole that consumer preferences are changing and with that their purchasing behavior. It would be a case where consumer choices drive supply and open new markets."}, {"type": "image", "content": "https://miro.medium.com/max/6750/0*rvTliT8TUrS35oK1"}, {"type": "sentence", "content": "In addition to providing biofuel slots, SAS purchases CO2 offsets for the trips of its Eurobonus members. Carbon offsetting means compensation for the emissions of a certain activity (for example, flying, driving, etc.) by financing an equivalent CO2 saving elsewhere. Usually, this entails allocating money for reforestation initiatives, improvement of energy efficiency projects, and others."}, {"type": "sentence", "content": "The combination of all these environmentally friendly strategies within the same company is unheard of to me, as a consumer. It then poses the question:"}, {"type": "subtitle", "content": "Why aren’t more aviation companies stepping up their sustainability game?"}, {"type": "sentence", "content": "After these turbulent economic times, I hope SAS picks up its sustainability efforts where it left off and speeds up the transition to greener air travel. This would pressure competitors to become stronger sustainable players in the aviation industry and the world."}, {"type": "sentence", "content": "P.S. This story is not sponsored."}], "topic": "travel"}