{"title": "An ‘artificial womb’ could be a lifeline for premature babies", "data": [{"type": "subtitle", "content": "Scientists are testing a middle phase between gestation and birth, but a human prototype is years away"}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*_-cddt5pRLnt67NY.jpg"}, {"type": "sentence", "content": "By Stav Dimitropoulos"}, {"type": "sentence", "content": "Scientists are testing a middle phase between gestation and birth, but a human prototype is years away"}, {"type": "sentence", "content": "In 1923, the eccentric English biologist J.B.S. Haldane coined the term “ectogenesis,” meaning the artificial conception and complete gestation of a fetus outside of its mother’s body — which would free women from pregnancy. Though Haldane’s vision remains a sci-fi concept, scientists in several countries have concluded that part of his idea may soon be possible. They hope to pioneer “ectogestation” — supporting extremely premature babies in an artificial womb. Researchers have already developed a system for keeping an extremely preterm lamb alive outside its mother’s womb — and they hope to develop a prototype for humans soon."}, {"type": "subtitle", "content": "The Problem"}, {"type": "sentence", "content": "About 15 million babies are born prematurely every year. And while medical advances have helped many more of them survive, premature babies risk damage to their respiratory, cardiovascular, and sensory systems, visual and hearing problems, and serious learning disabilities. For extremely premature babies, those who have completed less than 28 weeks of gestation, the stats are far grimmer: up to half of them will die, and of those that survive infancy, 20 percent to 50 percent will live shorter lives."}, {"type": "subtitle", "content": "The Solution"}, {"type": "sentence", "content": "A consortium of scientists from the Australian Women and Infants Research Foundation, Tohoku University Hospital in Japan, and the University of Western Australia are developing a treatment strategy for infants born at “the border of viability,” between 22 and 23 weeks of gestation. At that stage, they weigh only about one pound and their still-developing lungs struggle to exchange oxygen and carbon dioxide."}, {"type": "sentence", "content": "The scientists placed seven lamb fetuses, which were at an age equivalent to that of a human fetus at 24 weeks, into sacs full of high-tech, synthetic amniotic fluid. They connected each fetus’ umbilical cord to a device that allows gases and blood to flow out, filters them, and returns the blood to the body. The Australian-Japanese team also administered a cocktail of medicines, nutrients, and fluid to the fetus through the umbilical vessels. “We maintained the lamb fetuses in this artificial womb for five days without ill effects,” says Matthew Kemp, associate professor at the University of Western Australia and one of the project’s senior researchers. In an earlier study of the artificial womb system, the scientists were successful at transferring one preterm lamb from the system to a ventilator. The results of this study may lead to a similar treatment option for extremely preterm human infants, Kemp says."}, {"type": "subtitle", "content": "The Challenge"}, {"type": "sentence", "content": "“The Australian-Japanese group has made a great step forward in the development of artificial placenta technology,” says Joanne Verweij, a fetal medicine specialist at the Erasmus University Medical Center in Rotterdam. But there’s a long way to go, she adds, before anyone can safely test the idea on humans. Scientists will have to extend the duration of successful ectogestation, prevent infection inside the artificial womb, and establish adequate nutrition. Also, in an artificial uterus, the baby misses out on “ kangaroo care,” the practice of holding a newborn preemie skin-to-skin inside a parent’s shirt, somewhat like a female kangaroo carrying her newborn in a pouch. The snuggling stabilizes premature babies’ heart and breathing rates, encourages brain development, and helps them grow and gain weight."}, {"type": "sentence", "content": "Artificial wombs will raise a profound question: What is the definition of birth? “To be born is to be situated outside a mother’s womb, to interact with people, and to take on some of the burden of sustaining yourself,” says Elizabeth Chloe Romanis, a PhD candidate in bioethics and medical law at the University of Manchester, who is studying the bioethics of artificial wombs. In an artificial womb, the fetus is still gestating, so it is essentially not born, says Romanis, who has coined the term “ gestateling “ to describe this artificial in-between stage."}, {"type": "sentence", "content": "Almost a century ago, Haldane had predicted that humanity would enjoy full ectogenesis by 1951. History proved him wrong. But saving babies who knock on life’s door much too early could be achievable. Dutch researchers recently received more than $3 million in funding to produce a prototype artificial womb for humans, which they hope to deliver by 2024."}, {"type": "sentence", "content": "Fifteen to 20 years ago, says Kemp, hospitals weren’t regularly resuscitating babies born at 28 weeks of gestation. “That hard limit today is probably 20 or 21 weeks,” says Kemp. “Giving a good shot at healthy, long-term survival to those who start too soon… isn’t far away.”"}, {"type": "sentence", "content": "Stav Dimitropoulos is a writer based in Athens, Berlin, and New"}, {"type": "sentence", "content": "Sign up for weekly updates from Experience, a digital magazine published by Northeastern University that examines the power of experience at the intersection of humanity and technology."}, {"type": "sentence", "content": "York.Originally published at https://expmag.com on May 20, 2020."}], "topic": "science"}