{"title": "How Much Does a 5-Month Road Trip Really Cost?", "data": [{"type": "subtitle", "content": "I was surprised to see the total"}, {"type": "image", "content": "https://miro.medium.com/max/8320/1*rkAJ4jBJBCYLG4j4JfLnRQ.jpeg"}, {"type": "sentence", "content": "I left Moab in early December to make my annual trip to the SW."}, {"type": "sentence", "content": "I spent 5 months visiting the deserts of southern Arizona and California, Nevada, and Oregon, arriving in the Portland area on May 9."}, {"type": "sentence", "content": "Yes — I was on the road for the first 2 months of the Coronavirus pandemic. I wrote a bit about that here and will someday describe it in further detail."}, {"type": "image", "content": "https://miro.medium.com/max/10624/1*Iex5iX2iG989Lb5NIJuI6w.jpeg"}, {"type": "sentence", "content": "A lot of people seem to be curious about the financial aspect of vandwelling. It’s different for everyone, but I thought I’d share my real-life example."}, {"type": "sentence", "content": "I’m not always traveling; I often stay in Portland or Moab for a few months at a time. Typically I’ll save money before I leave for the SW. This time, my initial success with a Medium article gave me the confidence to start my voyage with just $446 to my name, knowing that I’d be receiving further income soon, not to mention the tax returns from my restaurant job."}, {"type": "sentence", "content": "All of my financial transactions come in and out of one bank account, so it’s not a complicated thing to chart. I didn’t start or end the trip with significant amounts of cash."}, {"type": "sentence", "content": "Here’s the running balance of my bank account from day 1 to 157 of my trip. The numbers in various colors represent income amounts (you can see they correspond to jumps in the balance)."}, {"type": "image", "content": "https://miro.medium.com/max/1360/1*x2giuuN0GqMiU9oZNgL85w.png"}, {"type": "sentence", "content": "Between my writing income, 2019 tax returns, the $1200 stimulus check, and my final paycheck from my restaurant job, I finished the trip with more money than when I began."}, {"type": "sentence", "content": "My total positive cash flow was $5,007."}, {"type": "image", "content": "https://miro.medium.com/max/994/1*AbZqbjnGZ_zgLzo76lU2FA.png"}, {"type": "sentence", "content": "My total spending was $4367."}, {"type": "sentence", "content": "This equates to about $873/month or $27.82/day."}, {"type": "sentence", "content": "I wish I could make a chart to categorize my spending, too, but I can’t remember what each item on my bank statement means anymore. I’d have to plan ahead and keep track as I go."}, {"type": "sentence", "content": "To be honest, I was surprised when I saw how high this number was, because I often camped out for a week or longer without spending any money at all. How could I have possibly averaged $27/day? I would have guessed it was closer to $20."}, {"type": "image", "content": "https://miro.medium.com/max/5920/1*guwqzHlygnI4czDB-RPuEw.jpeg"}, {"type": "sentence", "content": "I did keep careful track of fuel purchases. I bought 404 gallons of diesel, for $1162, which was my biggest expense — $7.40/day just by itself."}, {"type": "sentence", "content": "I renewed my 2-year vehicle registration for $208. I spent about $450 when I bought my fridge, a new stove, and some water containers. I spent another couple hundred on bus-build items and oil change supplies. I lost $112 on a parking ticket."}, {"type": "sentence", "content": "So, if you remove all those things, my total expenses were more like $2235, or $14/day. That’s closer to how much I would have spent if I weren’t traveling or working on my bus."}, {"type": "image", "content": "https://miro.medium.com/max/8192/1*cO6gn2tFeBtXGnETMs3VHQ.jpeg"}, {"type": "sentence", "content": "I have some recurring payments: insurance for $65.89/month, $25/month for my phone plan, $10 for Spotify, $5 for Medium."}, {"type": "sentence", "content": "The other obvious big expense is groceries, but it’s hard to sort out exactly how much I spent on food. Looks like perhaps $600. Halfway through my trip, I signed up for EBT, which basically covered all my grocery needs after that."}, {"type": "sentence", "content": "With these monthly necessities and groceries adding up to $1130, I can subtract that from the $2235 and conclude that I had about $1105 in “travel luxury spending”: $7/day for things I didn’t technically “need”, like eating out, souvenirs, and drugs/alcohol."}, {"type": "subtitle", "content": "So what?"}, {"type": "sentence", "content": "What’s interesting to me is that some people will see these numbers and be shocked that I can travel full time for less than $1000/month. Others, who are more frugal than I am, will wonder how I managed to waste so much money."}, {"type": "sentence", "content": "Financially, this trip was significant to me because it’s the first time I’ve had meaningful writing income to support me while traveling. Of course, it was bolstered by my tax returns and the unexpected $1200 check, but it gave me a taste of what it might be like to travel indefinitely and earn an income at the same time."}, {"type": "sentence", "content": "You might have noticed my bank account bottoming out three times in the first half of the trip. Typically, I spend money more freely after a recent deposit into my account, and then taper off as my balance gets lower. I adjust my level of strictness based on how long it will be until my next income event and how much I expect it to be. Even when my balance was nearly zero, I felt confident that I had the supplies I needed and that I would get another deposit before I ran out or went negative."}, {"type": "sentence", "content": "If I can travel for $873/month, I can certainly stay in one place for under $500. That means if I’m traveling 6 months a year I can comfortably get by on about $8,000/year."}, {"type": "image", "content": "https://miro.medium.com/max/8320/1*ft9_kf1UyQITACbXXv1qAg.jpeg"}, {"type": "sentence", "content": "My goal is to reliably make about $12,000/year, and to become more frugal, so I can save a few thousand every year for major repairs and other projects I want to do."}, {"type": "subtitle", "content": "No rent to pay"}, {"type": "sentence", "content": "When people ask what I like most about vandwelling, one of the first things that comes to mind is not paying rent."}, {"type": "sentence", "content": "Many people spend more than $873 on rent every month and think of it as necessary and automatic, a side effect of staying alive, the starting point of their budget; whereas for me, that amount of money can pay for my entire lifestyle. Certainly, there are a lot of good reasons to pay rent and live inside a building, too. It’s just a matter of preference."}, {"type": "sentence", "content": "Personally, I’m perfectly content with the home I have. I don’t have all the same luxuries, but having all my time completely free for months on end is so special to me that I’m happy to make some sacrifices."}, {"type": "image", "content": "https://miro.medium.com/max/5344/1*xFeA0sdwMtkiTR_CEtdymg.jpeg"}, {"type": "sentence", "content": "So, what do you think? Could you travel full time on my budget? Do you have any thoughts or questions for me? I’m happy to talk more about it in the comments."}, {"type": "sentence", "content": "Click here to sign up for my mailing list!"}], "topic": "travel"}