{"title": "How the COVID-19 Quarantine Saved My Mental Health", "data": [{"type": "image", "content": "https://miro.medium.com/max/5568/0*i5nOCcMlBWBkW7A7"}, {"type": "sentence", "content": "The COVID-19 outbreak caused many of us to go into isolation, to become more socially disconnected from others in an unprecedented way. At the beginning of the outbreak, I was frustrated by my lack of mobility and ability to get around and explore in the ways I had before. I felt upset, and having struggled with mental health issues for years, I was concerned that the outbreak would be emotionally detrimental. I would no longer be able to go to the gym, my typical mood regulation tactic."}, {"type": "sentence", "content": "However, it turns out, the pandemic was exactly what I needed, and it might have been the only way for me to recover from an extended episode of mania and psychosis."}, {"type": "sentence", "content": "I don’t mean to sound narcissistic — I know that the pandemic has caused many fatalities, economic hardship, and other very real issues for people. My story might be an anomaly, but COVID-19 actually saved me."}, {"type": "sentence", "content": "For the past two years, I have been struggling with what I didn’t realize was a manic and psychotic episode. It was triggered by a combination of factors, including the loss of a major relationship when I was 24 and had already been struggling with depression, the entrance into a connection with a psychopath who manipulated and bullied me when I was at a very low point in my life, becoming brainwashed by a spiritual/personal development leader, cannabis use, the ongoing grief at the loss of my mother when I was 20, problems with my family, and an underlying condition of what I have now been diagnosed with — bipolar disorder. This combination led to the perfect storm — a psychotic episode that lasted about two years."}, {"type": "sentence", "content": "Before COVID-19, I was constantly on the go. I was always out and about because I hated being at home. I was running away from my problems and I had no idea I was doing it."}, {"type": "sentence", "content": "It all started in 2018. I’d quit my long-term job at the spur of the moment, letting down the organization I’d worked hard at for 3 years. I’d quit in the middle of a contract, based on a delusion that I’d experienced a spiritual awakening."}, {"type": "sentence", "content": "I continued along in this brainwashed and delusional state for about two years. I traveled for a bit until I ran out of money, spent all of my savings, and got into major credit card debt. I was convinced I was on some sort of spiritual and personal development journey and that other people just wouldn’t understand. I’d become alienated and disconnected from society, observing it and getting by, but no longer actually part of it."}, {"type": "sentence", "content": "In February 2020, I finally started to snap out of it. I was running on the treadmill at my gym — a membership I’d purchased right after starting a new job, in the pattern I’d developed of getting a job and only lasting anywhere from 2 weeks to 3 months — when I started hearing voices in my head. I was lucid enough to know it was just coming from my mind, not like it was someone else talking to me, but I knew it wasn’t normal. I broke down crying and texted my dad that I needed to go to the hospital."}, {"type": "sentence", "content": "I was admitted to the hospital and stayed for almost a week. I hated being hospitalized. The majority of people I met had been admitted for suicidal ideation or attempts, and were very depressed. I couldn’t relate, as I was experiencing mania — the opposite of depression — and I felt trapped. I met some nice friends but I wanted to go back home more than anything. When the psychiatrist told me he wanted me to stay longer, I refused. He wanted to make sure that the medication was working, but at this point, I will now admit that looking back, I was still manic. I didn’t think there was anything terribly wrong with me, but I knew enough to understand that the voices were abnormal. I didn’t care what he recommended — there was no way in hell I was staying in that place. I began sobbing and adamantly refused to stay, and unable to keep me there against my will, he let me go home."}, {"type": "sentence", "content": "My dad drove me back home, and I began a new treatment regimen with a new doctor, who was able to sit and talk with me longer than the few minutes the hospital psychiatrist was. I hated being on medication, and I believed it was actually making me depressed. I was starting to have suicidal thoughts while taking them which I hadn’t had in many years. I called the doctor and told him about my symptoms. He told me to stop taking the medication, so I did. I then decided to stop seeing him. This was right around the beginning of the quarantine."}, {"type": "sentence", "content": "Even though I decided to stop seeing the doctor at that time, he made me aware of some of the behaviors I’d been partaking in that weren’t functional. I was forced to really look at these behaviors for what they were. They made sense to me from my new spiritual perspective, but in the real world, I had to admit, they were causing me a lot of trouble."}, {"type": "sentence", "content": "Over the course of the quarantine, unable to avoid the truth any longer, I grew more depressed. I wasn’t able to socialize as much, and it put me in a very bad mood. I started having very dark thoughts, even without being on the medication. It was then that I realized, perhaps this was indicative of some sort of mood disorder."}, {"type": "sentence", "content": "Before the manic/psychotic episode, I’d experienced prior bouts of depression. I’d always been a very emotional person, and before my mom passed away, she had been my biggest confidant. She’d suggested I visit a therapist several times, but I always refused, thinking it would be admitting weakness. After her passing, depression and anxiety had become my normal, so I did seek out treatment. However, the antidepressants I’d been prescribed for years never worked."}, {"type": "sentence", "content": "I started to think that maybe modern-day psychiatry was the problem, so for years, I sought help from outside of the traditional methods — I tried everything from yoga to aromatherapy to acupuncture to hypnosis. I have come to believe that it was this sort of thinking outside of the norm that actually fed into a lot of my delusions — that I wasn’t the problem, the system was the problem."}, {"type": "sentence", "content": "During the manic episode, I was very happy, sociable, and felt great most of the time, which is why I didn’t think anything was wrong. I felt like I was finally happy for the first time. Even though I couldn’t hold down a job, my finances were a wreck, and I had an unstable living situation, I felt happy. The quarantine forced me to come to terms with the fact that maybe I was not spiritually awake — maybe I was living in a delusion. For the first time, I came to terms with the fact that I might have been experiencing a manic episode, and that I was finally coming down from it."}, {"type": "sentence", "content": "I went back to see the psychiatrist. I started taking my medications again, which he adjusted. It’s going to take some time, but for the first time in a long time, I feel hopeful about modern-day psychiatry."}, {"type": "sentence", "content": "Upon learning more about the condition, I’ve discovered that typical antidepressants actually don’t work for people with bipolar disorder. This is likely why the antidepressants I’d been prescribed had never worked for me. I didn’t need to find a spiritual path, or to find alternative answers that caused me to become dissociated from reality — I just needed a proper diagnosis."}, {"type": "sentence", "content": "Even though it’s a sensitive subject, I am thankful for the COVID-19 pandemic in my own personal life. Of course, I am sorry to those who have lost loved ones — I have lost a few myself, and I know how devastating it is. However, in my own anomaly of a life, it forced me to take some time to get grounded — to stop seeking out the stimulation which kept my manic episode going, to listen to those wiser than me, to trust that people wanted to help me, and to allow my brain to heal."}], "topic": "mental-health"}