{"title": "My Georgetown Graduation Speech", "data": [{"type": "image", "content": "https://miro.medium.com/max/8064/1*kHIzo5PBPCqn0oOPRb987Q.jpeg"}, {"type": "subtitle", "content": "Some words for this year’s healthcare-focused graduates"}, {"type": "sentence", "content": "I said these words to my class at Georgetown’s School of Nursing and Health Studies at my own graduation. I hope to offer the same message to this year’s healthcare-focused graduates as they enter an uncertain future — one with a dire need for leadership and patient-focus in healthcare. At this turning point in healthcare, all of us must strive for building something better, together."}, {"type": "sentence", "content": "Speech Originally Given at Georgetown University Graduation Tropiaia Ceremony:"}, {"type": "sentence", "content": "Hi, my name is Robert Longyear — I am a healthcare management and policy major from Marietta, GA. And, to be honest, I’m a little nervous, but I wouldn’t have it any other way. Being even more honest it’s been a nervous past two weeks as I look beyond graduation at what’s next-a feeling, I am sure, many of us have been experiencing. But again, I don’t think I would have it any other way. Nervousness keeps you on your toes, I think, and it speaks to the tremendous importance of this event in our lives."}, {"type": "sentence", "content": "I would like to start out by saying congratulations to everyone — what a life-filled experience it has been during our time at Georgetown, and, I am sure I can speak for everyone when I say that it has been a journey of incredible learning, opportunity, growth, some pretty big challenges, and a fair amount of fun."}, {"type": "sentence", "content": "I have been afforded the significant honor and privilege to reflect on the past few years and to try to speak to a few concepts that I think are essential to what we have experienced and about where we go from here."}, {"type": "sentence", "content": "Recently, I have spent a great deal of time wandering around campus as I have struggled to put into words what I hope to convey. I think the closest way to describe the feeling I have is something like when you know you’re getting close to the end of a really good book — where you kind of wish the story wasn’t over, and want it to continue, but you’re also proud you finished it."}, {"type": "sentence", "content": "As we reach the end of each of our books, at Georgetown, the question remains:"}, {"type": "sentence", "content": "What do I do next?"}, {"type": "sentence", "content": "To me, the answer is simple but monumentally important. And, it is very much rooted in the core of what defines a Georgetown education. I have spent some time, over the past few weeks, speaking to different people about what makes our education unique."}, {"type": "sentence", "content": "A Georgetown education is firmly rooted in tradition and values practiced for hundreds of years. As we sit here today, we follow in a long line of people who have graduated from Georgetown before us; whose educations were also firmly rooted in the same tradition and the same values practiced since 1789-the values of which we have spent four years exploring in one way or another."}, {"type": "sentence", "content": "Pursuing Academic Excellence, practicing Cura Personalis, or care for the whole person, being People for Others, and practicing Contemplation in Action in searching for greater meaning by questioning what we see."}, {"type": "sentence", "content": "In keeping with tradition, we have the great privilege of following in the footsteps of those Georgetown graduates who have been in the same place as we are right now."}, {"type": "sentence", "content": "Each of us, like those coming before us, have been prepared to not only apply our education and empirical skills to the world beyond the front gates, but to apply them with such a purpose where we refuse to accept the status quo, where we are truly acting as men and women for others, and where we are unafraid to stand up for those who cannot stand up for themselves."}, {"type": "sentence", "content": "As we leave Georgetown, it is on us to be enemies of complacency, mediocrity, and injustice. Within Georgetown, the NHS is a unique school. We are all united around our commitment to a common goal: the improvement of health and wellbeing in our own communities, and those of people across the globe."}, {"type": "sentence", "content": "Healthcare is special in that it brings together so many disciplines that must collaborate in order to achieve success. Human science, nursing, healthcare management and policy, and global health are four categories of those disciplines."}, {"type": "sentence", "content": "But, healthcare is far more than the science, the systems, and the organizations — it is something inseparable from humanity, and something deeply personal. It is, at the same time, extremely complex and fundamentally simple. People are all looking for the same thing — to be healthy."}, {"type": "sentence", "content": "As our field is so ingrained with humanity, each of us in this room has our own very personal experiences with health and the healthcare system. We have all experienced something, whether big or small, close to home, or from a distance — each of us has our own healthcare story."}, {"type": "sentence", "content": "Today, I want to share a part my healthcare story, or rather, the story of my Mom’s battle against leukemia; and my family’s journey through the health system."}, {"type": "sentence", "content": "When I was 12 years old, I received the unbelievable news that my mom had been diagnosed with Chronis Myeloid Leukemia. Fortunately, research and work conducted by people just like those of you in human science allowed for the management of the disease with two pills a day for 8 years of her life."}, {"type": "sentence", "content": "During this time my mom continued to teach 5th grade, run marathons, and create a wonderful life for her family."}, {"type": "sentence", "content": "I absolutely cannot even attempt to express the value of those 8 life-filled years to me. So, to the future researchers in this room, I want you to know that the hours, months, and years spent searching for answers can have a profound impact on the lives of the people benefitting from your work. I hope you will remember the meaning of your work because I will never forget to be thankful for the people who discovered these revolutionary medicines."}, {"type": "sentence", "content": "During my sophomore year, at Georgetown, the safety found in the medicine was lost when the pills stopped working; and my mom was thrown into the mercy of our deeply flawed and fragmented healthcare system. No other experience could have taught me more about what healthcare is and what it should be."}, {"type": "sentence", "content": "My mom and our family spent months in the hospital, in-and-out of clinics, on the phone with insurance companies, and in the car driving to and from appointments, in the name of waging a war against a truly terrible disease. The experience revealed major flaws in the system but highlighted the importance of the human dignity present in our healthcare institutions each and every day."}, {"type": "sentence", "content": "Throughout our months on the bone marrow transplant floor, and my flights back and forth between Georgetown and Georgia, as I stood beside my mom during her care; the importance of the many roles our graduating class will assume as we progress through our careers continuously and vividly became clear. Healthcare is a team sport with the role of each playing an integral part of the whole."}, {"type": "sentence", "content": "Despite the fragmentation, many mistakes, and unfathomable difficulties navigating her care journey, my mom received very compassionate care. No other group provided more of that than her many nurses."}, {"type": "sentence", "content": "I will never forget the day when my mom and her care team made the decision to stop treatment and to go home. As I stood in the hallway completely distraught, and in disbelief, after 6 months of struggling to get ahead of the disease-unable to process the news, one of the nurses, Karla, put her hands on mine and just stood with me in the hallway, silently, without any need for words."}, {"type": "sentence", "content": "Many of you will go on to be nurses-leaders in your field. You will experience a heavy patient load, stressful work environments, and all the burdens placed on nurses in our system. But I want you to know that no matter how small the gesture, your patients and their families will never forget your compassion."}, {"type": "sentence", "content": "Just as I will never forget the power of that simple moment."}, {"type": "sentence", "content": "Many of you are moving on to medical school and other advanced degrees that will make you providers of healthcare with a great deal of influence over patients. I would like to offer the idea that you will hold a great deal of responsibility in your hands. Your words will have the power to offer hope, comfort, fear, and complete devastation."}, {"type": "sentence", "content": "Your demeanor and attention have an incredibly strong impact on patients, and their families, I cannot emphasize enough."}, {"type": "sentence", "content": "To my friends in healthcare management and policy, we have a lot of work to do. The patient should not have to fight a disease, worry about their own well-being, and life while struggling to navigate the health system."}, {"type": "sentence", "content": "We have the ability to go out from here and remember that solving our Nation’s cost and quality problems must begin with the patient. We talk a lot about large-scale reform, complex systems, and payment mechanisms, all of which are important."}, {"type": "sentence", "content": "But, at the end of the day improvement at the national level must occur at the individual level. It should not take a degree in healthcare management to understand how to navigate our system."}, {"type": "sentence", "content": "Each day, our world becomes increasingly globalized. The health of people around the world is now everybody’s problem. It is important for us to learn from our global counterparts to improve the health of all peoples around the world and so it is the role of global health to help guide that learning and sharing."}, {"type": "sentence", "content": "Uniting us all, regardless of focus, are our stories. I encourage you all to recognize your own healthcare story and keep it close to you as you do your work."}, {"type": "sentence", "content": "Our healthcare stories, combined with our education, have the power to bring about substantial and meaningful change to the system — not only in new technologies, lower costs, and improved outcomes but in how we treat the people who look to the system for help. How we design the system and act within it, can always be improved to make the patient experience so much better."}, {"type": "sentence", "content": "Here in our very own communities we have some of the worst health outcomes of the developed world, with such blatant inequity for specific groups of people. And, we face an increasingly strong push to remove the human element from healthcare as speed and efficiency are encouraged to combat costs."}, {"type": "sentence", "content": "As the future leaders of healthcare, it is our responsibility to advocate for the patient, to be relentless in our pursuit of better systems, and to speak out against shameful inequity."}, {"type": "sentence", "content": "It is my hope that each of us leaves Georgetown with the confidence in our skills to not only make excellent decisions and to solve problems, but to make decisions that are just and kind."}, {"type": "sentence", "content": "When society, and its institutions, utter the words “this is the just way we do this” and “this is the way it’s always been done”- I know we have the skills, the capacity, and the will to stand up and ask “why?”"}, {"type": "sentence", "content": "Thank you and Hoya Saxa."}, {"type": "sentence", "content": "Robert L. Longyear III is the author of Innovating for Wellness, a book about innovation in healthcare covering health policy and digital health. He is VP of Digital Health and Innovation at Wanderly and a former Medicaid researcher focused on value-based payment, high-risk care coordination, and social determinants of health."}], "topic": "education"}