{"title": "Apple Car Speculation: The Missing Pieces", "data": [{"type": "sentence", "content": "by Jean-Louis Gassée"}, {"type": "subtitle", "content": "Who wouldn’t want a neat electric Apple Car? Coming from the Apple Watch, iPhone, and Macintosh maker, it would be an automotive dream come true. Unfortunately, reality refuses to cooperate."}, {"type": "image", "content": "https://miro.medium.com/max/2600/1*abdX1YajAUt-3rH21_leqA.jpeg"}, {"type": "sentence", "content": "Apple Car speculation never dies. This time, it resurfaces in a research note by Morgan Stanley analyst Adam Jonas, a “Tesla Bull” who’s known for his very sunny views of Elon Musk’s company. As reported in 9to5mac.com, Jonas resorts to the frequently-(ab)used parallel between Tesla and Apple to suggest that Musk should get himself a star COO, just like Steve Jobs hired Tim Cook away from Compaq. To strengthen the reference to Apple, Jonas ropes in his Morgan Stanley colleague Katy Huberty, a respected technology analyst who frequently dissects the Cupertino company. Huberty concurs about Tesla’s need for a strong head of Operations [as always, edits and emphasis mine]:"}, {"type": "sentence", "content": "Then she offers her views on the “famed” Apple Car project:"}, {"type": "sentence", "content": "Weighty words from an authorized tech industry expert."}, {"type": "sentence", "content": "Indeed, were Apple to enter the auto industry, the putative vehicle would be just like an Apple Watch, only bigger: Everything engineered by Apple — minus the low rolling resistance Michelin tires. The Car would be yet another example of Apple’s appetite for vertically integrating all layers of the product’s “stack” (hardware, software, design), a behavior deeply embedded in the company’s culture."}, {"type": "sentence", "content": "Natural as it might feel, the parallel misses an important factor: Sales and Service. Apple doesn’t have the people and facilities to display, demonstrate, and maintain automobiles. Optimists will say these value chain links could easily be dealt with by buying selected auto dealers, sprucing up their premises, and re-training the employees. Or they could take the Tesla approach and send technicians to customers’ homes and offices to perform service tasks such as dealing with uncooperative doors. Perhaps."}, {"type": "sentence", "content": "There are two much more serious obstacles to making the Apple Car dream a reality."}, {"type": "sentence", "content": "The first one involves The Machine That Makes The Machines, the production system, and the confusion between Industrial Design and Styling interchangeably referred to as Design."}, {"type": "sentence", "content": "In 1991, The Machine That Changed The World, a book that’s rightly called seminal, explained how Toyota was on its way to surpassing General Motors by paying foremost attention to the design and running of the production system, to the big machine that excretes the cars, an approach that’s since been adopted, in various forms, by the entire industry. The Design and Styling that we ogle at in carnography magazines is secondary, a subset of the grand design. This is counterintuitive, but, with all due respect to the fine people in Japan’s Toyota City, the company didn’t fly to the top of the industry on the wings of its car stylists."}, {"type": "sentence", "content": "Given the production system’s preeminence, where are the rumors describing Apple’s plans to build a car factory in Marysville, OH, or elsewhere? Have we heard gossip describing contract manufacturing arrangements with a Magna Steyr subsidiary in Canada or Europe?"}, {"type": "sentence", "content": "A car manufacturing plant is hard to hide. No leaks means no plans, no imminent or medium term Apple Car project."}, {"type": "sentence", "content": "We now turn to the real killer of hopes for an Apple Battery Electric Vehicle (BEV): profit."}, {"type": "sentence", "content": "Even before the Covid-19 pandemic, automakers had trouble making good money. After a long struggle, Tesla’s operating margin reached 2.3% last quarter. For conventional automakers such as Ford, GM, and VW, 2019 operating profit hovers around 4%. Toyota does much better with 10%…but Apple’s 2019 operating profit was 29.3%."}, {"type": "sentence", "content": "Why would the Cupertino company enter such a low margin business? It’s nice to believe that Apple could make a car like a Tesla Model 3, only better. Better software, better fit and finish, distinctive style, the best BEV on the planet. But how would such a dream vehicle cost significantly less to make than a Model 3 while selling for more? With its Nevada Gigafactory, Tesla is the undisputed leader when it comes to battery cost — and now it’s shooting for the $100/kWh holy grail. It’s unimaginable that Apple could undercut Tesla’s bill of materials."}, {"type": "sentence", "content": "How would Apple raise perceived value and lower costs to achieve a workable financial proposition? One answer frequently offered by speculators is that Apple could come up with a self-driving secret weapon. But a real self-driving car — a.k.a. Level 5 Automation — is at best five years away. Elon Musk no longer touts a fleet of 1 million Tesla robotaxis by the end of 2020. Alphabet/Google is no longer gung-ho about the future of self-driving technology: Its Waymo subsidiary is raising $2.25B from outside sources and CEO John Krafcik admits that a spin-off is “certainly a possibility”. (This isn’t to say that investors in the new round, such as Magna International mentioned above, don’t see Waymo as a path to better driver assistance in future cars.)"}, {"type": "sentence", "content": "If Apple has a secret weapon, we again must ask: Where are the rumors?"}, {"type": "sentence", "content": "The magical Apple Car is an attractive fantasy: Imagine if Apple did for cars what it did for smartphones that existed before the iPhone? What if it could take on an entrenched industry the way it did with the Apple Watch? As Katy Huberty mentions, Apple has quasi-infinite R&D money it can throw at the problem, and it has superb SCM (Supply Chain Management) that could assemble and build a distribution network for its vehicles… But, if Toyota achieves only 10% in operating margin selling 10M cars a year (with $250B revenue, about 20% more than Apple), how can we seriously believe that Apple would enter the automaking field?"}, {"type": "sentence", "content": "— JLG@mondaynote.com"}], "topic": "business"}