{"title": "The Science and Politics of Masks in the Covid-19 Pandemic", "data": [{"type": "subtitle", "content": "The UCSF Chair of Medicine says there’s no debate: Masks are a simple and effective strategy to save lives"}, {"type": "image", "content": "https://miro.medium.com/max/8406/1*siky-zelajkKarTYCeuBNQ.png"}, {"type": "sentence", "content": "One of the amazing parts of the Covid-19 crisis has been seeing new issues crop up constantly: the (largely false) dichotomy between health and the economy, the accuracy of the death count, antibody testing, the effectiveness of various medications (and, yes, bleach). The list goes on."}, {"type": "sentence", "content": "In the past couple of weeks, the issue of face masks has become a hot topic. Masks are simple things, and yet they have become the subject of a lot of confusion and debate: Do they really work? Where and when are they most effective? Should they be required? How can we get people to wear them?"}, {"type": "sentence", "content": "Witnessing these questions emerge has inspired what follows: a review of the science and the politics of masks in Covid-19."}, {"type": "subtitle", "content": "How masks became a hot button issue"}, {"type": "sentence", "content": "Like many issues in the Covid era, the question of whether to mask has exposed many fault lines in American life. Do you trust facts or feelings? Do you protect yourself first, or protect others? What is the proper balance between state power and individual liberty? Should there be separate rules for the powerful versus the rest of us? And mask mania amps up the volume by adding another ingredient to the mix: personal vanity."}, {"type": "sentence", "content": "Not surprising, then, that masks are now a sizzling, hot-button issue. One vivid illustration of this was watching senators at the Fauci hearing on May 12 make clearly partisan statements by wearing, or not wearing, masks."}, {"type": "image", "content": "https://miro.medium.com/max/1936/0*nkyDpZDQKnzysEkQ.jpeg"}, {"type": "sentence", "content": "The mask debate escalated with Vice President Mike Pence’s open-faced visit to the Mayo Clinic, where he was surrounded by doctors, patients, and even his own staffers, all of whom were masked."}, {"type": "sentence", "content": "President Donald Trump stubbornly refuses to wear a mask. When he himself announced new CDC guidelines in early April, he raised doubt that he would follow his own suggestion. “I don’t think I’m going to be doing it,” he said. “Wearing a face mask as I greet presidents, prime ministers, dictators, kings, queens — I just don’t see it.”"}, {"type": "sentence", "content": "However, according to a recent Politico poll, 70% of all respondents — even the majority of Republicans surveyed — think that the president and vice president should be covering their faces in public."}, {"type": "sentence", "content": "The issue of mandatory mask-wearing has sparked tension in the businesses that have stayed open through the quarantine. In some cases, this tension has escalated to the point of violence. An extreme case was that of Calvin Munerlyn, a 43-year-old Dollar Store security guard in Flint, Michigan. Munerlyn was fatally shot by a customer for insisting that her child wear a mask inside the store, as required by the executive order of the state."}, {"type": "sentence", "content": "All respected public health bodies now recommend masks, particularly when distancing is impossible. You can review the CDC’s official guidance here; it’s representative of most public health guidance."}, {"type": "subtitle", "content": "Types of masks and how they work"}, {"type": "sentence", "content": "When discussing masks for use in everyday life, we’re talking about either cloth or surgical masks. Importantly, we’re not talking about N95 masks, which are mostly used in caring for Covid (or other contagious patients with serious respiratory pathogens) in medical settings. N95s block most pathogens (the “95” stands for 95%) from reaching the wearer by having thicker materials and a tighter fit than cloth or surgical masks."}, {"type": "image", "content": "https://miro.medium.com/max/1684/0*z_lX-6O5t9qGLwlu.png"}, {"type": "sentence", "content": "Part of why the mask story is so tricky is that cloth or surgical masks do protect the wearer somewhat (surgical are a bit better, but both do the job), but they are mostly meant to protect the people around them. Thus, mandating masks mixes the “What’s in it for me?” with the “Give Me Liberty or Give Me Death” veins of American culture."}, {"type": "sentence", "content": "The best analogy I’ve seen for understanding how masks actually work to prevent Covid came from Harvard epidemiologist Marc Lipsitch. It’s called “The Urine Test,” and while it’s a bit crude, it’s spot on."}, {"type": "image", "content": "https://miro.medium.com/max/2208/0*5_q4DhiY968ylCyY.jpeg"}, {"type": "sentence", "content": "Whatever the type of mask, building in sippy holes or outlet valves (such as the respirators with vents that many Californians used over the last few years’ brutal fire seasons) defeats the purpose. While they do make it easier for the wearer to breathe, holes or vents of any kind render a mask useless if the goal is to prevent the spread of viruses from the wearer to others."}, {"type": "sentence", "content": "Some experts have argued that plastic face shields are better than masks, since the shields would block the virus from hitting the eyes, and wouldn’t prevent people from seeing the faces of those wearing masks. It’s a reasonable case, but to me it’s more important to send a consistent message, and face masks are the more accepted and well-known type of protection. There’s no evidence that face shields are significantly more effective than masks, and pivoting now to promote a different form of protection might lead to more confusion than benefit. But for institutions or individuals considering some kind of virus protection, face shields would be a reasonable alternative."}, {"type": "subtitle", "content": "The evidence supporting masks"}, {"type": "sentence", "content": "The science behind masks was recently reviewed by Jeremy Howard and colleagues. Their comprehensive article is well worth a read."}, {"type": "sentence", "content": "One of the key things to understand in thinking about the value of masks is the concept of the viral dose. While it seems logical that a single viral particle hitting a person’s mouth, nose, or eye could cause an infection, strong laboratory and empirical evidence says that this is not the case — it takes a big dose of virus to launch a case of Covid. This happy fact means that masks for everyday use don’t need to block 100% of pathogens in order to prevent the disease from spreading. (Even the medical-grade N95 masks don’t block every viral particle, but they block enough to protect the user, even when caring for patients with known Covid-19.)"}, {"type": "sentence", "content": "Face masks are effective because they block droplets from spraying out of the wearer’s mouth. They also remind us not to touch our mouths/noses. We all know that sneezing and coughing can generate a spray of virus (the six-feet rule is because, in most cases, that’s the outer limit of how far moist droplets will travel). We now appreciate that singing transmits a lot of viral particles, and at least one large outbreak occurred during a choral practice. A recent simulation study found that loud speaking can also send viral particles out a moderate distance, though the clinical significance of this is uncertain. Nevertheless, now that we know the various ways that virus can leave someone’s mouth and enter the air, it’s all the more reason to mask up — particularly since there’s no good way to tell whether someone has Covid without testing, and up to 50% of Covid patients are asymptomatic, at least at first."}, {"type": "sentence", "content": "There have been no controlled trials that have tested the benefits of masks; all of the available evidence regarding their efficacy is from observational studies. Having reviewed the literature, I agree with this statement by Jeremy Howard: “The preponderance of evidence indicates that mask-wearing reduces the transmissibility per contact by reducing transmission of infected droplets in both laboratory and clinical contexts.”"}, {"type": "sentence", "content": "One compelling case study described the course of a person already positive for Covid-19, who had a cough, and who flew 15 hours on a crowded airplane. He wore a mask; it’s not clear from the paper whether the 25 passengers near him did as well. In any case, none of the passengers or crew on the flight contracted the virus. While this is only one case, it’s hard to believe that, with 25 people sitting less than six feet from a coughing patient with Covid, no one would have caught Covid if the infected person had not been masked."}, {"type": "sentence", "content": "In an excellent review in the British Medical Journal, Trisha Greenhalgh and colleagues came to the following conclusion:"}, {"type": "image", "content": "https://miro.medium.com/max/3084/0*frMMdawZq-p6c-Y4.jpeg"}, {"type": "sentence", "content": "I am someone who believes deeply in evidence-based medicine. Yet there are times in epidemiology where the evidence, though imperfect, is still good enough to take action, particularly when the intervention is cheap and benign. The Covid pandemic is undoubtedly one of them. People, we’re talking about wearing a mask on your face, not receiving chemotherapy."}, {"type": "sentence", "content": "One problem with the current literature is that masking is rarely the lone intervention — wearing masks is usually part of a bundle of measures including social distancing, diligent hand hygiene, etc. But it’s clear that the countries whose citizens are more serious about masking (and thereby tend to do the other stuff too) enjoy lower infection rates."}, {"type": "sentence", "content": "The key is getting folks to wear their masks. The figure below, from Howard et al., shows that if masks are 50% effective at blocking pathogens (a conservative estimate, shown in the Y-axis on the left) and 50% of people wear them (which shouldn’t be too tough; X-axis), the rate of viral transmission plummets from one person spreading it to 2.4 people on average, to one person spreading it to 1.35 people. (R0 from 2.4 →1.35; the curved lines within the square show the resulting R0.) That saves many lives, but, with an R0 of 1.35, there’s still a lot of spread. (Recall that the virus begins to die out if each infected person gives the virus to fewer than one person; an R0 of <1). The higher the rate of adherence to mask-wearing, the more we move to the upper right (blue) part of the square, the lower the spread of the virus, and the more quickly the epidemic recedes in a given community."}, {"type": "image", "content": "https://miro.medium.com/max/2024/0*I0fIM6icAQOKBb3Q.jpeg"}, {"type": "sentence", "content": "A simulation by De Kai and colleagues makes the case that masks are most effective if at least 80% of people are using them. The figure below maps the rate of transmission with the expected deaths from Covid-19 in a nation the size of the U.K. According to the simulation, social distancing alone without masking would lead to 1.16 million deaths by May 31. However, with 50% of the population masking, the projected death figure drops to 240,000. With 80% masking, there are 60,000 deaths."}, {"type": "image", "content": "https://miro.medium.com/max/1740/0*v0uatyujGdbSFqDZ.png"}, {"type": "sentence", "content": "If Professor De Kai’s mind-blowing video (below) doesn’t convince you of the virtue of mask-wearing, I just don’t know what to tell you."}, {"type": "sentence", "content": "Why is masking so difficult to maintain among the public? In Asia, face masks are now seen as a normal accessory. In the U.S., they’re still seen as awkward and stigmatizing. Historically, they have been a sign of illness or danger. This aversion, plus the fact that the benefit of masks mostly accrues to others, is why we need to make mask-wearing mandatory as long as SARS-CoV-2 is active in our communities, at least in closed spaces (as San Francisco has done)."}, {"type": "image", "content": "https://miro.medium.com/max/2412/0*k_fN93LEJBJn6Jl5.png"}, {"type": "sentence", "content": "One of the most common questions is whether it is necessary to wear a mask when walking or exercising outside. Empiric and simulation studies have shown that there is practically zero risk of viral spread when one is outdoors and keeping a distance of greater than six feet from others. I personally don’t wear a mask when walking the dog (but I do keep one with me just in case I encounter someone at close range). But I always wear a mask inside, or if an encounter within six feet is likely."}, {"type": "sentence", "content": "The counterargument to selective inside/outside mask-wearing is that our best chance of getting people to wear masks reliably is to mandate their use everywhere — including outside. That’s what my epidemiology sensei, UCSF’s George Rutherford, believes. “We need to make them normative,” he says, which might make a universal mandate the right policy call. I’d be fine with it."}, {"type": "sentence", "content": "On a recent Zoom Town Hall at my hospital, after hearing a mask pep talk by Dr. Rutherford, UCSF Health CEO Mark Laret donned his own mask (despite being alone in his home). “George scared me straight, so I’m wearing a mask to protect myself from myself!” That might be overkill, but it’s the right idea."}, {"type": "subtitle", "content": "As restrictions ease, masks remain vital"}, {"type": "sentence", "content": "Covid will be with us for the foreseeable future. When we were all sheltered at home, the risk of spread was minimized (though, given 1.5 million documented cases and 90,000 deaths in the U.S., clearly not eliminated). As we move into selective loosening of the restrictions, we need to embrace policies and practices that can decrease the risk of viral spread. In a world in which it is impossible to know who is carrying SARS-CoV-2 and highly unlikely that we can completely avoid entering each other’s space, masks represent a simple and effective strategy whose use will save tens of thousands of lives. Our smiles will still be there when this epidemic is over."}], "topic": "science"}