{"title": "Morbid Curiosity, Art Direction, and Fallout 76", "data": [{"type": "subtitle", "content": "Bethesda’s most infamous release deserves its bad reputation, but is there a light at the end of the tunnel?"}, {"type": "sentence", "content": "There’s not really any other way of introducing this topic, so I will just come right out with it: I am absolutely fascinated by Fallout 76."}, {"type": "sentence", "content": "I’d consider myself a pretty big Fallout fan, but one who had tempered expectations of Bethesda’s multiplayer spin on Fallout 4’s cycle of looting and crafting. This was of course compounded by the game’s singularly disastrous launch, one met with outrage, stifled laughter and an avalanche of commentary and criticism that reached critical mass within about a week. Like a fair few of you reading this now, I became intensely bored of hearing about just how bad this game was. Don’t get me wrong, the coverage was richly deserved: Joseph Anderson’s meticulous 3-hour dissection of the game’s litany of bugs was barely the tip of the iceberg. The actual release of the game added even more fuel to the fire: Bethesda reneging on promises regarding the quality of tie-in merch and a particularly rude support email response were only two parts of the unmitigated marketing disaster. Even if we excluded the bugs and the PR headaches, many reviewers simply arrived at the conclusion that the included content simply wasn’t very good anyway: 76, even if it was polished to a mirror-sheen, was never a product to write home about."}, {"type": "sentence", "content": "Throughout the ensuing year, I had a niggling morbid curiosity about this title. I made a promise that once it reached the kind of sale price that I could justify to myself to scratch that itch, I would pull the trigger. It turns out that, with a recent free weekend — combined with the spare time afforded by the extremely unwelcome virus outbreak we’re all angry at — I had a few days to play the title as much as I wanted free of charge. Perhaps that ‘free’ tag should carry an asterisk: time is of course its own commodity. Spending time playing a game that might be bad, frustrating or confusing comes at the price of not playing something dependably enjoyable or polished. Friends advised me this game was absolutely not even worth that time, and in busier circumstances perhaps I’d never have given the game a crack."}, {"type": "sentence", "content": "76 has been out for over eighteen months, though even then I am not confident that the dust has settled on that woeful launch yet. Opinions toward the game in popular media haven’t softened so much as they have been consigned to history. Until the free weekend, I had no idea of how 76 had been updated over the last year or so. The game barely appeared on my radar from a coverage perspective. After all, there’s new bug-filled messes, fresh controversies, and, frankly, the title’s well-documented failure reached a point where little else could be added from a critical perspective. Instead, 76 briefly reappears like a comet: Bethesda’s introduction of a paid subscription flashed across the sky a few months ago, but otherwise, absence."}, {"type": "sentence", "content": "While devouring, and even reveling in, contemporaneous coverage of the game, I could not believe it was this bad. To be clear, I fully understood what made the game so terrible: in the rare event the servers played ball, and that the game wasn’t bugging and glitching to unpalatable extremes, there were few interesting quests, and even fewer interesting characters to talk to. What I couldn’t believe was just how this had happened. Bethesda have developed some games I have greatly enjoyed. Fallout 4 was far from one of my favourite games but it was one that, on the whole, I did not regret the time I spent playing. As I began making my first character and venturing out of the vault into Appalachia, I found myself consumed by figuring out just exactly where this game might have gone right, and understanding how those well-accounted failings steadily subtracted from it."}, {"type": "sentence", "content": "76’s opening is exactly what you’d expect: you leave the vault, are given a handful of clues, pointers and whiffs of intrigue to give you some soft guidance on what to do next, and then are left to your own devices. You aren’t obligated to go over to the Wayward, the bar that opened as part of the Wastelanders update that recently dropped. You can explore at your own pace, and soak in a new, distinctly more rural wasteland. These early hours of exploration, while perhaps not quite as spellbinding as Fallout 3 or Obsidian’s peerless New Vegas, are excellent. Getting your bearings in the forest region, Appalachia’s beginner area, involves exploring disused fire-watchtowers, abandoned cabins, and picking soot flowers. Bethesda’s knack for environmental storytelling and contained narratives shines through here in abundance."}, {"type": "sentence", "content": "One particular highlight was discovering Anchor Farm, which the player is pushed towards relatively early on during the Wastelanders plotline. I walked towards the house at dusk, and was captivated by the scene in front of me: a typical 20th-century farmhouse, punctuated by a cobbled-together camp outside and a crumbling USAF biplane dominating the picture. The camp was dimly lit, and 76’s generally laudable lighting flattered the game’s underwhelming graphics. This moment was so clear in my mind because it reminded me just how talented this studio is when it comes to art direction, and storytelling within these crafted environments. I could picture how the farm might’ve looked before the bombs dropped, and perhaps even the types of people who lived there."}, {"type": "sentence", "content": "It’s probably not surprising to read that this is, in my opinion, 76’s strongest component. Exploration is just as good as in Fallout 4 at least — at least on the surface level of interesting places to look around and immerse yourself in. If little else, 76 scratches the itch of having another Bethesda open world to inhabit and enjoy. 76’s setting offers a nice, rural twist on the urban centers of previous titles. Otherwise, the curiosity of what might be around the corner, or what that greyed-out icon on the radar at the bottom of your screen might be, remains as strong as it has been in past Fallout and Elder Scrolls games. Reading logs and listening to tapes as you walk around deserted places can be exciting, amusing, and even tragic. This satisfied my curiosity of where 76 might last have been going right from a development perspective. In crafting an open world, it was assuredly business as usual, and that is a compliment. It also isn’t a surprise: 76’s lead designer, Emil Pagliarulo, also led Fallout 4. The standards set in past titles are, generally speaking, held to in 76. Specific dislike for certain areas might be subjective from player to player."}, {"type": "sentence", "content": "One area where 76 might even surpass Fallout 4, though again on a superficial level, is the enemy variety and their distinct appearances. Leaning playfully on local myths allowed the team to introduce enemies distinct to Appalachia. Mothmen look striking and extremely creepy, while Snallygasters and Mega Sloths help mix things up between familiar Super Mutants and Deathclaws. Obvious letdowns are the Scorched, the game’s awkward compromise between it’s initial commitment to having no NPCs and the quandary of having too few enemies that would fire back at the player. Indeed, where 76’s enemies do not surpass anything previously seen in the series is in their behaviour. Whatever it’s technical cause, almost all of these enemies have extremely limited tactical awareness and even less interesting execution. Scorched will alternate between hiding behind cover and sprinting directly at you — usually conveniently into your crosshairs. Worse are most of the creatures, who do not generally have the luxury of a ranged weapon, and are left to sprint towards you, and their inevitable demise. My heart sank having the illusion of these imaginative, interesting and scary enemies shattered by them obliviously shambling around with me six feet away, clipping through the floor, or sprinting gleefully towards the shooty end of my hunting rifle."}, {"type": "sentence", "content": "The problem with the enemies is a running theme in 76: execution is invariably poor. Circling back to the exploration and the environmental storytelling, those quality moments are let down greatly by a continuation, perhaps even a worsening, of the problems that plagued Fallout 4’s quest design. Contexts and settings might have been interesting, but the actual gameplay moved away from skill-checks and multiple endings in favour of fetch quests. 76 continues this theme, marred further by an abundance of lifeless quest-givers. Here, with this lack of direct quest intrigue, being sent to fetch glorified MacGuffins is even less enticing. This is partially solved in the Wastelanders update: the human NPCs brought into the quest-line are excellently written on the whole, and are a welcome return to form. However, a hard level cap midway through the quest-chain ultimately forces new players to trudge through the ‘old’ opening content. Treating players to some quality writing and Fallout world-building only to send them on a series of sterile fetch-quests punctuated by lengthy sections of terminal reading only brings more attention to the flaws of the game’s original plot-line. Just as I watched with frustration and disappointment at delightfully grotesque enemies freezing up or, politely, being brain-dead, my heart sank seeing an interesting, engrossing area be used for another quest involving finding a doodad in exchange for a handful of caps."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*p9Ksd9j7I09DZQ2n.png"}, {"type": "sentence", "content": "There’s little point in diving into the laundry list of problems that haven’t been addressed over the time that has passed since the game’s launch in 2018. Plenty of more insightful and exhaustive pieces give a better sense of this game’s biggest flaws. Likewise, coverage of the game’s predatory micro-transactions and controversial subscription option is abundant. I didn’t want to add my voice to that pile, not because I don’t necessarily share in those opinions, but because there’s nothing new I could possibly add to the discussion. The reason I bothered to play Fallout 76 was to try and ascertain whether there was a nugget of a good game buried in this mire of controversy and glitches, and I believe I found it. I don’t necessarily think that translates into a recommendation, but I can say some of the art direction and environmental design might rank among some of the series’ best. That facade crumbles when it is backed up by a creaking abomination of an engine that can barely handle Fallout 4’s level of detail. Technically speaking, Bethesda’s experiment with retrofitting online multiplayer into the decade-old Creation Engine went about as well as the in-universe experiments with FEV that produced the Super Mutants."}, {"type": "sentence", "content": "When I entered certain areas in Appalachia’s sprawling wasteland, usually at the behest of a quest issued to me by a computer terminal, I couldn’t help but think of the artists that drew and built the abandoned manor I was stepping into, or the ruined lakeside cabin whose ruins I was carefully navigating to avoid the irradiated water. They painstakingly position the furniture in the living room, choose which sections of the picket fence to weather just a little, and maybe throw some toys on the floor of the kid’s bedroom, as if they’d just been set down for the briefest of moments, itching to be played with again. Satisfied, they lean back in their chair and reflect on another beautiful new location for the upcoming Fallout 76. A quest designer comes in and says, “you know what this needs? Some holotapes.”"}], "topic": "gaming"}