{"title": "Children of the Pandemic: Literacy Support for Asian American Children at Home", "data": [{"type": "subtitle", "content": "Online picture books and multimodal literacy help Asian American children cope with COVID-19 related discrimination"}, {"type": "subtitle", "content": "By: Wenyu Guo"}, {"type": "image", "content": "https://miro.medium.com/max/1584/1*oP-evJjGNUmaH_65bcJo-A.png"}, {"type": "subtitle", "content": "Children of the Pandemic"}, {"type": "sentence", "content": "Since the outbreak of the pandemic, Asians and people of Asian descent have been targets of derogatory language in media reports and statements by politicians as well as on social media platforms, where hate speech related to Covid-19 also appears to have spread extensively. As millions of students across the country stay home to have online classes because of the coronavirus pandemic, it has been easier for children to be exposed to these hate speeches in the online environment."}, {"type": "sentence", "content": "“If they keep using these terms, the kids are going to pick it up,”"}, {"type": "sentence", "content": "said Tony Du, an epidemiologist in Howard County, Md., who fears for his son, Larry."}, {"type": "sentence", "content": "“They are going to call my 8-year-old son a Chinese virus and “kung-flu”. It’s serious.” (The New York Times)"}, {"type": "sentence", "content": "As the coronavirus upends American life, Chinese Americans students and families face a double threat. Not only are they grappling like everyone else with how to avoid the virus itself, they are also contending with growing racism in the form of verbal and physical attacks and coping with the challenges of their children’s mental and emotional health during the outbreak. Other Asian-Americans — with families from Korea, Vietnam, the Philippines, Myanmar and other places — are facing threats and educational challenges, too."}, {"type": "subtitle", "content": "As a part of the current Graduate Civic Scholars Program (GCSP) project, we will reach out children and youth through social media such as Facebook, Instagram, anda book club website — both locally and nationally."}, {"type": "sentence", "content": "Due to the pandemic, children and youth are staying at home and having online classes. They are more inclined to use social media to get information. Besides, social media firms have all taken action to ensure reliable sources of information on COVID-19 are promoted high on their sites and atop searches and user feeds. The platforms have also been used for campaigns such as #IamNOTAVIRUS which have sought to counter racist narratives as well as empower those who have faced abuse. This is the reason behind why I created a website for my small readers in the book club — to get in touch with them and also deliver positive literacy resources for reaching out to more marginalized children who are at higher risk of being discriminated during COVID-19."}, {"type": "image", "content": "https://miro.medium.com/max/1424/1*jlHQ44Z8X89E5HRvtgrwTg.png"}, {"type": "subtitle", "content": "Asian American Book Club Website"}, {"type": "image", "content": "https://miro.medium.com/max/1976/1*ly4CU4mJ8pWJmROu7jCEzA.png"}, {"type": "sentence", "content": "As parents, guardians and educators, how do we protect our children from being exposed to hate speeches on social media and provide them correct guidance through the long-lasting pandemic? How do we provide appropriate literacy support for Asian American children to develop their balanced identity at home? As the leading facilitator in a local Asian American Book Club, I deeply realized the dramatic changes caused by COVID-19 for Asian groups and also my students in the book club. Many students’ parents complained about lacking enough literacy resources and methods to support their children’s literacy and identity development at home. Some parents find it hard to look for online, culturally relevant picture books for their children to read since public libraries are all closed. These are the major reasons I created the website for Asian groups locally and nationally."}, {"type": "image", "content": "https://miro.medium.com/max/1590/1*jaP13XlChJXcBYRuoUnlww.png"}, {"type": "sentence", "content": "Founded in January 2019, the Asian American Book Club is a non-profit organization affiliated to the Columbia local Chinese Heritage School. The purpose of our book club is to support Columbia local Asian American immigrant children to develop their balanced bicultural identities through reading, sharing, and discussing culturally relevant children’s literature in a local Book Club. Working as the Chinese language volunteer teacher in the Chinese Heritage School for over two years, I deeply realized the importance of being immersed in two cultures — American local culture and their heritage culture. Besides learning Mandarin Chinese or any native languages, the Asian American children also need to be exposed positively to their home culture. With the desire to provide immigrant children another space and appropriate children’s literature to help them renegotiate with their bicultural identity, my husband and I decided to set up the “Asian American Book Club” in the UofSC Chinese Heritage School at the beginning of 2019 and have regular book club meetings every Sunday afternoon. As the leading facilitator, I scaffold Asian American children through reading Asian American historical narratives which empower children in keeping with the operation and function of their own culture — that of the children and ethnicity — within American history. Through sharing Asian American historical narratives with them weekly, we provide Asian American immigrant children another space to negotiate their bicultural identities."}, {"type": "subtitle", "content": "Literacy resources to help Asian American children deal with the pandemic."}, {"type": "image", "content": "https://miro.medium.com/max/1680/1*ZojhwfYOV4_UpAlE7_J9IA.png"}, {"type": "sentence", "content": "A new story book that aims to help children understand and come to terms with COVID-19 has been produced by a collaboration of more than 50 organizations working in the humanitarian sector, including the World Health Organization, the United Nations Children’s Fund, the United Nations High Commissioner for Refugees, the International Federation of Red Cross and Red Crescent Societies and Save the Children."}, {"type": "sentence", "content": "With the help of a fantasy creature, “My Hero is You, How kids can fight COVID-19!” explains how children can protect themselves, their families and friends from coronavirus and how to manage difficult emotions when confronted with a new and rapidly changing reality."}, {"type": "sentence", "content": "Related: My Hero is You, How kids can fight COVID-19! is written in Chinese, English and more than 30 other languages in order to reach as many children as possible."}, {"type": "sentence", "content": "Related: Read-aloud by well-known artist, Howard Donald"}, {"type": "sentence", "content": "2. Virus, Virus, You Cannot Scare Me!"}, {"type": "image", "content": "https://miro.medium.com/max/944/1*AaSVixBZ0J48X87mVlx8fw.png"}, {"type": "sentence", "content": "The children’s picture book is created and translated by Chinese author. This is an online picture book for children about virus prevention and control. The book enables parents and children to learn — in a fun interactive way — about how viruses spread and what people can do to protect themselves effectively. Thus, it helps relieve children’s fear for viruses and improve their ability to prevent infection. It also introduces the idea of harmonious coexistence between human and nature, in hope of raising children’s awareness of protecting wildlife as well as the natural environment."}, {"type": "sentence", "content": "Access the online picture book here!"}, {"type": "sentence", "content": "3. A Brief History of Viruses for Children"}, {"type": "image", "content": "https://miro.medium.com/max/1726/1*dlFGwETB2ma1DkIm6IqyTA.png"}, {"type": "sentence", "content": "The children’s picture book is created and translated by Chinese author. This picture book tells the origin of the virus and its impact on human society, so that the readers can understand the history of the virus. The book specifically sets up a “Ten Questions about COVID-19” section, which explains in detail the relevant knowledge and preventive measures of the virus, helping children and juvenile readers to understand where the virus comes from and how to prevent it."}, {"type": "sentence", "content": "Access the online picture book here!"}, {"type": "subtitle", "content": "Online Resources for Children’s Literacy Development During COVID-19"}, {"type": "subtitle", "content": "1. Epic!"}, {"type": "sentence", "content": "Epic is an online digital library for children ages 12 and under. There are picture books sorted by different genres and age groups."}, {"type": "sentence", "content": "Take a look at what Epic! has to offer."}, {"type": "subtitle", "content": "2. Wash Your Hands with Peppa Pig"}, {"type": "subtitle", "content": "3. Asian Pacific American Heritage Month"}, {"type": "sentence", "content": "The month of May was chosen for Asian Pacific American Heritage Month to commemorate the immigration of the first Japanese to the United States in May 1843 and to mark the anniversary of the transcontinental railroad, completed on May 10, 1869. The majority of workers who laid the tracks were Chinese immigrants. In 1992 the official designation of May as Asian Pacific American Heritage Month was signed into law."}, {"type": "sentence", "content": "Related: Parents can find resources to teach children about Asian American historical narratives through the Asian American history website: http://www.cetel.org/res.html"}, {"type": "sentence", "content": "Related: Parents can also find the oral history of Japanese American experiences during WWII on this website: https://densho.org/"}, {"type": "subtitle", "content": "4. Smithsonian learning lab collections on Asian pacific American history"}, {"type": "image", "content": "https://miro.medium.com/max/1056/1*VMG5bEZWfvfmaYnqnzl62Q.png"}, {"type": "subtitle", "content": "Online Videos of Youth of the Pandemic"}, {"type": "subtitle", "content": "Children of the pandemic: How will kids be shaped by the coronavirus crisis?"}, {"type": "subtitle", "content": "Being a kid stuck at home during covid-19 | Voices from the Pandemic"}, {"type": "subtitle", "content": "Homeschool During Coronavirus: How Parents and Kids are Reacting"}], "topic": "education"}