{"title": "15 Origin Stories That Show the Power of a Name", "data": [{"type": "subtitle", "content": "The world’s biggest brands had names no one remembers"}, {"type": "image", "content": "https://miro.medium.com/max/7192/0*lWX-WiO8FhDjmin5"}, {"type": "sentence", "content": "Would you do a Backrub search to buy something on Cadabra? Drink a latte from Cargo Cafe while watching some Kibble?"}, {"type": "sentence", "content": "These questions would make a lot more sense if Google, Amazon, Starbucks, and Netflix had stuck with their original names."}, {"type": "sentence", "content": "A company’s success depends on its name and many spend millions on this type of research."}, {"type": "sentence", "content": "Some names come to founders easily and some are just accidental. However they originate, naming a business can feel like naming a child — and be equally as difficult (isn’t that right, Elon?)."}, {"type": "sentence", "content": "Netflix co-founder, Marc Randolph says:"}, {"type": "sentence", "content": "No wonder some of the world’s most successful companies got it wrong the first (and even the second) time."}, {"type": "sentence", "content": "Luckily for them, they quickly changed — or 30 years later in one case below — and have gone on to become names known all over the world."}, {"type": "sentence", "content": "Here are the origin stories behind 15 popular brands and why they changed their name."}, {"type": "subtitle", "content": "1. Brad’s Drink (Aka Pepsi)"}, {"type": "sentence", "content": "Caleb Davis Bradham created a beverage comprised of carbonated water, sugar, vanilla, rare oils, and cola nuts and named it Brad’s Drink. It didn’t have much success until Caleb decided a name change was in order. He believed his drink aided digestion and changed the name to Pepsi — taken from the word dyspepsia, meaning indigestion."}, {"type": "subtitle", "content": "2. Burbn (Aka Instagram)"}, {"type": "sentence", "content": "Kevin Systrom loved Kentucky whiskeys so much that he named his location-based app (based on the popular Foursquare app) after his favorite alcohol."}, {"type": "sentence", "content": "The app went in a new direction when Kevin saw users weren’t using the app for its original purpose (checking into places) but for sharing photos. He decided on an alternative name for the app that better reflected what users were doing, hence Instagram."}, {"type": "subtitle", "content": "3. Backrub (Aka Google)"}, {"type": "sentence", "content": "Larry Page and Sergey Brin named their company Backrub, which was based on the way it analyzed the internet’s backlinks to rank the relevance of websites. Not happy with the name, Page held a brainstorming session with Stanford University grad students where they landed on the word googolplex — one of the largest describable numbers (a one followed by 100 zeros)."}, {"type": "sentence", "content": "In a fortuitous twist, the student who suggested the name spelled googol wrong. Even spelled incorrectly, Google just works. Can you imagine asking someone to Backrub an answer for you?"}, {"type": "subtitle", "content": "4. Cadabra (Aka Amazon)"}, {"type": "sentence", "content": "Jeff Bezos wanted to call his company Cadabra, as in abracadabra. When he told his lawyer, the lawyer misheard the word as cadaver and advised him against it — wisely thinking dead bodies wouldn’t be a pleasant vision for customers."}, {"type": "sentence", "content": "Jeff’s next choice was Relentless and he went as far as registering the name and domain. This time, it was his colleagues who told him the name was too brutal, so he went with his third choice, Amazon."}, {"type": "sentence", "content": "He chose the name Amazon because it was the world's longest river (it's marginally behind the Nile but this is debatable) and he wanted to be “Earth’s biggest bookstore.” He also wanted to appear at the beginning of listings — website listings were often in alphabetical order back then."}, {"type": "sentence", "content": "If you visit relentless.com, it will redirect you to the Amazon website."}, {"type": "subtitle", "content": "5. Zorba (Aka Zara)"}, {"type": "sentence", "content": "Amancio Ortega loved the 1964 film “Zorba the Greek” and named his clothing store after the film."}, {"type": "sentence", "content": "His store opened in La Coruña (a city in northern Spain) in 1975 but was located two blocks away from a bar called Zorba. The bar owner said it was confusing to have two places so close together with the same name. Ortega had already made the mold for the letters of his sign, and rather than make a new sign, he rearranged the letters to make up the word Zara."}, {"type": "subtitle", "content": "6. AuctionWeb (Aka eBay)"}, {"type": "sentence", "content": "Pierre Omidyar launched his website — AuctionWeb — with just one item. A single broken laser pointer. Ironically, it sold for $14.83 to a collector of broken laser pointers. Omidyar soon realized that you could sell anything on the internet."}, {"type": "sentence", "content": "Experiencing early success, Omidyar decided to change the name after two years to match the name of his consulting firm, Echo Bay. Since the Echo Bay website domain was taken, he shortened the name to eBay."}, {"type": "subtitle", "content": "7. Cargo Cafe (Aka Starbucks)"}, {"type": "sentence", "content": "Starbucks co-founder Gordon Bowker said that the original name for the chain was Cargo House. Thinking the name wasn’t a perfect fit, brainstorming continued. Bowker, having an advertising background, wanted a name that started with “st” as “st” words are seen as powerful and strong."}, {"type": "sentence", "content": "One of Gordon’s team pulled out an old map of the Pacific Northwest and found a mining town called Starbo. From there, Bowker thought of the first mate in the book, “Moby Dick” — Starbuck. He added an “s” to the end to make it sound more conversational and what would become the world's biggest coffee chain had a name."}, {"type": "subtitle", "content": "8. Kibble (Aka Netflix)"}, {"type": "sentence", "content": "Co-founder Marc Randolph had already registered the name Kibble, so that was the early name that Marc and his team used for their project to defeat Blockbuster. As they approached the launch, Randolph wanted to call the company rent.com but the name was taken and the owner wanted $40,000 for it."}, {"type": "sentence", "content": "As Randolph says:"}, {"type": "sentence", "content": "Net is derived from the word Internet and flix is a shortened version of the word flicks, a synonym for movies. And so Netflix was born."}, {"type": "sentence", "content": "Kibble and chill just doesn’t work, does it?"}, {"type": "subtitle", "content": "9. Sound Of Music (Aka Best Buy)"}, {"type": "sentence", "content": "This chain of stores selling high fidelity stereo equipment was founded in 1966 and was quite successful under this name for 15 years."}, {"type": "sentence", "content": "In 1981, Sound of Music had nine stories in Minnesota when the largest and most profitable store was hit by a tornado. The store then held a “tornado sale” to sell damaged stock in the store’s parking lot. The tornado sale promised “best buys” on everything. Sound of Music made more money during this “best buy” four-day sale than it did in an average month, thus, they decided to rename the store to Best Buy."}, {"type": "subtitle", "content": "10. Jerry and David’s Guide to the World Wide Web (Aka Yahoo!)"}, {"type": "sentence", "content": "Co-founders Jerry Yang and David Filo were Ph.D. students at Stanford when they created what would become one of the world’s largest search engines. They came up with the unwieldy name Jerry and David’s Guide to the World Wide Web."}, {"type": "sentence", "content": "A suitable name for a book, it didn’t work as a company name. Jerry and David settled on Yahoo! an acronym for Yet Another Hierarchical Officious Oracle. They were forced to add the exclamation point as there were already several companies named Yahoo."}, {"type": "subtitle", "content": "11. Pete’s Super Submarines (Aka Subway)"}, {"type": "sentence", "content": "In 1965, Pete’s Super Submarines opened in Bridgeport, Connecticut, before strangely changing its name to Doctor’s Associates Inc., after co-founder Dr. Peter Buck."}, {"type": "sentence", "content": "That name hardly made customers think of sandwiches, so as the business was failing, the founders made a third attempt at a catchy name — landing on the far more appropriate Subway."}, {"type": "subtitle", "content": "12. Blue Ribbon Sports (Aka Nike)"}, {"type": "sentence", "content": "Bill Bowerman and Phil Knight founded Blue Ribbon Sports as a distributor for Japanese shoemaker Onitsuka Tiger. When they branched out to make their own shoes, they tossed up two names — Nike and Dimension 6. Eventually, they settled on the name of the Greek goddess for victory, in what proved to be a wise choice."}, {"type": "subtitle", "content": "13. Tote’m (Aka 7-Eleven)"}, {"type": "sentence", "content": "The Tote’m convenience stores, founded in 1927, were so-called because customers toted away their items. In 1946, when they changed the operating hours of the stores to 7 a.m.-11 p.m., they changed their name to reflect this. And so 7-Eleven was born."}, {"type": "subtitle", "content": "14. Matchbox (Aka Tinder)"}, {"type": "sentence", "content": "When Jonathan Badeen co-founded the dating app he named it Matchbox, a play on words associated with love and fire. Think sparks flying, flames igniting, and smoldering looks. The name wasn't working so Badeen turned to a thesaurus for inspiration — the word tinder stood out to him and has now become synonymous with swiping right."}, {"type": "subtitle", "content": "15. Unadulterated Food Products (Aka Snapple)"}, {"type": "sentence", "content": "Perhaps the worst original name on this list was the company that sold all-natural juices to health food stores. Looking for a catchier name, they based it on their most popular product — a carbonated apple juice marketed as a “snappy apple taste.” And from then on, they were known as Snapple."}, {"type": "sentence", "content": "Although choosing a name for your business is important, the above companies show that even the best get it wrong sometimes."}, {"type": "sentence", "content": "Unadulterated Food Products … really?"}], "topic": "startups"}