{"title": "How To Ask Marketing Research Questions That Reveal Your Client’s Hidden Hot Buttons", "data": [{"type": "image", "content": "https://miro.medium.com/max/8064/0*RodJwTyp1bqwmU-6"}, {"type": "sentence", "content": "Small business owners usually find it impractical to hire a market research specialist. You have to identify the right prospects and ask them the right questions."}, {"type": "sentence", "content": "The way you ask the question will influence your answer — and the quality of information you obtain in your research."}, {"type": "sentence", "content": "Whether you write questions or ask them in interviews, your word choice will influence the way people respond. In one classic study, subjects observed a video of a car accident. Next, they were asked to estimate how fast the cars were going."}, {"type": "sentence", "content": "When the question was worded, “About how fast were the cars going when they smashed into each other?” respondents estimated higher speeds, compared to those who were asked, “About how fast were the cars going when they hit each other?”"}, {"type": "subtitle", "content": "How To Design Questions For Practical Market Research"}, {"type": "sentence", "content": "It’s very tempting to start by asking, “Why?” In fact, some expert consultants advise their clients to ask lots of “why” questions, such as:"}, {"type": "sentence", "content": "“Why did you hire me and not someone else?”“Why did you decide to call a consultant now?“Why do you think you’ve got this problem?”“Why did you seek the results you wanted?”"}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*DvjpIjyKLZHUTRR9f72lfw.jpeg"}, {"type": "subtitle", "content": "What’s wrong with “why” questions?"}, {"type": "sentence", "content": "Asking a “why” question seems logical because, as a researcher, you usually want to establish cause and effect. You don’t just want to know what people do. You want to know what psychological processes influenced their action so you can design your marketing campaign."}, {"type": "sentence", "content": "But asking a “why” question might actually give you misleading answers. When I was an academic researcher, one of the golden rules of qualitative research was, “Don’t ask why questions.” And here’s … um, why:"}, {"type": "subtitle", "content": "(1) “Why” questions require your interviewee to perform mental work."}, {"type": "sentence", "content": "The vast majority of people (including me, and probably you) do not want to do any more mental work than they absolutely have to…except when they deliberately seek challenges like Freecell, crossword puzzles, or online MOOC courses."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*BIymxKlr8rchYRlxDAyiKA.jpeg"}, {"type": "sentence", "content": "So your interviewee will reach for the first answer that comes to mind."}, {"type": "sentence", "content": "You ask, “Why did you choose my company instead of the competition?”"}, {"type": "sentence", "content": "True answer: “I don’t know…I saw your name somewhere.”"}, {"type": "sentence", "content": "What they tell you: “I was impressed by your bio. Your background and education stood out.”"}, {"type": "subtitle", "content": "(2)“Why” questions” assume your interviewee really understands his or her own motives."}, {"type": "sentence", "content": "“So when you got stuck in your business, why did you sign up for that mastermind?”"}, {"type": "sentence", "content": "True reason: “I happened to get their email when I was in a weakened state. And it was cheap.”"}, {"type": "sentence", "content": "What they tell you: “Marcel’s program seemed to combine the two things I was looking for — access to experts and accountability.”"}, {"type": "subtitle", "content": "(3) “Why” questions assume your interviewees don’t mind sharing their real reasons."}, {"type": "sentence", "content": "Psychologists talk about the social desirability effect, which means people will feel they’re being judged when they answer questions — even anonymously. They’ll edit their answers so they won’t come across like idiots or crazy people."}, {"type": "sentence", "content": "“Why do you want to get more clients?”"}, {"type": "sentence", "content": "True reason: “I’m desperate. I have to pay the light bill.”"}, {"type": "sentence", "content": "Stated reason: “I’ve got a lot to offer and I want to help more people.”"}, {"type": "image", "content": "https://miro.medium.com/max/1400/1*AuQj6vrby4lbfRrSiNHf9Q.png"}, {"type": "subtitle", "content": "Your market research interview turns into an interrogation."}, {"type": "sentence", "content": "How do you really feel when someone hammers you with “Why” questions? Doesn’t it remind you of television shows featuring police interrogations (“And just why did you happen to have a gun with you when you went to Sunday school that day?”)."}, {"type": "sentence", "content": "These questions might even trigger memories of all the nasty people you’ve run across in your life, collectively asking via your inner critic, “Why were you so stupid?”"}, {"type": "subtitle", "content": "Ask questions that give you actionable information."}, {"type": "sentence", "content": "Get more accurate, informative answers by asking questions that elicit facts and stories."}, {"type": "subtitle", "content": "Marketing consultant targeting startup business owners:"}, {"type": "sentence", "content": "“Can you describe your process for choosing a marketing coach when you hired Melvin?”"}, {"type": "sentence", "content": "“What was one thing that happened in your business that made you realize you needed a Virtual Assistant?”"}, {"type": "sentence", "content": "“When you recall reading about Marcel’s mastermind program, what promises stood out for you?”"}, {"type": "image", "content": "https://miro.medium.com/max/1370/1*qkgJ6Pb0aLRBApUyqN_w1w.jpeg"}, {"type": "subtitle", "content": "Home stager targeting homeowners who want top dollar when they sell their homes:"}, {"type": "sentence", "content": "“When you think of home staging, what image comes to mind?”"}, {"type": "sentence", "content": "“Have you met people who had their homes staged to sell? And if you have, how did they describe their experiences?”"}, {"type": "sentence", "content": "“When you think of selling your current home, what do you expect prospective buyers to say as they walk through your home?”"}, {"type": "subtitle", "content": "Career coach targeting managers and mid-career professionals who are ready for a career change:"}, {"type": "sentence", "content": "“What’s the most frustrating aspect of your career right now? Give me an example of how you experience this in your ordinary workday.”"}, {"type": "sentence", "content": "“What steps do you anticipate you’ll need to take if you want to change careers?”"}, {"type": "sentence", "content": "“Share a scenario of what your life would be like if you found your ideal career.”"}, {"type": "subtitle", "content": "When you ask the right questions, you can move directly into marketing campaigns."}, {"type": "sentence", "content": "Market research will be useful only if it leads to strategies that generate leads and clients."}, {"type": "sentence", "content": "You can begin by identifying exactly what you’d like to learn from each person you interview. Then frame questions to get them telling stories, adding as much color as possible."}, {"type": "sentence", "content": "When you ask these kinds of story questions, you encourage respondents to reflect on their own experiences. They’re staying in character — playing the same role they’d assume when they’re working with you or your competitor."}, {"type": "sentence", "content": "Notice that it’s important not to replace “why” with something that has the same impact, such as, “What prompted you to seek out a financial planner?” Ask for concrete facts and representations."}, {"type": "subtitle", "content": "When you ask people to think, they move into theory mode."}, {"type": "sentence", "content": "You learn their beliefs, colored by how they want to be perceived. And if you interview other professionals (such as coaches, financial planners or consultants), they’ll shift back to their comfort zone, which involves giving advice."}, {"type": "sentence", "content": "You ask: “Why has it been hard for you to change careers?”"}, {"type": "sentence", "content": "They answer: “I think you ought to talk to people who aren’t so close to retirement. They’ve got more time to save and they’ll be more likely to hire a coach.”"}, {"type": "sentence", "content": "That’s about as useless as you can get."}, {"type": "sentence", "content": "But when you ask directly, “What steps have you taken in the last year to move to a career change?” you head off these theoretical detours."}, {"type": "sentence", "content": "Your respondent might need time to reflect."}, {"type": "sentence", "content": "But ultimately she’ll say something like, “Frankly, I haven’t done a darn thing. I checked out a couple of books from the library. They weren’t helpful.”"}, {"type": "sentence", "content": "You follow up, “Can you be specific — what was disappointing about those books?”"}, {"type": "sentence", "content": "She says, “They seemed to be written for people who are independently wealthy. They didn’t tell me how to begin a career change while I was still working.”"}, {"type": "sentence", "content": "Now your marketing materials can address this point directly. You could write bullet points about the limitations of career books, the frustration of starting a career change without quitting your current job, and more."}, {"type": "subtitle", "content": "Set the stage to ask your questions."}, {"type": "image", "content": "https://miro.medium.com/max/9216/0*rkYxX9lwUaC1apNM"}, {"type": "sentence", "content": "(1) Make sure you’re getting information from your ideal clients."}, {"type": "sentence", "content": "Sometimes the most accessible people on your list aren’t the most relevant to your marketing."}, {"type": "sentence", "content": "(2) Be honest."}, {"type": "sentence", "content": "When you sneak in a sales pitch under the guise of “research,” your client will say “no” next time she’s invited on a research interview. You make life harder for everyone who’s genuinely seeking information."}, {"type": "sentence", "content": "(3) Get them telling stories."}, {"type": "sentence", "content": "Your goal is to learn about their personal experiences, discover what language they use to state their challenges (so you can adapt it for the copy), what have they tried so far, and what’s their reaction to your next program or product. And the best way to accomplish these goals is to get them telling stories — targeted stories on topics that will be relevant to you."}, {"type": "sentence", "content": "Originally published at https://cathygoodwin.com on May 19, 2020."}], "topic": "marketing"}