{"title": "How to Write a Powerful Proposal to Land a Job on Upwork", "data": [{"type": "subtitle", "content": "Pro tips for writing a cover letter that works like a magic"}, {"type": "image", "content": "https://miro.medium.com/max/8610/1*ZVmtrhLR-wIXvd8Jxq9aXg.jpeg"}, {"type": "sentence", "content": "During this time of lockdown and quarantines when most of us work from home and others may have lost their job altogether, starting a freelance career or enhancing an existing one has become more than ever relevant."}, {"type": "sentence", "content": "Upwork is a great place to earn a living or a decent side income, but first you should be able to land jobs. Among all the obvious criteria of being offered an interview and, potentially, a contract, your proposal rightfully plays the leading role."}, {"type": "sentence", "content": "In this article, I’ll share some key tips on how to write winning proposals that’ll lead to a contract on Upwork."}, {"type": "sentence", "content": "But first, how do I know that this is true?"}, {"type": "sentence", "content": "I’ve been on Upwork when it was still called oDesk. Back then the rules of the game were a bit different as both oDesk and its users were still quite inexperienced."}, {"type": "sentence", "content": "As a means of quality assurance, oDesk offered you to pass certain tests relevant for your specialty. Your skills were mostly assessed by the results of these tests, along with client reviews of course."}, {"type": "sentence", "content": "At the time I used to earn a decent amount of money each month and a dozen of 5-star reviews which led to the point that clients themselves kept inviting me to apply for their job postings. And I’ve been able to keep the rhythm to date."}, {"type": "sentence", "content": "Back then, landing jobs was somewhat easier than it is now, if we don’t count the huge number of incompetent freelancers who used to offer ridiculously low rates to steal the deal."}, {"type": "sentence", "content": "However, much has changed since oDesk and Elance joined forces in 2013 and turned into a single platform called Upwork in 2015. The platform introduced better and stronger evaluation criteria for freelancers. This helped sift away disqualified candidates and promote more competent freelancers."}, {"type": "sentence", "content": "Thus we, well-performing freelancers, adapted to the new approaches. But guess what? The competition has gotten even stiffer as now you have to compete with stronger and highly qualified candidates."}, {"type": "sentence", "content": "During all these years on Upwork, I’ve gained some solid knowledge and learned some key tactics of writing functioning proposals that win me the job the majority of times. Hence, I’m happy to share with you the following key tips of writing the perfect cover letter when applying for a job on Upwork."}, {"type": "subtitle", "content": "1. Stop sending copy-pasted letters"}, {"type": "sentence", "content": "This one seems obvious, yet it is a major mistake so many freelancers make. A copy-pasted template is the most annoying thing for a client to get, which instantly destroys your chances to be even contacted."}, {"type": "sentence", "content": "It’s like a red flag indicating that you’re not serious enough about the job and that you may not even have read the job posting entirely. It also implies that you are likely to treat the job as carelessly as you wrote your proposal."}, {"type": "sentence", "content": "Instead, write a clear, concise letter that specifically addresses the issues stated in the job post. Don’t write a lengthy letter for the sake of being lengthy. Sometimes, less is more. Be specific and to the point, showing the client that you’ve actually read their job post and that you’ve crafted your proposal precisely for them. This will significantly increase your chances of being hired."}, {"type": "sentence", "content": "Example not to follow:"}, {"type": "image", "content": "https://miro.medium.com/max/2158/1*10Wt0J7G-0jfOcs0ghm4YQ.png"}, {"type": "sentence", "content": "Example to follow:"}, {"type": "image", "content": "https://miro.medium.com/max/1834/1*--XamGrAjCd7ralkXMR55Q.png"}, {"type": "subtitle", "content": "2. Use the client’s name in your proposal"}, {"type": "sentence", "content": "If you’ve read the book “How to Win Friends and Influence People”, you probably know that there are few things in the world that people love more than hearing the sound of their own name. This is human psychology."}, {"type": "sentence", "content": "Whenever possible, always use the client’s name in your proposal. Reading their name the person subconsciously believes that the letter has been crafted specifically for them, which instantly generates a positive feeling."}, {"type": "sentence", "content": "Of course, using the client’s name alone won’t guarantee you a contract, but it’s an easy way to attract their attention and stand out from the crowd."}, {"type": "sentence", "content": "How do you find the client’s name on Upwork?"}, {"type": "sentence", "content": "Don’t worry, they’ll not think that you are a stalker. People love an individual approach and they may believe that you are going to treat their project with as much care."}, {"type": "image", "content": "https://miro.medium.com/max/8960/1*IZbi1sp9YPCcPTfIgCZTrQ.jpeg"}, {"type": "subtitle", "content": "3. Reduce the use of the word “I” in your proposal"}, {"type": "sentence", "content": "Yes, it’s your proposal where you should cover your experience and skills. Perhaps you’ve done similar jobs before or perhaps your background is exactly what the client needs. Using words like “I”, “me”, “my” are acceptable and often necessary in your cover letter, but be careful not to overuse them. Otherwise, your proposal may turn into a self-centered, one-sided story very unappealing for the client."}, {"type": "sentence", "content": "Remember, the client isn’t interested in how cool you actually are. And they are certainly not interested in how many diplomas you have, nor even where you’ve graduated from, nor at what companies you’ve worked before."}, {"type": "sentence", "content": "They want to know what you can do for them. In other words, they want to learn what they’ll get in return if they chose to hire you."}, {"type": "sentence", "content": "So, when writing a cover letter to apply for a job, avoid the “all-about-me syndrome” and focus on your client. This is an old sales secret that you can apply to literally any job application that you ever write again."}, {"type": "sentence", "content": "Example not to follow: I’m a very experienced professional translator who has worked for 3 international translation agencies. I’m dedicated to providing high-quality and affordable translation."}, {"type": "sentence", "content": "I am proud of my comprehensive approach to translation and my unrivaled expertise. I’m passionate about my work and take great pride in my numerous happy clients."}, {"type": "sentence", "content": "It’s hard for the client to get excited and visualize what’s in it for them, don’t you think? Did you notice how it uses the words “I” and “my” a lot. This is a dead giveaway and it’s a mistake too many freelancers make when they’re writing their cover letter."}, {"type": "sentence", "content": "Example to follow: I’ll provide you with high quality translation that perfectly fits your expectations and budget. Expect to get completely error-free, fluent text that doesn’t sound like a translation but is authentic enough to be taken as original."}, {"type": "sentence", "content": "A lot more interesting, isn’t it?"}, {"type": "sentence", "content": "When you try to write your next cover letter, instead of writing all about you, try re-framing it so it’s using less “I” language and more “you” language."}, {"type": "sentence", "content": "The key is to shift the focus so it’s away from you as a freelancer and more towards what your client’s goals are."}, {"type": "subtitle", "content": "4. Rephrase the client’s problem"}, {"type": "sentence", "content": "Read the job posting carefully and understand what is the exact problem of the client. When writing your proposal, rephrase the client’s core problem in your own words. Then tell them how you are going to solve it. This way you’ll show them that you actually understand their needs and thus you are more likely to handle the task properly."}, {"type": "sentence", "content": "Rephrasing the problem also has a psychological connotation. This strategy is called mirroring, and involves subtly repeating the other person’s words to them, leading them to unconsciously trust you more."}, {"type": "sentence", "content": "Example:"}, {"type": "sentence", "content": "Client request: We’re looking for a creative UI/UX designer to create a unique design for our app, so that it really represents our brand."}, {"type": "sentence", "content": "Potential proposal: I’ll be glad to design the look and feel of your app in a way that feels 100% like you."}, {"type": "subtitle", "content": "5. Watch out for “control words” in the job posting"}, {"type": "sentence", "content": "Many clients use special, often meaningless, “control” words in their job posting to make sure you’ve read through the entire post."}, {"type": "sentence", "content": "They then ask you to start your cover letter with that particular word. Be attentive and use the control words to avoid your proposal being ignored."}, {"type": "image", "content": "https://miro.medium.com/max/1588/1*kF752alyFOoj2oR5D2lDQQ.png"}, {"type": "subtitle", "content": "6. Don’t use vogue language"}, {"type": "sentence", "content": "Don’t use vogue words in your cover letter. Instead of making your proposal stronger, they do the opposite and weaken its impact. Here are a few examples:"}, {"type": "sentence", "content": "I am extremely professional / creative / super committed / well-organized and so on."}, {"type": "sentence", "content": "Nobody believes in it anyway, even if it’s true."}, {"type": "sentence", "content": "Instead, to emphasis your qualifications and how good of a candidate you are, redirect the client to read reviews and testimonials that other clients have written about you. This will pose you much more credible and improve your chances of getting hired on Upwork."}, {"type": "subtitle", "content": "7. Tell them how you’ll solve their problem"}, {"type": "sentence", "content": "The keyword here is “solve the problem”. You are expected to solve a problem. The client wants to hire you to ease their pain."}, {"type": "sentence", "content": "Concisely describe how you’ll solve their problem, what steps or approaches you’ll take, and what kind of suitable solutions you see. This is potentially the most important part of your cover letter. It can make or break the deal, so it deserves an extra effort."}, {"type": "sentence", "content": "Example:"}, {"type": "sentence", "content": "Client request: We’re looking to hire an experienced designer to create a coffee shop website design from scratch. You’ll need to do a research and ensure good user experience so that it is easy enough for a variety of users."}, {"type": "sentence", "content": "Potential proposal: I’ll start with wireframing first to sort out the UX, then I’ll create a low-fidelity prototype so that you can see how it actually works in terms of functionality."}, {"type": "sentence", "content": "Once this is sorted and we are satisfied with the user experience and flow, I’ll step in to build the UI and the aesthetics. What do you think?"}, {"type": "subtitle", "content": "8. Add a link to your portfolio"}, {"type": "sentence", "content": "Don’t expect to be asked for your portfolio and don’t assume that the client will necessarily take a look at your Upwork profile. Be sure to include a link to your entire portfolio or to a few relevant projects, but no more than 2–3."}, {"type": "sentence", "content": "Pro tip: it’s not necessary to include all your projects in your portfolio — 5–6 are quite enough, just choose the best ones. This way you’ll seem more professional."}, {"type": "subtitle", "content": "9. Avoid typos in your cover letter"}, {"type": "sentence", "content": "Always read your cover letter before hitting the send button. Typos will make it look less professional and decrease your chances of getting the job. This is especially relevant if you’re applying for translation, editing, copywriting or other writing jobs where improper grammar and typos are guaranteed to break the deal."}, {"type": "subtitle", "content": "10. Don’t include irrelevant skills"}, {"type": "sentence", "content": "Maybe you’re a programmer who also has a background of an accountant. While applying for a programming job, don’t include your accounting skills: this will not help you pose smarter. And nobody cares about it anyway. Instead, this will make you seem unfocused and unaware what you’re actually applying for. Say only what you believe the clients wants to hear."}, {"type": "sentence", "content": "Hopefully, these tips and strategies will help you on your way of landing more jobs on Upwork. I’d love to hear about your experiences and if you could leverage these tactics in your proposals. Share your thoughts in the comments or ping me on Twitter."}], "topic": "freelancing"}