{"title": "Going To University Isn’t A Waste of Time", "data": [{"type": "subtitle", "content": "A counter-argument to those that say it is, including myself"}, {"type": "image", "content": "https://miro.medium.com/max/10746/1*RsxLyX0MEV8KKJec1YVLKA.jpeg"}, {"type": "sentence", "content": "A point of view that I have heard a lot recently is that going to university is being outed as a waste of time. This sentiment seems to have reared its head because of the crisis we are living through and the idea that you can get a better education on YouTube."}, {"type": "sentence", "content": "I have my gripes with university. I have written about this before. Studying history for three years was an interesting experience and sometimes I do question what I learnt during that time."}, {"type": "sentence", "content": "However, reading some of these arguments against university made me realise how much benefit I got from further education."}, {"type": "sentence", "content": "Yes, I may not have learnt anything that shattered my worldview while I was there but that’s not the point. I went to university to study a topic that I’m passionate about."}, {"type": "sentence", "content": "Not only that but the experience of living away from my parents taught me how to fend for myself. Then there’s the social aspect of university life which is only bettered by that of hostel life."}, {"type": "sentence", "content": "All of these experiences made university worthwhile for me. Yes, it was expensive. Yes, there were times when I wondered what the point of it was but would I make the same decision again? Absolutely!"}, {"type": "sentence", "content": "The problem with life is that nothing is ever black and white. Attempts to shoehorn things into one category or another don’t work because the world is more nuanced than our biases lead us to believe."}, {"type": "subtitle", "content": "Unequal education"}, {"type": "sentence", "content": "One of the primary arguments against university is that it’s a waste of money now that you can learn about almost anything on the internet. Why pay to go to university when you can watch a YouTube video instead?"}, {"type": "sentence", "content": "This is an enticing argument but it’s one that doesn’t have much weight. The difference between the two is that in one arena, the curriculum is set for you, it doesn’t care about your views or your biases. While, in the other, you’re free to decide what to study. Are you really going to read a book or watch a video you disagree with?"}, {"type": "sentence", "content": "YouTube is a great platform for learning about various topics but there is a huge problem with it. Anyone can post a video there. Information is democratised and not always factual. The difference with university is stark."}, {"type": "sentence", "content": "At university, you study peer-reviewed texts. Texts that have been written by academics who have studied the topic matter for years. They haven’t bought a camera and microphone and decided to record a few videos on a whim. They’ve dedicated their careers to studying these topics."}, {"type": "sentence", "content": "This is not to knock YouTube, it can be useful to gain an introduction to a topic. The issue is that there is no gatekeeper as there is in an academic setting. No one is scrutinising the content before it’s churned out."}, {"type": "sentence", "content": "This may not seem like an issue but it is. If anyone can post a video on YouTube and claim to be an expert who do you trust? Whose videos should you watch? Too many questions arise when you shine a light on the debate."}, {"type": "sentence", "content": "Books are a better source of education than YouTube but they have their faults. They are not a substitute for a university course specifically geared to teach you about a topic. For instance, reading one book on the Soviet Union does not make me an expert, nor does one university course, but you’re provided with a more in-depth take than one book."}, {"type": "sentence", "content": "I remember the reading list for some of the courses that I took, one about the underclass in Britain stood out. It listed over 30 books that I should read to gain an understanding of the topic. I’m hardly going to be well-informed on the issue after reading one book!"}, {"type": "sentence", "content": "Another area where university has its benefits is that you have to demonstrate what you know. Anyone can watch a video or read a book and regurgitate a few quotes and facts. It’s much harder to put these together into a cogent argument when you have to write an essay on the topic."}, {"type": "sentence", "content": "This is where university comes into its own. You’re not just being taught, you have to demonstrate what you have learnt. When you have to write an essay on how significant the Great Reform Act of 1832 was, you’re not going to succeed if you only do the bare minimum."}, {"type": "sentence", "content": "You need to read around the topic, consider your argument, consider the counter-point to your argument and then demonstrate in your essay why you believe your viewpoint is correct. You’re being judged on your argument and whether you have understood what you have studied."}, {"type": "sentence", "content": "This experience was invaluable for me, especially now that I am a writer. The ability to demonstrate a point of view, such as this one, coherently and logically is not easy to develop."}, {"type": "sentence", "content": "Sometimes, I forget just how useful those three years of researching and writing essays were. They taught me lessons that I still practice to this day. But university wasn’t just beneficial academically, it was socially beneficial too."}, {"type": "subtitle", "content": "Social life"}, {"type": "sentence", "content": "Going to university is more than studying, there’s a huge social aspect to it as well. I made many great friends while I was at university and became a much more confident person as a result."}, {"type": "sentence", "content": "I had a lot of fun at university. Studying was high on the agenda, as it should have been, but the social side was just as important. It’s easy to turn your nose up at drinking and partying but when you’re 18 or 21 that’s what most of us want to do."}, {"type": "sentence", "content": "I was no different. While I wouldn’t do it now, I don’t look back and regret what I did. I had fun, I enjoyed myself, it was a release from all the studying. A way to blow off steam."}, {"type": "sentence", "content": "It’s daunting to leave your home behind, everything you have known to go and live with a group of strangers. When my three years were up, these strangers had become lifelong friends and a lot of that was due to the bonds that were forged during these nights out."}, {"type": "sentence", "content": "Sure, you can read books and watch videos in the comfort of your home but it’s not the same. It doesn’t replace the fun times or the friendships that you build from attending university."}, {"type": "sentence", "content": "This is what you will miss if you forgo university. Lectures may move online in the future but do we really want more time behind a screen? If the coronavirus situation has taught me anything it’s how much I don’t enjoy video calls."}, {"type": "sentence", "content": "I realise not everyone will have the same view as me, some of you may enjoy it. However, you can’t replace listening to someone speak while you’re in the same room as them, or the ability to socialise with other students."}, {"type": "sentence", "content": "These are all considerations that will need to be taken into account by future students. It’s great that learning has opened up to more and more people but there are tradeoffs with everything. You might gain more access but you lose something else too, the social side of university."}, {"type": "subtitle", "content": "My take"}, {"type": "sentence", "content": "University isn’t perfect. You will find many flaws within the education system which need to be addressed. That said, there are flaws with the alternative too."}, {"type": "sentence", "content": "Self-learning has its benefits but it needs to be carefully thought out for it to succeed. As a history graduate, I realise this when I read books on certain topics. One book does not make you an expert, it exposes how much you don’t know."}, {"type": "sentence", "content": "In my case, this is true in regards to the Soviet Union. I have a book which provides me with an overview of the regime. This book then pushes me in directions I hadn’t considered and now I need to read more books to fill in the gaps."}, {"type": "sentence", "content": "I knew this from my studies but it’s been hammered home in the years since. The danger is that you think you don’t need to read anything else because you’ve read one book and understand the topic."}, {"type": "sentence", "content": "It’s easy to think that because Steve Jobs, Bill Gates and Mark Zuckerberg dropped out of university there’s not much point in going. The reason they are mentioned so much is that they are outliers. No one mentions the countless number of people who drop out of university every year and don’t reach the same heights."}, {"type": "sentence", "content": "Nor can everyone be as successful as that trio. That’s not how the world works. Sure, you might be successful without a university education, lots of people are. But you shouldn’t base your views towards higher education on the success of these figures. What works for one person doesn’t work for everyone."}, {"type": "sentence", "content": "I’ve been critical of my time at universities and the education system in general, but writing this article has made me realise how valuable that experience was."}, {"type": "sentence", "content": "Far from being a waste of time, it feels like time well-spent. University isn’t for everyone and nor should it be but to think you can substitute a university education for YouTube videos and reading a few books is misguided."}, {"type": "sentence", "content": "Learning requires discipline and direction, that’s what you get at university. If you don’t abide by that principle in your own studies, you’re going to waste your time whatever you do."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "education"}