{"title": "How the Findings of Your UX Research Remain Valuable.", "data": [{"type": "sentence", "content": "You might recognize this problem: you have invested time, money and energy in user research but throughout the course of the of the project, you discover that nobody remembers the valuable findings. Well, here are some suggestions on how to make your UX research results more memorable and sustainable for you and your team."}, {"type": "sentence", "content": "By Sydney Luca-Lion, UX research intern"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*F52aqcD0Zcn0w9FtxBqT0Q.png"}, {"type": "sentence", "content": "If you’re in the business of making things for people, you may have already come across the terms “human-centered design” or “user-centered design”. This essentially means keeping the end user in mind at every step of the design and development process. To achieve this, you need to know your users, understand their goals, know how they think and act. Research helps you make better decisions, and better decisions lead to more successful products. If you are not convinced or don’t know where to start, this article (in German) might interest you."}, {"type": "sentence", "content": "If you have already conducted UX research and collected results, an important step in the user-centered project process has already been taken. But this does not mean that the research phase is over — it is now important to get the most out of your findings and to make them more useful for everyone on the team who’s involved in the project. Here are three things you should keep in mind:"}, {"type": "subtitle", "content": "1. See the forest amongst all the trees"}, {"type": "sentence", "content": "In UX research you are often confronted with a lot of data in many different forms, and some of the information is really useful and informative, and some less so. As you prepare to share your results with the team, you as an observer/researcher need to think carefully about how you can interpret and summarize the information — so that you end up presenting only what is worth sharing."}, {"type": "sentence", "content": "Valuable research results are those that are truly relevant to the project, and are accessible for the whole team. You and your team want to “see the forest amongst all the trees”, which means not getting caught up in too many details and losing sight of the big picture. Try to stay focused on the scope of the project and don’t get caught up in insights that are not really relevant to the project. If you want memorable and valuable research results, you have to clarify to find the most meaningful points. Make an effort to be clear, comprehensive and straightforward so that the results of your research are understood and remembered by everyone involved in the project."}, {"type": "subtitle", "content": "2. Think about presentation when it’s time to share"}, {"type": "sentence", "content": "Carrying out UX research and presenting the results to others go hand in hand. It is likely that one person or a small team will be responsible for conducting UX research — but the knowledge gained from research will only become really useful when it can be shared with all those involved in the design process."}, {"type": "sentence", "content": "It is important to remember that presentation is about communicating knowledge in a coherent and memorable way. You want to pass on what you have observed and learned so it can be utilized by others. A good, clear presentation allows you to easily convey important information to your team and clients. For example, put all your research findings, personas and stories together in an eye-catching poster, which you can then print out and hang on the project wall. In this way, you ensure that the results will stick in people’s minds and be taken into account in forthcoming decisions. After all, for a user-centered approach, it is up to the whole team to be advocates for the personas (and thus the users) and to keep them in focus throughout the design process."}, {"type": "image", "content": "https://miro.medium.com/max/7148/1*K0LAjaU8CScN6WXtam77tg.jpeg"}, {"type": "subtitle", "content": "3. Be open to adjustments"}, {"type": "sentence", "content": "Your findings are not static. As a project goes on, you and your team will learn more, both about your product and your users. Maybe you’ve written a collection of user stories, which a designer uses to create some wireframes, and comes up with new features for the product. Maybe this leads to new considerations about your personas. Great! Now it’s time to revise your documentation to reflect the new findings. The aim is to keep the findings relevant and useful. Just like your prototypes, the research itself must go through iterations and adapt as the project progresses."}, {"type": "sentence", "content": "Make the most of the time and effort you spend on UX research by keeping the big picture in mind and sharing only relevant and practical research results. Focus on clearly transferring knowledge and putting it into an appealing form. And finally, be prepared to revise and develop your results as needed. This is how you present effectively, and increase the value of your UX research."}, {"type": "sentence", "content": "For all you German speakers, feel free to try out our Minimal User Experience Research set, or subscribe to our newsletter. We’re always happy to hear from you."}], "topic": "ux"}