{"title": "Inserting and Resizing Images in IPython Notebook (Python and R)", "data": [{"type": "subtitle", "content": "Adding Images in IPython Notebook (short article)"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*PvsMw2Cv9vQeedtv"}, {"type": "sentence", "content": "The current article is about a problem that I had faced when started learning data analysis in the IPython notebook. The problem is about loading an image in IPython notebook so that I could present codes with better visual representation (i.e., with images)."}, {"type": "sentence", "content": "I have searched for several solutions on different websites. Different people have reported different mechanisms and libraries in Q & A blogs. After trying different solutions I have found two possible solutions for both Python and R that works perfectly."}, {"type": "subtitle", "content": "Python solution"}, {"type": "sentence", "content": "Let’s first discuss the solution when running Python in the IPython notebook. We could use the Image class of IPython.display to load and display a local image in the IPython notebook."}, {"type": "sentence", "content": "Here, I have used the Image( ) function, where one needs to supply the filename i.e., the location path for the image file. Additionally, we can vary the width and height to adjust the image size."}, {"type": "image", "content": "https://miro.medium.com/max/1864/1*ogVi5B7OGRmnuClo3Vn5Lg.png"}, {"type": "subtitle", "content": "R Solution"}, {"type": "sentence", "content": "Let’s next discuss the R solution for IPython notebook. For R, IRdisplay library is the best available option to load a local image."}, {"type": "sentence", "content": "Here, I have used the display_png( ) function, where one needs to supply the filename i.e., the location path for the image file. Additionally, we can vary the width and height to adjust the image size."}, {"type": "image", "content": "https://miro.medium.com/max/1858/1*eLG5CkGxY2BgFZ4MW7Bhbg.png"}, {"type": "sentence", "content": "I hope this would help."}, {"type": "sentence", "content": "If you learned something new and liked this article, say 👋 / follow on Twitter, LinkedIn, YouTube, or Github."}], "topic": "productivity"}