{"title": "7 Questions To Ask Yourself Before You Start Freelancing", "data": [{"type": "subtitle", "content": "How to prepare for the volatile world of working for yourself."}, {"type": "image", "content": "https://miro.medium.com/max/10180/1*Y4mjEWSI8ES6iROSBJHU3g.jpeg"}, {"type": "sentence", "content": "When it comes to making a career choice, there are countless things to consider. There are bills to pay and mouths to feed, and then you have to think about whether or not you can even do the job or, more importantly, if you even want to do it."}, {"type": "sentence", "content": "Making the decision to start freelancing comes with its own set of difficult questions, and there are a few key ones to ask yourself before you start. Having solid answers to these questions will help prepare you for making the leap into the volatile world of working for yourself."}, {"type": "sentence", "content": "These questions are designed to make you think about your situation and decide whether or not freelancing is a viable option for you. So, let’s dive into them."}, {"type": "subtitle", "content": "1. Can you afford to have no income for several months?"}, {"type": "sentence", "content": "This is arguably the most important question to ask yourself from a practical point of view. The answer is obviously going to vary depending on your current situation and standard of living, but the bottom line is: can you afford to go without all of your current income for several months and still live comfortably?"}, {"type": "sentence", "content": "This question should both scare you and motivate you. The reason it is so blunt is because you are very likely going to be putting yourself in a position with very limited income from the very beginning, and there is a high chance that you will earn no money for weeks or even months."}, {"type": "sentence", "content": "That is not to say you can’t make any money within your first few months as a freelancer. I managed to make enough to quit my part-time job within 4 months of starting my own freelancing adventure."}, {"type": "sentence", "content": "If you have enough money in the bank to pay all of your expenses for several months with no income, freelancing will become a more viable option for you."}, {"type": "subtitle", "content": "2. Do you enjoy working to deadlines?"}, {"type": "sentence", "content": "This question is important because freelancing will essentially involve a bunch of mini-jobs combined into one “career”. You can become a freelancer in almost any field, but no matter which path you choose you will have to complete lots of different jobs while meeting lots of different deadlines."}, {"type": "sentence", "content": "In a typical job you might find yourself tasked with a few separate projects or reports to complete, and if you can handle this kind of workload then that is a good start."}, {"type": "sentence", "content": "As a freelancer you will be working solely to the deadlines of your clients, and so it is vital that you can stay motivated and manage your time when you have a lot more on your plate than just a few reports that need filed by the end of the week."}, {"type": "sentence", "content": "You might have 5 different jobs on the go at one time, which translates into 5 separate deadlines to meet. If you want to be a freelancer you need to be able to handle the pressure of multiple deadlines."}, {"type": "image", "content": "https://miro.medium.com/max/4096/1*EHTx2sRSHTQOT5vdogVqog.jpeg"}, {"type": "subtitle", "content": "3. Can you handle volatile schedules?"}, {"type": "sentence", "content": "Leading on from the previous question, you have to be able to handle schedule changes on a daily basis. You might have 10 clients one week, and the next you might have just one or two. You ideally want to strive for some reliability and consistency, but when you are just starting out that is often impossible."}, {"type": "sentence", "content": "You have to be prepared to work yourself to the bone one week and spend the next week hunting for clients. You have to be able to deal with 15 deadlines all at once, and then one much larger project a week later."}, {"type": "sentence", "content": "Freelancing will be very volatile at the beginning, and it will put stress on your ability to work without a routine. But if you can manage that volatility and stay just as focused during your downtime as you are when you are putting in full days of work, you will be in a good position to get started."}, {"type": "subtitle", "content": "4. How well can you deal with criticism?"}, {"type": "sentence", "content": "Every job involves feedback in one form or another, and a lot of jobs will require you to have regular sit-downs with your boss or supervisor to go over your performance. These provide you with opportunities to find out what you are doing well and where you are struggling."}, {"type": "sentence", "content": "With freelancing, your feedback only comes from your clients, and not a manager. This means there are no policies or restrictions in place to govern what they can and can’t say to you."}, {"type": "sentence", "content": "What’s worse is that most of this feedback will come to you via phone or email, and everyone knows that people tend to hold a lot less back when they are sitting in front of a screen."}, {"type": "sentence", "content": "You may think you have done a really good job with someone’s marketing campaign for example, but they might hate it. They might give you constructive criticism to get things back on track ASAP, or they might tear into your abilities as a marketer and try to put you down, before ultimately demanding you give them their money back."}, {"type": "sentence", "content": "Nobody finds these kinds of interactions enjoyable, but if you want to be a freelancer, you have to be prepared for them. Most of the time, provided you do your job right, you won’t have to deal with horrible customer service altercations. But if you don’t think you could handle one of them effectively, you will struggle when they inevitably come along."}, {"type": "subtitle", "content": "5. Do you have a lot of patience?"}, {"type": "sentence", "content": "This one goes hand in hand with the last question, although it is not to do with the feedback you receive but rather how you communicate with the client before, during and after any project."}, {"type": "sentence", "content": "You will inevitably have to deal with challenging clients, and not just those that want to scream at you via their keyboard. Some clients just do not know how to interact in a working relationship, and some will have whacky requests that put a strain not only on your ability to do the work but your communication skills as well."}, {"type": "sentence", "content": "Being patient and understanding that the hardest part of a freelancing job is often outlining what is required will be very helpful. You must be prepared to deal with people that have no idea what they want or how to interact with a freelancer."}, {"type": "sentence", "content": "You can always just say no to these clients, but sometimes there are no warning signals and they start being difficult half way through the job. There may be other times that the job itself is too hard to say no to, whether that’s due to the price or the project being the perfect fit for you."}, {"type": "sentence", "content": "Nevertheless, if you can’t communicate well with others and if you don’t have much patience, freelancing might not be for you."}, {"type": "subtitle", "content": "6. How big is your ego?"}, {"type": "sentence", "content": "As the first question highlighted, there is a big chance that you will struggle to gain traction with freelancing at the beginning. This dry spell can continue for any amount of time, and so you have to stay motivated."}, {"type": "sentence", "content": "This can be very difficult, especially if your goal with freelancing is to get rich as soon as possible. Aside from the unrealistic nature of this goal, it presents a challenge for your ego as well."}, {"type": "sentence", "content": "If you can’t handle failure, freelancing will put you against your ego in a fight to the death. If you are going to give up after a couple of proposal rejections and put it down to the jobs not being right for you, it will be difficult to take your freelancing anywhere near the heights that you want to reach."}, {"type": "sentence", "content": "You need to put your ego to the side, and accept that things will not always go your way. When you inevitably fail, you have to be able to continue, without fear of what you or others will think."}, {"type": "subtitle", "content": "7. Do you enjoy learning?"}, {"type": "sentence", "content": "Finally, you have to ask yourself whether or not you enjoy learning. Freelancing, aside from being a way to make money, represents an opportunity for personal growth. As you take on new clients and as you complete new projects, you will need to learn new ways of doing things."}, {"type": "sentence", "content": "You will also have to learn how to deal with difficult clients, how to promote your services and how to carry yourself forward in the appropriate manner. If you struggle with learning new tasks, or don’t enjoy learning new ways of doing things, freelancing is going to be tough."}, {"type": "sentence", "content": "If you would prefer to have things explicitly taught to you, or if you would rather just carry out work that involves the same skillset on a repetitive basis, freelancing is not going to work for you."}, {"type": "image", "content": "https://miro.medium.com/max/7906/1*o9sr1bZZdPJPTqjDwoDVFQ.jpeg"}, {"type": "sentence", "content": "Each of these questions is vital to ask before you start freelancing, but they can be used as references throughout your career as well. By considering each one in turn, you will be preparing yourself for an extremely volatile and challenging working environment. Don’t worry if you don’t think you are ready for it, as your answers to these questions can change over time."}, {"type": "sentence", "content": "If you don’t think you are patient enough, or if you struggle to work to deadlines, try to improve upon these aspects and then consider freelancing again. If you can’t afford to switch careers right now, wait until you can. Save up some extra funds and put yourself in a better position and then get started."}, {"type": "sentence", "content": "Freelancing is not for everyone, but you can use these questions to find out whether it is right for you now, or if it could be in the future."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}