{"title": "Black Representation in Gaming- Is Balrog Problematic?", "data": [{"type": "sentence", "content": "Let’s examine my favorite black characters in Video games to parse out what these characters represent as black representations in gaming. Let us delve into how there are problematic characters for black people or good for us (or both). I have to start with my first black experience in video games; Balrog from Street Fighter II. Balrog, the boxer turned Shadaloo muscle working for M. Bison in Street Fighter II."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*vP_knREIl7StpqRV.jpg"}, {"type": "sentence", "content": "He is named M. Bison in Japan (think Mike Tyson) but that wasn’t going to fly here due to copyright concerns that Mike Tyson might sue Capcom due to the likeness. Balrog looks a lot like Mike Tyson, big muscles, tough mug, ripped clothes and boxing gloves. Balrog is a charge character with no kicks. All punches, and a devastating headbutt grab. Why does Balrog matter to me as a black man? He was my first."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*4Y_a_QKZvVPyA264.jpg"}, {"type": "sentence", "content": "As a young kid (8, 9 years old maybe) he was the first character I have ever seen who looked like me! I’m not an Italian plumber, or a large Russian man, but I was a black kid and Balrog looked like me. He was black, he was powerful, he won fights. Balrog looked like what I thought a man should look like, which has probably warped my view of masculinity but that’s a talk for a different time. He was too big for clothes! He was a super hero for me. I could beat anybody with Balrog, and watching my black avatar beat up these other characters was a big deal for me as a kid and frankly still holds weight now."}, {"type": "image", "content": "https://miro.medium.com/max/2576/1*q_NC_Btj8XLse4_IR2yr_A.png"}, {"type": "sentence", "content": "While fighting games aren’t known for their stories, characters did get some exposition after you beat arcade mode with them. When you beat the game (depending on the version) Balrog’s ending animation shows him with riches and white women! Made sense to me as a kid! He was a role model. He is a role model? Every once and a while at the gym I look at myself and think, “I am one step closer to looking like Balrog”. Balrog represents a power fantasy to me and one I can replicate. He doesn’t shoot orbs or create fire, he uses his fist. I have fist. I can punch. He headbutts, I can headbutt. He is as realistic as a character gets in Street Fighter, hell he looks like a clone of THE Mr. Olympia Ronnie Coleman. As I got older I had to ask…..Is he problematic? Is my hero a mocking stereotype of a black athlete and a black man? Short answer is yes, long answer…still yes but Street Fighter V actually gave him a bit of a redemption arc that we will look at too."}, {"type": "image", "content": "https://miro.medium.com/max/1370/1*x4_opBRh6cS8MSb5r8sG8Q.jpeg"}, {"type": "sentence", "content": "What do I mean when I say Balrog is problematic? In the games industry the biggest issue with representations of race is that certain races are represented a very limited basis. If those representations are negative it can have harmful effects. To elaborate, White characters are represented in every capacity in games. They are protagonist, antagonist, drug dealers, and cops. You see enough positive white figures in games that the negative ones don’t stand out. For black characters that is simply not the case. Balrog becomes one of very few black representations we have in gaming. If he was the only black person a white kid in the suburbs interacted with in ’94 what are they going to think about black people? It’s problematic."}, {"type": "sentence", "content": "Let’s look closer at who Balrog is and what stereotypes he reinforces."}, {"type": "sentence", "content": "Stereotype: Lazy Black Man"}, {"type": "sentence", "content": "Balrog got barred from professional boxing due to cheating and gambling. He wanted to get rich the easy way instead of winning and building a career. He also is constantly trying to find ways to beat M. Bison and become boss of Shadaloo with the as little work as possible."}, {"type": "sentence", "content": "Stereotype: Unintelligent Black Man"}, {"type": "sentence", "content": "In a lot of the versions of Street Fighter II if you beat the game with Balrog they will tell you how he took over Shadaloo and ruined the empire due to his stupidity. It’s a disappointing narrative because he was clearly smart enough to become a high ranking official in an organization and then take said organization over, so he clearly has some ingenuity but they don’t let him have a successful reign. He is also obsessed with money and women instead of the grander goals of Shadaloo."}, {"type": "sentence", "content": "Stereotype: Prefers white women"}, {"type": "sentence", "content": "This stereotype is a hot button issue both in the black community and white. The idea is that as soon as a black man gets successful they exclusively date white women. The rationale being that white women are inherently more desirable than black women. This is problematic for a lot of reasons, the main one being that no race of women is superior to another due to the color of their skin. It’s also hurtful because black women provide for and support black men in a myriad of ways. It reaffirms and perpetuates Western standards of beauty that black women are forced to conform to via hairstyles and fashion. It also creates a paradigm where people don’t appreciate and empathize with the black women’s suffering and pain, the only pain that seems to matter is that of white women. This narrative comes up in present day when you look at who a lot of athletes end up marrying. When you beat the game with Balrog this image below is your reward….. he finally made it…"}, {"type": "image", "content": "https://miro.medium.com/max/800/0*ditwBJ8siTZJ64Ci.jpg"}, {"type": "sentence", "content": "Stereotype: Athletically gifted"}, {"type": "sentence", "content": "The narrative is that black men are inherently talented and good at basketball and other sports. It’s problematic because athletic success comes from hard work, and by attributing it to race it devalues the hard work and training black athletes put into their craft. It also puts undue pressure on black people to perform athletically while simultaneously causing us to undervalue education and other realms that black people can find success in."}, {"type": "sentence", "content": "Stereotype: Black man as criminal"}, {"type": "sentence", "content": "The mass incarceration of black men in America is a tragedy of epic proportions (America incarcerates too many people in general). Black people are arrested at 5 times the rate of white people (source). The for-profit prisons system has only heightened these issues especially in communities of color. Balrog is a criminal. If you watch the news you will see a disproportionate amount of coverage on black crime and arrests. If you are not black and watch the news and play Street Fighter and don’t have any other interactions with people of color, you would probably be scared and have a very negative perception of our people. That fear is pervasive even today."}, {"type": "sentence", "content": "Balrog is problematic because he is one of the few major recurring black figures in gaming. If we had more black people in games, negative images like this would not be so harmful but we are not there yet. As a kid this was one of very few options for me to look up to and that’s a shame. At least the white kids had Mario and Luigi! Balrog, or M. Bison, is also based on a problematic real life person in Mike Tyson. Tyson is a convicted rapist and had some real struggles that derailed one of the greatest boxing careers of all time."}, {"type": "image", "content": "https://miro.medium.com/max/1024/1*QRvgkU6ateWbmVXitdTFFA.jpeg"}, {"type": "sentence", "content": "Capcom gave Balrog some Character development and redemption surprisingly in Street Fighter V. Street Fighter V introduced a new character named Ed. Ed was created in the S.I.N labs and when the labs were destroyed during Ed’s childhood Balrog saved him. Balrog raised Ed and treated him as a son. Having Balrog as a father figure and mentor is wildly in opposition to the character Balrog has been for 20 years prior. A black male as a father figure in media in general is still too rare of a sight, and anything that undermines the stereotype that black men are bad fathers or can’t be fathers is positive. Balrog and Ed’s relationship culminates with Ed leaving Balrog to protect him, Balrog protest and gives a somber, “Get lost.” as he depressingly watches Ed leave. It was a pretty touching moment in a cut scene of a fighting game."}, {"type": "image", "content": "https://miro.medium.com/max/1024/1*INoLCLKeDWGkTRtvpzPX8A.jpeg"}, {"type": "sentence", "content": "It is great that Balrog has persisted throughout the years as a main stay character in the Street Fighter franchise. He is still strong and still a menacing character to use in the game. Over the years Capcom has stuck with Balrog and I still play with him to this day. I don’t hate that Balrog exist, I just wish he had a positive character to counter him (maybe DeeJay?), especially in the gaming space. I also think it is important to acknowledge that he was made by a Japanese studio, and their perceptions and knowledge of race in America may be different than that of a domestic studio."}, {"type": "sentence", "content": "That’s all I got for Balrog! Peace."}], "topic": "gaming"}