{"title": "How To Take Control Of Your Own Upskilling", "data": [{"type": "sentence", "content": "One of my biggest life lessons over the past five years is that problems do not go away, or even get smaller all on their own. While I’m not ready to further dramatise my problem person, ahem, I mean event, this is an excellent mantra to flip and apply to other, more positive things, like learning and upskilling."}, {"type": "sentence", "content": "If you’re a super wise, disciplined, focused, Yoda-guru kinda person, then you probably don’t need to create learning workbooks. But for me, I’m a distracted soul with more than one significant conquest to undertake."}, {"type": "sentence", "content": "We all learn differently; some people can visualise; some can learn directly from stories or tales; some people just know things and others will probably never learn at all. Me, I need some application, an activity to complete. I need a course workbook."}, {"type": "sentence", "content": "I think back to my most productive year ever; it was a while ago but still in memory. It was working full time, completing two of my final university modules part-time and writing my first play. It was a wonderful time, and the key was having no time to procrastinate because I had a syllabus of essays and tasks that I had to complete on time or fail. I had a programme of learning, except for the play which was such a new skill I was riding on pure glee. I didn’t have hours to waste in between essays wondering what I should do or write."}, {"type": "sentence", "content": "I know how obvious this sounds but hear me out because given the number of productivity articles I still see on Medium and that I’m still reading, I’d say we’re all pretty far from our peak state."}, {"type": "sentence", "content": "Last month a few sources of advice converged to convince me that I needed to write a short story a week. It was a quote by a famous writer and an episode of the filmmakers’ podcast talking about the process of writing a short story every week for a whole year."}, {"type": "sentence", "content": "So I started and what emerged in the first month was a habit of sitting down on a Sunday afternoon and bashing out a short story; anything with an end would do, I had no criteria other than producing a short story. The first one felt satisfying and even the second one, but towards the end of the month, I had just created a habit of writing a bundle of words, not quality tales."}, {"type": "sentence", "content": "I looked at my process. I’d created a schedule and mostly stuck to that desk arrival time but come to the first session I’d sit down and think about writing for half an hour. Then an email or tweet would arrive, and I’d tend to that, and similar distractions would occur across the week and then shit..it’s Saturday already. I’d better batter out a story by tomorrow and what was coming out was a story, but not a good one."}, {"type": "sentence", "content": "The problem wasn’t a lack of motivation; it wasn’t a lack of schedule; it was invasive procrastination because I didn’t know what to write. I needed more purpose and definition for my weekly short story task."}, {"type": "sentence", "content": "I’m not short of ideas, but my 2020 brain will latch on to any excuse to move my focus onto something simple. I thought back to my incredible part-time degree and regular assignments."}, {"type": "sentence", "content": "That’s what I needed."}, {"type": "sentence", "content": "So I created a course of my own to drive productivity and improvement. It didn’t take much effort to develop or too much time to make, and it feels like it’s working. I’m hitting my assignments, improving my craft and building a more organic process of actual improvement."}, {"type": "sentence", "content": "I recommend creating a course for any new skill you are undertaking, or for a process of improvement that isn’t under the guidance of a tutor or mentor, and there’s a bonus piece of advice at the end about sharing it to the world."}, {"type": "sentence", "content": "Here are the steps I took to create my course workbook. Again, it’s all obvious stuff but allocating the time to create your own learning programme is the quickest way to start improving."}, {"type": "subtitle", "content": "Step 1 — Define Your Why"}, {"type": "sentence", "content": "It is knowing or remembering your why when undertaking learning is critical, especially where self-learning. In a boisterous world, only things that feed into a robust higher objective will survive the noise. I’ve got bills to pay and galaxies to explore otherwise and the “nice to have’s” need to be core essentials."}, {"type": "sentence", "content": "The reasons I started my course was to improve my fiction writing so that I can write my great novel. I don’t want to write a novel; i want to write an amazing novel. I’ve written plays and scripts, but I want to improve my descriptive prose, and by writing short stories, I’ll be able to practice and improve these skills."}, {"type": "subtitle", "content": "Step 2 — Decide On Your Length/Frequency"}, {"type": "sentence", "content": "Set the length of your programme and the frequency at which you can produce your output. Basically, how quickly do you want to learn and what time do you have available."}, {"type": "sentence", "content": "I like twelve for a course length, three months. It’s a reasonable amount of time to create a habit and see measurable progress at the end. A short story a week is achievable yet ambitious. That’s the sweet spot you should look for; it needs to be the right size of a challenge for you to complete."}, {"type": "sentence", "content": "You can also think in terms of your endgame of output. The idea of having 12 short stories in my bank often keeps me moving forward. Maybe monthly is better for you or a year rather than 12 weeks."}, {"type": "sentence", "content": "Just write something down; you can always change it afterwards."}, {"type": "subtitle", "content": "Step 3 — Set Your Learning objectives"}, {"type": "sentence", "content": "List your objectives for the course and allocate one per week or month, whatever frequency you can undertake. If you know them, that is."}, {"type": "sentence", "content": "My course is less about learning particular skills and more about just creating regular tasks so I can focus on improvement and reduce procrastination."}, {"type": "subtitle", "content": "Step 4 — Content."}, {"type": "sentence", "content": "Yay — this is the fun bit. Can you map out 12 tasks that represent a challenge but something achievable? Mine came in the form of different types or themes for a short story."}, {"type": "sentence", "content": "Have a quick read through online courses or some of your craft books if you need ideas."}, {"type": "sentence", "content": "For example, in the first week, I created a task to write a story that included a force of nature, the week after was a theme etc. etc."}, {"type": "subtitle", "content": "Step 5 — Formalise it"}, {"type": "sentence", "content": "Write up your course material. Maybe it’s a word document or if you’d like something fancier you could use a design tool such as Canva although if it is just for you don’t spend too much time perfecting it. The objective is to give it a level of authority beyond scribbling own a few notes in your diary."}, {"type": "sentence", "content": "I’ve created my course on Convertkit, which is a CRM for creators. It’s so easy to produce a weekly lesson on there via sequences and set yourself up for a weekly email. If you haven’t used it before they run helpful tutorials and you can set up a free account for up to 2000 subscribers. You can share it, see below, or just set up the automations to be emailed to you."}, {"type": "subtitle", "content": "Step 6 — Publish it"}, {"type": "sentence", "content": "Be brave if you dare and publish it, you might get a few joiners along the road and learning is more fun when it’s a group activity."}, {"type": "sentence", "content": "I’ve given my course a name. It’s called On The Road, and there’s a link to sign up in my profile. It’s a free course because I’m learning myself and not in a position to teach. Making it an actual course has encouraged me to create material that is beyond a written task."}, {"type": "sentence", "content": "The content not only includes a task but a couple of examples and references, and it’s expanding the overall learning experience through reading and research."}, {"type": "sentence", "content": "Honestly, it’s taken me longer to write this blog than it took me to create the first few weeks of content, and I’ve got three short stories already, and each one represents an improvement on the last. It’s even affecting my screenwriting positively."}, {"type": "sentence", "content": "Do it and if you’re a mischievous spirit such as me when have you ever been teacher’s pet before in your life?"}, {"type": "sentence", "content": "If you enjoyed this story, sign up to my weekly newsletter to read more like it. Subscribe here."}], "topic": "productivity"}