{"title": "STEM vs Humanities: my dream for the post-pandemic world includes an end to the false dichotomy", "data": [{"type": "sentence", "content": "Successful pandemic response strategies show we need both to survive in an ever-changing world. Public health leaders are proving to be masters of communication; journalists understand epidemiology better than some of us in healthcare."}, {"type": "sentence", "content": "My late mother, if asked where she was “from”, would respond: I am a scientist, that is my first citizenship."}, {"type": "sentence", "content": "In case that looks like a slam-dunk summary of the STEM-dominant environment I grew up in, my mother also had great respect for people she called “readers”: loosely defined as people who read, not the glossy magazines on supermarket shelves, but real books, not just the blurb at the back, and not just people who watch the movie adaptations."}, {"type": "sentence", "content": "Growing up, the division between the sciences and the humanities seemed more a way of deciding which part of the library I felt like browsing that day, rather than a “real” distinction."}, {"type": "sentence", "content": "When I applied to medical school, the “personal letter” I wrote about why I wanted to be a doctor played a part in admissions and consideration for financial support, as it still does today. I found a copy of that letter while moving house — clearly not my best piece of literary non-fiction, but not bad for an angsty teenager."}, {"type": "sentence", "content": "I told a professor of philosophy that, many years later, and he laughed — “that sounds like something we’d ask at our philosophy exam”."}, {"type": "sentence", "content": "I “grew up” and married a writer. I found myself failing at making small talk at some of my husband’s parties. Before I got married, good friends used to invite me to parties just so I could help make guests who didn’t know anyone else feel at ease. So maybe I got boring after marriage (I wouldn’t be the first person accused of that). But I have another, unproven theory — my sixth sense tells me that many of my husband’s “artist” friends found a physician too boring to speak to, since I make a living out of writing prescriptions, not poetry."}, {"type": "sentence", "content": "Back to the issue of the false dichotomy of STEM vs the humanities: if we are to indulge ourselves in conspiracy theories, somewhere along the journey of knowledge, someone decided to “divide and rule”. That someone must have realized, the surest way to dumb down thinkers, was to have them believe they had to choose between the “sciences” and the “humanities”, and then forever spend the rest of their lives trying to prove to the other that their choice was the superior one of the two."}, {"type": "sentence", "content": "The Greeks defined the liberal arts as including aspects of both the humanities and STEM — the three arts of the trivium (grammar, logic, rhetoric) and the quadrivium (geometry, arithmetic, astronomy and music). Many still say “liberal arts” when they mean the humanities."}, {"type": "sentence", "content": "We can say Da Vinci (15th century), an inventor, artist, scientist, etc. was an exceptional genius, and not everybody could be expected to know both the sciences and the arts. Yet, when Charlotte Bronte worked as a governess and wrote the role into her novels (Jane Eyre, 1847), we don’t hear of a family hiring two governesses, one for “STEM” and the other for “humanities”. Knowledge was knowledge."}, {"type": "sentence", "content": "A quick look at another civilization, the Chinese for example, suggests that the divide, arbitrary though it may still have been, was between the “thinkers” and the “athlete/fighters”. Those who are able in both were lauded for being so. Nowhere was it ever assumed, that a thinker could not be a fighter, or vice versa (generals in war were applauded for strategy as much as their ability to shoot straight)."}, {"type": "sentence", "content": "Reading the biography of Santiago Ramon y Cajal (Nobel Prize 1906), the antagonism between the “sciences” and the “humanities” might have already begun, at least in the “Western” world. Cajal, the father of neuroscience, was an artist before attending medical school. His father, an anatomy teacher, did not approve of his son’s passion for art."}, {"type": "sentence", "content": "And yet, it was the ability to draw that enabled Cajal to convey to other scientists what he saw under the microscope (no screenshot technology at the time). He showed how one cell signaled another, and how these, in turn, became complex networks, eventually forming the brain and nervous system, connected throughout the human body. Just as knowledge — be it the humanities, science, technology, mathematics — are intertwined and interconnected."}, {"type": "sentence", "content": "The acronym “STEM” appeared earlier this century, when educationists were worried that students were doing poorly in these subjects. Now, we see the pushback from other parts of the education community, aware that science cannot live alone. Beyond the choruses of “Why STEM is not enough” and the recognition of the need to be “inclusive” of the humanities, perhaps we should go one step further — to recognize and appreciate that all knowledge, of all colors and kinds, go together, often in ways that do not have well-defined boundaries. Instead of falling into the trap of pigeon-holing our minds and our thinkers — we should revel in the grey zones between the domains of knowledge, such that they (and we) are not competing for attention, but co-existing, cross-pollinating, and symbiotic."}, {"type": "image", "content": "https://miro.medium.com/max/3588/1*bUqpP6igoi0pDtqTRx-Exg.jpeg"}], "topic": "education"}