{"title": "The Discrete Art of Repurposing Content", "data": [{"type": "subtitle", "content": "How the least talked about method can solve the biggest challenge of content marketing"}, {"type": "image", "content": "https://miro.medium.com/max/7874/0*fCy1e3z30K0r_pVN"}, {"type": "sentence", "content": "The number one advice most content marketer would give to anyone wanting to get started advertising their business online would be to create and publish content, and lots of it, consistently. Which could be clarified into posting multiple times a day, every day."}, {"type": "sentence", "content": "If you’re just getting started in content creation or marketing, this advice may seem scary and daunting. You may wonder how you can produce this much content, and how you can compete with others that may publish even more than you do."}, {"type": "sentence", "content": "These are very valid concerns. Especially if you are competing with a larger organization, who can afford teams and employees to create content every day. Very quickly, you could be overwhelmed with marketing, spending all of your free time publishing the best content you can to fight for your audience’s attention."}, {"type": "sentence", "content": "That’s when repurposing content can be an excellent strategy. Repurposing content is sometimes talked about by content marketers, but it is often kept as a secrete, or a discrete method to be able to publish a lot of content in a small amount of time."}, {"type": "subtitle", "content": "What’s Repurposing Content?"}, {"type": "sentence", "content": "Repurposing content is the idea of taking a generally longer piece of content, and to adapt its length, format, and message to publish it to a different platform."}, {"type": "sentence", "content": "For example, you could write a 3,000 words blog post about a topic, and wrap the main ideas of them in an infographic that you would post on Instagram, Pinterest, Twitter, Facebook, and so on. This way, you don’t have to wait until you write another giant blog post to be able to communicate about your business. But you could also take a few quotes from this article, and post them on Twitter, or write them on an inspiring background using Canva or Photoshop. The possibilities are endless."}, {"type": "sentence", "content": "From one piece of content, you find ways to reformat it to be able to share it on other platforms."}, {"type": "subtitle", "content": "Why Is Repurposing Content Efficient?"}, {"type": "sentence", "content": "Repurposing content helps with dealing with volume."}, {"type": "sentence", "content": "Let’s say you need to be posting three times a day on Twitter. You could be brainstorming hours to find three ideas worth sharing, or you could recycle some of your existing content and put them in a tweet format. You could get these ideas from your blog posts, YouTube videos, or the past few newsletters that you sent. The people following you on Twitter don’t necessarily follow you elsewhere, and even if they do, it’s not guaranteed they were already exposed to all the content you’re sharing."}, {"type": "sentence", "content": "Efficiency is a significant part of content marketing: you need to be publishing a lot of high-quality and highly-engaging content without spending your entire day creating content. This means that you need to find ways to create a high volume of content in a limited amount of time. That’s what repurposing content can do for you."}, {"type": "sentence", "content": "Repurposing content also helps with increasing the reach of your content. Instead of promoting a longer piece of content once (like a blog post or a YouTube video), you’re sharing it multiple times per day on various platforms. This helps with getting your message and ideas out there without having to deal with keeping on creating longer pieces of content."}, {"type": "subtitle", "content": "Repurposing Content, a Secret Well Kept."}, {"type": "sentence", "content": "This method isn’t that talked about for a reason: it’s a significant competitive advantage."}, {"type": "sentence", "content": "Being able to repurpose content the right way, and efficiently allows individuals and brands to publish a lot more content without spending hours consistently coming up with new ideas."}, {"type": "sentence", "content": "In terms of the method per se, there isn’t much to it. All you have to do and have to know is all the different formats available. You are not going to post the same thing on Facebook or Twitter or Instagram. You need to understand what works and on which platform."}, {"type": "sentence", "content": "The simplicity of repurposing content also makes it a technique that’s not too described online. For this reason, it’s a hugely underestimated technique. It’s tempting to be looking for a complicated solution to a problem that seems so deep and unsolvable. Because of that, the simplicity of repurposing content doesn’t strike most people as the best way to solve the issue that they have."}, {"type": "sentence", "content": "Having the ability to take one piece of content and turn it into 10 or 20 is a superpower, and it’s an unfair advantage in a business that relies on content marketing to get traffic. It’s the only way to be able to publish an outstanding amount of content daily. There is no better way. Don’t underestimate the power of repurposing content, because you may be missing out"}], "topic": "social-media"}