{"title": "How to Find a Marketing Strategy That Works for You", "data": [{"type": "subtitle", "content": "When you stop looking for shortcuts, you can focus on your strengths"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*_1kKg9f3EDS25_6ckI-hZQ.png"}, {"type": "sentence", "content": "“They told me I have to be on social media,” Amelia reported with an exhausted tone. “And I don’t want to be on social media.”"}, {"type": "sentence", "content": "Luckily, Amelia didn’t have to. She had already found and implemented a great way to find her business in front of new customers until someone told her that she must be on social media: “You can’t succeed in business nowadays unless you’re on Instagram.”"}, {"type": "sentence", "content": "This remark combines the myth that there’s only one recipe to business with a poor understanding of what marketing is: a bridge between your customers (with a problem/desire) and your offer/solution. If you can effectively reach them by throwing paper planes out of the window, then that’s as good a marketing strategy as being on social media."}, {"type": "sentence", "content": "The reason why most people confuse marketing with black magic is they haven’t taken the time to clarify what they want to get out of their efforts. So they start signing up for social media platforms or even buying equipment to (one day) shoot videos or record podcasts."}, {"type": "subtitle", "content": "The Danger of Looking for the Next Hack"}, {"type": "sentence", "content": "When you believe that business is about finding the right cheat codes, you’ll keep looking for shortcuts and following the latest trends telling you what you must do."}, {"type": "sentence", "content": "This attitude is dangerous for three reasons:"}, {"type": "sentence", "content": "Looking for hacks focuses you on the marketing tactic and makes you forget what you want from it: to connect customers to your services or product."}, {"type": "sentence", "content": "To get your offer in front of the right people, tactics should come last."}, {"type": "subtitle", "content": "Where Do They Hang Out?"}, {"type": "sentence", "content": "The most potent marketing question I know is where do your customers hang out? To find out, you want to ask them."}, {"type": "sentence", "content": "Before you start creating colourful spreadsheets and sign up for some software trial, this doesn’t have to be complicated. You want to arrange a good, old-fashioned conversation and ask them."}, {"type": "sentence", "content": "To find them, think about your network first. Do you have any past or current clients or any friends who fit the picture?"}, {"type": "sentence", "content": "Next, ask your network for introductions. Ask your friends if they know anyone that reminds them of your ideal customer, or ask on social media if anyone can help you connect to them. Here’s an example:"}, {"type": "image", "content": "https://miro.medium.com/max/4070/1*cIbb_FO3Fr33HIGN6ti-hQ.png"}, {"type": "sentence", "content": "Finally, you can ask open questions to forums such as a subreddit — it may feel like a scary place, but I was able to arrange several conversations and even preorders by having honest, non-pushy discussions on forums. If you want access to my templates on how to reach out, join my idea challenge today."}, {"type": "sentence", "content": "Through having real interactions, you want to answer a simple question."}, {"type": "subtitle", "content": "“Where do they spend time?”"}, {"type": "sentence", "content": "When you have the conversations, follow a script so you get the same data from each person: If you have lots to ask, consider sending a short survey. With that said, open questions and conversations allow you to explore what they do, instead of confirming what you think they do."}, {"type": "sentence", "content": "These interactions aim to establish where they spend time, both online and offline. Where do they look for information when they have a question? Are they part of any group or association on and offline? Do they read books or use social media? Which channels?"}, {"type": "sentence", "content": "This information will give you a full picture of all the options that you have, in terms of what mediums your target audience enjoy (video, podcast, articles, microcontent, etc.) and where they go to find them (which platforms)."}, {"type": "sentence", "content": "Next, what about you?"}, {"type": "subtitle", "content": "What Do You Enjoy? What Are Your Strengths?"}, {"type": "sentence", "content": "If you’re the one creating content or even setting a direction for it, you want to make sure you focus on something you enjoy doing. Just like the example of Amelia at the start of this article, you don’t want to end up feeling trapped by your business."}, {"type": "sentence", "content": "The easiest platform ever can become extremely challenging if you don’t want to be on it."}, {"type": "sentence", "content": "If you’ve ever started any content attempts only to quit right away, switched to something else, and then … quit again, you’re probably looking for a shortcut instead of committing to something you enjoy and that leverages your strengths."}, {"type": "sentence", "content": "Time to interview yourself: How do you enjoy creating and communicating? Are there any platforms on which you feel more comfortable? If you had to choose one for the next three years, which would it be?"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*ApRolUOw7vS3VzyoD5jCVg.png"}, {"type": "sentence", "content": "Focusing on the intersection between what works for you and what your target audience wants is a game-changer."}, {"type": "sentence", "content": "It allows you to create original content that stands out but also empowers you to commit to something you’re happy to stick to for a while."}, {"type": "sentence", "content": "Instead of spinning your wheels on many marketing tactics going nowhere, leverage your strengths and involve your customers. That way, you’ll never be tempted to jump onto the next distraction again."}], "topic": "freelancing"}