{"title": "Moderna’s Announcement Was Great News — Just Not For The Reason You Think", "data": [{"type": "image", "content": "https://miro.medium.com/max/1920/0*JgFqItBNSBj0n6oZ"}, {"type": "sentence", "content": "Moderna’s press release announcing the initial success in its Phase I trials of a Covid-19 vaccine was one of the main reasons the Dow Jones Industrials shot up by nearly a thousand points on Monday."}, {"type": "sentence", "content": "Moderna, a Boston-based ex-unicorn that has successfully developed and marketed as many drugs as you have, turned itself from a $6 billion midcap stock to a $27 billion large cap stock over the space of a few months and a handful of press releases."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*o6IDZwxsizYDxpMP"}, {"type": "sentence", "content": "Whether Moderna’s vaccine shows efficacy in any of its clinical trials — let alone is able to be mass-produced as quickly and in the volumes the world desperately needs — is beside the point. The great news about the Moderna announcement is the breathtaking scientific progress it represents and what this progress says about our civilization’s ability to survive a threat even more profound than Covid-19."}, {"type": "sentence", "content": "Moderna’s vaccine candidate does not just represent a new way to combine a beaker full of chemicals, it is a revolutionary therapy that aims to engineer a molecule known as Messenger RNA (mRNA). mRNA drugs establish microscopic vaccine factories within human cells; these factories allow the subject’s own body to “naturally” produce the antibodies to fight the virus (see also Bill Gates’s explanation in his essay, The first modern pandemic)."}, {"type": "sentence", "content": "The total number of mRNA drugs saving people’s lives today is zero, despite some promising advances. Scientific conferences to discuss mRNA therapies only started in 2013 — it’s that new of a field."}, {"type": "sentence", "content": "It is the breathtaking rapidity with which an entirely new field of human scientific endeavor has sprung into prominence that makes Moderna’s mRNA-based Covid-19 vaccine such a wonderful illustration of the potential of human genius and adaptability."}, {"type": "sentence", "content": "This genius and adaptability and its expression in the economic sphere — capitalism — are the only things that will allow us to survive and thrive during an age of climate change."}, {"type": "sentence", "content": "Do not get too misty-eyed, my loyal, Chicago School readers, at the mention of the glory of the capitalistic system. Much of Moderna’s drug pipeline — including the Phase I trials for the Covid-19 vaccine — has been supported through grants from an alphabet soup of government agencies."}, {"type": "sentence", "content": "The public — that is you and me — also funds some astounding scientific work at Argonne National Laboratories. I tuned into an online lecture last night about the work Argonne is doing to identify the structure and inner workings of the SARS-CoV-2 virus, find promising drug candidates, and model the spread of the disease under different quarantine policies."}, {"type": "sentence", "content": "Some of this work is powered by Argonne’s particle accelerator — which provides X-rays a thousand times more powerful than those your cat receives at the vet’s — and some by Argonne’s amazing supercomputing resources."}, {"type": "sentence", "content": "Listening to the Argonne lecture, I was struck by how much mental horsepower in Chicago and around the globe is being directed at solving the threat posed by Covid-19."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*HNXzlR9hzUnLpczK"}, {"type": "sentence", "content": "Public and private organizations across the earth have united to combat an immediate mortal threat to our species through human intelligence, hard work, and creativity."}, {"type": "sentence", "content": "How great it would be if — one of these days soon — we get around to using the same model of concerted effort to address the issue of climate change."}, {"type": "sentence", "content": "Intelligent investors take note."}, {"type": "sentence", "content": "Originally published at https://www.forbes.com."}], "topic": "science"}