{"title": "How to Spend Less Time on Your Phone and Improve Your Life", "data": [{"type": "subtitle", "content": "Even if you work from home."}, {"type": "sentence", "content": "Phones and laptops are a significant part of our lives — especially for those of us who work from home. We spend hours on our devices whether we’re working or taking a break."}, {"type": "sentence", "content": "You can’t help but notice that you spend more time on your technology than you do in the real world. This makes you feel guilty and like you’re not really living."}, {"type": "sentence", "content": "You’d love to spend less time on your devices. The problem is you’re addicted. You don’t know what to do outside of the screen, so you keep typing and scrolling and tapping."}, {"type": "sentence", "content": "You feel a little miserable, and maybe even a little numb."}, {"type": "subtitle", "content": "It’s Not Your Fault That You’re Addicted to Your Phone"}, {"type": "sentence", "content": "We’ve all become accustomed to depending on our devices, which isn’t necessarily our fault."}, {"type": "sentence", "content": "According to Healthline, our brains release a chemical known as dopamine when it’s rewarded. They wrote, “Some phone apps are designed in a way to keep you coming back again and again for positive social reinforcements that can trigger the release of dopamine in your brain.”"}, {"type": "sentence", "content": "Certain parts are built to be addicting. There are countless apps and ways for you to do, well, everything — and that’s not a bad thing. The world evolves, and we evolve along with it."}, {"type": "sentence", "content": "Still, that doesn’t mean we don’t get sick and tired of using our devices so damn much."}, {"type": "sentence", "content": "We’ve forgotten that we don’t need a phone for everything. There are lots of activities we can do outside of it. You just have to look up for long enough."}, {"type": "sentence", "content": "Once you do, you’ll feel your life improve. The online world is great, but nothing beats real life. The wonderful thing is that you don’t have to do much — you just have to get off of the screen to feel a change."}, {"type": "subtitle", "content": "Why Do You Spend so Much Time on Your Devices?"}, {"type": "sentence", "content": "The simple and truest answer is that you’re bored. CNN Business wrote, “Fiddling with our phones, [researchers] say, addresses a basic human need to cure boredom by any means necessary.”"}, {"type": "sentence", "content": "You don’t know what you do, so you play games on your phone and watch YouTube videos on your laptop."}, {"type": "sentence", "content": "Here’s the kicker, though: Those are the very things you’re tired of. You feel jaded with your life because you do the same thing repeatedly."}, {"type": "sentence", "content": "How many times can you go on social media? For how long can you watch the latest Netflix series?"}, {"type": "sentence", "content": "You’re allowed to spend time however you want, but that’s the problem. You’re not spending it doing anything. You’re wasting it."}, {"type": "sentence", "content": "That’s not to say that all time spent watching YouTube videos, scrolling through social media, or watching TV shows is a waste of time. You want to use your devices mindfully."}, {"type": "sentence", "content": "Instead of using social media to pass time, use it because you want to connect with friends. Instead of letting your life pass you by without a second thought, be wary of how many videos you’re watching."}, {"type": "sentence", "content": "Think about what you’re doing instead of just doing it."}, {"type": "sentence", "content": "You need more to do — or even, less. There are lots of benefits to being bored, such as:"}, {"type": "sentence", "content": "If you can’t find anything to do, that’s okay, too. Boredom is good for you."}, {"type": "subtitle", "content": "Replace Screen Time By Finding Your Thing"}, {"type": "sentence", "content": "Since you’re going to spend less time on your laptop and phone, you need something to do — fun activities outside of technology. That can mean anything you want it to mean."}, {"type": "sentence", "content": "Fun can be a bike ride around the neighborhood, a jigsaw puzzle and podcasts, or baking cookies. I’m not going to suggest things you can do because you’ve already heard them all."}, {"type": "sentence", "content": "You just actually have to do them."}, {"type": "sentence", "content": "Before you open an app on your phone that’ll lose you forty-five minutes of your time, ask yourself why you’re about to do that."}, {"type": "sentence", "content": "If you’re doing it because you’re bored (which you most likely are) then get out. Do something off of your phone. Whatever the hell you want."}, {"type": "sentence", "content": "Find a hobby that feeds your soul, makes you laugh, or gets you excited. Even something as simple as blasting music and singing along feels greater than liking picture after picture on Instagram."}, {"type": "sentence", "content": "Take time to find your thing. Try all types of activities. These will bring you genuine joy and help improve your overall life."}, {"type": "subtitle", "content": "How Can You Replace Your Phone and Laptop?"}, {"type": "sentence", "content": "People started replacing everything they did for the convenience of their phone. Now, you have to do the opposite."}, {"type": "sentence", "content": "Don’t buy a notes app, buy a notepad. Instead of playing games on your phone, purchase a deck of cards. Instead of mind-mapping your novel on a website, do it on paper. Purchase a paperback, not an ebook."}, {"type": "sentence", "content": "You can do so much outside of your screens. We just forget because we go to our devices first."}, {"type": "sentence", "content": "Here’s the harsh truth: If you got rid of all of the distracting things you do on your laptop when you work, your laptop-time would decrease by at least two hours."}, {"type": "sentence", "content": "Wouldn’t you love an extra two hours on your hands?"}, {"type": "sentence", "content": "You don’t actually need your laptop for as long as you use it. But you’re letting yourself get caught up in a bunch of shit that doesn’t matter."}, {"type": "subtitle", "content": "What can you do during your breaks?"}, {"type": "sentence", "content": "Look, I’m not perfect. I spend a hell of a lot more time on my laptop than I should because of distractions. But you want to be wary."}, {"type": "sentence", "content": "I used to go on my phone when I was taking breaks. Then, when I’d work, I’d switch to my laptop."}, {"type": "sentence", "content": "It was no wonder my eyes were red and dry by the end of the day. That’s why I decided to get off all technology when I was taking a break, no matter how long that was."}, {"type": "sentence", "content": "What do I do instead? I like to talk to my sisters. Pace the room and think. Read a lot. Play a sudoku puzzle or listen to music in bed."}, {"type": "sentence", "content": "It doesn’t matter what you do. Just replace your phone and laptop time with anything off of it. This is incredibly simple, but most people won’t do it. They’ll continue wasting their lives to shit that adds no value to their lives."}, {"type": "sentence", "content": "They’ll continue to scroll and click away even though they don’t want to be."}, {"type": "subtitle", "content": "Final words"}, {"type": "sentence", "content": "Spending time off of your phone and laptop doesn’t have to be hard. Right now, we’re all addicted."}, {"type": "sentence", "content": "Your job is to replace the hits of dopamine your receive from your phone with genuine happiness you receive from something real."}, {"type": "sentence", "content": "That’s not to say you can never spend time on your devices when you’re not working, but you clicked this article to learn to do just that. So find hobbies and activities you can do, and then actually do them."}, {"type": "sentence", "content": "It’s so easy, most people will just nod along and think they can do it. The truth is, most people can’t."}, {"type": "sentence", "content": "Who will you be?"}], "topic": "productivity"}