{"title": "The Lack of Rural Representation in ‘Graduate Together 2020’", "data": [{"type": "image", "content": "https://miro.medium.com/max/12000/1*f5h2cKtnEGhHIbMRjHe-1w.jpeg"}, {"type": "subtitle", "content": "Another example of rural exclusion in the national discourse"}, {"type": "sentence", "content": "Over the weekend, millions of households tuned-in to Graduate Together 2020, an hour-long program dedicated to this year’s graduating high school class who collectively missed out on all of the traditional pomp and circumstance due to COVID-19. Over the course of 60-minutes, viewers were treated to monologues from thought leaders and celebrities like Malala Yousafzai, Kevin Hart, Lena Waithe, and Megan Rapinoe; performances by the Jonas Brothers, Alicia Keys, and H.E.R.; and a commencement speech from Former President Obama that underscored the absence of President Trump in a moment like this."}, {"type": "sentence", "content": "When big name personalities were not speaking or performing, the spotlight was shone on dozens of students speaking about their experiences, introducing special guests, participating in musical numbers, or being wholesomely silly as they celebrate this major achievement."}, {"type": "sentence", "content": "The night was notably celebratory, but not without a touch of necessary somberness via the inclusion of a memorial similar in style to the six glass towers of the New England Holocaust Memorial that was dedicated to the teachers who succumbed to COVID-19."}, {"type": "sentence", "content": "Also of note was the conspicuous elements of inclusivity, as noted by the diversity in race, ethnicity, gender, and sexuality of the students and guest speakers."}, {"type": "sentence", "content": "Alas, and as inferred by the title, the program was not entirely inclusive."}, {"type": "sentence", "content": "As I watched the program with my family, one of the first things I picked up on was the number of student presenters and speakers from California. Re-watching the video, within the first 15-minutes, I personally counted 5 out of 7 student presenters being from a major city in California. From this point, there was a gradual shift to include students from other states, including DC and oft-disregarded-in-the-mainstream Puerto Rico by way of a student and Bad Bunny."}, {"type": "sentence", "content": "Still, in spite of this shift, the proportions were off: Arizona was somewhat overrepresented, with 8 out of 10 students in a video montage starting at the 45th minute mark hailing from private schools located throughout The Grand Canyon State from what I could confirm via Google; there was only one student from Texas, the second largest state in The Union; no students from Florida or New York, the third and fourth largest states, respectively; and no students from any the states that comprise New England, much of the northern and middle interior, or Alaska and Hawaii. Illinois and Ohio each had a student representative, although considering that the young man from Ohio graduated from Lebron James’ I Promise School and the young woman from Chicago is a member of the Obama Foundation, I am skeptical as to whether these two states would have had any representation without the presence of these two individuals (a similar case could be argued for Puerto Rico’s representation had Bad Bunny not been included in the line-up)."}, {"type": "sentence", "content": "In total, I only counted 10 states as being overtly included in the entire program. Once you include Puerto Rico and D.C. and do some digging to uncover Arizona’s representations, the number of places represented increases to 13."}, {"type": "sentence", "content": "While there is a chance that students from unrepresented states may have been featured in the litany of dance and celebratory videos shown throughout the program, none of that matters if it isn’t obviously mentioned."}, {"type": "sentence", "content": "To the majority of viewers, this probably went unnoticed. After all, California is the biggest state by population in the U.S., one would have to dig as I did to uncover the Arizona numbers, and the inclusion of Puerto Rico was noteworthy considering that the last time the island got any sort of significant mention in the mainstream was in the wake of Hurricane Maria."}, {"type": "sentence", "content": "And that’s exactly the problem."}, {"type": "sentence", "content": "Much of the mainstream media, entertainment, and political discourse of the US seems to center around urban areas, large cities in particular. If your only exposure to the United States is through Hollywood or American primetime television, you may be led to believe that all of America looks like Los Angeles, New York City, Miami, or the Northwest quadrant of D.C. I’ve lost count of how many times I’ve encountered this perception when interacting with people during my respective travels and stretches of living abroad. It is that pervasive."}, {"type": "sentence", "content": "This skewed perception of what America looks like is not limited to people living outside of the United States, however, as one can find the pungent air of city-slicker arrogance permeating from the inhabitants of the major coastal cities. This exaggerated ego most often presents itself in the contemptuous labels given to the more rural interior of the country by these folks: fly over country; the rust belt; bum f*ck nowhere."}, {"type": "sentence", "content": "Hailing from the Boston area, I too am guilty of having used such pejoratives to describe the heartland."}, {"type": "sentence", "content": "Often, it feels like the only time that the rural areas of our Union are ever discussed in a favorable light by us urban dwellers is during an election year when politicians — followed by major news networks — clamor for the attention and confidence of state fair attendees and town hall participants. Once the votes are in and the crowds evaporate, things go quiet, but certainly not unnoticed: 71% of people living in rural areas feel like they receive less financial attention from the Federal Government when compared to their urban and suburban counterparts."}, {"type": "sentence", "content": "And I don’t blame them for feeling this way."}, {"type": "sentence", "content": "American cities do a terrible job of including rural America in the national discourse, nor does it make any real tangible attempt to understand or empathize with the unique challenges facing these communities. With an upcoming election in which the divide between rural and urban feels stronger — and more toxic — than ever, there must be a more conscious effort made by all of us city folk to be inclusive and respectful of our fellow country persons living in rural areas, be it in politics or avoiding the use of stereotypical portrayals when discussing the places that millions call home."}, {"type": "sentence", "content": "An event like Graduate Together 2020 provided a great opportunity to shine a light on the proud graduates of the rural communities found in Montana, Wyoming, Wisconsin, North and South Dakota, Arkansas, and West Virginia, to name a few."}, {"type": "sentence", "content": "Alas, the opportunity was fumbled."}], "topic": "education"}