{"title": "How is My Mental Health During Mental Health Month? -“Quarantined.”", "data": [{"type": "subtitle", "content": "Why being a human is so much harder today."}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*s8N3GaP2ZG5MF59l"}, {"type": "sentence", "content": "There is a posture that I assume where once I’ve reached that point, I know my body is telling me we’ve reached misery. “Collective Weariness” is what came to mind this morning that I’d heard recently on Brenè Brown’s podcast. And I think I’m officially there. So as I tossed and turned in my bed this morning, fighting to avoid the posture I knew was coming anyways, I thought about how this experience has been- being locked inside my house for over two months. It’s something we are all grappling with, something we are all unprepared for, something we are all trying to survive, whether we are on the front lines helping others or on the front lines of our own mental health. Today, I feel that fight for my own mental health more than ever."}, {"type": "sentence", "content": "I am a behavioral health consumer on a regular day. I have genetic predispositions and life experiences that have led to the presence of anxiety and depression on a regular basis. I work on these on a normal day. I attend therapy, and practice self-care, and take medication, on a normal day. And on day 67 of novel corona virus, my normal day practices aren’t cutting it. Throughout this time I’ve watched myself go through all of the variations of the ways we, and our bodies, respond to a threat. The typical fight or flight? Yep, been there. The freeze and fawn? Yep, I’ve been there currently for a week or two."}, {"type": "sentence", "content": "When all this started, I was excited to stay home. As a resident introvert, and as someone who commutes downtown every day- which is exhausting and stressful and anxiety producing- I embraced the break and the ability to work from home, which had not previously been an option. And after that first week of “sleepover mode”, finding myself staying up late watching Netflix shows I’d been meaning to catch up on, eating poorly, and working in my pajamas, the following week I entered “fight mode”. I was determined. I was going to use this time for the best, and get the most out of it possible. I meal prepped. I worked out 3 times a week. I tried a new yoga class I’d been wanting to try for months. I went for walks on my breaks and practiced gratitude. I literally smelled the roses. I initiated a ‘self-care’ challenge at work to encourage others to practice self-care and boost morale for us all. And after all that “fighting”, I unsurprisingly entered “flight mode”."}, {"type": "sentence", "content": "I now was avoiding the news at all costs, only leaving room for a friend, family member, or co-worker to catch me up on the world. Slowly, my motivation to attend virtual gym classes faded. I knew it would be good for me, and yet the thought of being inside for another hour at the end of my workday, was unbearable. So I took to walking outside for an hour instead to get some fresh air and shake off some of that cooped up feeling from the day. And that worked for a while. A while. At the beginning of this I was going on walks and hikes, trying to get outdoors as much as possible, and trying new trails and parks that were open. This morning, I found myself just trying to get out of bed. Once again in that all too familiar posture that reminds me I’m miserable."}, {"type": "sentence", "content": "I’ve reached that posture many times in the past. It’s the moment where I know I really don’t like the job I’m in. It’s the moment I know that I’m dreading having to get up and work that job for one more day. And it’s the moment I know I have to stop avoiding this reality and finally start job searching. This morning, in my “tornado position” on my bed in the dark, feet wrapped up underneath me, and my face cupped in my hands and burrowing into the mattress, it wasn’t a job I wanted to leave."}, {"type": "sentence", "content": "It was a reality I wanted to leave."}, {"type": "sentence", "content": "I want to say that this experience hasn’t affected me, that I’m doing well, and I’m going to rock this time at home and get super fit and accomplish all my goals. But my goals have had to shift significantly. I had such lofty goals in January of 2020. 2020 was going to be my year! I was excited and motivated and dedicated to reaching the goals I’d set out for myself. I’m an enneagram 2 with a hard wing 3 if anyone was curious…But 2020 hasn’t been “my year” for anyone. And it’s ok to acknowledge that we are in completely unprecedented times that haven’t been experienced in any of our lifetimes."}, {"type": "sentence", "content": "We are separated, isolated, living in ‘Groundhog’s Day’ time and time again. We are away from our loved ones, or away from all ‘ones’ entirely. We weren’t meant to be alone and in isolation. We weren’t meant to be in survival mode 24/7 with a threat that seems unyielding with no end in sight. Many humans have faced circumstances much worse that these in wars and famines, and any number of catastrophes you can name. And I can have both empathy for those experiences, and also practice kindness towards myself that this is hard."}, {"type": "sentence", "content": "On good days this is hard. On bad days this feels unbearable at times. As the days drag on and on and on, I feel like I’ve shifted from the Joy character on Inside Out, so determined to keep those “awesome core memories” intact, to now the Sadness character pointlessly turning every memory to blue on the bottom shelf while Joy drags her along. Today I am that Sadness character. Today my mental health is harder than it is on a normal day. And today I can acknowledge that and accept it as truth. Some days I really hate this. Some days all the things that got me through those first weeks aren’t working anymore. And some days I dread facing the reality I live in. I can feel all these things, while also holding space for our frontline health and mental health professionals (and many more!), who may be feeling all these things too, yet in their reality every day they still have to get up and fight."}, {"type": "sentence", "content": "Today, I’ll try. I’ll try to practice some of my self-care methods. I’ll try to go for a walk on my breaks. I’ll reach out for support from people I love. I’ll acknowledge and express my feelings. I’ll take my medication, and do all the things I have to do on a normal day for my mental health. And today, I’ll reach out wondering if you too are waking up in a ‘fetal position’ of your own and in need of some support and solidarity. Today I’ll get up and sit in the same chair, look out the same window, with my same cup of coffee, and open up my computer to work once again. And tomorrow I’ll do the same. No matter how long this lasts, we can acknowledge that it’s tough in the mean time and practice being kind to ourselves."}, {"type": "sentence", "content": "Stay kind, my friends."}, {"type": "sentence", "content": "Update: Today I did try. And there were ups and downs to it. I made it through the day, took some walk breaks, reached out to friends and support. And some of parts of it were great, and some parts of it were hard. Hang in there my friends and keep supporting one another."}, {"type": "sentence", "content": "Diana Kirby, MS is a Consultant, a Partner with Try On Therapy, and a Program Director for the State of TN Mental Health Department. She is passionate about empowering others, winning the argument that all dogs should be called puppies, reducing stigma surrounding mental health issues, and fostering creativity and authenticity in others and in herself."}, {"type": "sentence", "content": "dianamkirby.orgLinkedIn: diana-kirbyTwitter: @dianamkirby"}], "topic": "mental-health"}