{"title": "China Laos Railway", "data": [{"type": "subtitle", "content": "Travel | Modernization"}, {"type": "subtitle", "content": "A Modern Silk Road"}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*J_menEa4pjRn9z1QLvd1Sw.jpeg"}, {"type": "sentence", "content": "In the spring of 2018, my partner and I travelled to Asia. Near the middle of our trip we met friends in Laos.Together we explored the country, from the southern city of Vientiane to Luang Prabang in the north."}, {"type": "sentence", "content": "One morning after breakfast, we crossed the small river near our hotel using a bamboo foot bridge. We walked through the town and made our way to the Mekong River. There were wide concrete steps leading down to a collection of colorful river boats, arranged in a line."}, {"type": "sentence", "content": "We watched fishermen bringing their catch to restaurants, families travelling with school aged children and boatmen available to ferry goods to the other side."}, {"type": "subtitle", "content": "It was there that we met Phet, the boatman."}, {"type": "sentence", "content": "Phet brought us down to the shore and showed us where his long boat was moored with a long rope and an anchor dug into the sand."}, {"type": "sentence", "content": "The boat was long and skinny, with a passenger cabin that had two seats across, a narrow aisle up the middle and a roof for shade. There was a separate section in the front for the driver. Phet and his wife lived in a small cabin at the rear. The boat was painted in a rainbow of blues, red and yellow."}, {"type": "sentence", "content": "We talked to Phet about going on a river tour, but we’d seen many of the traditional tourist places so we wanted something different. After some discussion we settled on a trip to a pottery village, and a remote traditional village up river."}, {"type": "subtitle", "content": "It cost 50,000 Kip per person- about $5 US."}, {"type": "sentence", "content": "The river was wide and muddy and slow moving. You could see the current roiling just under the surface. As we journeyed upriver we passed villages and many boats that looked like they were also live-aboards. We arrived at the traditional village and he landed us on the edge of a low sandy shore."}, {"type": "sentence", "content": "Clambering up the bank, we found ourselves on a short wide dirt path that wound through a collection of houses. There might have been ten houses there, maybe 50 people in the whole village. The homes were mainly built with bamboo and woven reeds and we could see seaweed drying on racks in the yard. The roofs were mainly corrugated sheet metal."}, {"type": "sentence", "content": "Phet spoke with a local and they invited us into their home. There were two main rooms, very dimly lit by the sunshine coming through the doorway. They had limited electricity and proudly showed us their television blaring in the corner."}, {"type": "sentence", "content": "The inner walls were lined with stacked bags of rice. The owner told us (through Phet) it was the food for the family for a year. This tiny village also supported a temple (Wat) with 3 monks."}, {"type": "sentence", "content": "When we reached the top of the village, I was surprised to see a newly built rough gravel road. The villagers told us it was built by the Chinese and it was a haul road for the dump trucks."}, {"type": "sentence", "content": "After we asked more questions, they took us back down to the river and in the distance we could see immense concrete pillars under construction."}, {"type": "subtitle", "content": "It was a bridge, they said. For the train."}, {"type": "sentence", "content": "When I returned home I researched the project. It’s being built by the Laos-China Railway Co and much of it is likely finished by now. What we saw was the first of two bridges that will span the Mekong River. The span we saw was 1458 meters long, crossing a wide part of the river."}, {"type": "sentence", "content": "As we stood there on the side of a riverbank with the traditional village behind us, we were surprised, upset and impressed all at once."}, {"type": "sentence", "content": "It was unexpected to see such a juxtaposition of modernity and tradition."}, {"type": "sentence", "content": "The lives of the villagers are changing forever. All of the people on the route will be impacted by the access and the traffic. There will be benefits from increased access to jobs."}, {"type": "sentence", "content": "One local engineer was thankful that he had access to the modern training that was provided on the project."}, {"type": "subtitle", "content": "He’s teaching his children to speak Mandarin."}, {"type": "sentence", "content": "— —"}, {"type": "sentence", "content": "Tree is a writer for ILLUMINATION and Whispers of Magic. Follow her on Twitter and Facebook."}, {"type": "sentence", "content": "With gratitude*"}, {"type": "sentence", "content": "More reads: All Will Be Well where I write about connection and belonging and Whispers of Magic."}], "topic": "travel"}