{"title": "Saving Lives at Kilimanjaro", "data": [{"type": "subtitle", "content": "KPAP Partner Companies Carry the Load to Support the Mountain Crew During Covid-19"}, {"type": "image", "content": "https://miro.medium.com/max/6086/0*BiJUTjZ2YsnsFrt6"}, {"type": "sentence", "content": "In a normal year, some 50,000 adventurers of all ages and abilities flock to Tanzania to climb Mount Kilimanjaro, the massive savannah-to-sky volcano in northern Tanzania that tops off at 19,341 feet above sea level — the highest point in Africa. Of course, this year is anything but normal, and as Covid-19 forces travelers to cancel or postpone their climbing trips and subsequent safaris, the communities of Moshi and Arusha — gateways to Kilimanjaro and the Ngorongoro Conservation Area — are facing a staggering loss of income on top of the unpredictable health concerns brought by the novel coronavirus."}, {"type": "sentence", "content": "“It’s really frightening to see there is no immediate future in tourism,” confides Wilfred Moshi, a porter-turned-guide who has helped realize Kilimanjaro expeditions since 1999 and now runs Kili Treks Tanzania. “How will we survive?” Julie Veillette, a longtime Arusha resident originally from Canada who operates East African Voyage with her Tanzanian husband, is more blunt: “We need to find solutions. We’re talking about how to save our staff from starvation.”"}, {"type": "sentence", "content": "The gravity of the financial and health concerns becomes more clear when you consider that 49 percent of the Tanzanian population is living below the international poverty line of $1.90 per person per day, according to the World Bank, and there are not the safety nets seen in more developed countries, like unemployment assistance, severance pay, paid leave, and health coverage."}, {"type": "image", "content": "https://miro.medium.com/max/2304/1*s2ETi3WHqOPd-PhiZgkdYg.jpeg"}, {"type": "sentence", "content": "Finding solutions is exactly what an impressive collaboration of local and international Kili tour operators — including Julie and Wilfred — has been laser focused on for the past eight weeks. Unified by their partnership with the nonprofit Kilimanjaro Porters Assistance Project (KPAP), their group began weekly calls in mid-March and has been encouraging one another, sharing best practices, seeking out what the local staff needs, and developing ways to provide it ever since."}, {"type": "sentence", "content": "Alexandra Pastollnigg, founder of Fair Voyage, a KPAP partner based in Switzerland, initiated these calls. “With Italy in my backyard, I saw how fast Covid-19 could spread,” she says, “and having researched the economic importance of tourism for more vulnerable countries, I was aware that a cancelled Kilimanjaro climbing season would be catastrophic for people in Tanzania.” In mid-March, Alex jumped on the phone with KPAP Program Manager Karen Valenti and emphasized the importance of responding quickly and collaborating as an industry, and suggested they have weekly support calls to brainstorm the best way forward for their companies and staff. KPAP, Alex knew, was the voice that could bring them together."}, {"type": "subtitle", "content": "A Small Nonprofit with a Big Mission"}, {"type": "image", "content": "https://miro.medium.com/max/9982/1*6KgOqUeHYoRlFsC5gNy3jA.jpeg"}, {"type": "sentence", "content": "Since it launched in 2003, KPAP has worked tirelessly to improve the working conditions of Kilimanjaro’s mountain crew, especially its porters, a disadvantaged group that has experienced the most egregious exploitation and mistreatment over the years. In addition to offering free resources like a gear-lending program and classes in English, first aid, and Leave No Trace environmental care to mountain crews, KPAP has established standards for fair treatment and a rigorous monitoring system to ensure that the companies participating in their Partner for Responsible Travel Program are in compliance. Guidelines include providing porters, cooks, and guides — all independent contractors — with a minimum wage, three meals a day, and proper tents while climbing, as well as equal work opportunities, a transparent tipping procedure, and a direct connection to management."}, {"type": "sentence", "content": "“KPAP is the only monitoring and compliance organization of its kind to ensure fair treatment of porters and crew,” explains Melissa Foley, a sustainable travel and marketing expert who lived in Moshi for three years and is now based in Cape Town, South Africa. She is also a Fair Voyage advisor, and board member for the International Mountain Explorers Connection (IMEC), which started and advises KPAP. “Through KPAP, climbers can verify which companies offer ethical climbs.”"}, {"type": "sentence", "content": "Out of the 300–400 Tanzanian businesses operating Kili treks, 47 are local KPAP Kilimanjaro Outfitter Partner companies (42 of which have Tanzanian directors). KPAP counts another 110 partners, which contract their expeditions with Kilimanjaro Outfitter Partner companies. (A full list of partners can be found here.) Thanks to KPAP, approximately 7150 porters — about a third of the total number working on the mountain — are protected while trekking, have earned respect as part of the team, and are being recognized by company management. “Porters are feeling more empowered,” reports Karen. “They are building houses and sending kids to school instead of drinking away their pay.”"}, {"type": "sentence", "content": "Still, the modest wages from their seasonal work only go so far, and most will be needing income again come June, when visitors usually begin to return after the rainy season. Without tourism, they are wondering how they will make ends meet. “The coronavirus came as a shock to me,” Damasi Magige, a porter of 20 years, explains through a Swahili translator. “It came so suddenly; there was no time to prepare.” Gasper Gidale, a porter and camp manager with 7 years on the mountain, chimes in, “We need to do other work, whatever it is.” Ibrahim Assenga, a porter of 6 years, confides, “I do not have the means to find alternative sources of income to meet the daily needs of my family.”"}, {"type": "sentence", "content": "Considering KPAP’s proven record of advocating for the mountain crews, it makes sense that the non-profit is reorienting to help them in this new situation. According to Ake Lindstrom, founder of Arusha-based KPAP partner Summits Africa: “KPAP has stepped up in a massive way, going way beyond their mandate. They’ve provided an incredible place to share ideas. It’s that platform that we never thought we would need or use.”"}, {"type": "subtitle", "content": "Sounding the Alarm"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*nSc0soSblccN7JA3"}, {"type": "sentence", "content": "The first KPAP conference call zeroed in on how to spread the warning to all partner companies and crews: Covid-19 is coming and the tourists are not. Because it was rainy season, many mountain crew members were at home in their villages and out of easy reach. Each partner company selected a representative to relay the emergency messages to their crews, however they could. Most porters do not have smart phones or internet access, so elaborate phone trees and texts translated into Swahili shared information about washing hands, social distancing, and making food, farming, and savings go as far as possible."}, {"type": "sentence", "content": "KPAP partner Local Moshi Adventures also pioneered a mask-making and -distributing effort, understanding that the mountain crews and their communities would not be able to afford the protective devices. “We found that people preferred washable, locally made masks in Tanzanian fabrics,” co-founder Anya Beutler explains, so the company hired women in small villages to sew masks using materials that it provided. The women have been producing 50–60 masks per day, and more than 1600 have been donated."}, {"type": "subtitle", "content": "Addressing Food Security"}, {"type": "image", "content": "https://miro.medium.com/max/8512/0*pyw83vokaM34QgKm"}, {"type": "sentence", "content": "“We knew we didn’t have all the answers,” reflects Alex about the conference calls, which she continues to attend each week, acting as contributor, secretary, and tech support. “Even the local companies didn’t pretend to know what was best for their mountain crews. Instead, they asked their crews directly what would be most helpful in that moment and how they might make a living in the coming months. It was with their input that the most effective solutions were generated.”"}, {"type": "sentence", "content": "Some mountain crew members have other gigs to supplement their expedition work, like running a small restaurant or shop (often overseen by their wives), but those too will be out of business with no travelers to serve. “The only industry that will continue is food,” Julie asserts, and indeed, the mountain crews conveyed to KPAP that what they need most right now is access to food and farming."}, {"type": "sentence", "content": "With this feedback, Ben Jennings hopped into action. The founder of Arusha-based E-Trip Africa and a good friend to KPAP, Ben tapped his networks in Tanzania and Kenya to obtain and share information on farming best practices and he compiled a massive database on farming techniques, harvesting, crops, and raising animals, largely amassed during his days in the Peace Corps in Cameroon. “I hope all partner companies use this information to make their farming more efficient. My goal is to help porters feed their families through this crisis and to earn enough money to buy other food (like meat and bread) and to pay for health costs and school fees.”"}, {"type": "sentence", "content": "Summits Africa, which regularly employs about 400 porters, is focused on developing farming opportunities that will provide for the long term. Just back from planting seeds with his mountain crew, Ake explains, “Now, it’s turning into a different journey, but we’re not straying away from our teams. We’re literally planting seeds side by side and trying to figure out if things are going to turn around in a few months, or if it’s all going to fail. We’re taking risks side by side.”"}, {"type": "sentence", "content": "Summits Africa has rented a little land that the team can farm together, and the mountain crew has set up a SACCOS, a cooperative that provides financial services and education to its members. About 100 people have gotten involved so far, and Ake hopes that number will grow. “Farming is hard work and returns are risky,” he explains, “so people have been reluctant to put down the investment (about $10) required to join. They need to see proof that it’s working.”"}, {"type": "sentence", "content": "East African Voyage called together its team to find out who had land, who had farming experience, and who had ideas. One of the head guides, Victor Kinyonga, immediately offered to make available for farming the 10 acres he has set aside in southern Tanzania for retirement. The company has also begun renting arable land near Arusha for farming and is hoping to launch a poultry project to give other crew members access to work and food. (East African Voyage contracts with about 200 porters.) To help with the up-front investment for these initiatives, Julie set up a GoFundMe page on April 22 and has raised $5,230 so far, about a third of her goal. As a backup plan, she is collecting food reserves — maize, rice, and beans — to be rationed to the most vulnerable porters in July and August."}, {"type": "sentence", "content": "KPAP partner Duma Explorer also launched a GoFundMe campaign to support their trip staff of about 200. They have raised $9645 from 83 donors since April 10."}, {"type": "subtitle", "content": "Business Matters"}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*gl1ygpqfZa3tiQmaUUDjXQ.jpeg"}, {"type": "sentence", "content": "Like tour operators all over the world, Kilimanjaro outfitters have been hit with a tidal wave of cancellation requests. When KPAP partner companies expressed the need for guidance, Melissa and Ben ran a workshop on cancellation policies and best practices, encouraging discussions about individual goals and the implications of refunds versus credits. “The idea was to present companies with ways to think through the process and develop their own policy, not tell anyone what to do,” Ben explains."}, {"type": "sentence", "content": "Melissa is providing KPAP with a steady stream of support materials, such as tourism handbooks and information about consumer protection laws, communication strategies, and post-Covid safety protocols, which are then shared with the partner companies. She will also be conducting social media training."}, {"type": "sentence", "content": "Because so many issues were coming to light, the KPAP conference-call collaborators launched a second weekly virtual meeting that features guests speaking on topics of special interest to the local partner companies. For example, an accountant offered tips on dealing with the tax authority, agriculture experts made planting recommendations, and representatives from the national tourism board are due to share insights. All partner companies are encouraged to participate and gain information they would likely not have access to otherwise."}, {"type": "sentence", "content": "While helping each other during a pandemic seems like the right thing to do, there is more at stake. “Companies play a large role in determining the treatment of porters,” Ben explains, “so if we can help KPAP partner companies survive this crisis, then the KPAP mission lives on. If KPAP partners fail, then more clients will go with less ethically minded companies, which rewinds the clock to when so many porters were being exploited.”"}, {"type": "subtitle", "content": "Looking Toward the Future"}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*zVT1rMRDA9kFX0VG9SLTBg.jpeg"}, {"type": "sentence", "content": "As of May 15, Tanzania has officially reported 509 covid-19 cases and 21 deaths. Residents are required to wear masks, social distancing is encouraged, and schools are closed, but no stay-at-home order has been imposed and businesses and places of worship remain open. Karen is carefully watching what’s happening at home and around the world, concerned about the challenges that the local population and medical facilities will face if the virus gains momentum in Tanzania."}, {"type": "sentence", "content": "But for now, she is hopeful. Covid-19 has changed KPAP’s focus to equipping the Kilimanjaro mountain crews with a new set of critical skills. “This is going to help them in the off-season,” she explains, “which could mean improved sustainability and less dependence on the mountain.” If the new agricultural projects prove successful and are kept in place, they may make partner companies less reliant on tourism, too."}, {"type": "sentence", "content": "Whenever tourism returns to this corner of northern Tanzania, the landscape of outfitters offering treks and safaris will undoubtedly have changed. At the start of this pandemic, Tanzania was oversaturated as a tourism market, and as a result, some operators were offering cheap Kilimanjaro climbs and lowering standards. When companies underbid each other, it’s the mountain crews that suffer because the other operating costs are fixed."}, {"type": "sentence", "content": "“Many local companies are unlikely to survive this crisis,” Melissa admits. “Innovation and new product development will be necessary to fill the gap. Although bittersweet, this shift of quality versus quantity will have tremendous potential to raise the market standards and therefore the conditions of workers, creating more sustainable margins for companies and better service for visitors.” If travelers emerge from their stay-at-home orders with increased consciousness, as many experts predict, their demand for more ethical and sustainable travel choices can only drive the market in this positive direction."}, {"type": "sentence", "content": "A less optimistic approach is that competition for new business will be so fierce that commitments to standards and porter welfare will go out the window. To make matters worse, travelers may feel extra price sensitive, having just weathered a major economic downturn. Duma Explorer is already getting calls from potential clients eager to get to Kili as soon as flights lift off again, but also asking for steep discounts and waived deposits. “With all that is going on, it’s understandable,” Stacy reports, “but it is not a sustainable approach for companies and in the end, it hurts the mountain crews.”"}, {"type": "sentence", "content": "This predicament underscores the responsibility of each traveler to carefully evaluate where their money is going when they book a Kili climb — or any expedition, for that matter. Is the investment supporting or harming the community? By insisting on using an outfitter that provides fair and ethical treatment for their porters, camp cooks, and guides, a traveler has the power to affect lasting change."}, {"type": "subtitle", "content": "How to Help"}, {"type": "image", "content": "https://miro.medium.com/max/2800/1*eufY4x5q7EpQYNaOwAZ7eA.jpeg"}, {"type": "sentence", "content": "Anyone wishing to support KPAP’s efforts is invited to visit IMEC/KPAP. Ideas, expertise, and insights on helping the local community through this pandemic are welcome."}, {"type": "sentence", "content": "When it’s time to head for the Kilimanjaro summit, travelers should consider climbing with a KPAP partner company to ensure ethical treatment of the mountain crew."}], "topic": "travel"}