{"title": "A healthy way of working: What I learned from three years of freelancing", "data": [{"type": "image", "content": "https://miro.medium.com/max/10940/1*7R-M2zKWUOnHlNVbw_Hg5w.jpeg"}, {"type": "sentence", "content": "A few years ago, I swapped my office job as a healthcare PR consultant for self-employment. Hello freedom! I could finally decide for myself when, how and where to work. In addition to all the euphoria, at a certain point, problems also arose — for example, when it came to maintaining healthy structures, which is not so easy when the familiar office environment, which includes built-in colleagues, breaks and regular working hours, is no longer available. As freelance writers and editors, however, our income depends on being fit and able to work productively. This is reason enough to take a closer look into sustainable, healthy ways of working!"}, {"type": "subtitle", "content": "Ergonomics: I will never go back"}, {"type": "sentence", "content": "I don’t want to be a moral apostle, but the big annoyance that small ergonomics problems can ultimately cause has recently been described by Scribbr senior editor Shane in “A Cautionary Tale of Tendons And Terrors”. An ergonomic office therefore makes perfect sense. Fortunately, at least at home, I had used an ergonomic setup from the beginning."}, {"type": "sentence", "content": "But things were different when I began to work while traveling. Who needs an extra monitor when you are on the go? Instead, I’d just work with my laptop! What initially sounded so uncomplicated eventually resulted in extremely painful tensions. Beyond new hardware, only intensive yoga helped me resolve them — my personal wake-up-call because at that time, I was not really into yoga."}, {"type": "sentence", "content": "Since then, I have always made sure to have at least an external keyboard and my ergonomic mouse and mouse pad with me when I’m on the road. In addition, I position my laptop slightly higher to improve my sitting position. This way, I avoid having to look down constantly (and in doing so prevent back pain). Scribbr’s community manager Nicole advises remote workers to use a laptop stand — and I second this recommendation. If you have no other option, you can improve your setup by setting your laptop on books or a box, which is better than nothing."}, {"type": "sentence", "content": "I also always try to find a workplace abroad that offers chairs and tables that are reasonably suitable for my size. For example, your feet should be able to stand flat on the floor (you may need a footrest if you are not very tall), and the elbows should be at right angles (pillows can help). All this will probably cause some effort, but these slight ergonomic adjustments have really made a big difference for me while working remotely."}, {"type": "subtitle", "content": "Why breaks pay off so much"}, {"type": "sentence", "content": "The more I got used to working solo, the more I neglected my breaks. I thought, “I’ll just finish writing one last paragraph or fix one last mistake.” Before I knew it, I’d used 1 of 1,000 possible reasons to postpone my lunch break again and ultimately missed it. It didn’t really make me any more productive. And prolonged sitting is also not desirable for your health. After all, we keep reading that sitting is the new smoking."}, {"type": "sentence", "content": "So, get up and move — even without the colleagues with whom I could have coffee breaks or casual chats. To discipline myself, I started using a timer app. It now reminds me to take a short break of a few minutes at least once an hour. In addition to my tea refill, I try to use this time for some physical activity, such as stretching or sun salutations (yoga and I have become really good friends). But my timer app still remains just that: an app. Unfortunately, during stressful times, I still click away the alarm. That’s why I try to meet people for lunch as often as possible. Spending one hour with like-minded people not only brings more activity into your day, but also prevents freelancer loneliness."}, {"type": "subtitle", "content": "More no-screen time: A good choice for the eyes"}, {"type": "sentence", "content": "My eyes are also very thankful for some discipline regarding breaks. Irritated, red and dry … does that sound familiar to you? Staring at the screens of our laptops, phones and tablets continuously can be very exhausting for the eyes. Experts therefore recommend frequent breaks, during which you should deliberately look at a distant object. For example, according to the 20–20–20 rule, you should look at a faraway object at least 20 feet away every 20 minutes for not less than 20 seconds."}, {"type": "sentence", "content": "I also make sure to keep distance between my eyes and the monitor. An arm’s length should do it. Besides that, it’s helpful to reduce your overall screen time by, for example, avoiding videos and Slack during your lunch breaks — which, admittedly, is not easy. When I check the screen time function on my iPhone, I am sometimes surprised by the number of hours I spend on my phone. Once I add in my laptop use, it’s quite a lot. Now, I’m trying to balance out my screen time by sitting at the window while I have my meals — without my phone."}, {"type": "subtitle", "content": "Fight snacking with consciousness"}, {"type": "sentence", "content": "Taking your time to enjoy your meal in the absence of screens is not only helpful for stressed eyes. I also find it’s beneficial for my calorie count. You might recognize this scenario: In very stressful times, I tended to eat far too much on the side while working. After all, the refrigerator is available 24/7 when you work from home. However, with this behaviour I didn’t really notice the food: it didn‘t satisfy me, and my favorite pants eventually sounded the alarm to me."}, {"type": "sentence", "content": "That’s why I switched to eating more consciously and only during my breaks. In between, I drink a lot of water and ginger tea. When I snack, I (mostly) stick to vegetables and fruit. By the tenth slice of cucumber, my appetite wanes. With chips or chocolate, this natural limit doesn’t seem to exist for me. I’ve also achieved some first successes regarding conscious eating and relaxation with mindfulness exercises. However, this personal study is still a work in progress."}, {"type": "subtitle", "content": "Back to the comfort zone of a 9-to-5?"}, {"type": "sentence", "content": "All that self-discipline around freelancing — is it really worth it? In my opinion, definitely yes! With a few tricks, I managed to work healthier and create the basis for a long-lasting freelance career. In return, I feel rewarded with freedom that I don’t want to give up any time soon."}], "topic": "freelancing"}