{"title": "Is that a lot, or is that a little?", "data": [{"type": "subtitle", "content": "The answer to the question is often far from clear-cut, and we may be easily misled — by others and by ourselves"}, {"type": "sentence", "content": "Imagine you have ended up in a foreign country that you have never visited before. You have no local currency on you but, remarkably, the taxi driver accepts your credit card. You ask him how much he would charge you to take you to your hotel, which you know is about 8km from where you are now. He says that would cost 250 monetan. Is that expensive or cheap?"}, {"type": "sentence", "content": "Without anything to compare this with, the amount is clearly meaningless. Knowing the exchange rate might help at least convert it into your home currency. But perhaps you rarely take a taxi at home, so even knowing how many pounds, euros or dollars a moneta is might still not tell you the whole story. And even then, perhaps the going rate for an 8km taxi ride in this country is 50 monetan, and the taxi driver is ripping you off."}, {"type": "subtitle", "content": "No certainty without context"}, {"type": "sentence", "content": "Numbers give us a sense of certainty, but they don’t tell us anything if there is no context. In a foreign country with a currency we are unfamiliar with, we are keenly aware of this. If we cannot compare the price of one good or service with what other goods and prices cost, with what a similar good or service would cost in our own country, or with what we could buy at home with the equivalent amount, the proposition by the taxi driver may just as well have been for 250,000 monetan, or 2.5."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*FwbH1v6V6_ohF8lNM_hTow.jpeg"}, {"type": "sentence", "content": "And it is not as if there is just one single context. If you can buy a sandwich for 250 monetan, then the taxi drive seems cheap, but if the moneta is at parity with the pound, the euro or the dollar, it’s rather pricey for an 8km drive. (Both can be true at the same time, by the way.)"}, {"type": "sentence", "content": "Because numbers need context, if we don’t have one, we will make one up. If we don’t know whether 250 monetan is a lot or a little, we’ll think of 250 pounds, 250 euros or 250 dollars as a reference. We will not actually equate the two currencies but, failing anything better, a taxi ride costing 250 monetan will feel expensive, and one costing 25 monetan cheap."}, {"type": "sentence", "content": "We don’t even need fictional foreign currency for such implicit comparisons. I remember hearing, back in the 1990s, someone mention that British Telecom made a profit of over £3 billion, or “more than £5,000 per minute “. Now, £3 billion is, even 25 years on, a large amount of money that is hard to evaluate for ordinary mortals. The attempt to convert it to something that speaks more to the imagination is, in itself, laudable, but what do most people think of when they see an amount of £5,000? Many will compare it with their salary. The average person in 1995 had to work for three months to earn what BT makes in profits in one minute. A correct observation, but does it help us evaluate the significance of this amount? Can we say whether BT’s profit is a little or a lot, excessive or disappointing, given this context? Not really. Will that stop us drawing a conclusion? You probably know the answer."}, {"type": "sentence", "content": "We can even leave money behind altogether, and still find ourselves harbouring assumptions that lead us to unwarranted conclusions. In a recent essay, Professor Sir David Spiegelhalter, the closest thing to a risk and uncertainty guru the UK has, calculates that “compared to a 20-year-old, an 80-year-old had ~ 500 times the risk of dying from COVID [over the 5-week period from 28th February to 1st May]”. Is that a little, or a lot? Of course, as one might expect, the good prof provides plenty of context in his article for us to get to the bottom of it. But how would most people interpret a newspaper headline like this? 500 times the risk of dying sounds pretty dramatic. (As it happens, Prof. Spiegelhalter’s approximation is a little off — the risk doubles every six years, not every six-seven years, which means that over a 20-year age gap the risk increases around 10-fold, not 8-fold. This in turn means an octogenarian is at 1,000 times the risk of dying compared to a vicenarian*. If anything, this amplifies the effect, of course.) But unless we know 500 (or 1,000) times what, what can we really conclude?"}, {"type": "sentence", "content": "Looking at the data table in the article, we see that the actual risk for a 20-year old male is about 1 in 200,000, and that of an 80-year old male is indeed just over 1,000 times higher, at 1 in 179. A little or a lot? Well, it’s still not so easy to say."}, {"type": "subtitle", "content": "In search of the right context"}, {"type": "sentence", "content": "We can look at what would happen in the absence of this pandemic. The baseline risk of dying for a man in the 80–84 age range is a little higher than that of dying of COVID-19, at 1 in 155. If there was a group of, say, 179 80-year old men on 28th February in a normal year, five weeks later there would be 178 still alive. Now, with the novel coronavirus spreading around, it would be 177. This perspective is a long way from what the figure of 500 or 1000 suggested."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*0G7iW9khS0tLSYjq"}, {"type": "sentence", "content": "Because for someone in this demographic, the risk of dying of COVID-19 in that 5-week period is about the same as the baseline risk, we can also say the pandemic has nearly doubled the risk. For a man between 20 and 24, that increase is 11%. We might therefore just as legitimately conclude that the increase in the risk of dying as a result of the virus for an 80-year-old man is less than 10 times greater than for a 20-year old man. Again, quite different from the 500 (or 1000 times) factor, which seems not remotely as informative as we might have thought."}, {"type": "sentence", "content": "We cannot help comparing, though. (I wrote about our comparing minds before.) The work of researchers like Dan Goldstein and Jake Hofman can produce give meaningful context to numbers (see this piece), but in the meantime we often have to simply construct our own."}, {"type": "sentence", "content": "And our conclusion — a little or a lot — often hinges on what we use (or are given) as a reference point. This creates opportunities for nudging for good, as illustrated in a new research by Hal Hershfield, a psychologist at the University of California, Los Angeles and colleagues. They tested different ways of presenting a saving programme, and found that framing deposits as daily rather than monthly amounts quadrupled the number of people who enrolled. More strikingly still, they found that, with a suggested deposit of $150 per month, the number of participants in the highest income bracket was three times the number in the lowest bracket. When the deposit was presented as $5 per day, the difference in participation rate was eliminated."}, {"type": "sentence", "content": "But it also creates opportunities for manipulation. If the context can make a little look like a lot, and a lot like a little, astute people with a particular agenda can select the one that furthers their cause. At the Twitter account @justsayrisks, Gideon Meyerowitz-Katz, an epidemiologist at the University of Wollongong in Australia, regularly shares examples of somewhat sensationalist use of relative risks in media headlines — like the recent Daily Mail claim that coronavirus patients with vitamin D deficiency are twice as likely to die, whereas the absolute risk increase is just 1%."}, {"type": "sentence", "content": "A little or a lot? It often depends. Be on your guard that you are not getting the wrong answer."}, {"type": "sentence", "content": "* Yes, I had to look it up, too."}, {"type": "sentence", "content": "Originally published at http://koenfucius.wordpress.com on May 22, 2020."}, {"type": "sentence", "content": "Thank you for reading this article — I hope you enjoyed it. Please do share it far and wide — there are handy Twitter and Facebook buttons nearby, and you can click here to share it via LinkedIn, or simply copy and paste this link. See all my other articles featuring observations of human behaviour (I publish one every Friday) here. Thanks!"}], "topic": "economy"}