{"title": "All the Questions to Ask Your General Counsel Right Now", "data": [{"type": "subtitle", "content": "Decisions made during a crisis can have legal consequences down the road"}, {"type": "image", "content": "https://miro.medium.com/max/11520/1*vl6OVg_1Rdrg4AuuRNzL6Q.jpeg"}, {"type": "sentence", "content": "Leaders are often faced with in-the-moment decisions armed only with imperfect information and limited experience to predict the consequences of their decisions. These decisions are difficult during good times, and feel near impossible during uncertain times. We are all eager to make the decisions necessary to return to some sense of normalcy. However, the consequences of the decisions we make as we seek out this new normal will reveal legal liabilities for companies of all sizes."}, {"type": "sentence", "content": "As cities lift their shelter-in-place policies and businesses strategize how to reopen, now is a prudent time for leaders to create a proactive game plan with their lawyer or general counsel to avoid legal mishaps in the future. While there isn’t a roadmap or proven plan for a Covid-19 business world, there are some basic principles you can adopt while navigating an uncharted path. These are the same principles we turned to when launching our company last year and will continue to turn to during uncertain times: focus on the fundamentals, avoid easy-to-miss foot faults, and always understand your fiduciary responsibilities."}, {"type": "subtitle", "content": "Focus on the fundamentals"}, {"type": "sentence", "content": "Any business has to do a few basic things to survive: build a product that people want, figure out how to attract the resources (human, financial, etc.) necessary to develop and bring that product to market, and generate revenue and profits so the business is self-sustaining. In doing these things, you set up expectations (some explicit, others less so) for your stakeholders. There are several actions you can take during a crisis to continue proving that your business is functioning while also working with your lawyer to avoid any legal pitfalls."}, {"type": "sentence", "content": "As a starting point, you need to know your real runway. Create a runway model that assumes your demand and retention is reduced by some percentage and that anticipated funding won’t come in when you expect it to. The percentage will depend on your business. Most companies may choose 30%–50%. (If you’re in an industry like hospitality, that is largely on pause due to shelter-in-place restrictions, you may choose a higher number.) No matter what percentage you choose, remember that your real runway is likely much shorter than you think."}, {"type": "sentence", "content": "Next, look at opportunities to extend your runway. Start with dusting off your contracts because you’ll need to start looking for opportunities to exercise rights you already have in your contracts. What contracts are coming up for renewal and when? Will they automatically renew if you don’t proactively notify a vendor that you’re discontinuing services? What opportunity do you have to negotiate better terms? What’s the worst thing that happens if you decide to default? Ask your lawyer about “efficient breach.” They’ll likely smile, remembering first-year contracts, and then talk through whether it makes sense to reserve for anticipated damages if you decide to walk away from the contract."}, {"type": "sentence", "content": "Vendors, landlords, and lenders aren’t likely to make an exception to your contracts to let you out early, reduce costs, or get out of an auto-renewal window that’s already passed. Your best bet will be leveraging terms you negotiated before you even heard of Covid-19."}, {"type": "sentence", "content": "That’s not to say you won’t find some flexibility. If you need a short-term deferral of payment obligations, ask the vendor if they would be willing to change the payment terms to allow for a longer period of time. Or perhaps your landlord is open to a rent abatement if you agree to a longer term lease. You may be met with a quick “no,” but you won’t know if you don’t ask."}, {"type": "sentence", "content": "If you need to reduce people costs, do it the right way. If you’re thinking about this cost-saving measure, the first thing to do is talk to an experienced employment lawyer. They work on reductions for companies of all sizes and situations and will pull from their experience to help you design a plan that works best for your business and help you avoid mistakes they’ve seen other clients make. Handling any employee dismissal can be a stressful and legally-fraught moment — all the more so in our current environment."}, {"type": "sentence", "content": "Once you’ve identified your cost-savings measures, clearly communicate these with your stakeholders. Start by identifying who your stakeholders are. In most cases they will be your board, your employees, and any key partners or major customers."}, {"type": "sentence", "content": "If you haven’t done so already, you should proactively update your board about any changes you need to make to your operating plan, cost structure, capital needs, product roadmap, etc. Your board wants you to be successful and this is an opportunity to ask for help. Is there an introduction they can make? Is there someone at their fund or company that can advise you on cost reductions? Are they open to extending a bridge loan to help with any short-term funding needs?"}, {"type": "sentence", "content": "Employees will be understandably nervous. They are likely reading the same news you are about term sheets pulled, startups folding, and well-respected companies of all sizes are making the difficult decision to lay off employees. Be empathetic and be honest with your team. Don’t paint a rosier picture than actually exists. Don’t promise that you won’t have any layoffs if you’re not sure you can stick to your word."}, {"type": "sentence", "content": "Key partners or suppliers will likely ask about your financial situation. These requests may seem sudden, but quick, thorough, and honest responses will help maintain and build your relationships. Misleading people in such moments can easily land you in a pile of legal trouble."}, {"type": "subtitle", "content": "Avoid easy-to-miss foot faults"}, {"type": "sentence", "content": "The “new normal” will look anything but normal. While you’re sorting through what you need to do to get employees back to the office or optimize a new semi- or permanent remote work structure, it is easy to trip into small errors along the way."}, {"type": "sentence", "content": "If you’re returning to the office, carefully follow local city, county, and state guidance. Many counties and cities have more conservative rules than states, so even if your state has relaxed certain business operational restrictions, that doesn’t mean your city will permit you to return to the office."}, {"type": "sentence", "content": "Local restrictions may require you to reduce the number of employees in an office at any given time, restrict access to common amenities (like the kitchen or multi-stall bathrooms), or close conference rooms. Your lawyer can help you sort through the particulars of your locality and any variations for offices in other locations."}, {"type": "sentence", "content": "From a practical perspective, you may have employees who rely on public transportation operating on alternative schedules or have unsolved child care needs. Consider asking employees directly what they need to support a successful return to the office. It may be as simple as paying for parking or more complicated, like additional support in a remote work environment for an extended period of time."}, {"type": "sentence", "content": "Job responsibilities may have changed amid the shift to remote work or in the return to the office. You should carefully review the job duties of all team members to ensure they are still properly classified and paid. Even pre-Covid-19, it was very common for job duties to change quickly at startups. Employees who were once exempt from overtime may be performing different job duties that now make them eligible. Your lawyer or human resources lead can quickly take you through an assessment to determine who should be eligible for overtime and how to transition team members to a new compensation structure."}, {"type": "sentence", "content": "While you’re focused on employee pay, remind managers to discuss time cards with their nonexempt team members. In a semi- or full-time remote environment, it is easy to work extended schedules and nonexempt employees must be paid for all hours worked, even if those hours are worked at different times than normal or on the employee’s own initiative instead of at a manager’s request."}, {"type": "sentence", "content": "Finally, whether you’re returning to the office or staying remote for an extended period of time, managing individual and team performance is more critical than ever. The fundamentals of performance management (thankfully) remain the same. Be clear in your expectations, be fair in your measurement of performance against expectations, and be consistent in your feedback. Your lawyer will tell you that the number one way to manage legal risk in performance conversations is to follow up on every performance conversation with an email summary — as painful as it may be (and yes, they know it’s painful)."}, {"type": "subtitle", "content": "Understand your fiduciary responsibilities"}, {"type": "sentence", "content": "As a founder or CEO, there are two key fiduciary duties to keep in mind: duty of loyalty (always acting in the best interest of both the company and its shareholders) and duty of care (carrying out duties with the requisite degree of care and prudence)."}, {"type": "sentence", "content": "Your duty of loyalty requires you to always act in the best interests of both the company and its shareholders. Most leaders take this to mean that you are acting to maximize company and shareholder value. As a founder, you’re probably also a shareholder, and likely to personally profit from an increase in shareholder value. While that’s okay, you must put your personal preferences and interests aside when making a decision that you may benefit from. Consider proactively pulling in your attorney to help you identify and manage potential conflicts of interest."}, {"type": "sentence", "content": "To satisfy your duty of care, you should seek the information necessary to make a decision. You may want to consult your lawyer or an outside advisor. There’s no perfect answer. The most important thing to do is to seek the information you need to make a decision and keep a clear record of the information you’re looking at and your process along the way."}, {"type": "sentence", "content": "Finally, when managing fiduciary duties, be flexible based on the changing conditions. What worked before may not work now. For example, you may have calculated your real runway assuming your biggest customer was going to renew, only to find out that they, too, are cutting their costs and have regrettably decided to cancel. While you may not be able to save the renewal, you can make your stakeholders aware of the unexpected change, your next steps, and any decisions and their outcomes."}, {"type": "subtitle", "content": "You know your risk best"}, {"type": "sentence", "content": "Entrepreneurs will almost always understand their own risks the best — you should certainly weigh counsel from others close to you and your business. You’re closest to the details necessary to form a view on your business’s situation, and a vision for how you need to evolve your situation to survive and thrive. Be honest with yourself and those around you. Proactively identify risks — including legal ones — and figure out which risks you can mitigate. At a certain point, you’ll need to trust yourself, focus on your fundamentals, be mindful of unforced errors, seek the information you need to make a decision, and then decide and move on. Because at the end of the day, the person that knows your business and your business’s risk best is you."}, {"type": "sentence", "content": "Co-authored by Kelly Wulff, General Counsel at Vouch Insurance"}], "topic": "leadership"}