{"title": "How Mindful Scrolling Can Help You Grow on Instagram", "data": [{"type": "subtitle", "content": "Marketing is not an exact science; it’s all about a relationship between a creator and a user"}, {"type": "image", "content": "https://miro.medium.com/max/12032/0*kVtpe0hC2hqNuQqR"}, {"type": "sentence", "content": "If you’ve been interested in learning about Instagram marketing, you are probably overwhelmed by the amount of information and rules you just discovered."}, {"type": "sentence", "content": "You read that you should post once per day, use hashtags, bring value, have engaging captions, post at the right time, use the right filters, make sure your feed looks pleasant and harmonious, have a nice and clear bio, the proper Instagram handle."}, {"type": "sentence", "content": "It’s a lot of information to understand and process, that’s for sure."}, {"type": "sentence", "content": "Because of all these new techniques you just learned, you might even be stressed to post on Instagram now. “What if I’m not posting at the optimal time?” “What if my post doesn’t look that great in my feed?” “Should I use 7 or 13 hashtags on this post?”"}, {"type": "sentence", "content": "At least, I’ve been there when I started to learn more about social media. I wanted all of my posts to be the most optimized possible, I was tracking every single source of insights and analytics I could, and I was making sure I was learning from my mistakes."}, {"type": "sentence", "content": "Instagram became a major source of anxiety for me. The hardest to handle, for me, was the amount of information available online. You could read something and the radical opposite on the same blog. I spent most of my time fact-checking what I was learning and testing it to see if it was true or not."}, {"type": "sentence", "content": "One principle helped me get out of this Instagram obsession."}, {"type": "sentence", "content": "This one principle is very simple and very obvious, but trust me on this, it’s very powerful, and it can be life-changing for you."}, {"type": "sentence", "content": "This principle is: pay attention to how you use Instagram and create content you would engage with."}, {"type": "sentence", "content": "I told you it was simple. Don’t leave this page just yet. Let me explain why this principle might be better for you than most of the information you read about Instagram in the past few weeks."}, {"type": "subtitle", "content": "There’s No Chronological Feed on Instagram"}, {"type": "sentence", "content": "So why bother posting at the most optimal time? Do you scroll Instagram at “the optimal time”? No, when you’re bored, you open the app and check out the posts that Instagram decided to show you."}, {"type": "sentence", "content": "It doesn’t matter at what time you post. As a user, if you’ve engaged a lot with an account, you’ll see it on top of your feed when you open the app."}, {"type": "sentence", "content": "It’s the same thing with your content. You don’t have to get nerdy with your analytics, just post during the day. Posting at 6:30 pm instead of 6:10 pm won’t make any difference. Once your content is published, it will hopefully get some engagement, and from there, it will still be seen by your audience for the next 18 hours or so."}, {"type": "sentence", "content": "So stay away from this “Post at the specific time” kind of rule."}, {"type": "subtitle", "content": "You Follow Accounts That Bring Value to You"}, {"type": "sentence", "content": "Open Instagram, take a step back and try to analyze why you follow the accounts you follow. Try to understand the more profound value that you are getting from following these accounts. When you scroll and skip an entire post, try to understand why you do that. I call this exercise the Mindful Scrolling."}, {"type": "sentence", "content": "Of course, there are no universal conclusions for this exercise. For example, I skip posts from brands and people that only show-off or brag about themselves or their products, and I tend to spend more time and engage with authentic life updates, and content that is trying to teach me something."}, {"type": "sentence", "content": "From here, every time I post, I try to make sure that I’m not showing off, that I’m not bragging. If I happen to create content in that sense, I either delete it, or I adapt it to make sure it brings value to people."}, {"type": "sentence", "content": "It may seem super obvious what you like and dislike when you scroll on Instagram, but creating content that you would hate happens way more than you think."}, {"type": "sentence", "content": "Do not create content that you would skip, but publish content that you would stop on, learn from, and engage with."}, {"type": "subtitle", "content": "You Don’t Care About How Many Hashtags Other People Use"}, {"type": "sentence", "content": "Seriously, do you count the number of hashtags people use on their posts? Do you even notice them anymore?"}, {"type": "sentence", "content": "The optimal number of hashtags is the weirdest rule I keep reading about. Users don’t care about how many hashtags you use. I don’t think you can appear spammy by using all 30 of them."}, {"type": "sentence", "content": "Next time you post, make sure you separate hashtags from the rest of your caption to make it more elegant, but then, use as many hashtags as you want. Use only relevant ones and don’t use these very general hashtags. If you stick to relevant hashtags, you will probably use between 10 and 20, and that’s fine. You can even only use one, or 30. It doesn’t matter."}, {"type": "sentence", "content": "Users don’t care about how you decide to tag your post."}, {"type": "subtitle", "content": "You Read Captions, so Write One"}, {"type": "sentence", "content": "Do you stop on posts that only have a single emoji as a caption? I mean, sure, the picture might be pretty, but was that a valuable post? Well, unless the picture was extremely valuable and jaw-dropping, I highly doubt so."}, {"type": "sentence", "content": "Spend time writing a caption. That’s where all the value you can bring to your audience is."}, {"type": "sentence", "content": "Consider Instagram as a micro-blogging platform. Of course, you’re not going to post a 2,000 words essay on there, but try spending a little time writing an engaging piece of content."}, {"type": "sentence", "content": "If you want to optimize your caption, make sure to include some sort of title to the top of your caption. This way, your audience will know what your post is about without having to click the “Read More” button."}, {"type": "sentence", "content": "An Instagram post is like a little blog post. Your audience should learn something from reading this caption. If you’re spending time writing one, make sure you make it worth it."}, {"type": "sentence", "content": "If you don’t have the inspiration to write a good caption, do not post at all."}, {"type": "subtitle", "content": "You Don’t Have to Post Once Per Day, But Post Consistently"}, {"type": "sentence", "content": "The key to a good Instagram strategy is consistency."}, {"type": "sentence", "content": "It’s not better to post once a day, or three times a day, or twice a week. The best is to be able to publish valuable content regularly."}, {"type": "sentence", "content": "I’m not going to dive into the details of why consistency is better than following a “once a day” rule, but if you’re interested, I wrote an entire piece about this very topic."}, {"type": "subtitle", "content": "You Like Interactions on your Content"}, {"type": "sentence", "content": "Don’t you like it when people like and comment on your posts, when they ask you questions in your DMs, and generally engage with you? At least I do, it’s gratifying of the time and effort I put into my Instagram strategy. I’m also curious to learn more about these people that are interested in what I do, so I regularly check out their profiles and sometimes follow them if I like what I see."}, {"type": "sentence", "content": "I’m sure you do all that too."}, {"type": "sentence", "content": "Find people within your niche or topics you’re interested in, and start engaging more with these people. Leave comments, shoot them a DM if you have a specific question. Start seeing Instagram as a social platform. Be social, and people will naturally come to you."}, {"type": "sentence", "content": "This is the best growth hack ever."}, {"type": "sentence", "content": "No one wants to follow an account that just posts and then leaves."}, {"type": "sentence", "content": "These are just a few examples of how you can get away from the rules that are stressing you out. Be more mindful of how you use Instagram; it will teach you a lot about the best practices of the platform."}, {"type": "sentence", "content": "If you like this approach and want to take it further, ask your friends, colleagues, family about how they use Instagram. Ask them about what kind of content they like, and what type of content they skip. It will give you more insights into what people want, what to do when you create content, and what to stay away from."}, {"type": "sentence", "content": "Marketing isn’t an exact science. It’s all about a relationship between you, your brand, and your audience."}, {"type": "sentence", "content": "People love teaching (and sometimes selling) you rules, but sometimes a bit of mindfulness and some common sense can drive a ton more results than a “works for most people” kind of rule."}], "topic": "marketing"}