{"title": "It’s Not that I’m Negative, America Really is Screwed", "data": [{"type": "subtitle", "content": "Why Economics Says America’s Collapse is Probably Irreversible Now"}, {"type": "sentence", "content": "A few years ago, I wrote a post called “Why We’re Underestimating American Collapse.” Sadly, I think my predictions have proven to be true — though I suppose you can judge that for yourself. 90,000 dead and counting. A president who calls the death toll a “badge of honor.” A paralysed Congress. 40 million unemployed. Today, I often get the question, “Why are you negative, Umair?” or, “What can be done to fix all this?” These are really the same question, and my answer, which you probably won’t like, goes like this: we’re still underestimating American collapse."}, {"type": "sentence", "content": "The economics of American collapse say that it’s probably too late to fix America. It’s probable that this is the new normal. Chaos, decline, incompetence, malice, poverty, hopelessness, despair."}, {"type": "sentence", "content": "Let me explain, as clearly as I can."}, {"type": "sentence", "content": "You can see, right about now, that America is what political scientists call a failed state. A President who tells people to drink bleach during a pandemic. 90,000 dead, of which 90% are needless. A society that’s not able to provide basics for it’s citizens anymore. A nation in which income, savings, life expectancy, happiness, trust are all in free-fall. This is the stuff of epic social collapse."}, {"type": "sentence", "content": "Now, the reason that America collapsed is straightforward. Americans never invested in building expansive social systems, unlike Europe. Systems to provide healthcare, retirement, childcare, finance, and so forth."}, {"type": "sentence", "content": "The result has been twofold. One, the average American now goes without these things. That’s because they’re largely unavailable. For example, the fresh food that I can get on any block in Europe is simply absent in huge chunks of the States. You buy processed food, or you don’t get food. The same is true of many, many things, like, say, education, or income. You don’t have a job with guarantees and protections like in Canada or Europe. You have a lower quality — not just quantity — of income."}, {"type": "sentence", "content": "Two, the the average American pays prices that the rest of the world considers absolutely absurd — because they are — for the very same things. Having a child? That’ll be $50K, thank you. An operation? That’ll be more than a house. Want to educate a kid? There go your life savings. Want a few fresh apples? That’ll be ten times the price Canadians or Europeans pay. These things — the basics of life — are eminently affordable in the rest of the rich world. In America, though, they cost more than the average person can afford."}, {"type": "sentence", "content": "How do I know that? Because the average American now dies in debt. Their whole life is one long sequence of unpayable debts now. First, there’s “lunch debt” which becomes “student debt” which becomes a mortgage and credit card debt which becomes “medical debt.” The forms of debt in quotes don’t even exist in most other rich countries. In America, though, they define life — precisely because the average American is now a poor person, in the sense that they can’t make ends meet when it comes to paying for the basics of life."}, {"type": "sentence", "content": "Sure, they might have a big car and big house and a big gun. But the economic truth is this: all those things are had on debt, and the average American now lives like an impoverished person. No savings, no assets, no liquidity. 80% — eighty percent — of Americans live paycheck to paycheck, struggle to pay basic bills, and can’t raise say $500 for an emergency. Those are the statistics of a nation having descended into poverty."}, {"type": "sentence", "content": "Now. I don’t write all that to make some theoretical point, so let’s come back to the question. Can America save itself from collapse? If you really understand the numbers, then the answer above — sadly — is: probably not. The economics say that America has more or less almost certainly reached a point of no return now, and collapse is nearly inevitable."}, {"type": "sentence", "content": "To stop collapse, America would have to start investing — massively, suddenly, historically — in functioning systems. To stop longevity and health cratering, it needs a healthcare system. To stop happiness and trust cratering, it needs affordable education and retirement. To stop incomes and savings plummeting, it needs retirement systems and protections for workers. And so forth. Every single facet of American collapse requires massive, large-scale, sustained public investment to be turned around, that goes on for a decade or more."}, {"type": "sentence", "content": "Many Americans even support that much. They get, by now, that without a new social contract, America is finished. Sure, the American Idiot — Trump and his army of bleach-drinking morons — don’t. But maybe the average American does — sure, let’s allow that much. The tragic wrinkle is that it makes no difference. Even if the majority of Americans want a better America — is it too late to actually build one? Probably."}, {"type": "sentence", "content": "Why? Well, who’s going to pay for it? Remember those dismal statistics above? The average American lives like a poor person now? So who exactly is going to pay for all these expansive new systems? The average person simply can’t afford the very improvements to society that they need anymore. Bang! What happens then? The answer is: nothing does. More of this does: a slow, shocking collapse and descent. Because there’s no other option, choice, alternative. Nobody much has the money for one. You see, if I say to the average American — “let’s fix America. All you have to do is pay ten percent more in taxes, and you’ll have world-class healthcare, retirement, childcare, and so on” — they might even support it, whole-heartedly. They might genuinely want it."}, {"type": "sentence", "content": "But the economic truth is that they cannot afford it. That ten percent is now crucial income. That’s what “the average American dies in debt” tells us. The average person can’t give up that ten percent. He or she needs it — usually desperately — to pay off simple everyday bills. They have no real savings to speak of. So where is the money to fund this wonderful new social contract going to come from? The bitter truth is this: Americans are now too poor to afford a better social contract. Even if Americans support a Canadian or European style social contract, the hard economic truth is that are probably now too poor to ever have one. Americans are now so poor they can barely afford to support themselves and their own —80% live at the edge — so how can they afford to support anyone else, let alone everyone else?"}, {"type": "sentence", "content": "That’s not just some idle opinion. You can see stark evidence of these fatal economics already doing their work. Americans just rejected their best chance at reform in generations, Bernie and Liz Warren. That was on the left — the 70% or who say they want decent healthcare, retirement, education, and so on. Only they never, ever vote for it, when it comes down to it. Why? Raising the spectre of higher taxes to fund a functioning society is something that simply can’t be borne by even those who want. Nobody can afford it now. Even Americans who say they want a better society don’t seem able — predictably, consistently — to follow through now. There’s a reason for that, and it’s that America is too poor as a country to afford to be a functioning society anymore."}, {"type": "sentence", "content": "Even if, as Bernie promised, taxes wouldn’t rise — Americans don’t seem to believe it. Why not? It’s not just they don’t — with good reason — distrust their government. It’s also that they can’t bear any more uncertainty. When your whole life and future seems to be going up in smoke, when you bear all the risk in society — the last thing you can take is even more. So while Bernie and Liz might have championed a functioning society at the same tax rate, the risk of taking having to pay for a functioning society is simply now too much for Americans who already live at the edge. What if taxes do end up rising by five percent? When you’re already perpetually struggling? Bang! Then it’s game over. Americans can’t afford to bear the risks or costs of fundamental reforms to a broken society, and that seals in collapse as the only trajectory left to follow."}, {"type": "sentence", "content": "On the right, by the way, people are so confused and bewildered that, like the protesters above, they’re willing to give up their lives to keep their livelihoods. That’s how desperate things have gotten. See the point: on the left, people might want a functioning society, but never, ever vote for it, because nobody can afford it, while the right has given up on it altogether, hoping only for the chance to be exploited, just so long as food can still be put on the table. That leaves…nobody much…in society…who both wants a functioning nation, and can afford to pay for it."}, {"type": "sentence", "content": "Sure, it’s true that corporations and the super rich can be taxed. And they should be, heavily. But that’s not enough. There’s a reason that Europe and Canada ask people to pay higher taxes to support a better social contract, and that reason is that is the only way such a contract is sustainable. You can’t get there from a one-off tax on corporations and the rich alone."}, {"type": "sentence", "content": "It’s also true that if America were to build a better social contract — with say good healthcare and retirement and so forth — everyone’s bills would decline over time. But that doesn’t solve the problem, which is that Americans can’t afford the costs in the first place. Sure, if American had public healthcare, people wouldn’t have to pay $10K per person per year for it. But they do — and it’s not as if someone’s magically going to raise their incomes by that much if they don’t. Do you think corporate America’s going to give anyone a raise just because it’s paying less in healthcare costs? That’s why all the plans for overhauling America’s broken public healthcare system involve, still, employers paying into some kind of fund — nobody wants to give people more money. But without giving people more money, Americans stay too poor to live in anything but…the collapsing society America’s become."}, {"type": "sentence", "content": "If that doesn’t make sense, just think about it in your own life. Could you really afford to lose 10% of your income right about now? Ever? More likely, like most Americans, your life is balanced right on the razor’s edge. A few percent either way, and — kaput!! — you lose most or everything you have. There goes the mortgage, school, the credit ratin, and so forth. The plainer economic translation of that is: you’re too poor to afford a functioning society. You can barely support your own — how can you support anyone, everyone, else?"}, {"type": "sentence", "content": "So how was America left too poor to afford anything but collapse? In Europe and Canada, there’s a certain kind of fairness that came to prevail. People pay about half their incomes in taxes. Half for me, half for everyone else. But that also means that society’s surplus is distributed far more equitably in the first place. That half you pay in taxes goes on to employ doctors, nurses, professors, public servants of all kinds that simply don’t exist in America. It’s used to invest in hospitals, schools, universities, parks, libraries — every single year. That’s been happening for something like 50 years by now: a cycle of equitable redistribution that became sustained investment and reinvestment. What happens if you invest in a thing like a park, hospital, library for fifty years? It gets better and better. It’s returns grow and grow. There’s more of everything to go around for everyone. The battle for self-preservation doesn’t lock people into poverty, as it has in America. That is what it means to be a truly rich society."}, {"type": "sentence", "content": "America’s been doing exactly the opposite, for the same fifty years, and longer. See any reinvestment in…anything? Everything’s decrepit, from airports to schools to libraries, precisely because there hasn’t been any. There hasn’t been any — or enough, anyways — because Americans didn’t want to pay those higher taxes Europeans and Canadians did. They believed the strange, foolish, and evidence-free ideologies of trickle-down economics and neoliberalism and all the rest of it — we’ll all be richest if we invest in…precisely nothing together. Nobody should care about anyone else. Nobody should ever support anyone else in the pursuit of anything. Life was to be purely individualistic, adversarial, and acquisitive."}, {"type": "sentence", "content": "That led Americans straight into a poverty trap. They were paying lower taxes, sure. But their public goods were decaying. Their common wealth was eroding. Their systems and institutions were corroding. What happens to metal that isn’t polished, a street that’s never cleaned, a house that’s never repaired? Well, in the end, you have to pay a bigger bill. But you might not be able to afford it by then. Bang! Then you’re done. You live in that crumbling house until it finally turns to dust, if you can’t pay the roofer, plumber, electrician. That’s where America is now."}, {"type": "sentence", "content": "Do you know what a poverty trap is? When a poor person spend more than rich people just to have the basics — think of a poor person spending most of their income on low-quality food, transportation, medicine, and so on, because it’s all they can get. That’s where America is now, from a global perspective. In a classic poverty trap. Too poor to ever afford to be rich again, because it doesn’t have the money to invest in it’s own self-improvement or betterment now. Decades of underinvestment mean that there was less and less to go around — until American life became a brutal daily battle for self-preservation. But when all you can do is barely even struggle to preserve yourself, put food on the table, keep your family afloat — what do you have left to give back to a better society? Nothing, is the grim answer, and it’s borne out by America’s spectacularly low — negative — savings rate, aka, everyone but the mega-rich dies in debt."}, {"type": "sentence", "content": "To achieve European or Canadian living standards, how much would America have to invest now? Think of it: gleaming hospitals for everyone, thriving public squares, expansive childcare, good retirement, jobs that pay the bills, oversight of it all. It would take trillions. Probably dozens of trillions. Much, much more than average Americans all put together can afford to spend now. Those are the brutal economics of collapse. Societies who let themselves become poor can hardly then wave a magic want and become rich."}, {"type": "sentence", "content": "What it means to be a poor society, which is what America’s become, is also the experience of life in it by now: political chaos, economic ruin, emotional paralysis, cultural degeneration. Europe and Canada, again, have been investing in life for decades, while America’s been ignoring it. The result is that they are ahead now — and America probably can’t ever catch up. America let itself become a poor society, and this — the chaos and dislocation of now — is what it means to be one."}, {"type": "sentence", "content": "I know this is grim reading. It’s terrible and horrific. Is it “negative,” though? Well, I know that it comes across that way. I want to do a job that the typical pundit won’t, though, which is try to tell you simple truths. The one that economics tells me is this. It’s too late for America to recover. It left it too long. It was arrogant and conceited, paying for things it didn’t need, like wars and mega-mansions, but not those it did. So it didn’t invest when it should have, but now the bill is due, but nobody can pay it. What do you call a society like that? Bankrupt. Just like most Americans are, only they don’t know it. What do you call a whole society of people, after all, who die in debt?America’s broke, my friends. And when you’re broke, what do you have left to invest in yourself?"}, {"type": "sentence", "content": "There’s one way out, by the way, if you’ve followed me closely. Give people money. No strings attached, no questions asked, now, on a large-scale, more or less permanently, forget how much needs to be borrowed to make it happen. So people can fund a working society again. Or else. That’s the big question for America. The rest is noise. Until something along those lines begins to take shape — my answer is simple: Americans made themselves too poor to now afford to have the luxury of a functioning, civilized, modern society. Or is all that a necessity?"}, {"type": "sentence", "content": "Umair May 2020"}], "topic": "economy"}