{"title": "Classifying black holes with SQL", "data": [{"type": "subtitle", "content": "A conclusion to basic SQL Queries"}, {"type": "image", "content": "https://miro.medium.com/max/6638/1*4VHIAc0vSGFRKZc9OrMkdw.png"}, {"type": "sentence", "content": "“In a black hole, no one can see you disappear.” — Stephen Hawking"}, {"type": "sentence", "content": "In the past month, I have written about basic SQL queries and used examples from astronomy. Here are the posts:"}, {"type": "sentence", "content": "For a final tutorial on basic SQL queries, I will cover CASEstatements. This is like an if/then statement in other languages in that it determines a result from conditionals. Keep this in the back of your mind while I re-introduce you to the SQL table that I will use in this post. (if you’re curious, this table of information was used in Black holes, planets, and SQL.)"}, {"type": "sentence", "content": "The table black_holes has characteristics of black holes, specifically, the name (which, for most entries, hints at the location of the object) and mass."}, {"type": "image", "content": "https://miro.medium.com/max/754/1*34bm-fKLGsWYR9E2cqfMRg.png"}, {"type": "sentence", "content": "To read the mass in this table, use scientific notation: base_mass x 10^power. The unit of mass for these black holes is in solar masses, or “the mass of the Sun”. For example, the Sombrero galaxy is 1x10⁹ times the mass of the Sun."}, {"type": "sentence", "content": "We can see that, from the power column, the mass of the last black hole is very much less than the other three. Using a WHEREclause — something covered in Black holes, planets, and SQL — we can verify this."}, {"type": "sentence", "content": "Result:"}, {"type": "image", "content": "https://miro.medium.com/max/624/1*iPpNl9a8RE3ZM5ca4_0DEg.png"}, {"type": "sentence", "content": "Indeed, the result is the name of three massive black holes in the table, specifically those with power larger than 0. The 4th black hole, Cygnus X-1, should appear by itself if we update the query’s WHERE clause."}, {"type": "sentence", "content": "Result:"}, {"type": "image", "content": "https://miro.medium.com/max/304/1*51mWg2qER4fhbV7CNRwRDA.png"}, {"type": "sentence", "content": "And, we see that there is only one black hole where the power is equal to zero."}, {"type": "sentence", "content": "Let’s take this one step further. Suppose we need to create a SQL table view that classifies each entry. For this task, CASE statements are useful."}, {"type": "sentence", "content": "Remember I said thatCASE acts on conditionals? Here I am creating a conditional that tests the value ofpower."}, {"type": "sentence", "content": "(This is in line with the definitions of a supermassive black hole — found at the center of galaxies — and a stellar-mass black hole which is often found orbiting another star.) By the way, these classifications are listed in a new column, bh_description."}, {"type": "sentence", "content": "Here is the result of the previous query:"}, {"type": "image", "content": "https://miro.medium.com/max/1638/1*HJZXE9HTbLcGI2BLXEUIrg.png"}, {"type": "sentence", "content": "This CASE example wraps up my introduction to SQL. Next up? I will tackle more intermediate-level join statements! As always, let’s chat in the comments!"}], "topic": "data-science"}