{"title": "What Can a Facebook Chatbot Actually Do for Your Marketing?", "data": [{"type": "subtitle", "content": "I tried one and it helped, but I had to close the sale myself"}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*kYUkWzVRWsUgH1mpn30wiA.jpeg"}, {"type": "sentence", "content": "Logging into your Facebook page to an inbox full of warm sales leads is a dream come true for any small business owner. Wouldn’t it be nice if a chatbot had been doing your sales for you while you sleep?"}, {"type": "sentence", "content": "That’s definitely what bot building services like Manychat would have you believe. They promise big on sales, leads, and engagement:"}, {"type": "image", "content": "https://miro.medium.com/max/1676/0*jxt51asp0elvSyie"}, {"type": "sentence", "content": "For my online courses business, I built a simple chatbot and put this to the test. Here’s what I learned."}, {"type": "subtitle", "content": "My Chatbot Helped the Warmest Leads Stand Out in My Facebook Page Inbox"}, {"type": "sentence", "content": "My chatbot helped me spot high quality leads in a busy inbox."}, {"type": "sentence", "content": "I taught non-native speakers of English how to write essays for an English language exam. I produced a lot of great free content. So a lot of people messaged my page looking for more free stuff. The chatbot helped me focus my sales efforts on people who had money to spend."}, {"type": "sentence", "content": "It was surprisingly simple. All I had to do was ask:"}, {"type": "image", "content": "https://miro.medium.com/max/950/0*ZNN_DjmQo-6hsj-G"}, {"type": "sentence", "content": "Just one click filters out anyone who’s not looking to pay right now. And the emphasis there is on right now. These might be paying customers later. So I directed those people to my free online course. It was a win-win. They got more free help and, as they signed up off Facebook with their email addresses, I built a substantial mailing list of prospects."}, {"type": "sentence", "content": "With the developing leads sitting on my mailing list, the chatbot could show me in more detail who was a priority lead. I knew there were two key factors that made people more likely to buy: motivation for doing the exam and target grade (“target bandscore” in the lingo of this exam). So my chatbot asked:"}, {"type": "image", "content": "https://miro.medium.com/max/1322/1*X8Qb0yNaGhR0SxwjJIATew.png"}, {"type": "image", "content": "https://miro.medium.com/max/1448/1*Xq4wcMpzjgiNyd6sPL7zrw.png"}, {"type": "sentence", "content": "When I came to check my inbox, I looked for low target bandscores or “Something else” responses. Low targets were easier to achieve without my help. The purpose of “Something else” often turned out to be casual interest or a general idea to do the exam because “it might be useful later.” These leads were unlikely to result in sales. So they went to the bottom of the pile."}, {"type": "sentence", "content": "On the other hand, high targets meant the lead was going to have a hard time getting their grade alone. Work and study were economically important objectives that made people more likely to spend. I could scan my inbox quickly for these high priority leads."}, {"type": "sentence", "content": "The basic chatbot allowed for lead profiling. By asking about a few key metrics, I could immediately tell who was more likely to result in a sale. Thanks to the chatbot, I could now skim through my inbox and pick out people who were likely to buy."}, {"type": "subtitle", "content": "Even a Simple Chatbot Could Get Surprisingly Valuable Answers by Asking Just One Question"}, {"type": "sentence", "content": "The profiling questions were great for figuring out who was the most likely to buy. But the real gold lay in asking people to answer questions in their own words. So I threw the floor open to a typed response from the user. Here’s a typical example:"}, {"type": "image", "content": "https://miro.medium.com/max/1508/0*QNqK06aP8JIT9vaV"}, {"type": "image", "content": "https://miro.medium.com/max/938/0*hx_ld9BJg5sw-vGs"}, {"type": "sentence", "content": "With just one question, my chatbot has unearthed a key pain point: “I can’t really say what my problem is, to be honest with you.” I know my course can do something about this. From the length and thought in the response, I can also tell that this lead is willing to engage in a sales chat. These are all positive signs. So when I scan my inbox, I can see this message and prioritise this lead over others."}, {"type": "sentence", "content": "I think the value of “tell me a little more about your situation” was a great one for this kind of discovery. It let the lead tell me what was important to them. That might be the pain point that we take through our sales conversation. It could also sometimes be an amber flag or a glaring green light."}, {"type": "sentence", "content": "Compare these two answers to my “tell me a little more” question:"}, {"type": "image", "content": "https://miro.medium.com/max/944/0*P_rLMSzcUxzmHuLG"}, {"type": "image", "content": "https://miro.medium.com/max/896/0*xh7Nzlw4irKH1lic"}, {"type": "image", "content": "https://miro.medium.com/max/974/0*M1PsV2qmEct05pnC"}, {"type": "sentence", "content": "They both look pretty promising at first glance. There are multiple failures indicating a strong pain point. I knew from experience that both countries (Malaysia and Saudi Arabia) had given me customers in the past."}, {"type": "sentence", "content": "But a closer look reveals that these leads are far from equal. The first has an amber flag: “I hope the price of your course is affordable to me.” This is a warning light about price sensitivity. Maybe this lead has enough money that he doesn’t need to worry about buying my course. But maybe he’ll think it’s too expensive."}, {"type": "sentence", "content": "The second lead, on the other hand, has paid 1200 SAR, over $300 USD, before and still isn’t happy. This lead is much less price sensitive. They clearly have money and are looking to buy. That’s a glaring green light."}, {"type": "sentence", "content": "My chatbot has discovered deeper details about my leads with just one automated question. Armed with that knowledge, I can consistently prioritise the conversations with the most sales potential. That’s where I started to hit the limits of what a chatbot could do by itself."}, {"type": "subtitle", "content": "The Chatbot Could Start the Sales Conversation by Itself… but It Couldn’t Make Sales Without a Human (Me!)"}, {"type": "sentence", "content": "After my chatbot asked the “tell me a little more” question, there was still a lot of work to do to make a sale. The process still required my time. Through trial and error, I found that a chatbot couldn’t build the kind of relationship that led to a sale."}, {"type": "sentence", "content": "Fundamentally, I think this came down to the emotions in the audience I was dealing with. Frustration at exam failure and uncertainty about success are quite intense emotions. I can comment “that must be frustrating.” I can empathise. A chatbot cannot."}, {"type": "sentence", "content": "I discovered that ultimately there is no substitute for the human element in building a relationship during the sales process."}, {"type": "sentence", "content": "I’m not only more emotionally genuine, but I’m also more subtle. I can gently probe a lead on things like past failures and current frustrations in a way that a chatbot responding to keywords cannot. I can build understanding and the trust that comes with feeling understood."}, {"type": "sentence", "content": "Relationship selling is, at its core, understanding what is in the best interests of the lead and agreeing on the best way forward. A chatbot can never truly understand best interests. Nor can it make nuanced decisions about what kind of offer to make a lead. After filtering out freebie seekers, profiling who was likely to buy and asking one all-important discovery question, it was time for my chatbot to get out of the way."}, {"type": "subtitle", "content": "Key Takeaways: “Drive Sales, Get More Leads, Engage Prospects” — Did My Chatbot Deliver?"}, {"type": "sentence", "content": "Overall, I’d say it delivered on two and a half of the three promises of sales, leads and engagement It definitely got me higher engagement. It also got me more sales opportunities, which I could have capitalised on if my offer had a price that was more in line with the market. It didn’t directly bring me more leads. But the chatbot revealed my most promising leads and helped me build content to attract more leads. If “two out of three ain’t bad,” then this simple chatbot was really not bad at all."}], "topic": "social-media"}