{"title": "Embodied Cognition: You Are Not a Brain in a Vat", "data": [{"type": "subtitle", "content": "‘Smartness’ of the body, and how our sensory and motor systems shape our reality"}, {"type": "subtitle", "content": "Embodied cognition"}, {"type": "sentence", "content": "You are not a brain floating away in a vat (well, most probably). Rather, you are eighty-six billion neurons connected to hundreds of nerves running through a body with sensory and motor systems unlike any other creature on earth."}, {"type": "sentence", "content": "One type of cranial nerve, of which you have twelve, enables you to move your eyes to scan the vistas before you, another allows you to smell, and yet another to taste. Thirty-one pairs of spinal nerves branch off into hundreds of peripheral nerves allowing you to pick up objects and feel their roughness, their smoothness."}, {"type": "sentence", "content": "For all of this, reality is like the light filtering in through a small, warped and darkened window. You are limited by form and function; deaf to the scurrying of tiny insects, blind to ultraviolet light, indifferent to the paths of magnetic fields*, and so you do not inhabit the reality of the bat, the bluebottle butterfly, or the migratory eel."}, {"type": "sentence", "content": "However, you are far from a passive recipient of sensory information, rather you move through the world, and interact with it. Thus, your behaviour emerges from a complex interaction of mind, body, and environment (Wilson & Foglia, 2011)."}, {"type": "sentence", "content": "Your brain is not the sole cognitive resource at your disposal — there is a ‘smartness’ to the body. For example, walking is facilitated by our body mechanics rather than requiring brainpower to calculate the ‘timing and magnitude of our strides’ (Wilson & Golonka, 2013)."}, {"type": "sentence", "content": "The very structure of your body, the constraints and opportunities it affords, encodes information about how to navigate your environment (Godfrey-Smith, 2016)."}, {"type": "sentence", "content": "This is known as embodied cognition."}, {"type": "subtitle", "content": "Metaphor? I barely know her!"}, {"type": "sentence", "content": "Concepts are sensorimotor in nature (Mahon, 2015a). For this reason language, the means by which we organise our understanding of the world, relies heavily on metaphor (Boroditsky & Ramscar, 2002)."}, {"type": "sentence", "content": "Metaphor expresses abstract concepts such as fluctuating emotional states and the passage of time by grounding it in the tangible and concrete. Thus, we think of people as cold or warmhearted, and conceptualise time as distance traveled or quantity accrued."}, {"type": "subtitle", "content": "Emotion and morality"}, {"type": "subtitle", "content": "Out, damned spot!"}, {"type": "sentence", "content": "Is there an emotion more grounded in the body than disgust?"}, {"type": "sentence", "content": "Even moral disgust manifests in the flesh. An action that is morally repugnant induces in us the same nauseated, stomach-churning feeling as if we’d been exposed to spoiled food or decay. We even wrinkle our noses in disapproval of heinous acts, as if we’d just caught a whiff of something malodorous (Wilson & Foglia, 2011). Speaking of which…"}, {"type": "sentence", "content": "Exposure to unpleasant odors increases negative bias and harsh moral judgments made of others (Schnall et al. 2008a; Inbar et al. 2009). Furthermore, it appears that very act of cleaning one’s body serves to cleanse one’s mind following immoral actions (Schnall et al. 2008b)."}, {"type": "subtitle", "content": "Posturing"}, {"type": "sentence", "content": "When you’re upset, your head hangs low, the corners of your mouth droop, your gaze is downcast, and there is a tendency to slouch."}, {"type": "sentence", "content": "However, the reverse is also true, changing your body language can change your mood. Hence, the prevalence of advice calling for us to adopt a confident stance when giving a speech."}, {"type": "sentence", "content": "Research has shown that enacting poses associated with positive mood (straight-backed rather than stooped) helps with mood recovery. However, it may be in your best interest to slouch and slump when trying to recall sad memories as mood-congruent posture aids in recall (Veenstra, Schneider, & Koole, 2017)."}, {"type": "sentence", "content": "Fake it, till your body makes it."}, {"type": "subtitle", "content": "Consciousness"}, {"type": "subtitle", "content": "I act, therefore I am"}, {"type": "sentence", "content": "A sense of self as a being who is separate from others requires interacting with the world, acting upon it. Embodied cognition is vital to self-agency which is in turn a prerequisite for consciousness (Wilson & Foglia, 2011)."}, {"type": "sentence", "content": "Self-agency works thusly, every action we take is distinguishable from an externally generated one because it is anticipated and therefore attenuated. For example, if you press down into your arm you’ll feel it less keenly than if another person were to touch you with the same amount of pressure (Buhrmann & Di Paolo, 2017)."}, {"type": "sentence", "content": "This ability is known as source-monitoring, and its breakdown is why individuals with schizophrenia mistake their self-generated hallucinations for real-world percepts (Blakemore, Smith, Steel, Johnstone, & Frith, 2000)."}, {"type": "sentence", "content": "There you have it, bodily experience has a profound effect on cognition. If you’d like to learn more about other modality-specific (visual, auditory etc.) mental representations, or the effects of motor processes (or merely watching others engage in them — mirror neurons!) on cognition, here’s a good place to start."}, {"type": "sentence", "content": "You might also enjoy:"}, {"type": "sentence", "content": "While cognition is embodied, we are the ‘minded body’, tethered but not chained to our corporeal form, allowing us to benefit from VR:"}, {"type": "sentence", "content": "Pondering life as the shapeless, ever-shifting octopus:"}, {"type": "subtitle", "content": "Footnote"}, {"type": "sentence", "content": "*Actually, we can sense magnetic fields although it escapes our conscious notice; changes in magnetic fields induce slow-wave brain activity (Wang et al., 2019)."}, {"type": "subtitle", "content": "Further Reading"}, {"type": "sentence", "content": "Blakemore, S. J., Smith, J., Steel, R., Johnstone, E. C., & Frith, C. D. (2000). The perception of self-produced sensory stimuli in patients with auditory hallucinations and passivity experiences: evidence for a breakdown in self-monitoring. Psychological medicine, 30(5), 1131–1139."}, {"type": "sentence", "content": "Boroditsky, L., & Ramscar, M. (2002). The roles of body and mind in abstract thought. Psychological science, 13(2), 185–189."}, {"type": "sentence", "content": "Godfrey-Smith, P. (2016). Other minds: The octopus and the evolution of intelligent life. London: William Collins."}, {"type": "sentence", "content": "Mahon, B. Z. (2015a). The burden of embodied cognition. Canadian Journal of Experimental Psychology/Revue canadienne de psychologie expérimentale, 69(2), 172."}, {"type": "sentence", "content": "Schnall, S., Johnson, D. J., Cheung, F., Brent Donnellan, M., Arbesfeld, J., Collins, T., … & Dunsmore, L. (2014). Disgust as embodied moral judgment. Social Psychology, 45(4), 315–320."}, {"type": "sentence", "content": "Schnall, S., Benton, J., & Harvey, S. (2008). With a clean conscience: Cleanliness reduces the severity of moral judgments. Psychological science, 19(12), 1219–1222."}, {"type": "sentence", "content": "Veenstra, L., Schneider, I. K., & Koole, S. L. (2017). Embodied mood regulation: the impact of body posture on mood recovery, negative thoughts, and mood-congruent recall. Cognition and Emotion, 31(7), 1361–1376."}, {"type": "sentence", "content": "Wang, C. X., Hilburn, I. A., Wu, D. A., Mizuhara, Y., Cousté, C. P., Abrahams, J. N., … & Kirschvink, J. L. (2019). Transduction of the geomagnetic field as evidenced from alpha-band activity in the human brain. eneuro."}, {"type": "sentence", "content": "Wilson, R. A., & Foglia, L. (2011). Embodied cognition."}, {"type": "sentence", "content": "Wilson, A. D., & Golonka, S. (2013). Embodied cognition is not what you think it is. Frontiers in psychology, 4, 58."}, {"type": "sentence", "content": "Angela Volkov writes about the full gamut of human experience, and is the editor of AVocation (please submit posts about your hobbies and pastimes here) and Sike! Psychology for World Domination."}], "topic": "neuroscience"}