{"title": "Beyond The Human Touch: How Hotels Can Bounce Back", "data": [{"type": "image", "content": "https://miro.medium.com/max/12032/1*te84gVTbjVWBC72Nr-5Lhw.jpeg"}, {"type": "sentence", "content": "Normally, the summer months see hotel prices sky-rocket as tourists rush to escape the daily grind and spend a few glorious weeks lounging on sun-drenched beaches, clutching cocktail-filled coconuts and slathering on the sunscreen."}, {"type": "sentence", "content": "When the recovery happens, it’s going to be slow. But it will happen. For hotels, much of their success will lie in their ability to adapt to the “new normal” and position themselves in a way that attracts a new type of traveller."}, {"type": "subtitle", "content": "Where will recovery be the fastest?"}, {"type": "sentence", "content": "Hotels situated in tourist destinations that have a lower reliance on long-haul international travel will be the first to see guests return as domestic travel will be the first to pick up again as lockdowns are lifted. In particular, this gives hotels located in the UK, Germany and Italy a competitive advantage, as they’ve previously seen some of the highest levels of domestic tourism."}, {"type": "sentence", "content": "We can also predict that the recovery will be speedier for hotels based in rural locations, as tourists will use their re-found freedom to escape the hustle and bustle of the big cities, and all of the potential hazards that come with overpopulated urban tourist hotspots by getting some fresh air out in the countryside."}, {"type": "sentence", "content": "Hotels can look to capitalise on these “staycation” trends by pivoting their marketing to appeal to guests that are looking for a change of scenery (or an escape from their small, jam-covered children) after being pent up at home for the best part of two months."}, {"type": "subtitle", "content": "Who will be the first guests to return?"}, {"type": "sentence", "content": "For many Millennials, the freedom to travel feels a bit like a birthright. They’re the generation raised on budget trips to Ibiza and Magaluf. In 2019, Millennials planned to take an average of five trips a year, three of which were international. Although they have less money and less job security than their older Gen X and Boomer counterparts, a combination of tempting travel discounts, re-discovered freedom and an innate sense of invincibility will likely see Millennials be the first to return to hotels across the world."}, {"type": "subtitle", "content": "How can hotels adapt to meet the expectations of these first guests?"}, {"type": "sentence", "content": "Like any brand, hotels will need to adapt and reposition themselves to match the demands of their guests."}, {"type": "sentence", "content": "Those that previously capitalised on principles such as social connectivity are going to have to put highly-visible (and therefore reassuring) hygiene and social distancing measures in place if they want to entice guests back. There’s going to be a decrease in demand for hands-on spa treatments, crowded bars and co-working spaces as wary guests seek to find ways to relax without fear of being coughed on."}, {"type": "sentence", "content": "Online check-in, touch-free QR codes instead of key cards and in-room tech that’s controlled via an app on your phone (because hotel TV remotes are gross at the best of times) will become standard. Instead of concierges, apps will do much of the heavy lifting, and robot delivery systems, previously dismissed by many western hoteliers as a “gimmick”, will roam hotel corridors, laden with snacks and tubes of toothpaste. And due to the tech-savvy nature of returning Millennials, the adoption rate of “smart hotel room” technology will soar over the next few years."}, {"type": "subtitle", "content": "Won’t we lose the “personal touch”?"}, {"type": "sentence", "content": "This is a common misconception. In fact, there’s actually plenty of evidence to the contrary. When it’s done right, technology and automation are the best friends of hoteliers and guests alike."}, {"type": "sentence", "content": "Databases remember important information about guests when people forget. High-tech heating, lighting and in-room entertainment systems allow for increasingly personalised experiences. Digital concierges will provide boundlessly accurate suggestions, unimpeded by human bias. The nippy robots that bustle about delivering room service are part-staff member, part-built-in entertainment; a great marketing tool, with guests ordering stuff just for the sake of being able to create a viral TikTok starring it’s very own robot."}, {"type": "sentence", "content": "And with global lockdowns forcing even older generations to quickly get to grips with FaceTime, Zoom and Skype, now might be the perfect time to start to introduce all manner of tricky technologies. After all, a third of seniors already own tablets."}, {"type": "sentence", "content": "In the future, every part of a hotel will be designed to offer guests continual moments of delight at every touchpoint throughout the entire customer journey."}, {"type": "sentence", "content": "And in a world where physical “personal touches” will be avoided, guests will be more open than ever to embracing the technology that allows them to recreate the human connections of old."}, {"type": "sentence", "content": "But we’ve got to be aware of the negative impact that increased automation will have of individuals employed in the industry, as roles previously performed by humans are increasingly digitised."}, {"type": "sentence", "content": "Will room service robots become the hospitality industry’s self-service checkout?"}], "topic": "travel"}