{"title": "So, You Want to Be a Startup Spokesperson?", "data": [{"type": "subtitle", "content": "10 Lessons from a Public Relations Pro"}, {"type": "sentence", "content": "Congratulations. You’ve just been chosen to be the next spokesperson for your startup."}, {"type": "sentence", "content": "Don’t squander this chance to elevate your company’s reputation."}, {"type": "sentence", "content": "Before you march out into the line of fire to get peppered with questions, let’s make sure that you have the basics nailed down first, yes?"}, {"type": "subtitle", "content": "Media Training 101"}, {"type": "image", "content": "https://miro.medium.com/max/12032/0*JqTZgwt0pVPI7Cz2"}, {"type": "subtitle", "content": "1. Do your homework, be prepared"}, {"type": "sentence", "content": "Your communications team should be able to help you with this, but it’s always a good idea to read the reporter’s recent pieces to get a sense for their reporting style and their stance on particular industry issues. Also make sure that you’re intimately familiar with the publication’s audience; this is who you’re really trying to reach."}, {"type": "sentence", "content": "The worst interview experiences that I’ve moderated have been when the spokesperson is “coming in hot,” after several back-to-back meetings. That’s a bad baseline to start with."}, {"type": "sentence", "content": "Give yourself a buffer before the interview to focus and mentally prepare yourself. A buffer on the back end can also be useful in case you run over."}, {"type": "subtitle", "content": "2. Don’t treat an interview like a conversation"}, {"type": "sentence", "content": "It can be natural to consider an interview as just another pleasant exchange between polite professionals— a conversation where you want to help out the other person by giving them everything they need."}, {"type": "sentence", "content": "This is a dangerous move. If you get too comfortable, you might let something unintentional slip or you might not be ready when they hit you with the hard questions."}, {"type": "sentence", "content": "Anything you say can and will be used against you. You can assert some control over the interview if you think of the reporter’s questions as opportunities to deliver your key messages."}, {"type": "subtitle", "content": "3. Stick to your subject"}, {"type": "sentence", "content": "Just because you’re a spokesperson doesn’t mean you’re supposed to know everything."}, {"type": "sentence", "content": "You’ll likely get questions about a topic that’s unfamiliar. Fight the urge to make something up or give a ballpark answer. When in doubt, ask yourself if you’d be comfortable with what you’re about to say being on the cover of the New York Times. If not, don’t say it."}, {"type": "image", "content": "https://miro.medium.com/max/11136/0*ZMKcOG-e9TOrYxU-"}, {"type": "subtitle", "content": "4. Stay on message"}, {"type": "sentence", "content": "It’s best to go into any interview with three main points that you want to drive home. These are your key messages, and they tend to ladder up to your startup’s core narrative about why the company was developed, its purpose and how it will deliver vaule to customers (your comms team can help you)."}, {"type": "sentence", "content": "Having three messages keeps everything simple and ensures that you stay on track. Any more points than that and the conversation can veer off course quite quickly. The reporter might walk away not certain what your primary points were."}, {"type": "subtitle", "content": "5. Give real-life examples; help the reader understand"}, {"type": "sentence", "content": "This is storytelling 101. In order to effectively convey a message, it helps to use concrete examples that are relatable."}, {"type": "sentence", "content": "Not only do examples serve as proof points that validate your core messages, they also give readers points of reference in their lives and helps the message to stick. For example, I once worked with executives at a large enterprise technology company. Their spokespeople were very smart, but they spoke in abstractions and concepts."}, {"type": "sentence", "content": "They had the vision and trajectory of an entire industry nailed, but they couldn’t speak to actual customer paint points, much less speak the language of the rank and file. As a result, their quotes were frequently cut from stories. See, I just gave you a real-life example with consequences to help articulate my message."}, {"type": "image", "content": "https://miro.medium.com/max/8000/0*K36y-4Ni11IqLOeu"}, {"type": "subtitle", "content": "6. Tap into broader trends and current events"}, {"type": "sentence", "content": "Reporters will often ask you to relate the topic of the interview to broader market trends. This is an attempt to make the piece newsworthy and topical."}, {"type": "sentence", "content": "If you are able to do it, I highly recommend this. As a spokesperson, the more capable and equipped you are to broaden the lens, the more interviews you will likely get (because you can speak to more things)."}, {"type": "sentence", "content": "Paying attention to the broader market is always a good policy if you’re a spokesperson because you never fully know what the reporter could ask."}, {"type": "sentence", "content": "When you address broader market trends, you are also building rapport with the reporter by helping them round out their story and make it more relevant to their audience. Moves like this can lay the ground work for a long-term relationship that pays recurring dividends over time."}, {"type": "subtitle", "content": "7. Don’t break “into” jail"}, {"type": "sentence", "content": "This one is important. Remember those key messages you keep on your desk? Always have those handy."}, {"type": "sentence", "content": "Reporters sometimes use silence as a tactic to get spokespeople to offer up additional information. Silence makes people uncomfortable, and it’s natural to want to fill that emptiness with more information."}, {"type": "sentence", "content": "If you feel the need to fill the silence, pivot back to reinforce one of your key messages. I’ve been on countless interviews where a rambling spokesperson stepped into a topic that they would rather avoid. If what you coughed up is juicy or newsworthy, the reporter isn’t going to let it go."}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*p6DhkuhIwMSkeHfO"}, {"type": "subtitle", "content": "8. Don’t hard sell"}, {"type": "sentence", "content": "Unless they’re green behind the ears, reporters have listened to dozens of executives try to sell them on the exaggerated merits of their businesses. They hate this. 100% of the time. Just. Don’t. Do. It."}, {"type": "sentence", "content": "If you do it, they’re not going to use whatever you say. You’ll also come across as tone-deaf and piss them off, which is not the way to inspire trust or build a long-term relationship. The reporter may even say that they never want to talk to you again. I’ve seen it happen many times."}, {"type": "sentence", "content": "An interview is not a pitch to a venture-capital firm. Leave the pitch deck and all the fluffy aggrandizement behind. When talking about the future of the business, point to concrete milestones that have been agreed upon internally."}, {"type": "sentence", "content": "Reporters dislike overtly fluffy language because it damages their credibility with their audience. The end-around play is to offer up a third-party expert. When an outsider compliments your business, that’s entirely different."}, {"type": "subtitle", "content": "9. Don’t make growth promises"}, {"type": "sentence", "content": "Particularly for an early stage startup, it can be tempting to make bold predictions about what kind of business growth is around the corner."}, {"type": "sentence", "content": "Be careful with this. If your CEO, board of directors and investors are okay with you playing fast and loose, then you might get away with it. But expect these projections to be questioned once you actually hit that time horizon."}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*wMN_2_vGgyj75bo_"}, {"type": "subtitle", "content": "10. Build good rapport with your PR team"}, {"type": "sentence", "content": "This goes for both internal and external teams. As with many things in life, the better relationship you build, the better your results will be. Think of it as a reciprocal partnership. You both need each other to achieve success — so why not join forces?"}, {"type": "sentence", "content": "If you have a more open, transparent and connected relationship, your team will likely go the extra mile and be a little more creative when seeking that next opportunity. Open lines of communication also facilitate sharing, which can lead to the brainstorming of newsworthy ideas."}, {"type": "sentence", "content": "In my experience, the best pitch angles seem to come from organic conversations about topical trends in the news."}, {"type": "sentence", "content": "@RussellWeigandt led Fortune 500 accounts at some of the world’s top agencies for more than a decade."}, {"type": "sentence", "content": "###"}, {"type": "sentence", "content": "If you liked this, you might also like these. But no pressure…"}], "topic": "marketing"}