{"title": "Pangolins Are Not to Blame for The Pandemic", "data": [{"type": "subtitle", "content": "… But They Could Still Cause The Next One"}, {"type": "sentence", "content": "The infectious disease of COVID-19 was first identified in Wuhan, China in December 2019. As we all know, it has since spread globally and is thus considered a pandemic. COVID-19 is caused by the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). This pathogen is generally thought to have originated in bats, since this has been the case in many other viral pandemics. However, the search for intermediate hosts is still ongoing, and the pangolin has often been pointed to as a suspect. But recent research supports the animal’s innocence."}, {"type": "subtitle", "content": "The Charge"}, {"type": "sentence", "content": "Before we dive into the case of the pangolin, a fair question is: what is the crime we are accusing it of? Many animals carry viruses, friendly and violent. These usually don’t jump between species, as they are ill-suited to new bodies. However, it still happens occasionally, through close contact with body fluids. When the recipients are human, the virus is called ‘zoonotic’. Once a virus has spread to a new host, it starts adapting to it. The pathogen is often more damaging after such transmission: the new host, unlike the original one, has not evolved in an arms-race together with the virus. Thus, its bodies resistance lags behind. This is the reason people have developed rabies or Ebola after zoonosis, but the original bats were less affected by the virus. They have had the time to tackle the virus over many years."}, {"type": "subtitle", "content": "The Mystery"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*LgKzHBzNoxfusfQCINsL4A.jpeg"}, {"type": "sentence", "content": "That being said, bats have been the source of earlier viruses like SARS-CoV and MERS-CoV, which were highly problematic for us humans. As for SARS-CoV-2 (better known as ‘the coronavirus’), earlier research has shown the virus probably also arose in bats, and more specifically in the species Rhinolophus affinis. However, direct contact between humans and bats is very rare. It is therefore likely an intermediate host has played a role (as was also the case for MERS and SARS). Many fingers have been pointed to suspects already: for instance, snakes and raccoon dogs. The latest candidate was the pangolin. What makes this animal suspicious?"}, {"type": "subtitle", "content": "The Suspect"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*2MK5OIRxZB6mYYQh9qps3Q.jpeg"}, {"type": "sentence", "content": "Pangolins are anteaters found across Africa and Asia. The mammals are one of the world’s most trafficked animals, mostly due to the many protective scales covering their bodies. In Asia, for example, these scales are removed by boiling the pangolins, whereafter they are used for tailoring or traditional medical practices. This is actually the first reason pangolins were considered suspects in SARS-CoV-2 transmission to humans. People have been in close contact with them at places where their flesh and scales were sold, such as the Wuhan market. Besides, pangolins are infamous as natural hosts of many viruses. Finally, the recent study has shown that a certain pangolin virus shares the same binding receptors (‘suction cups’) as SARS-CoV-2 for entering and infecting host cells."}, {"type": "subtitle", "content": "The Innocence"}, {"type": "sentence", "content": "It seems the pangolin is a logical suspect for the charge of intermediate host. But research shows it is not likely to be the mystery animal we are looking for. The unlikeliness of this idea was shown by genetic analyses of coronaviruses in two sick Malayan pangolins. The study was performed by Ping Liu from the Guangdong Institute of Applied Biological Resources in China. Viral genes found in the pangolins were highly comparable to SARS-CoV-2, even showing up to 90% similarity and being only slightly shorter in nature. As mentioned earlier, the suction cup was also of the same type. But still, a better match was found comparing the viral protein spikes between bat and SARS-CoV-2, making it unlikely the pangolin was an intermediate host."}, {"type": "image", "content": "https://miro.medium.com/max/8000/1*bpd7vM4vYBzkN2RAyDFYOA.jpeg"}, {"type": "subtitle", "content": "The Hybrid Hypothesis"}, {"type": "sentence", "content": "There is another interesting hypothesis currently unrefuted, however. Since SARS-CoV-2 is not identical to the identified pangolin virus, but still highly similar, and even more similarity was found in bats, we could be dealing with a chimeric virus. This implies SARS-CoV-2 resulted from recombination during evolution of two separate viruses in bats and pangolins, while exchanging protein bits and pieces. The resulting hybrid virus could have been the early SARS-CoV-2 the world is dealing with now. Of course, more research is needed to support this hypothesis."}, {"type": "subtitle", "content": "A Tough Case Study"}, {"type": "sentence", "content": "You might be wondering why this mystery is not yet an unraveled one. Well, it is quite certain SARS-CoV-2 has been transmitted on the wildlife Wuhan market. After this became clear, the market was immediately shut down. Another problem: not just a handful of animals could be found there. In one specific section of the market an amount of 75 different species were sold. Meaning, many prime candidates. Fingers will keep on pointing until the culprit is found."}, {"type": "subtitle", "content": "The Why Question"}, {"type": "sentence", "content": "Why is this witch-hunt necessary? We all know it will not cure cases of COVID-19. However, performing wildlife virus research has many positive effects. It could improve understanding of the (corona)viruses circulating at one moment. Surveillance of these viruses, and even creating a list of potential transmission intermediates, could also prove to be useful. Proactiveness prevents many more disease cases than coming into action after transmission, or waiting for the next pandemic."}, {"type": "subtitle", "content": "Which Animal Is the Real Culprit?"}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*5b5TMeAhOQVfaO22sFgEGg.jpeg"}, {"type": "sentence", "content": "As has become clear from this article, we are still unsure about the intermediate host transmitting SARS-CoV-2 and consequently starting the pandemic. What we do know is that diseases like SARS, MERS and now COVID-19 have all been transmitted because of increasing exposure to wildlife. Human population growth brings us further in contact with species’ natural habitats. Wildlife exploitation as well as trade markets all contribute to the possibility of viral outbreaks. Minimizing all these factors could reduce transmission risks and prevent future outbreaks. Now that we know the pangolin was not the culprit we were looking for, maybe we should not point fingers to other animals — and start blaming ourselves."}, {"type": "sentence", "content": "Find the original research article here:"}, {"type": "sentence", "content": "Other articles used in the process of writing:"}, {"type": "sentence", "content": "Stay updated for a post about infrared sensing in snakes!"}, {"type": "sentence", "content": "More from me:"}], "topic": "science"}