{"title": "No One Sees My Fear of Not Becoming Successful", "data": [{"type": "subtitle", "content": "The invisible aura of deep thoughts cloud my mind every day"}, {"type": "image", "content": "https://miro.medium.com/max/9856/1*KCKInDtM9qZprxHyCGwhsQ.jpeg"}, {"type": "sentence", "content": "As a kid, I was a huge gamer and quite timid to be honest with you. If it wasn’t for my dad coaching me in three sports and getting me out of my comfort zone, I wouldn’t be the creative entrepreneur I am today."}, {"type": "sentence", "content": "The creative journey started when I saw YouTubers thriving and making a career out of it. My confirmation bias that I was worthy of doing work in a creative space unveiled itself in my sophomore year sports marketing class. Mr. Arcurie would offer Portillo’s and Buffalo Wild Wings gift cards for the best pitch of each project we had."}, {"type": "sentence", "content": "In a humble fashion, I won many of these competitions simply because I had a strong eye for compelling content. Ever since then, I have worked on vlogging, blogging, and podcasting very soon. My classmates never knew I was dreadful of failing. They never knew I had anxiety through the roof when it was my time to present my idea, video, or ad campaign."}, {"type": "subtitle", "content": "The Fear of Failing is a Ginormous Obstacle"}, {"type": "sentence", "content": "There’s beauty and struggle that comes with being an extremely competitive individual. It’s a double edged sword that tells you that you are going to be an icon one day. The sharper edge of the sword is the one that pushes you to wonder… what will people think about me if I’m not successful?"}, {"type": "sentence", "content": "It’s terrifying to think that my creative venture will fail. I have very few other backup plans should things go a different route. Many friends I know are afraid they won’t pass their Orgo class and get their nursing degree. Many people are in the same boat, but with their stress, it’s evident."}, {"type": "sentence", "content": "From a creator’s standpoint, we rarely ever share with our audiences how insecure we feel about whether or not our audiences like us. Are our ideas worthy? We mask our insecurities by not putting them out on the table in fear of people thinking we are incompetent."}, {"type": "sentence", "content": "Incompetency is a fear of mine so what I do is over-prepare. Before I started using Medium’s Partner Program, I studied each and every article I could get my hands on in order to perform at a high level from the jump."}, {"type": "subtitle", "content": "Mistakes are going to happen, we know this"}, {"type": "sentence", "content": "My fear of not being successful isn’t blown so far out of proportion that I believe I’ll be mistake-free. I’ve made hundreds of mistakes!"}, {"type": "sentence", "content": "Many of the mistakes I’ve made are relatable and that’s what makes the whole experience humane. We can’t be perfect all the time, but we can strive for perfection."}, {"type": "subtitle", "content": "Imagine Living in a Different Era"}, {"type": "sentence", "content": "If I wasn’t able to live through the current era we are in, I am not sure if I would make it. Say we were in the 1920’s and we were going through the Great Depression. I know many people who lose incomes would be in deeper holes than they are right now."}, {"type": "sentence", "content": "I fear that if I lived during that time, I would be working at a factory and feeling little to no sense of fulfillment or purpose in the world. That’s scary. The odds of becoming a human being are 400 trillion to one. We are blessed to even exist and have a chance at life. I don’t want to waste it. I must be successful."}, {"type": "sentence", "content": "Opportunities we undermine include blogging, teaching english to students in China, delivering for UberEats, driving with Lyft, or YouTubing. Unlike back then, we can have side hustles. In other words, we can make money in ways where we are our own bosses and aren’t as desperate to the big companies. In the sea of opportunities, my anxiety rises because I feel like if I can’t succeed in the current era, then I am a failure."}, {"type": "subtitle", "content": "Consuming Content of Now-Successful Journeymen and Women"}, {"type": "sentence", "content": "There is a light at the end of the tunnel. The internet has allowed me to consume content from great influencers such as Gary Vaynerchuk, Michael Jordan, and Russell Wilson. These gentlemen allow me to push past my insecurities."}, {"type": "sentence", "content": "Thanks to the great lessons I’ve learned from my role models I named earlier, I have made strides. I avoided being stubborn to learn from the great writers of our time such as Tom Kuegler, Tim Denning or Ayodeji Awosika. The pioneers of online blogging have taken me under their wing and given me more advice than I could have ever imagined."}, {"type": "subtitle", "content": "Let Fear Work for You"}, {"type": "sentence", "content": "I’m still scared that I won’t make it as a successful entrepreneur in such a competitive world. No one will ever look at me and see my insecurities the way I do. We are our biggest critics. There’s no doubt about it."}, {"type": "sentence", "content": "I know that living with this constant fear of not becoming a successful entrepreneur will stick around until I make it to where I want to be. The best thing to do is acknowledge it’s there and adapt to the challenges it presents. Living in constant fear is not an option unless stagnation is what I seek, which its not."}, {"type": "sentence", "content": "It simply isn’t worth worrying and stressing over success, but that’s why I consider it to be one of my biggest invisible illnesses. Staying the course and riding the waves is a part of the journey, so I’m gonna stay awhile."}], "topic": "productivity"}