{"title": "How To Sabotage Your Social Media Marketing", "data": [{"type": "subtitle", "content": "Just keep doing these things"}, {"type": "sentence", "content": "Are you tired of looking at your social media stats and seeing the same dismal numbers day after day?"}, {"type": "sentence", "content": "You spend a lot of time, probably too much, on your social media accounts, but your number of followers just won’t go up."}, {"type": "sentence", "content": "Or worse, they keep going down."}, {"type": "sentence", "content": "Like many others, you are probably making one or more of the following mistakes. I know this because I did the same thing for years, and saw the same crappy results as you."}, {"type": "sentence", "content": "Well, apparently, I’m no Einstein because I kept doing the same things day after day, then wondering why my stats didn’t go up."}, {"type": "sentence", "content": "Then I tripled my followers on Twitter and grew my stats on other social media exponentially in only a few weeks."}, {"type": "sentence", "content": "How, you ask?"}, {"type": "sentence", "content": "I stopped doing the same things."}, {"type": "subtitle", "content": "Posting Random Crap"}, {"type": "sentence", "content": "I don’t have much of a filter. The gap between having a thought and expressing it is usually pretty short. I’ve learned this is a mistake in real life, so why did it take so long to realize it on social media? Especially Twitter and Facebook. Every time some random thought popped into my head, I would post it. Best case, this confuses your followers; worst case, it annoys them. And what do you do when someone you follow keeps annoying you?"}, {"type": "sentence", "content": "That’s right, you unfollow, unfriend, or whatever the process is."}, {"type": "sentence", "content": "The same goes for reacting to other people on social media. Remember, you are there to market yourself, not argue with people. If a post pisses you off, ignore it and move on. Or unfollow the person. If you engage, you are wasting your time."}, {"type": "sentence", "content": "And worse, you are annoying other people. Who will unfollow you."}, {"type": "sentence", "content": "Don’t engage with trolls. You know who they are and you know what they are trying to do."}, {"type": "sentence", "content": "You want everything you post to make people want to see more of what you have to say. And better yet, tell others about you. Posting random thoughts or reacting to rants and trolls won’t do either of those things. At least, not in a positive way."}, {"type": "subtitle", "content": "Blindly Following Everyone"}, {"type": "sentence", "content": "We’re all guilty of this when we first start out. We are not following anyone and nobody is following us. So we follow everybody that pops up. This is a terrible idea for several reasons. You should have a specific reason for adding every person you follow. They either have useful advice that will advance your knowledge, or they have followers that you want, that might follow you. Preferably both."}, {"type": "sentence", "content": "That you want. That is the key takeaway. Following someone with 10k followers that doesn’t help in your marketing is worse than following people blindly."}, {"type": "sentence", "content": "Years ago, I went on a mission on Facebook to grab followers. And I did. I quickly reached my limit of 5,000 friends. But they were a random collection of people in a niche that did absolutely nothing for me. And worse, 25% of them didn’t read or write English."}, {"type": "sentence", "content": "I learned another lesson on Twitter, and to a degree on all social media. Outside of writing, my main gig is photography. There are a ton of photographers out there. Everybody with a cellphone is a photographer. Gaining a following of photographers is easy. Too easy."}, {"type": "sentence", "content": "But here’s the thing. In over 15 years of being a professional photographer, I have sold exactly one picture to another photographer. That’s pretty slim odds by any account."}, {"type": "sentence", "content": "You don’t want followers that do what you do; you want followers that want what you do."}, {"type": "sentence", "content": "Don’t get me wrong, I still follow a handful of photographers and writers. I want to learn what they can teach me and I want to observe how they succeed. But having thousands of followers just because they do the same thing you do is a waste of time."}, {"type": "sentence", "content": "So, a few times a year, make sure you are not guilty of…"}, {"type": "subtitle", "content": "Not Pruning Deadwood"}, {"type": "sentence", "content": "Facebook has a limit of 5K friends on a personal page. There is no limit on a business page, but personally, I haven’t found business pages useful. Other sites don’t have a limit (at least that I have hit), but maybe they should. That would force us to clean house."}, {"type": "sentence", "content": "To use social media, you have to spend some time on it. Scrolling through your feeds should give you opportunities, educate you, and entertain you. In that order. If you spend a lot of time scrolling past post after post without stopping, it’s time to thin the herd."}, {"type": "sentence", "content": "If they add no value, cut them. If they fill up your feed with random retweets and shares, cut them. If they keep doing the things I am talking about in this article, cut them."}, {"type": "sentence", "content": "Sure, everyone has a bad day. Every post by everybody you follow will not be gold. But mostly, everyone you follow should do one of the three things listed above. And the entertaining ones should be in the minority. You want entertainment? Go watch Sponge Bob. You’re here to market and learn."}, {"type": "sentence", "content": "I do pruning in two ways, ongoing and dedicated. Actively, I try to evaluate the posts I am seeing quickly. I try to remember who is wasting my time. Two or three strikes and you’re out."}, {"type": "sentence", "content": "Then, at least twice a year, I dedicate a couple of hours to one particular feed. I look at my followers and statistics. I’ll click on the profiles of those I see a lot and pay attention to the kinds of things they post. On these days, I will cut 10–25% of the people I follow and those that follow me."}, {"type": "sentence", "content": "I clean house"}, {"type": "subtitle", "content": "Ignoring Everyone"}, {"type": "sentence", "content": "In attending trade shows and events, salespeople will often measure their success by how many business cards they hand out and how many they collect. Whether or not this is valid will depend on how well they follow up, but it’s a starting place. Giving someone your card is like adding them as a follower. Take their card and you are following them."}, {"type": "sentence", "content": "So imagine I walked onto the floor of one of the national photography shows. There are thousands of people buying and selling every imaginable product and service. I walk throughout the show, up and down every aisle. But I don’t talk to anyone. After a couple of hours I leave, empty-handed."}, {"type": "sentence", "content": "How is that for marketing?"}, {"type": "sentence", "content": "Not very good. On the other hand, you can walk through the event, grabbing every card you see and handing yours out to random people. Better than nothing, but not much. People will not remember you, and when they get home, your card will probably end up in the trash. A decent salesperson will work the room; shaking hands and talking to everyone. They want to remember who they met and be remembered by them. Either way, you can’t walk around ignoring everyone and expecting to make a sale."}, {"type": "sentence", "content": "And you can’t do that on social media. You have to engage. Not just follow, engage. Talk to people. Shake their virtual hand and trade business cards with them. Introduce yourself and explain why they might want to hear what you have to say."}, {"type": "sentence", "content": "Many of us don’t do that enough. We just scroll past everyone, like we are walking past them at the trade show. Never stopping to talk. This will not get you anywhere. It’s not magic, you have to work it to get results."}, {"type": "sentence", "content": "But it gets worse."}, {"type": "sentence", "content": "Worse than ignoring the random stream on your social media account is ignoring someone who engaged with you. If someone takes the time to ask you a question, answer it; preferably with a call to action. If someone compliments you on an image or article, thank them. Profusely. Engage with them. Tell them, if they liked that one, they should… and that’s another call to action."}, {"type": "sentence", "content": "Those are the people you’ve been trying to reach. That’s the whole point of this social media game. Ignore them and you’ve lost them and everyone they influence. Probably, forever."}, {"type": "sentence", "content": "But when I say to engage with your followers, I don’t mean…"}, {"type": "subtitle", "content": "Selling, Not Telling"}, {"type": "sentence", "content": "I follow a lot of vendors in both photography and writing. I like to keep abreast of what’s out there and maybe find some new product or service that will help grow my business."}, {"type": "sentence", "content": "But if all they post is, “Hey, buy this!” they will not last very long. What’s even worse is the people who have gone to the trouble to add me to their email list successfully and then just send me ads every day. Delete. Spam. Block. Unfollow."}, {"type": "sentence", "content": "Wasted opportunity."}, {"type": "sentence", "content": "And remember, you can’t just judge an email campaign by the number of subscribers. It has to generate solid leads, if not customers. It takes 5 seconds to unsubscribe. It takes 1 second to delete. Guess which one I choose most of the time."}, {"type": "sentence", "content": "You want to take a master class on social media marketing?"}, {"type": "sentence", "content": "Get on Reddit."}, {"type": "sentence", "content": "On most every social media site, you can get away with selling, not telling. You won’t gain much by it, but you can get away with it."}, {"type": "sentence", "content": "Reddit? Not so much."}, {"type": "sentence", "content": "Jump on a relevant sub-Reddit and post a link to your product or service, best case you will be downvoted, ridiculed, and ignored. And that’s the best case."}, {"type": "sentence", "content": "You could get banned from the sub. For life. Trust me, I’ve done it."}, {"type": "sentence", "content": "You could even get banned from Reddit entirely."}, {"type": "sentence", "content": "It can happen. Reddit don’t play."}, {"type": "sentence", "content": "Reddit is a remarkable marketing opportunity. There are subs with tens of thousands of active members."}, {"type": "sentence", "content": "But you have to work the room."}, {"type": "sentence", "content": "Get on there and just listen for a while. Read what people have to say and pay attention to their reactions. Their voting system is impressive and immediate. Say the wrong thing and you know it immediately."}, {"type": "sentence", "content": "After a while, jump in and contribute to a thread or two. Offer some value. Give some advice. Slowly, over time, set yourself up as an expert. Get some solid interaction."}, {"type": "sentence", "content": "Then and only then do you post a link. But not by itself. Give some of the same advice or share a story as you have been. Then follow up with, “By the way, I wrote an article that exactly answers this question. Here is a link if you are interested.”"}, {"type": "sentence", "content": "Then wait. One of three things will happen. Only one of them is bad. Very bad. If they downvote you and slam you, apologize and lie low for a while. If they ban you, sorry, you lose."}, {"type": "sentence", "content": "If they ignore you, no loss. Stick with it and try again another day."}, {"type": "sentence", "content": "But this could happen."}, {"type": "image", "content": "https://miro.medium.com/max/4268/1*qkFUREjvQGg35tV_2SJwmA.png"}, {"type": "sentence", "content": "Now, almost all of those views were external, and that article has only earned me $5. But it got me a ton of exposure. It got me solidly in with a large sub on Reddit."}, {"type": "sentence", "content": "Hopefully, it gained me some fans, followers, and members."}, {"type": "sentence", "content": "And isn’t that what marketing is all about?"}, {"type": "sentence", "content": "Many people have written articles on the right way to use social media. You can link to mine below. But first, you have to stop doing the wrong things. Doing the wrong things can lose your followers faster than you can ever gain them back."}, {"type": "sentence", "content": "Stop doing the same things and expecting different results."}], "topic": "marketing"}