{"title": "Why We Choose to Humiliate Ourselves Online", "data": [{"type": "subtitle", "content": "Sometimes, emo-journalism of the self goes terribly wrong"}, {"type": "image", "content": "https://miro.medium.com/max/5170/1*0zsawg7D2iqOqav-x5WIKA.jpeg"}, {"type": "sentence", "content": "You’re the cautionary tale and the inspiration, the one people love to hate, the one people hate to love."}, {"type": "sentence", "content": "It doesn’t matter whether others root for you to fail or succeed, you get paid either way but the cost to you keeps increasing. Every day, you dare yourself to reveal more than is comfortable, mining your past and your current reality for shame, humiliation, and pain. The more you do, the more trapped you get yet you have to cater to the audience you built, the kind that consumes the misery of others to feel better about their own station in life."}, {"type": "sentence", "content": "Most people have no idea who they are unless they can compare themselves to someone else so you’re that someone every imaginable kind of misfortune happens to. And it’s never not an absolute disaster because nothing is more monetizable than shit shows."}, {"type": "sentence", "content": "Every time people gawk, you get paid."}, {"type": "sentence", "content": "Every time people point the finger, you get paid."}, {"type": "sentence", "content": "Hate-reads fuel the internet and misery loves company."}, {"type": "sentence", "content": "So you let it all hang out online, voicing widely shared outrage and emoting out loud in print at the same time in an ongoing attempt to secure recognition, fame, and fortune, whatever it takes."}, {"type": "sentence", "content": "It isn’t so much bleeding as voluntary bloodletting to attract ghouls and assorted rubberneckers. This is the business model you chose because there was no barrier to entry: Everyone has feelings, everyone can type."}, {"type": "sentence", "content": "You too."}, {"type": "sentence", "content": "Success feels icky to you, unreal, a fluke, something you never dared imagine you’d find although you’ve never not dreamed of it either."}, {"type": "sentence", "content": "Parlaying sordid into splendid, shame into fame, and humiliation into traction may have improved your financial and material health but your mental health hasn’t enjoyed the ride at all. You’re now stuck in a cage of your own making, one you handcrafted bar by bar, word by word."}, {"type": "sentence", "content": "You built it from the inside, it has no door, and the bars are so close together they almost look like a wall. The minute you grokked people love to spectate the lives of others, you went all in on feelings and aimed for the human heart. If it’s good enough for lobbyists and marketers, it’s good enough for you: Algorithms will promote anything as long as it keeps users on a site."}, {"type": "sentence", "content": "In a staunchly anti-intellectual culture, the lowest common denominator is always a safe bet: It has mass appeal. You can’t beat victimhood culture for clicks and bucks either: People love to feel sorry for themselves and blame someone else because it’s a lot easier than taking responsibility for your own life."}, {"type": "sentence", "content": "Life, liberty, and the pursuit of profit are your honest birthright."}, {"type": "sentence", "content": "Unfortunately, we don’t live in the world we used a few months ago and misery of the magnitude of yours is commonplace now, even vanilla in comparison to pandemic-related horror. Most people have no idea who they are unless they can compare themselves to someone else."}, {"type": "sentence", "content": "You no longer have unique selling points."}, {"type": "sentence", "content": "Using the personal essay to write marketing copy for you, the brand, made you forget who you, the person, are."}, {"type": "sentence", "content": "Since we all spend a lifetime getting to know ourselves, it was never that clear-cut to you. You had no sense of purpose beyond getting paid so you became the mechanical turk of gut-wrenching content and that was that."}, {"type": "sentence", "content": "But trauma is nobody’s best friend, diagnoses don’t define anyone, we aren’t any less human because we have issues; the human condition isn’t a pathology nor should it be pathologized. Every single time we embrace victimhood, we self-sabotage. Positing you’re a victim — even of your own malfunctioning mind — robs you of agency."}, {"type": "sentence", "content": "Wobbly mental health isn’t an excuse any more than it needs to be a limitation: It is a parameter, part of your context, but it’s not who you are. You don’t have to auction off your privacy, your dignity, or your identity for clicks and bucks, even if it’s what the internet currently rewards."}, {"type": "sentence", "content": "We cannot let the internet suck the life out of us, none of us can afford to."}, {"type": "sentence", "content": "Thanks to the internet, we’re all media now but the meaning of words has become so fluid not everything we read will mean anything."}, {"type": "sentence", "content": "Sometimes, it’s waffle designed to feed algorithms and keep the author relevant while they continue to service other people’s need to feel morally, emotionally, and intellectually superior by presenting them with oodles of content they can ridicule and deride."}, {"type": "sentence", "content": "Because money."}, {"type": "sentence", "content": "As long as the internet continues to put sensationalism first and elevate voyeuristic, polarizing reads whose only value is entertainment at the expense of others, be it their author or anyone they choose to target — a fellow human they may or may not be related to, a political party, a religion, a skin color, a sexual orientation, an immigration status — we as a society will never move forward because you as a person will not."}, {"type": "sentence", "content": "If social media platforms have enabled greed with the influencer culture that turns every inch of our private life into content that can be monetized and sponsored, the pandemic has upended that particular business model and it’s no longer looks viable for many who used to make a living out of it."}, {"type": "sentence", "content": "People are sick and tired of being sold defective dreams that posit success is only ever one more effort away."}, {"type": "sentence", "content": "Desperation is a race to the bottom and the competition is fierce so perhaps wealth isn’t what we thought it was."}, {"type": "sentence", "content": "You may be widely successful yet no amount of money can ever palliate the absence of self-respect that led you to auction off your dignity to the highest bidder. The attention laying yourself bare on the page generated failed to translate into any of the validation, admiration, or credibility you sought. Much as you will yourself to detach from the persona you created, you’ve come to espouse its forms so perfectly you’re one now."}, {"type": "sentence", "content": "This is how everything you’ve worked so hard to build collapses and crushes you while others continue to grow and thrive despite all the odds stacked against them, including lack of means. And if it makes no sense, it’s because some of us, especially the most cash-strapped, have been socialized to equate self-worth with dollars and assets at the detriment of our own humanity. When every interaction is a transaction, connection is never genuine but designed to achieve monetization."}, {"type": "sentence", "content": "We do what we have to survive but our culture encourages, elevates, and empowers the worst of human traits, we as a society, we as an internet have gone too far and shot ourselves in both feet."}, {"type": "sentence", "content": "When life is a performance, no one knows how to be real anymore, and constant connectedness makes it much, much worse. No one knows who or what or how to trust either. Now that the social life of many has gone mostly if not fully digital, welcome to alienation: Without the ability to forge deep bonds with others, how do we even survive, much less live or thrive?"}, {"type": "sentence", "content": "Our inner monologue informs the language we use to convey a snapshot of our reality in print: Self-respect shows others we value vulnerability while not recoiling from any aspect of it, and much less attempting to sensationalize it."}, {"type": "sentence", "content": "When words honor and celebrate our shared humanness, nothing is taboo, nothing is stigmatizing, nothing is even awkward anymore. Sometimes, we even laugh."}, {"type": "sentence", "content": "You can saw the bars of your cage with a pen and a little self-compassion and experience what happens when you share that instead."}, {"type": "sentence", "content": "When you get to know yourself without judgment, others begin to react differently, too."}, {"type": "sentence", "content": "And life sucks less for everyone, including you."}, {"type": "sentence", "content": "I’m a French-American writer, journalist, and editor now based in the Netherlands. To continue the conversation, follow the bird. For email and everything else, deets in bio."}], "topic": "social-media"}