{"title": "Remembering the Charm of Charminar During Ramadan", "data": [{"type": "subtitle", "content": "Appreciating local food and ambience during a festival"}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*8J6ydIZo6MFTauFQDD7LNA.jpeg"}, {"type": "sentence", "content": "I lived in the charming city of Hyderabad for ten years. It was a time of great transformation; for the city and for me. From a leafy, sleepy city known for its laidback attitude (a legacy of the Nizam’s who ruled it, I was told), it was rapidly transforming into an IT hub. As an outside observer hailing from the industrious Mumbai (or Bombay as it was known in my youth), Hyderabad’s metamorphosis was a like an evolving fascinating puzzle that I was enjoying figuring out."}, {"type": "sentence", "content": "As a tourist, I had visited its historic sights including Golconda Fort and the Salarjung Museum. But as a resident, there was one place I really wanted to visit. It was one that required planning and execution during the right season — a visit to the old city, to its iconic site, the Charminar, during the month of Ramzan."}, {"type": "sentence", "content": "Recounting my visit to the quaint scene at Charminar one evening during the month of Ramzan in 2012 makes me nostalgic for not just a place but a time as well, because we cannot separate the two. As the world prepares to celebrate Ramzan Eid (or Hari Raya Aidilfitri as it is known in Singapore), details of that long ago day come to mind."}, {"type": "sentence", "content": "***"}, {"type": "sentence", "content": "There was one thing on my list that finally got crossed out this week. Since the time I have been in Hyderabad, I have wanted to visit Charminar during the month of Ramzan. In the days preceding the Eid, the entire neighborhood comes to life at night after the fast is broken. It has a unique atmosphere that is specific to the season regardless of the time of year."}, {"type": "sentence", "content": "I have thought about going there every year for the last five years at least. I was told that it is not safe, it is too crowded, there is nothing for me there since I don’t eat mutton biryani and a myriad other reasons to stay away. And I heeded these words. Until this week."}, {"type": "sentence", "content": "On Tuesday night I spent the hours between 11 p.m. and 3 a.m. in the area around Charminar. I bought glass bangles at Laad Bazaar, picked up cheap chappals on the roadside and ate sinful chola bhatura. The place was lit up like a thousand Christmas trees, with cartloads of fresh fruit, and the seasonal delicacy, haleem. Piles of clothes at bargain prices block the entrance to stores."}, {"type": "sentence", "content": "Footwear in an astonishing range of colors and mind-boggling prices twinkled in the bright lights. I looked forward to some good-natured bargaining with the smiling vendors for sandals, crockery, and jewelry at every step. Women in burkhas walked by while men on motorbikes ogled the woman in our group. Young boys announced the latest discounts while college girls selected accessories with a vengeance."}, {"type": "sentence", "content": "Festive energy enveloped the place. An easy camaraderie seemed to permeate the streets. The Charminar was lit up for the occasion and looked like a jeweled masterpiece erected temporarily, like a bouncy castle for a child’s birthday. The bangle seller tried to convince me about the novelty of his goods by saying that the only ‘old’ thing in the neighborhood was the Charminar, everything else was brand new!"}, {"type": "sentence", "content": "We took pictures with our fancy cameras but no two-dimensional depiction could capture the enthusiasm of the shoppers or the incipient joy that flowed through the streets."}, {"type": "sentence", "content": "I felt totally at home in the crowds. It was almost like a regular day in a Mumbai local train. With all the lights around, it seemed like 8 p.m., not midnight. I am not a night owl but the contagious energy of the masses seemed to move me for a few hours until it was time to grab some Famous icecream and return home. What a great way to participate in the spirit of Ramzan! Eid Mubarak!"}, {"type": "sentence", "content": "Originally published at https://www.ranjanirao.com on May 22, 2020."}], "topic": "travel"}