{"title": "What People Who Live Long — and Through Pandemics, War, and More — Have in Common", "data": [{"type": "subtitle", "content": "It may be a combination of genetics, lifestyle, attitude, and a yearning to keep on going"}, {"type": "sentence", "content": "During the Second World War, an American woman named Shelley Smith Mydans reported on the conflict for Life magazine. Along with her husband, the photographer Carl Mydans, Shelley documented WWII in both Europe and the Pacific."}, {"type": "sentence", "content": "Midway through the war, the Mydans were captured in the Philippines. The Japanese held them in POW camps in Manilla and Shanghai. But despite spending two years as prisoners of war, both Mydans survived and went on to live long and productive lives. Shelley lived to 86, while Carl made it all the way to 97."}, {"type": "sentence", "content": "Many who survived the war were not so fortunate. A U.S. serviceman named Philip was also in the Pacific Theater during WWII. Even before the war, Philip was prone to anxiety and “catastrophizing” — to always predicting the worst. After he returned home, these traits intensified. Philip drank heavily and separated from his wife. Although he saw that there were positive aspects of his wartime experience, he was also frustrated and resentful about his time overseas; he felt it had hurt his marriage and disrupted his life. As the years passed, his drinking escalated. He tended not to exercise, and he was occasionally depressed. He died at age 64 of a heart attack."}, {"type": "sentence", "content": "Philip’s story is recounted in The Longevity Project, a book that summarizes a 20-year study based on interviews and health data collected from approximately 1,500 people — each followed from youth until death. “Our study wasn’t designed to look specifically at people who lived through hard times, but of course many did,” says Leslie Martin, PhD, a professor of psychology at California’s La Sierra University. “We found that many people who lived through hard times went on to live long lives — even though their lives were not stress-free, by any means.”"}, {"type": "sentence", "content": "Unlike Philip, for whom the war seemed to push life onto a difficult and self-destructive path, Martin says that the Mydans appeared to turn their WWII experience into a source of motivation. “They didn’t see their stress as meaningless — it seemed to fuel them,” she says. “And this ability to think about the hard things we go through as ultimately beneficial — whether to ourselves or to people we care about or to society at large — seems to be important.”"}, {"type": "sentence", "content": "Eat right. Exercise. Avoid stress. These vague directives are often framed as the necessary ingredients in a long and healthy life. And there’s some truth to each of them. But Martin and others who have studied longevity say these are oversimplifications that tend to prioritize action over attitude. While day-to-day habits and behaviors matter a great deal, a person’s approach to life — including, and maybe especially, the way they react to hardship — is arguably the more important side of the longevity coin."}, {"type": "sentence", "content": "In the midst of Covid-19 and the many challenges it presents, a close look at the lives and shared qualities of long-living people can be instructive — and inspirational. While there are few hard-and-fast rules when it comes to living a long life, there seem to be helpful guidelines."}, {"type": "sentence", "content": "“What we’re going through right now… for some people, this might be the first time they’ve been really tested with something difficult,” Martin says. “What we’ve found is that the way we respond to a test like this and the mental perspective we take can make a difference.”"}, {"type": "subtitle", "content": "The power of personality"}, {"type": "sentence", "content": "Experts who study longevity often talk about “pathways” and “trajectories.” They do so to make the point that short-lived events or endeavors — good or bad — matter much less than durable habits or beliefs. “Problems arise when you veer off a healthy pathway and cannot steer yourself back to safety,” says Howard Friedman, PhD, Martin’s co-author on The Longevity Project and a distinguished professor of psychology at the University of California, Riverside."}, {"type": "sentence", "content": "For many, times of hardship — like say, a global pandemic keeping people in their homes for months — are the obstacles in the road that lead to this kind of veering. And, when confronted by difficult times, Friedman says that a lot of people start drinking, smoking, abandoning exercise, cutting ties with friends, or making other unhealthy choices. These decisions and their consequences often far outlive the trials that spawned them; a drinking habit escalates, or lost friends are never replaced."}, {"type": "sentence", "content": "Ironically, good times can also act as catalysts for unhealthy behaviors. A period of professional success or an unexpected windfall can, in some cases, unmoor people from the healthy habits and personal ideals they clung to before. But certain qualities seem to safeguard people from the pitfalls created by periods of both feast and famine. And experts say one consistently tops the list. “In terms of personality characteristics, the strongest predictor of a long life was being high on conscientiousness,” says Martin."}, {"type": "sentence", "content": "“Conscientiousness” refers to someone who is organized, prudent, and persistent in their pursuits. “Conscientious people are planful and responsible, not impulsive,” she says. “When they take on a task, they don’t give up easily.”"}, {"type": "sentence", "content": "This may come as a surprise to those who assumed carefree, take-it-easy types would be best insulated against life’s many injuries and injustices. “We actually found the most cheerful and optimistic people lived shorter lives,” Martin says. “Being worried or anxious all the time is a problem, but a little worrying — when you’re thinking ahead and working through scenarios — can help you to be better prepared.” Conscientious worriers tend to put their fretting to good use: They make choices or changes in response to their concerns. Their worrying is productive, not pointless."}, {"type": "sentence", "content": "There are more straightforward explanations for a conscientious person’s longevity: These are folks who tend to wear their seatbelts, eschew heavy drinking or drugs, and avoid other sources of undue risk. They’re not totally risk-averse, Martin clarifies, but they’re thoughtful and judicious about the risks they’re willing to take. Conscientious people also tend to adopt and stick with healthy habits, and their awareness and diligence tend to lead them into healthy relationships and jobs. All of these tendencies promote a long and healthy life."}, {"type": "sentence", "content": "There’s some evidence that conscientiousness is at least partly dependent on brain chemistry. Hormones and neurochemicals such as serotonin seem to play a role in impulsivity and risk-taking. But Martin says personality “is not set in stone,” and that’s particularly true for young people."}, {"type": "sentence", "content": "How can someone become more conscientious? She says that adopting healthy routines and following a daily schedule is a good start. These are things that conscientious people do automatically, but that others can teach themselves to do with effort. “Just going along and letting things happen when they happen isn’t particularly good for our mental health, or for helping us get things done,” she says. She also recommends spending time with people who are diligent and organized, and who have other admirable qualities. “Associating with people who demonstrate these behaviors can make habit-forming easier, as their tendencies influence us a bit,” she explains."}, {"type": "sentence", "content": "Others agree that people really do have the capacity to change their minds and behaviors. “It is certainly possible to change your personality, and it happens pretty quickly,” says Gary Small, MD, director of the University of California, Los Angeles Longevity Center and author of Snap, a book about the power people have to adopt new habits of mind."}, {"type": "sentence", "content": "He says that a core element of conscientiousness is tenacity — or sticking with a healthy change or ambition once you’ve started it. The more people push themselves to follow through on their goals — even very small and easy to achieve ones — the more they can build up their tenacity muscles. He also says that the ability to be flexible is important: When the course of life disrupts plans or schedules — as it’s surely doing for most people in the midst of Covid-19 — the ability to pivot into a new but still healthful and satisfying routine is essential."}, {"type": "sentence", "content": "“It’s not as though the very old have been sheltered from adversity,” says Peter Martin, PhD, a professor at Iowa State University who has devoted much of his career to the study of healthy aging. “Anyone who has lived to 100 has faced many difficult situations.” He echoes many of the above sentiments and mentions a few other characteristics that the long-lived seem to share. “They’re not uptight or neurotic,” he says. While not blasé about life’s challenges, people who live a long time usually don’t catastrophize — that is, they don’t assume the worst, which is a habit that can lead a person to make choices that get them into trouble, such as prematurely abandoning a healthy routine or promising enterprise."}, {"type": "sentence", "content": "Martin says those who live a long time also tend not to engage in “upward comparisons.” This means they don’t spend a lot of time comparing themselves or their present circumstances to more-fortunate others or happier times. Instead, they think about people who have it worse, or situations they endured that were even more difficult."}, {"type": "sentence", "content": "Another, underappreciated element of longevity is something Martin refers to as “geotranscendence,” which, roughly, is a preference for a cosmic or spiritual worldview, rather than a materialistic or strictly rational one. He says many long-lived individuals seemed to lean toward the spiritual as they age. “You see a pronounced reliance on religious beliefs — on putting faith in a higher power’s hands,” he says."}, {"type": "sentence", "content": "Adopting a more spiritual attitude may allow people to better work through the aspects of life that they find inscrutable or disconcerting. “When you’re able to hand things over to a higher being, that’s a way of letting go,” he says. At a certain point, letting go can reduce anger, frustration, and many other emotions that push people toward unhealthy thoughts or actions."}, {"type": "subtitle", "content": "Other factors that matter"}, {"type": "sentence", "content": "Valter Longo, PhD, is director of the Longevity Institute at the University of Southern California. Last year, Longo traveled around Italy to speak with centenarians — those who had lived to or beyond the age of 100 — in an effort to uncover patterns that might explain their enviable longevity."}, {"type": "sentence", "content": "He says that two themes emerged. One was a theme of genetic good fortune. “They’d say, ‘My sister made it to 94. My brother to 98.’ So genes played a big part in it,” he says. “The other story was the person who did not have any long-lived siblings or parents, but they were in a concentration camp during World War II.” In other words, something about living through incredible hardship seemed to bestow longevity on certain survivors. Longo has a couple theories about what that “something” could be."}, {"type": "sentence", "content": "His first theory is based in nutrition science. Much of his work — in mice and in people — has found that periods of fasting or caloric restriction can help clear away dead or dysfunctional cells in ways that may discourage the development of disease and also promote longevity. “If we give mice low levels of protein or calories for a while, then we feed them normally, they live longer than the mice we fed normally the whole time,” he says."}, {"type": "sentence", "content": "While malnourishment is an extreme and inhumane example of forced deprivation, Longo points out that many places in the world where people tend to live into very old age are also places where people eat a vegetable-centric and meat-restricted diet. Along with clearing away dead or diseased cells, “eating this way could cause epigenetic changes that affect lifespan,” he says, referring to diet-induced alterations in the way some genes are expressed."}, {"type": "sentence", "content": "His second theory is more of an observation. “One thing all these centenarians had in common is that they all wanted to live — they wanted to go on,” he says. “They didn’t say, ‘I’m ready to die’ or, ‘I don’t care anymore.’ They were still interested in life and paying attention to everything.” While most people are passionate and engaged when they’re young, a great many lose these attributes as life wears on. And this loss seems to matter."}, {"type": "sentence", "content": "La Sierra’s Martin says she’s also noticed this characteristic. “The outlook on life that typified many of the long-living individuals was one of, ‘I will not give up. I think that what I’m doing is important.’” These are not people who regard life as fruitless or arbitrary. “These are people who tend to find meaning in what they do,” she says."}, {"type": "sentence", "content": "While an effort to inject meaning into life could be viewed as an attitude, it’s also a product of a person’s pursuits. Returning to the story of Philip, the heavy drinking WWII vet who died young of a heart attack, Martin’s book says that he found his job merely “tolerable,” and that he was looking forward to retirement — though he didn’t know how he would fill his time or whether he would enjoy himself. Even in his early sixties, he did not seem like a person who was involved in activities that gave his life passion or purpose. Unlike Philip, people who tend to live a long time are often the types who actively pursue goals that provide them a strong sense of accomplishment, Martin says."}, {"type": "sentence", "content": "UC-Riverside’s Friedman agrees. He says that “increasing one’s maturity” over the years is essential to maintaining good health. “This means more involvement with meaningful work — work with a purpose — and doing good things for family, friends, and society,” he says."}, {"type": "sentence", "content": "Close relationships are important. But the quantity of friends a person has mattered less than the depth of those friendships. “If you are an introvert with a few close relationships, then that is as good as being an extrovert with many more ties; it is the quality and consistency of the ties that matter,” he says."}, {"type": "sentence", "content": "Here again, lived hardship may play an important role. While some regard tough times as a sign that life is unfair or unpleasant, others emerge from a struggle with a greater sense of gratitude and a newfound resolve to commit their time and efforts to things that matter — to close friendships, to family bonds, or to hobbies, or work for which they feel passionate."}, {"type": "sentence", "content": "As Covid-19 has made plain to all, no life is without its challenges. While everyone is entitled to a period of adjustment during difficult times, those who endure will not let those difficulties knock their lives or attitudes off course for good. “If you dwell on the negative, you’re not going to do well,” UCLA’s Small says. “But if you can see a challenge as something to rise to, it can be very gratifying to get to the other side.”"}], "topic": "neuroscience"}