{"title": "Top 5 online courses to get you started with Data Science today.", "data": [{"type": "subtitle", "content": "Here are the online courses that got me started on Data Science."}, {"type": "image", "content": "https://miro.medium.com/max/7936/0*nweMoZuh1PjKj7pk"}, {"type": "sentence", "content": "Data Science is still one of the most popular professions in 2020. In fact, the demand is skyrocketing to the point where qualms arise that the data science skill gap will perpetuate in widening, as the supply of data wizards fail to catch up to the demand of the companies around the world."}, {"type": "sentence", "content": "That said, there are tons of students who are jumping into the field and taking on this complex topic in college so that they can keep up with the trend and have a shot at this multidisciplinary career. Due to reports such as Glassdoor’s 50 Best Jobs which deemed Data Science the conquerer in the last 4 years consecutively, and a tsunami of articles and online courses prompting and influencing youngsters to embark on this endeavor to master Data Science."}, {"type": "sentence", "content": "However, with the internet, some daring individuals have decided to formulate his or her own curriculum or pathway to learn about Data Science. Since Data Science has become democratized and almost anyone can learn about it today, even without a formal education, learning about it on your own is entirely possible."}, {"type": "sentence", "content": "So this article is for all those who are thinking of learning Data Science or you’ve been wanting to know more about it but don’t know where to start. In this article, I share the 5 courses that got me started on Data Science and had me passionate about turning data into insights."}, {"type": "sentence", "content": "But before diving into the list, here are some prerequisites before starting these courses."}, {"type": "sentence", "content": "With that taken care of, check out the list below!"}, {"type": "subtitle", "content": "1. What is Data Science — IBM"}, {"type": "image", "content": "https://miro.medium.com/max/1850/1*uaUZ7qR8810Fz7pscnRDoQ.png"}, {"type": "sentence", "content": "Coursera is one of the best MOOC/online learning platforms out there today and it has myriads of amazing courses to up your game in programming, mathematics, machine learning, etc."}, {"type": "sentence", "content": "The course provided by IBM— What is Data Science is a great starting place for all data science enthusiasts out there, it explores how humans have been uncovering insights and trends from data way back in ancient times. Fast forward to this day, an era where Artificial Intelligence is superseding humans in certain fields and the exponential growth of data, Data Science can do wondrous things."}, {"type": "sentence", "content": "In this course, you will discover what Data Science really is, the important topics involved in the field — Neural Networks, Hadoop, Big Data, and how data wizardry is used in business."}, {"type": "subtitle", "content": "2. CS109 — Harvard University"}, {"type": "image", "content": "https://miro.medium.com/max/2220/1*Xc13DQs9Q2PZGSmeN1FOcw.png"}, {"type": "sentence", "content": "CS109 is a popular beginners course for Data Science, it covers the nitty-gritty aspects of Data Science, and follows the de facto, standard university curriculum. The best part about this course is that its taught by Harvard, a prestigious university that costs big bucks but made free for everyone."}, {"type": "sentence", "content": "This entire course is available at GitHub and videos are all mostly HD. There are lecture slides as well for you to follow with the curriculum as you learn. Homeworks are given too, and if you are interested in doing them just follow the procedures on the README.md and you should be all set!"}, {"type": "sentence", "content": "Although this course is from 2015, it still teaches almost everything you need to know about Data Science. The course content includes — Python, web scraping, Probability, Regression, Machine Learning, Ensembles, Bayes, and Clustering. There’s also a final capstone project you for the last week to test your knowledge and whether you’ve really been learning constructively."}, {"type": "subtitle", "content": "3. Introduction to Data Science in Python — University of Michgan"}, {"type": "image", "content": "https://miro.medium.com/max/2098/1*snvzz7_09cngFm1updILVw.png"}, {"type": "sentence", "content": "Offered by the University of Michigan, one of the top universities in the US, this course introduces learners to data science through the python programming language, which is very prominent in the data science world today."}, {"type": "sentence", "content": "You will be taught the basics of the python programming environment, including fundamental python programming techniques such as lambdas, reading and manipulating CSV files, and the Numpy library."}, {"type": "sentence", "content": "Throughout the entire course, Jupyter notebooks are used, which are versatile and very easy to use. You get to familiarise yourself with the popular tool Data Scientists use in their day-to-day work."}, {"type": "sentence", "content": "In short, you get to learn Python (the most popular language for Data Science, though other languages like Golang and Julia, are catching up), Numpy, Pandas, and Data cleaning (which as you know, data scientists spend 80 % of their time on)"}, {"type": "subtitle", "content": "4. Kaggle Micro courses"}, {"type": "image", "content": "https://miro.medium.com/max/1994/1*sVVlYzLfwLJxFB5DZNMkhQ.png"}, {"type": "sentence", "content": "This amazing collection of micro-courses is an amazing resource for everyone wanting to learn data science for free, it covers almost every aspect there is to Data Science, some of the courses include the basics such as Pandas, Intro to SQL, Data Visualization up to the complex topics such as deep learning and NLP."}, {"type": "sentence", "content": "They profess that these micro-courses are the “fastest and most fun” way to learn Data Science or to just improve your skills. Moreover, these courses teach complex topics but are stripped down to their key components, so that you can learn them in a mere few hours."}, {"type": "sentence", "content": "A great place to start is the course Learn Python and Intro to Machine Learning."}, {"type": "sentence", "content": "P.s. you get free certificates after completing them, just a little heads up. They’re great for motivation and it pushes you to complete it."}, {"type": "subtitle", "content": "5. Google Machine Learning Crash Course with TensorFlow APIs"}, {"type": "image", "content": "https://miro.medium.com/max/1528/1*6S9ptjlYWRVHtpEKkgywFw.png"}, {"type": "sentence", "content": "This course is an amazing gem out of the tsunami of content on the internet and everyone who wants to learn about Machine Learning should check it out. It’s taught by people experts at Google and they're amazing at breaking down difficult topics in a way for complete beginners."}, {"type": "sentence", "content": "Though before you have a run at this course, you should head over to the prerequisites page and make sure you are capable of learning Machine Learning. Don’t get too excited and start learning about something you can’t understand. Mathematical knowledge on Linear Algebra and Multivariable Calculus is required."}, {"type": "sentence", "content": "Get hands-on with algorithms and fundamental machine learning concepts with this Crash Course and get real-world experience with the companion Kaggle competition."}, {"type": "sentence", "content": "Google developers also have a free python crash course if you’re interested. You can also visit Learn with Google AI to explore the full library of training resources."}, {"type": "subtitle", "content": "Action plan"}, {"type": "image", "content": "https://miro.medium.com/max/10944/0*cA4OMiccxzIuhZQp"}, {"type": "sentence", "content": "The Internet is honestly one of the greatest invention of all time, but as with all things, there comes the good and bad side of it. You can either learn new skills and create a better future for your life, or spend days watching multiple TV shows on Netflix, which you might regret when you’re older. I would suggest choosing the former, though the controlled use of Netflix doesn’t hurt."}, {"type": "sentence", "content": "With so much uncertainty and chaos going on, it’a truly hard to muster the willpower and strength to focus and pour effort into your personal projects and passion. But stay optimistic and look at the positive side of things, you’re spending more time at home and you may even be connecting with your family more."}, {"type": "sentence", "content": "So I hope you will utilize the Internet for the purpose of acquiring skills that would be beneficial to your future and at the same time cherish the time you have with your family and friends. Remember to stay optimistic and garner the energy to learn."}, {"type": "subtitle", "content": "Recommended habits/practices for learning online"}, {"type": "sentence", "content": "Thanks for reading and I wish you all the best in your journey towards Data Science!"}, {"type": "subtitle", "content": "What’s next"}, {"type": "sentence", "content": "Check out this list of Top 20 free Data Science, ML, and AI MOOCs on the Internet for more topics such as Deep Learning and NLP"}, {"type": "subtitle", "content": "Check out some of my best articles on Data Science!"}, {"type": "subtitle", "content": "Read my series on Ultralearning Data science that proffers a profusion of advice and tips on learning effectively."}, {"type": "subtitle", "content": "Contacts"}, {"type": "sentence", "content": "If you want to be updated with my latest articles follow me on Medium."}, {"type": "sentence", "content": "Other means of contact:"}, {"type": "sentence", "content": "Stay Safe!"}], "topic": "education"}