{"title": "When There’s Nothing You Can Do", "data": [{"type": "subtitle", "content": "How do we find peace when we have such a lack of control?"}, {"type": "sentence", "content": "Do you ever feel like no matter what you do, nothing is going to change a situation?"}, {"type": "sentence", "content": "Do you ever feel like no matter how much you try to make things better, no change happens?"}, {"type": "sentence", "content": "I feel that way — in fact, I feel that way all the time, as a teacher in Baltimore City. Yes, sometimes I feel hopeless, like there’s nothing I can do, but I know that just being there is important, and that the fact that I a ma witness to the forces around me that just make life so damn hard for the people around me."}, {"type": "sentence", "content": "In Baltimore, we’ve had over 300 murders every year since 2015. No matter how many new police commissioners, legislative plans, or anything else that’s happened, it just seems like, well, there’s nothing we can do tho changed he culture of violence in the city."}, {"type": "sentence", "content": "I understand that executing success comes one step at a time, but what do we do when there’s nothing we can do. I’m currently watching Charm City, a movie about Baltimore’s violence over the past couple of years and a documentary following various people in East Baltimore, from police officers, drug dealers, community organizers, and just regular community people."}, {"type": "sentence", "content": "One scene shows the officers doing the best they can to make a drug arrest, with a body-cam video showing that it was a clean arrest that didn’t hurt anybody and that the two officers were just doing their jobs. A call to the state attorney’s office shows the officers’ arrests being overturned because they didn’t write their reports the way the office wanted."}, {"type": "sentence", "content": "Even when people are trying to do the right thing, from the community organizers to officers to teachers, they are often reprimanded for doing so from forces much greater than them."}, {"type": "sentence", "content": "It genuinely feels like there’s nothing you can do in this documentary, and often, in real life, it feels like there’s nothing you can do to change things. The pandemic has actually come as a great relief to me because I’ve only had to focus on home and have prioritized my own writing."}, {"type": "sentence", "content": "I have had much greater control in these things than I have in my classroom, school, and community. Compared to now, when I go back into the classroom, I might feel like there’s nothing I can do to change things, like I did for the majority of this year."}, {"type": "sentence", "content": "Look, when there’s nothing I can do, I laugh. Even in the most hopeless of circumstances, people are funny. But all you can do sometimes is wait for the time to pass, navigate life as best you can when life is passing, and really not do anything when there’s nothing you can do."}, {"type": "sentence", "content": "I used to think you can sheer force and will your way towards any goal or objective. If only I alone had more willpower, maybe I would have solved the problem of educational inequity in Baltimore. But it’s a problem much bigger than me, and all the sheer force and willpower I can exert, well, won’t change a thing."}, {"type": "sentence", "content": "We’re all in situations where we feel similarly hopeless. The worst thing we can do is give up, because someone else in our situation would feel as hopeless or quit, too. But we can, however, live our lives and go on as time passes and hopefully the natural course of things brings change."}, {"type": "sentence", "content": "I leave it up to the higher power of God. There’s nothing I can do not only sometimes, but all the time, and it’s in God’s control, not mine, and if He wants to use me to bring substantive change, I’d be glad to be of service. The whole religious concept of surrender tackles and even radically embraces our lack of control — which is why I felt so compelled towards Christianity."}, {"type": "sentence", "content": "But until then, until there are answers, there seems like there’s nothing I can do, and it would only be more depressing to agonize over hopelessness. Maybe I should be more accepting of that."}], "topic": "mental-health"}