{"title": "SAFe Scrum Master vs ‘Scrum’ Scrum Master — Deceptively Alike, But Totally Different", "data": [{"type": "subtitle", "content": "A SAFe Scrum Master does not need to know about Scrum"}, {"type": "sentence", "content": "The Scaled Agile Framework (SAFe) exists to “to enable the business agility that is required for enterprises to compete and thrive in the digital age.” — scaledagileframework.com/about. Organisations adopt SAFe to align multiple teams working on the same product. SAFe is one of many ways to scale."}, {"type": "sentence", "content": "It is important to note that Agile teams in a SAFe environment can use Scrum, but can also choose to work differently:"}, {"type": "sentence", "content": "This is a key facet of Agile teams. They can also choose to adopt parts of Scrum and combine it with other practices. It is important to note, however, that according to the Scrum Guide, these teams do not use Scrum at all:"}, {"type": "sentence", "content": "Still, the servant leader of a SAFe Agile team has the title “Scrum Master”. If a SAFe Agile team uses Extreme Programming only, the servant leader and coach is still a Scrum Master."}, {"type": "subtitle", "content": "TLDR; Entirely Different Roles"}, {"type": "sentence", "content": "There is a difference between a SAFe Scrum Master and a Scrum Master according to the Scrum Guide (I will call it ‘Scrum’ Scrum Master from now on). Starting with the fact that Agile teams in a SAFe environment don’t have to use Scrum at all, there are many more things that make it an entirely different role:"}, {"type": "sentence", "content": "With that, it is clear that the roles are entirely different. So much so that it is strange that they have the same name. You could even argue SAFe is not a scaling framework for Scrum. It re-interprets the Scrum Master role, therefore it isn’t Scrum. It would be entirely logical to rename the Scrum Master role in a SAFe environment to something like SAFe Team master."}, {"type": "sentence", "content": "If you are interested in a detailed comparison of the two roles, you can find them in the remainder of the article. With that, I hope to bring clarity on this topic so next time you see a job description for a Scrum Master (in a SAFe or Scrum environment), you know what it entails."}, {"type": "subtitle", "content": "Similarities"}, {"type": "sentence", "content": "You would expect that the roles are very much the same. This section brings forward all similarities. Still, there’s fine-print to consider."}, {"type": "subtitle", "content": "Servant leader and coach"}, {"type": "sentence", "content": "Both types of Scrum Masters are servant leaders and coaches for their team. The Scrum Master is continuously challenging the status quo to help improve the team."}, {"type": "subtitle", "content": "Complementary practices"}, {"type": "sentence", "content": "Both types help the team understand Scrum and complementary practices like Kanban. The SAFe Scrum Master also focuses on teaching SAFe."}, {"type": "subtitle", "content": "Impediments"}, {"type": "sentence", "content": "Both help remove impediments. SAFe Scrum Masters identify and eliminate them. Scrum doesn’t specify that a Scrum Master identifies impediments. The reason is that everyone is responsible for identifying impediments to the team’s progress. By emphasising that one person is responsible for identifying impediments, you run the risk of creating teams depending on others to find and fix their problems."}, {"type": "subtitle", "content": "Self-organisation"}, {"type": "sentence", "content": "The Scrum Master’s primary role is to help a team to self-organise to achieve its goals. These include team goals and Sprint/Iteration Goals. SAFe adds to that that teams are/can be self-managing. Typically, self-management means the team has more authority than self-organisation. Interestingly, SAFe brings this forward where Scrum doesn’t."}, {"type": "sentence", "content": "The SAFe Scrum Master assumes that the responsibility for inter-team coordination cannot be delegated entirely to the Scrum Master; every team member shares this responsibility. This is in line with the concept of ‘self-organising team’."}, {"type": "subtitle", "content": "Product Owner"}, {"type": "sentence", "content": "The Scrum Master helps the Product Owner to manage the backlog. Other Scrum Master responsibilities towards the Product Owner are not for the SAFe Scrum Master. These include helping to do product planning in an empirical environment and practising agility."}, {"type": "subtitle", "content": "Descriptiveness SAFe vs rudimentary Scrum"}, {"type": "sentence", "content": "SAFe needs many words to describe the Scrum Master role. Sometimes these descriptions are clear-cut. In other cases, however, they confuse. Here are a couple of examples of SAFe’s descriptiveness."}, {"type": "subtitle", "content": "Framework of choice"}, {"type": "sentence", "content": "For starters, the SAFe Scrum Master supports teams with ScrumXP, Kanban, and other ways of working. Interesting here is the focus on ScrumXP. While Agile teams within a SAFe environment can choose their way of working, SAFe puts the spotlight on ScrumXP."}, {"type": "sentence", "content": "A ‘Scrum’ Scrum Master will help the team to create high-value products and coaches them to use ways of working that help to achieve this. The Scrum Guide doesn’t mention any additional practices because by making a list, it would rule out other practices."}, {"type": "subtitle", "content": "Helping to improve"}, {"type": "sentence", "content": "A SAFe Scrum Master helps a team to improve performance in areas of quality, predictability, flow and velocity. He/She helps them become better problem-solvers. The Scrum Guide however only discusses that Scrum Masters help teams to create high-value products. It is interesting to note that SAFe doesn’t mention Value in the context of improvement. Thus a team can bring more quality, predictability, better flow and higher velocity and miss out on bringing more value."}, {"type": "subtitle", "content": "Culture"}, {"type": "sentence", "content": "The SAFe Scrum Master also helps to create a culture of technical discipline and craftsmanship. He/she works to build a high-performing team and assists to resolve interpersonal conflicts, challenges, and opportunities for growth. The SAFe Scrum Master also often helps the team build effective relationships with other teams. Lastly, a SAFe Scrum Master helps individuals and teams through personnel changes."}, {"type": "sentence", "content": "This all is way more descriptive than you will ever find in the Scrum Guide. A ‘Scrum’ Scrum Master can do these things to help create high-value products. But the Scrum Guide is deliberately vague about it."}, {"type": "subtitle", "content": "Sourcing of the role"}, {"type": "sentence", "content": "SAFe has some very clear-cut ideas about how to source the SAFe Scrum Master. The role can be part-time or full-time. For Enterprise-scale, SAFe recommends a part-time Scrum Master. It supposedly will be a challenge to bring across the need for full-time Scrum Masters in an environment of 100 teams or more. The SAFe Scrum Master section even discusses that a company has to choose between developer capacity and Scrum Master capacity, hinting that developer capacity brings more merit. Therefore SAFe assumes that a Scrum Master role is part-time except at the start of the transformation. SAFe also recommends having external consultants as Scrum Masters, especially during initial SAFe adoption."}, {"type": "sentence", "content": "The Scrum Guide doesn’t discuss all of this, leaving room for all kinds of choices. One could argue that SAFe leaves the same room for choices, but it brings forward many so-called best-practices that these are in essence driving companies to a certain direction."}, {"type": "subtitle", "content": "Deviations from Scrum Guide Scrum Master role"}, {"type": "sentence", "content": "SAFe Scrum Masters also have responsibilities that are not (fully) in line with the ‘Scrum’ Scrum Master’s role. It’s here where the two roles become distinctly different."}, {"type": "subtitle", "content": "Ensuring the process"}, {"type": "sentence", "content": "A SAFe Scrum Master ensures that the team follows the agreed Agile process. This means that a SAFe Scrum Master can intervene when a team deviates from the process. A ‘Scrum’ Scrum Master only promotes and supports Scrum. When a team deviates from Scrum, the ‘Scrum’ Scrum Master can’t force them to get back on track."}, {"type": "subtitle", "content": "Fostering a high-performing environment"}, {"type": "sentence", "content": "SAFe Scrum Masters foster an environment for high-performing team dynamics, continuous flow, and relentless improvement. The Scrum Guide doesn’t mention all of this. It only discusses:"}, {"type": "subtitle", "content": "Assisting in SAFe implementation"}, {"type": "sentence", "content": "SAFe Scrum Masters help to implement and support SAFe principles and practices. They work together with Release Train Engineers and Solution Train Engineers to improve the effectiveness of SAFe."}, {"type": "sentence", "content": "They also help the team to coordinate with other teams on the Agile Release Train. SAFe Scrum Masters frequently represent the team in the Scrum of Scrums."}, {"type": "sentence", "content": "These are all responsibilities that are not for a ‘Scrum’ Scrum Master."}, {"type": "subtitle", "content": "Part of Scrum but not for SAFe Scrum Master"}, {"type": "sentence", "content": "A SAFe Scrum Master doesn’t have the same responsibilities as a ‘Scrum’ Scrum Master. Even some responsibilities that are in the Scrum Guide don’t apply to a SAFe Scrum Master. This may explain why a SAFe Scrum Master isn’t a full-time role."}, {"type": "subtitle", "content": "Scrum adoption"}, {"type": "sentence", "content": "The Scrum Master services the Development Team, the Product Owner and the Organisation in its Scrum adoption. However, a SAFe Scrum Master mainly focuses on the first two. The role of the SAFe Scrum Masters to the organisation is far less prominent. Within SAFe other roles are taking huge chunks of that responsibility."}, {"type": "sentence", "content": "A SAFe Scrum Master will not lead the organisation in its Scrum adoption, will not plan Scrum implementations and will not recommend changes to the organisation that help the team to improve their Scrum adoption. They may do this for SAFe adoption as a whole. This can include recommended changes that help to improve Scrum adoption."}, {"type": "subtitle", "content": "Artifact transparency"}, {"type": "sentence", "content": "A facet that many overlook but is pivotal at the same time is the Scrum Masters role in artifact transparency to allow empiricism. Oh, by the way:"}, {"type": "sentence", "content": "Without transparency, the team and its stakeholders may make the wrong decisions. A Scrum Master needs to ensure if the artifacts are completely transparent and help the team to reach complete transparency if this isn’t the case."}, {"type": "subtitle", "content": "Endnote"}, {"type": "sentence", "content": "Whenever you see a job description that mentions the role of ‘Scrum Master’, you have to look beyond the title. Besides the many misconceptions about the role, there are also subtle but important differences between a Scrum Master in a SAFe environment and a Scrum Master according to the Scrum Guide."}, {"type": "sentence", "content": "Some of the responsibilities are the same, but other responsibilities are distinctly different. If you then realise that SAFe promotes a framework called ScrumXP, then it becomes clear that the Scrum Master as it exists in Scrum could better have a different name."}, {"type": "image", "content": "https://miro.medium.com/max/1938/0*e3x-YkvIRg0zekfl.png"}], "topic": "leadership"}