{"title": "We Lost Track of Slow", "data": [{"type": "image", "content": "https://miro.medium.com/max/6898/1*ZQdIST7Ta5x1qpYKAIazcQ.jpeg"}, {"type": "sentence", "content": "The last time I saw her she was lingering over the last line of Bridges of Madison County. Remember how she used to light her cigarette off yours? How she walked down F Street along the curb like Mary Lou Retton?"}, {"type": "sentence", "content": "My favorite thing about Slow in those days was walking down to the pond by the Lincoln Memorial where she would French braid my hair, then her own, and we’d watch children chase pigeons and tell each other our most awkward first kiss stories."}, {"type": "sentence", "content": "Slow was the kind of girl who would one day get lost."}, {"type": "sentence", "content": "I’m not saying she wasn’t smart — she knew the words to every 80s TV theme song."}, {"type": "sentence", "content": "Slow was her own blend of brilliant. But in a dying star sorta way."}, {"type": "sentence", "content": "If you see her — Slow — will you tell her something for me?"}, {"type": "sentence", "content": "Tell her I’m going rollerblading again."}, {"type": "sentence", "content": "Tell her I think of her, of that time in her dorm room when we skipped PoliSci and smoked from the red bong."}, {"type": "sentence", "content": "Tell her I have children now, and in my son, there are hints of her, subtle reminders in the way he looks at me before reluctantly falling to sleep."}, {"type": "sentence", "content": "I know it’s partly or mostly my fault we don’t speak anymore."}, {"type": "sentence", "content": "It was I, after all, who forgot our appointment to dream."}, {"type": "sentence", "content": "I won’t blame married life, or my coworkers, or the rising price of gas. Even though that feels safer."}, {"type": "sentence", "content": "Tell her there’s a tree in North Carolina where Jack Kerouac said nothing ever happened. Let’s pencil in a time and meet there."}, {"type": "sentence", "content": "I’ll braid her hair and she’ll braid mine and we’ll roll our own and light them off each other."}], "topic": "fiction"}