{"title": "Leaving It All Out There: A Simple Guide For Overcoming Procrastination", "data": [{"type": "subtitle", "content": "The key is to be ok with what you are capable of producing and then, without hesitation, put it out for the world to see."}, {"type": "subtitle", "content": "The Mindset"}, {"type": "sentence", "content": "The goal here is to overcome self-sabotage and, in turn, mediocrity. Here are several points to keep in mind when instilling this type of mindset into your life."}, {"type": "sentence", "content": "Understanding these types of narratives will help program your mind to run more efficiently."}, {"type": "subtitle", "content": "Example — Mucking Up Your Daily Schedule"}, {"type": "sentence", "content": "You wake up late in the afternoon and realize that your routine is already shot."}, {"type": "sentence", "content": "Your twenty five minute morning meditation is going to be much harder now, if you even get around to it, because you’re hungry, thirsty, and need to use the restroom."}, {"type": "sentence", "content": "Journaling your goals and setting an intention for the day is something you needed to have done before the momentum of your schedule started."}, {"type": "sentence", "content": "The result of these kinds of days is usually met with stress. Stress, stress, stress."}, {"type": "sentence", "content": "You end up skipping more things on your to-do list, and your goals become shifted ever so slightly towards later in the week."}, {"type": "sentence", "content": "Stress, in turn, turns off the executive thinking centers of our brains. This is a critical center for proper decision making and long-term planning. Without this, we are doomed towards making rash decisions that are probably not very beneficial for our well-being mentally or physically."}, {"type": "sentence", "content": "This break in momentum brings with it a feeling of defeat; binge-watching television, drinking a little too much alcohol, and numbing ourselves with some other forms of mass dopamine-production are the end results for many of us."}, {"type": "subtitle", "content": "Setting Ourselves Up For Successful Days"}, {"type": "sentence", "content": "Multi-million-dollar motivational speakers such as Brendon Burchard, Tony Robbins, and Dr. Joe Dispenza, to name a few, have ways around this gradual fall into mediocrity."}, {"type": "sentence", "content": "That is not to say everyone needs to aspire to be like these people to be content with their lives."}, {"type": "sentence", "content": "It is, however, good to have people we can model after, taking their routines with a grain of salt, and tailoring them to our own lives."}, {"type": "sentence", "content": "Luckily, as we often see with all successful individuals, the simpler the daily routines, the more consistent progress becomes, and if this consistency becomes a daily habit, success will often-times find us."}, {"type": "subtitle", "content": "The Tools"}, {"type": "sentence", "content": "Each of these individuals carries out some form of mental rehearsal and relaxation techniques in the morning."}, {"type": "sentence", "content": "This includes meditation (which involves visualizing their future and letting go of their past), breathwork to change the chemistry of their body and minds (state-change), which is usually paired with physical activity (yoga or working out — they key being a movement of some kind)."}, {"type": "sentence", "content": "As a result, their days are filled with abundance. They wouldn’t dare miss a day when they feel so liberated, whole, and as Dr. Joe Dispenza often says, unlimited."}, {"type": "subtitle", "content": "The Ideal Life"}, {"type": "sentence", "content": "Everyone understands, on some level, that if you want to get ahead in life, you must avoid the mental trappings of ‘the ideal’."}, {"type": "sentence", "content": "This is to say, we cannot wait for the perfect weather to go running outside, pure silence to meditate, or a certain amount of income before we start paying off debt."}, {"type": "sentence", "content": "We need to become accustomed to questioning whether or not life is ever ideal. The answer is…not really."}, {"type": "sentence", "content": "Sometimes the stars line up, so to speak, where we have the energy and mental fortitude to sit down for three hours to bang out a killer article."}, {"type": "sentence", "content": "Unfortunately, motivation and idealizations aren’t very reliable sources to fall back on."}, {"type": "sentence", "content": "We can’t wait for the ‘opportune’ moment. There is nothing for us there, it is fleeting, almost mythical in its very nature."}, {"type": "sentence", "content": "Let us simply do the work, become entranced with the fact that we did something, and move on with our lives. You will thank yourself for the leeway, and others will be grateful that you are pulling your own weight."}, {"type": "subtitle", "content": "Integration"}, {"type": "sentence", "content": "Knowing that our ideas might be overlooked, outshined, or otherwise forgotten, should bring us solace — our ideas must be birthed from the void, the quantum field, the unknown, whatever you want to call it, the alternative is not doing anything at all, this is the most tempting and dangerous element of procrastination. It is also this illusion that ends up destroying a stable sense of self."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "We oftentimes shoot ourselves in the foot by overanalyzing the minutiae of life."}, {"type": "sentence", "content": "Don’t worry though, ‘perfect’ is subjective, it is not a fixed quality that we must obtain from somewhere else."}, {"type": "sentence", "content": "What has helped me tremendously is questioning my thoughts."}, {"type": "sentence", "content": "Nowadays, the academic areas involving neuroscience, psychology, cultural studies of first world countries (where materialism and therefore advertising are both very relevant in the importance of one’s daily life), and philosophy, all understand one overarching concept:"}, {"type": "sentence", "content": "The brain is highly suggestible (priming) and highly adaptable (plasticity)."}, {"type": "sentence", "content": "Continually learning by way of; reading books on new subjects, practicing new skills (playing guitar, trying out new cooking methods, different workout routines), I noticed I reacted less to my previous ways of thinking."}, {"type": "sentence", "content": "The self-limiting nature of these previously held beliefs and narratives I used to live by stopped me from completing new projects."}, {"type": "sentence", "content": "Continual daily learning brought with it less procrastination."}, {"type": "sentence", "content": "A concrete example is in my writing. I used to get stuck on the rough draft or brainstorming portion of my practice."}, {"type": "sentence", "content": "I would not feel that my ideas were flowing, so I would experience some level of guilt for not being able to accomplish what I set out to do."}, {"type": "sentence", "content": "Now, if I say that I want to sit down and brainstorm, or I already have a rough draft for a new article, I am simply ok with what I come up with and what I ultimately produce in the end."}, {"type": "sentence", "content": "This is key because, without this, I would essentially throw away unfinished ideas."}, {"type": "sentence", "content": "Ideas that I could have fleshed out to become entire articles. Or other projects, unrelated to writing, where I could have created something unique, but didn’t, because I was simply impatient and judged myself too much."}, {"type": "sentence", "content": "You will always get better if that is your sincere intention and, you will find out very quickly that, what used to be considered impossible is now very doable."}], "topic": "mindfulness"}