{"title": "Date night gets a little harder: Victoria’s Secret and Bath & Body Works closing in large numbers", "data": [{"type": "subtitle", "content": "COVID-19 is still leading to more store closures"}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*WppZJ_CrNne4AOw8w8A9ig.jpeg"}, {"type": "sentence", "content": "While retailers slowly re-open after two months of social isolation lockdowns left them unavailable to the public, some stores are saying goodbye for good. According to CNN Business, L Brands parent company is closing 250 Victoria’s Secret locations (out of 1,100 total in North America) and 50 Bath & Body Works locations (out of 1,700 stores in North America)."}, {"type": "sentence", "content": "Although Victoria’s Secret stores had been quietly closing due to lack of sales — and other competitors who have gotten a noticeable rise due to inclusiveness — Bath & Body Works closures may be the more shocking one. The smell-good chain had online sales skyrocket up to 85 percent during the last year, with its main hit being hand sanitizer. That alone sold $300 million in 2020 — up from $100 million in 2019 — and it’s not even summer yet."}, {"type": "sentence", "content": "From March to now, hand sanitizer, toilet tissue, paper towels and alcohol can’t stay on the shelves for any retail store that commonly sells them. During the worldwide coronavirus health outbreak that has left more than 4.99 million people infected and more than 327K people dead, people are hoarding these in larger numbers than normal (or predicted). As of now, there are only two options for hand sanitizer from Bath & Body Works — 3 oz. French Lavender spray and a five-pack of Beautiful Day pocketbac — but the rest of their online options are sold out or no longer listed."}, {"type": "sentence", "content": "For cruelty-free customers, this is a double loss. While Victoria’s Secret has perfumes, body sprays, lotions and lip glosses — in addition to lingerie and pajamas — they are primarily tested on animals. Bath & Body Works customers know that no matter what items they purchase in this retail chain, the items are not animal-tested cosmetics. There’s no need to check the label since the whole store follows this no-testing policy."}, {"type": "sentence", "content": "But there’s still some extra hope for casual BBW shoppers and regulars returning to brick and mortar stores. As has become common for today’s consumers, the retail chain requires face masks and keeping a six-foot distance in their brick and mortar stores. And when it comes to BBW’s suggestion to “wash hands frequently or use hand sanitizer,” clearly this is the chain that’ll have that covered upon entry."}, {"type": "image", "content": "https://miro.medium.com/max/600/1*ptgUHesIDUrlOQz7pX66RA.jpeg"}, {"type": "sentence", "content": "Would you like to receive Shamontiel’s Weekly Newsletter via MailChimp? Sign up today!"}], "topic": "business"}