{"title": "Pitch Deck Tips That Will Get Your Message Across", "data": [{"type": "sentence", "content": "The following is adapted from First Pitch by Debi Kleiman."}, {"type": "image", "content": "https://miro.medium.com/max/6000/1*BjOYcRSODbosV2ycEE8JKQ.jpeg"}, {"type": "sentence", "content": "Appearances matter in pitching."}, {"type": "sentence", "content": "Whether you are pitching one-on-one, one-to-several, or one-to-thousands, how your pitch deck comes across from an aesthetic point of view can make or break a presentation."}, {"type": "sentence", "content": "People make snap judgments; and once a person’s mind is set, it can be difficult to walk back a first impression. Think about the visual design of your deck as the wrapper for your content."}, {"type": "sentence", "content": "It needs to reflect the image you hope to project while also supporting your main messages. Good design begins with attention to detail."}, {"type": "sentence", "content": "What else don’t you care about?"}, {"type": "sentence", "content": "What details of building your company, executing on deliverables, or protecting their investment are you going to overlook?"}, {"type": "sentence", "content": "Nobody wants a sloppy business associate."}, {"type": "sentence", "content": "Fortunately, there are tried-and-true rules you can follow to help create a well-designed presentation."}, {"type": "subtitle", "content": "RULES FOR WELL-DESIGNED PRESENTATIONS"}, {"type": "sentence", "content": "When the look of the deck aligns with the message and the company, you are bound to make a favorable impression. In order to achieve good design, there are certain rules that, with few exceptions, should always be followed."}, {"type": "sentence", "content": "These universal rules for successful presentations are worth committing to memory:"}, {"type": "sentence", "content": "Many people use PowerPoint for a presentation deck, but it does have limitations. Fortunately, several companies have created excellent templates that are usable in PowerPoint."}, {"type": "sentence", "content": "They’re drag-and-drop, and the companies have already thought through visual presentation rules to help you craft something that fits, providing a wonderful jumpstart to your presentation and saving you from the agony of staring at a blank page."}, {"type": "sentence", "content": "The different slide templates incorporate various structures and formats to help you tell your story in a clear way. Canva and Slidebean are two examples of sites that offer free templates you can download and use to fill in your own content."}, {"type": "sentence", "content": "They offer even a novice the opportunity to create a professional look. You can also go to graphic design marketplaces like 99designs or Fiverr and put your job out to professional designers all over the world to bid on, yet another benefit of the gig economy, and decide from there which partner you want to work with."}, {"type": "subtitle", "content": "THE USE OF IMAGERY"}, {"type": "sentence", "content": "Let me start with this:"}, {"type": "sentence", "content": "Do not use it."}, {"type": "sentence", "content": "Ever."}, {"type": "sentence", "content": "The graphics should all be consistent in style. If your company is modern and sexy, you want to use modern and sexy graphics."}, {"type": "sentence", "content": "Sometimes you can use the image to help people remember things you want them to remember. For example, Ravish uses a shock and awe tactic with his graphics when pitching his magnetic ink company."}, {"type": "sentence", "content": "He introduces photos of huge piles of plastic on beaches. This is profoundly disturbing. Then he shows a picture of plastic with magnetic ink on it being moved to recycling, and that’s memorable."}, {"type": "sentence", "content": "If you find that you need to use stock images, that’s okay, as long as they are beautiful and stylized. There are plenty of sources for free photographs, so be careful that you don’t use copyrighted material without permission."}, {"type": "sentence", "content": "Inadvertently misappropriating intellectual property never makes a good impression in a pitch. Use images and photographs that render well both on-screen and printed; they’ll need to be high resolution so they don’t look fuzzy or hard to read."}, {"type": "sentence", "content": "The site startupstockphotos.com provides nice stock footage for PowerPoint decks. Another, unsplash.com, has inexpensive, high-quality images that are not copyright-protected."}, {"type": "sentence", "content": "It is worth buying nice graphics for your pitch deck; it can make all the difference."}, {"type": "sentence", "content": "They convey an idea via a symbol. If you use icons on a slide, make sure they are all from the same family and stick to that styling throughout the presentation."}, {"type": "sentence", "content": "For example, if one is in blue and reflects a certain style, they should all be in blue in that certain style."}, {"type": "sentence", "content": "Also, emojis are not icons."}, {"type": "sentence", "content": "Do not confuse them with icons, and do not use them."}, {"type": "sentence", "content": "A company called The Noun Project provides many free, low-cost icons that can be used in pitch decks. Icons look simple, convey a lot, and help reinforce your message if used consistently."}, {"type": "sentence", "content": "To learn more about how to perfect your pitch, you can find First Pitch on Amazon."}, {"type": "sentence", "content": "DEBI KLEIMAN is an award-winning marketer, teacher, startup advisor, mentor, and angel investor, with over fifteen years of experience working with and coaching startups of all kinds. She is the executive director of the Arthur M. Blank Center for Entrepreneurship at Babson College, the nation’s #1 school for entrepreneurship. At Babson, Debi helps student and alumni founders build their startups and teaches entrepreneurial marketing and pitching. Debi previously spent a decade leading initiatives in brand development and innovation at Coca-Cola, Welch’s, and Procter & Gamble. She received her MBA from Harvard Business School and currently lives outside of Boston with her husband and two teenage sons."}, {"type": "sentence", "content": "Excerpted materials from “First Pitch” are provided courtesy of Babson College. “First Pitch, © Babson College 2020. All rights reserved. No part of this book may be reproduced in any way without the prior, written consent of Babson College."}], "topic": "startups"}