{"title": "Put It In Your Own Words", "data": [{"type": "subtitle", "content": "How to find your voice and set it free"}, {"type": "sentence", "content": "One year ago, I had an epiphany that shattered the silence — not only mine, but the silence of thousands of people all over the world."}, {"type": "sentence", "content": "Although I’m a writer and make my living with words, I realized that all too often in my life and work, I was waiting for permission to speak. I was holding back on telling my story, on pursuing my dreams, because something inside me said I needed a person in a position of power to give me the go-ahead."}, {"type": "sentence", "content": "I was raised in an insular, religious world where women are taught to be subservient to men. And although I am now light-years away from that life, those early lessons of silence and submission have sunk into my bones. It has been hard to break free."}, {"type": "sentence", "content": "Since writing is the best way I know to process hard things, I started writing about it. First, I wrote a blog post. And then a conference talk. And then a hands-on workshop. And now a Personal Voice Workbook."}, {"type": "image", "content": "https://miro.medium.com/max/3600/0*b15MjAhofaexMlYZ.jpeg"}, {"type": "subtitle", "content": "How the world changes"}, {"type": "sentence", "content": "Before I knew it, I was traveling to far-off places, standing on stages in Israel and Australia and talking to people about how to unlock their voices. No matter where I traveled, or who I talked to, I found kindred spirits — people from different cultures, with disparate backstories, all struggling to believe their voices matter."}, {"type": "sentence", "content": "So many people have been conditioned for so long to sit down and shut up; they think that no one wants to hear their story. But in my years of writing, I’ve come to see that stories are really the things that change the world."}, {"type": "sentence", "content": "When you are brave enough to tell your story-unvarnished and raw though it may be-it resonates on a profoundly human level. And when you use your true voice, you can give someone else the courage to find their own. You can inspire someone or awaken someone or make someone uncomfortable enough that they begin to question their own fears and prejudices."}, {"type": "sentence", "content": "And that is how the world truly changes. When we hear voices that are different from our own. When we empathize, put ourselves in others’ shoes, try on new perspectives."}, {"type": "image", "content": "https://miro.medium.com/max/13164/1*iigDgvGL1PAfawHiudpnlA.jpeg"}, {"type": "sentence", "content": "In this unprecedented time, when we are locked in our homes and waiting out a global pandemic, our stories-our voices-matter even more."}, {"type": "sentence", "content": "So I’m deeply delighted to share the Personal Voice Workbook with you. It combines elements of both the “Permission to Speak” talk and workshop to give you the means to find and use your voice"}, {"type": "sentence", "content": "The workbook walks you through exercises designed to help you not only identify the things that silence you, but also envision how and when and where you can speak up. You can download a PDF and print it out at home, or pre-order the (super-gorgeous) analog version to arrive by mail."}, {"type": "image", "content": "https://miro.medium.com/max/2880/1*n0fVqeHB0MV_4Hm6TpdarQ.png"}, {"type": "sentence", "content": "Along the journey to unlock my own voice, I’ve learned that breaking through the silence requires a level of vulnerability and honesty that is sometimes uncomfortable. You have to get brave enough to crack yourself open and see what’s really going on inside. But, oh, so very much worth it."}, {"type": "sentence", "content": "Your voice is your power, and there’s never been a better time to claim it."}, {"type": "sentence", "content": "Originally published at https://dropbox.design."}], "topic": "design"}