{"title": "Mordhau: Pure Medieval PvP Chaos", "data": [{"type": "subtitle", "content": "This could be the best game of 2019 that you haven’t heard of"}, {"type": "sentence", "content": "Randomly browsing through Steam can be a funny thing. You never know if you’ll find a random gem, or perhaps one of your favorite games of 2019. The game I’m referring to is Mordhau, a bizarre medieval player-versus-player fighting game. Maybe that’s why you’ve never heard of it?"}, {"type": "sentence", "content": "On the surface, Mordhau may seem simple. Sure, it’s a medieval fighting game where you form teams and smash each other to bits. You can choose your own weapons and load out for a given match. But there are two things that really make this game special. First, there’s a massive community full of people who like to derp. Oh, and the developers really pay attention to them."}, {"type": "sentence", "content": "Then there’s the white-hot chaos that ensures when you throw 64 players wielding medieval weapons together onto a battlefield and tell them to go at each other. Picture this battlefield in your mind’s eye, and imagine walking across it — dodging arrows and axes, avoiding the occasional catapult, and ducking under a broadsword aimed right at your neck."}, {"type": "sentence", "content": "It’s a cacophony of noise, violence, and colour. And I love it! Who knows what it really felt like to be in a medieval battle; you get the sense, though, that this approximation is strikingly realistic, even if only based on the visceral sensory overload it imbues."}, {"type": "sentence", "content": "Before I forget: friendly fire is a thing here! So be careful when you swing that battle axe my way, won’t you."}, {"type": "sentence", "content": "What I’m describing may seem like one big, dumb, blunt object. But there’s a detailed combat system here. There are dozens of different weapons, each with their own reach, speed, and damage. You can swing, heavy swing, poke, throw, and stab — all in a variety of different ways. You can block, counter, chamber, and feint. Hundreds of different combos are possible. It’s possible to attack from multiple directions/angles as well."}, {"type": "sentence", "content": "As a result of these various permutations, there’s quite a steep learning curve. During your first 20–25 hours, you’ll be dying. A lot. You’ll need to train to improve to the point where you’re competitive in any real sense; this isn’t a game where you can just start playing and expect to rise to the top of the leaderboard. After some practice, you’ll get a sense of what play style works best for you."}, {"type": "sentence", "content": "There’s a huge sense of accomplishment here when you finally kill a player in a 1v1 or even 2v1 scenario."}, {"type": "image", "content": "https://miro.medium.com/max/3420/1*ORPRWuWoSrpSVJnlzDtIDw.jpeg"}, {"type": "sentence", "content": "Then there’s the loadout system, which is also very awesome. You start with a certain amount of points you can spend; these can be distributed across armour, perks, and weapons. The better the option you choose in each category, the more points it’ll cost. You have to think carefully about the combinations you’re going to put together in order to get the best bang for your proverbial buck. It’s also worth noting that every weapon, armour piece, and skin is actually unlockable with in-game currency — but there’s no pay to win system here. And loot crates aren’t a thing either. You’ll never spend real-world money on these items; rather, you’ll need to earn the in-game currency required to upgrade."}, {"type": "sentence", "content": "As you might expect, this makes it somewhat easy to spot high-level players. These folks sport the best and most expensive-looking armour (and are often flanked with a lovely gold sword to boot). Of course, you probably won’t be looking at these players for very long, or at close range: your best bet is to run, because you won’t last long in their presence. But don’t worry, that’s all part of the experience."}, {"type": "sentence", "content": "Okay, so let’s address the big, derpy elephant in the room. Mordhau doesn’t have an in-game voice channel but it does have chat. Despite this, most people use the emote system. There are dozens of emotes, as you might expect. Combine these with the many different screams and speeches you can do, and you’ll have a memeworthy recipe in no time!"}, {"type": "sentence", "content": "When you’re in battle, you’ll see the funniest and most random things. Sometimes there will be a naked dude running around with a massive hammer, killing everyone in his path while screaming. In the next match, you might spot an army of men with frying pans at the ready as they dive into battle."}, {"type": "sentence", "content": "I love this game! I really do. It’s completely nuts. The community is awesome and the gameplay is even better. Sure, it has a steep learning curve and yes, you’ll be killed by players with thousands of in-game hours under their belts…but it’s worth it. If you’re looking to blow off a little steam (and have plenty of laughs along the way), check out Mordhau."}], "topic": "gaming"}