{"title": "Mental Health Professionals Are Endangering Clients Through Lack of Scientific Training", "data": [{"type": "subtitle", "content": "Has your therapist been trained in the scientific method? Do they have a basic understanding of human physiology? Without this knowledge, they could be putting you in harm’s way."}, {"type": "sentence", "content": "Over 97% of scientists in the natural and physical sciences — such as chemistry, biology, and physics — support evolutionary explanations, according to the Pew Research Center (2009). Indeed, it is almost impossible to be a scientist without ascribing to an evolutionary view."}, {"type": "sentence", "content": "However, in the social sciences and in some areas of psychology, acceptance of foundational scientific tenets — namely evolution and genetics — is low and appears to be declining (Gross & Levitt, 1998; Perry & Mace, 2010)."}, {"type": "sentence", "content": "These trends are symptomatic of a larger anti-scientific or ascientific position signifying a widespread unwillingness to engage with key scientific concepts and a suspicion of scientific explanations of the world and of human behaviour. In such an environment, non-evidence-based ascientific treatments used by a large portion of mental health professionals — including counsellors, psychotherapists, and even some registered clinical psychologists — have flourished."}, {"type": "sentence", "content": "The resulting harm to clients is significant, surprisingly common, and estimated to be vastly under-reported. In order to work with a client with the goal of treating a psychological, mental, or emotional issue, all counsellors, psychotherapists, and psychologists should be registered with an accredited regulatory organization."}, {"type": "sentence", "content": "To be registered with said organization, the mental health professional must have completed significant, high quality training in science and scientific methodology, and this science training must be core to their graduate education. Without these measures in place, significant harm to clients and loss of faith in non-pharmacological psychological treatments will continue unabated."}, {"type": "subtitle", "content": "Lack of Evidence-Based Psychological Treatments and Graduate Programs"}, {"type": "sentence", "content": "Recent reports have shown that there is a widespread lack of evidence-based mental health and psychological services and low numbers of evidence-based psychology graduate programs in North America (Lilienfeld, Ritschel, Lynn, Cautin, & Latzman, 2013; McHugh & Barlow, 2010)."}, {"type": "sentence", "content": "There is substantial evidence showing that several clinical psychology graduate programs (especially those run by private, for-profit organizations) do not have high admissions standards, do not provide enough training in science or scientific methodology, and therefore produce graduates who do not know how to conduct their own research or read scientific journal articles (Baker, McFall, & Shoham, 2008)."}, {"type": "sentence", "content": "As a result, these graduates are unable to enter the wider ongoing scientific debate or help to resolve the growing divide between psychology research and practice."}, {"type": "sentence", "content": "Additionally, a large faction of clinical psychologists, usually thought of as some of the more science-literate members of the mental health field, have been described as displaying a “deep ambivalence about the role of science and their lack of adequate science training,” leading many of them to base their understanding of their own treatment practices on personal experiences with clients or anecdotal reports from mentors and peers (Baker et al., 2008, pp. 67)."}, {"type": "sentence", "content": "Some are using outdated treatment modalities, like forms of psychoanalytic therapy, to which they have strong emotional attachments. They also routinely use questionable psychometric or assessment tools, even when scientific evidence suggests that these practices and tools are unsupported or potentially even harmful to clients."}, {"type": "sentence", "content": "Lilienfeld et al. (2013) outline widespread reservations concerning scientific methods and scientific research displayed by many clinical psychologists and clinical psychology students — reservations which may be partially supported by high consumer demand for popular ascientific and pseudoscientific interventions."}, {"type": "image", "content": "https://miro.medium.com/max/9612/0*XoJCabpM6ELQrorK"}, {"type": "sentence", "content": "Lists of such interventions practiced or endorsed by a wide variety of mental health professionals are extensive and include Reiki energy work, aromatherapy, hypnosis, age regression and/or past life regression, eye movement desensitization and reprocessing therapy (EMDR), attachment therapy, Jungian dream interpretation and analysis, and Thought Field Therapy/Energy Psychology or “tapping” (Lilienfeld, 2007; Thomason, 2011)."}, {"type": "sentence", "content": "These interventions are commonly practiced by the mental health professional in addition to other treatment options, or the mental health professional might suggest the interventions to clients as adjuvant or follow-up therapies."}, {"type": "sentence", "content": "Other treatments routinely used by mental health professionals are innocuous in themselves, but may be indirectly harmful when the treatment replaces or decreases the efficacy of lifesaving medical and/or pharmacological care (Lilienfeld, 2007; Myers & Cheras, 2004)."}, {"type": "subtitle", "content": "The Harmful Effects of Non-Evidence-Based Psychological Treatments"}, {"type": "sentence", "content": "These are very important findings, since a great deal of psychological (and sometimes physical) damage is done to clients as a result of the use of non-evidence-based treatments (Rozental, Kottorp, Boettcher, Andersson, & Carlbring, 2016)."}, {"type": "sentence", "content": "Unfortunately, many individuals in the mental health professions tend to dismiss or ignore negative outcomes in their clients, and in some cases very serious mental deteriorations caused by the psychotherapy itself are not being reported (Lilienfeld, 2007; Vaughan, Goldstein, Alikakos, Cohen, & Serby, 2014)."}, {"type": "sentence", "content": "Research reviewed by Lilienfeld (2007) regarding the negative effects of non-pharmacological psychological treatments showed that up to 10% of all clients experienced direct harm as a result of the treatment itself, and this number may be higher due to issues of under-reporting. One-third of all participants in research conducted by Rozental et al. (2016) reported one or more adverse results from therapy."}, {"type": "sentence", "content": "Harmful effects of psychological treatments can include long-term worsening or protraction of symptoms (such as mild to moderate symptoms of depression becoming severe, or symptoms of depression carrying on for much longer than is usual); development of new symptoms (such as new symptoms of anxiety that the client never experienced before, or obsessive compulsive traits emerging for the first time); over-dependence on the mental health professional and inability to see oneself as an agent of change separate from the therapist (characterized by excessively long treatment that carries on over several months, years, and in some cases even decades); physical harm (in the case of avoiding medical treatment to receive non-evidence-based treatments instead), and a long-term or lifelong reluctance to pursue psychological treatment following a deleterious therapy experience (Lilienfeld, 2007; Rozental et al., 2016)."}, {"type": "image", "content": "https://miro.medium.com/max/6290/0*yqGXF_SArvCKvWXH"}, {"type": "sentence", "content": "Some treatments are evidence-based for certain conditions but not for others. In those who are panic prone or struggle with certain types of anxiety, for example, guided relaxation and meditation have been known to cause distorted thinking, fear response, and increased anxiety, and generally work against reduction of primary symptoms (Schlosser, Sparby, Vörös, Jones, & Marchant, 2019)."}, {"type": "sentence", "content": "These harmful effects, and those summarized above, should be considered separately from the short-term worsening of symptoms commonly experienced at the beginning of therapy. For example, some symptoms of post-traumatic stress disorder (PTSD) typically worsen at the beginning of exposure therapy, and marital altercations can increase at the beginning of couples therapy as couples confront each other on issues that they may not have discussed before. These temporary deteriorations are to be expected as a combined result of the particular presenting problem(s) plus the kind of treatment typically recommended for said problem(s)."}, {"type": "sentence", "content": "Harmful effects resulting from non-evidence-based treatments are different and can lead to overall long-term deterioration in clients’ functioning, an over-dependence on psychoactive medications, and large sums of money being spent to pursue either the same harmful treatment or a string of different unsuccessful ones."}, {"type": "sentence", "content": "Williams, Turner, and Peer (1985) described acrophobia clients who had experienced debilitating fear of heights that impacted many areas of their lives, with some clients having symptoms that stretched on over several decades. These clients were relieved of their acrophobia in less than three hours each, using evidence-based exposure therapy developed for the condition."}, {"type": "sentence", "content": "Some acrophobic clients had received other forms of therapy, such as psychoanalytic psychotherapy, which did not significantly reduce symptoms even after prolonged treatment. This example shows that evidence-based treatment, even when delivered in a very short time frame, can be much more effective at alleviating client suffering."}, {"type": "subtitle", "content": "Stricter Regulation and Better Science Training Are Needed"}, {"type": "sentence", "content": "As noted by Lilienfeld (2007), the field of psychology has no equivalent to the Food and Drug Administration (FDA) in the United States or the Health Products and Food Branch (HPFB) in Canada. The average mental health professional would not disagree with the amount of work and clinical trials that go into preparing and testing a new medical treatment before it goes to market, so why do so many of them balk at the necessity of careful and thorough scrutinization of non-pharmacological treatments in their own field (Lilienfeld, 2007; Vaughan et al., 2014)?"}, {"type": "sentence", "content": "And current regulation is clearly not enough, otherwise the spread of harmful and non-evidence-based treatments would not be the ongoing and persistent problem that it has become. For example, the College of Psychologists of British Columbia, to which a mental health professional who has received a doctorate degree in psychology can become registered, will only grant membership (and branding as an official “registered psychologist”) to BC-based applicants who have received extensive training in scientific methodology and research methods from an educational institution that has been accredited by the Canadian Psychological Association (College of Psychologists of British Columbia, 2015)."}, {"type": "sentence", "content": "However, the College’s bylaws do not discuss ongoing surveillance or oversight of psychologists registered with them, and do not state that use of evidence-based practices are necessary for maintenance of one’s status as a registered psychologist. While the College does have a process for clients to submit complaints about registered psychologists who are suspected of acting against the College’s stated values, there is nothing explicitly in their bylaws stating that a member must maintain evidence-based treatments or else risk removal from the College."}, {"type": "sentence", "content": "A Google search of registered psychologists in British Columbia reveals several members of the College who openly practice non-evidence-based treatments (sometimes as their primary modalities), as shown by their websites’ lists of treatments that they offer to their clients. One example of many is Dr. Joanne MacKinnon, registered psychologist #1147 and expert witness for the Supreme Court of British Columbia, who received her PhD in Clinical Psychology from Simon Fraser University (MacKinnon, 2019)."}, {"type": "sentence", "content": "In addition to her graduate and undergraduate information, she describes herself as an expert in eye movement desensitization and reprocessing (EMDR), a certified practitioner of Advanced Energy Psychology (aka “tapping”), and a recipient of advanced training in psychodrama. All of these modalities have been listed as non-evidence-based, pseudoscientific, and/or potentially harmful by several upstanding researchers in the field of psychology (Lilienfeld, 2007; Thomason, 2011)."}, {"type": "sentence", "content": "Advanced Energy Psychology (aka, Thought Field Therapy or “tapping”) specifically, is very popular yet has not been shown to provide benefits to clients beyond a potential placebo effect for a rare few (Bakker, 2013). The theory behind energy psychology is based partly on egregious misunderstandings and misrepresentations of quantum theory and partly on traditional Chinese medicine, along with other elements cherrypicked from a variety of practices from around the world."}, {"type": "sentence", "content": "Practitioners of energy psychology believe that psychological disturbances are caused by energy blockages or surges in energy, which are said to be relieved or diverted by way of tapping areas of the body with the therapist’s or client’s hand (Bakker, 2013)."}, {"type": "sentence", "content": "Quick Google searches show that many established and respected registered psychologists have based their careers — in full or in part — on treatments that run counter to leading psychological, scientific research."}, {"type": "sentence", "content": "To guard against this tendency towards pseudoscientific treatments and to repair existing damage, all mental health professionals should be registered with regulatory bodies that ensure adequate high quality training in science and scientific methodology on an ongoing basis. This is currently the only foreseeable way to maintain high quality standards of evidence-based practice and provide an assurance to clients that the therapy they receive will do the least harm possible (and ideally no harm at all)."}, {"type": "sentence", "content": "Regarding education obtained in order to satisfy registration requirements by regulatory bodies, Aarons (2004) found that, generally speaking, mental health professionals who had received the most education are more likely to embrace and practice evidence-based treatments for the extent of their careers. As a result, these mental health professionals have the best success at treating their clients, and the clients will be treated more quickly and with fewer harmful side effects."}, {"type": "subtitle", "content": "Therapists Would Suffer Due to Lack of Freedom?"}, {"type": "sentence", "content": "Mowbray (1995) states that statutory regulation of any kind is too controlling, restricts therapists’ rights, and hinders psychotherapeutic innovation and educational possibilities. Others do not necessarily speak out against regulation in this way, but they do tend to keep quiet about the ascientific interventions (as listed above) that they see being used by so many in their own profession."}, {"type": "sentence", "content": "Others contend that regulation would lead to fewer individuals pursuing mental health professions, fewer treatment options, and less variation between therapists’ “performances” — and therefore less diversity in the field (Mowbray, 1995)."}, {"type": "sentence", "content": "Such therapist-centric views tend to include now-discounted ideas such as “any treatment is better than no treatment,” and also tend to credit the majority of a treatment’s success to the skills and/or personality of the therapist (Lilienfeld, 2007)."}, {"type": "sentence", "content": "The idea that any treatment is better than no treatment is supported by the notion that when a client visits a therapist, the therapist should be able to offer some help. However, even though the therapist might sincerely wish to help the client, there are many situations where psychological intervention is contraindicated, and it is up to the therapist to discern these types of scenarios."}, {"type": "subtitle", "content": "Client Safety Is More Important Than Therapist Freedom"}, {"type": "sentence", "content": "The client’s rights and safety will always be more important than the mental health professional’s ability to experience freedom to innovate or “experiment” on their own with their clients by using non-evidence-based treatment modalities."}, {"type": "sentence", "content": "If this means that far fewer individuals enter the mental health field because they are incapable of understanding science or unwilling to put in the time to complete science-laden schooling, the benefits of a science-literate mental health field far outweigh these costs and downsides to mental health reformation."}, {"type": "sentence", "content": "Due to the widespread use of non-evidence-based treatments and unregulated or inadequately-regulated mental health services, there already exists tremendous emotional, psychological, medical, financial, and social damages in need of repair."}, {"type": "sentence", "content": "Some clients end up jumping from one mental health professional to another with little to show in the way of symptom improvement or alleviation, or they give up hope of ever getting better after a particularly traumatizing therapy experience (Lilienfeld, 2007). Both outcomes put clients at risk for further and intensified suffering, including suicidality or suicidal ideation in some cases (Rozental et al., 2016; Vaughan et al., 2014)."}, {"type": "sentence", "content": "When we have a vast body of easily-accessible psychological research that supports a diverse selection of evidence-based treatments, it does not make sense to have mental health professionals treating clients from an ascientific stance that lags far behind the research."}, {"type": "sentence", "content": "For those who want to persist in these modalities, they should not be able to use labels like counsellor, therapist, or psychologist, and they should not be able to state or imply that they are practicing psychology. What they practice is more akin to New Age or spiritual interventions (as many do have their basis in religious, spiritual, or New Age practices, especially those dealing with “energy fields” and “quantum realities”) (Lilienfeld, 2007) — and should be labelled as such."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "Evidence-based psychological treatments clearly protect clients from harm and yield better results, while non-evidence-based treatments put clients at risk of not being treated for their main presenting issues (and thus prolonging suffering), developing new symptoms, and forming long-standing or even lifelong negative and distrustful views of psychological interventions."}, {"type": "sentence", "content": "Research in psychology overwhelmingly supports scientific, evidence-based treatments and provides a vast array of modalities for mental health professionals to choose from."}, {"type": "sentence", "content": "A mental health professional who has been adequately trained in science and scientific methodology will be better able to interpret the findings presented by their peers, avoid being duped by the claims of pseudoscience and pseudoscientists, engage in rigorous and productive scientific debate, produce experiments and hypotheses of their own in line with the scientific method, and contribute to the substantial and ever-growing body of research on the benefits of psychotherapy."}, {"type": "sentence", "content": "They will also be better equipped at detecting, in themselves and others, the various cognitive biases that frequent the human mind. They can then take the appropriate reflexive actions to weed them out by systematically questioning their own attachments and perceptions, and analyzing their own blind spots in how they treat clients."}, {"type": "sentence", "content": "These attributes and actions can only stand to forward psychology and improve the reputation of psychological treatments in the public eye."}, {"type": "subtitle", "content": "References"}, {"type": "sentence", "content": "Aarons, G. A. (2004). Mental health provider attitudes toward adoption of evidence-based practice: The Evidence-Based Practice Attitude Scale (EBPAS) [PDF file]. Mental Health Services Research, 6, 61–74. Retrieved from https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1564126/pdf/nihms10919.pdf"}, {"type": "sentence", "content": "Baker, T. B., McFall, R. M., & Shoham, V. (2008). Current status and future prospects of clinical psychology: Toward a scientifically principled approach to mental and behavioral health care. Psychological Science in the Public Interest, 9(2), 67–103. https://doi.org/10.1111/j.1539-6053.2009.01036.x"}, {"type": "sentence", "content": "Bakker, G. M. (2013). The current status of energy psychology: Extraordinary claims with less than ordinary evidence. Clinical Psychologist, 17(3), 91–99. https://doi.org/10.1111/cp.12020"}, {"type": "sentence", "content": "College of Psychologists of British Columbia. (2015). Homepage. Website of the College of Psychologists of British Columbia. Retrieved from https://collegeofpsychologists.bc.ca/"}, {"type": "sentence", "content": "Gross, P. R. & Levitt, N. (1998). Higher superstition: The academic left and its quarrels with science. Baltimore, MD: The Johns Hopkins University Press."}, {"type": "sentence", "content": "Lilienfeld, S. O. (2007). Psychological treatments that cause harm. Perspectives on Psychological Science, 2(1), 53–70. https://doi.org/10.1111/j.1745-6916.2007.00029.x"}, {"type": "sentence", "content": "Lilienfeld, S. O., Ritschel, L. A., Lynn, S. J., Cautin, R. L., & Latzman, R. D. (2013). Why many clinical psychologists are resistant to evidence-based practice: Root causes and constructive remedies. Clinical Psychology Review, 33(7), 883–900. https://doi.org/10.1016/j.cpr.2012.09.008"}, {"type": "sentence", "content": "MacKinnon, J. (2019). About and professional qualifications page. Website of Dr. Joanne MacKinnon, Registered Psychologist. Retrieved from http://drjoannemackinnon.com/about/"}, {"type": "sentence", "content": "McHugh, R. K. & Barlow, D. H. (2010). The dissemination and implementation of evidence-based psychological treatments: A review of current efforts. American Psychologist, 65(2), 73–84. https://pubmed.ncbi.nlm.nih.gov/20141263/"}, {"type": "sentence", "content": "Mowbray, R. (1995). The case against psychotherapy registration: A conservation issue for the human potential movement. London, England: Trans Marginal Press."}, {"type": "sentence", "content": "Myers, S. P. & Cheras, P. A. (2004). The other side of the coin: Safety of complementary and alternative medicine [PDF file]. The Medical Journal of Australia, 181(4), 222–225. Retrieved from https://www.mja.com.au/system/files/issues/181_04_160804/mye10108_fm.pdf"}, {"type": "sentence", "content": "Perry, G. & Mace, R. (2010). The lack of acceptance of evolutionary approaches to human behaviour. Journal of Evolutionary Psychology, 8(2), 105–125. Retrieved from https://www.researchgate.net/publication/236135191_The_lack_of_acceptance_of_evolutionary_approaches_to_human_behaviour"}, {"type": "sentence", "content": "Pew Research Center. (2009). Evolution, climate change and other issues. US Politics & Policy. Retrieved from https://www.people-press.org/2009/07/09/section-5-evolution-climate-change-and-other-issues/"}, {"type": "sentence", "content": "Rozental, A., Kottorp, A., Boettcher, J., Andersson, G., & Carlbring, P. (2016). Negative effects of psychological treatments: An exploratory factor analysis of the Negative Effects Questionnaire for monitoring and reporting adverse and unwanted events. PLOS One, 11(6), doi:10.1371/journal.pone.0157503"}, {"type": "sentence", "content": "Schlosser, M., Sparby, T., Vörös, S., Jones, R., & Marchant, N. L. (2019). Unpleasant meditation-related experiences in regular meditators: Prevalence, predictors, and conceptual considerations. PLOS One, 14(5). https://doi.org/10.1371/journal.pone.0216643"}, {"type": "sentence", "content": "Thomason, T. C. (2011). Psychological treatments to avoid [PDF file]. The Alabama Counseling Association Journal, 36(1), 39–48. Retrieved from https://files.eric.ed.gov/fulltext/EJ911995.pdf"}, {"type": "sentence", "content": "Vaughan, B., Goldstein, M. H., Alikakos, M., Cohen, L. J., & Serby, M. J. (2014). Frequency of reporting of adverse events in randomized controlled trials of psychotherapy vs. psychopharmacotherapy. Comprehensive Psychiatry, 55(4), 849–855. doi:10.1016/j.comppsych.2014.01.001"}, {"type": "sentence", "content": "Williams, S. L., Turner, S. M., & Peer, D. F. (1985). Guided mastery and performance sensitization treatments for severe acrophobia. Journal of Consulting and Clinical Psychology, 53(2), 237–247. doi:10.1037/0022–006X.53.2.237"}], "topic": "mental-health"}