{"title": "Build a Culture Primed to Innovate", "data": [{"type": "subtitle", "content": "The Most Important Factor Might Not Be What You’d Think"}, {"type": "sentence", "content": "The word innovation gets thrown around a lot today. One could argue (and I have) that the term’s meaning has gotten fairly squishy from lazy overuse."}, {"type": "sentence", "content": "There is, after all, a reason everyone either wants it, claims to have it or promises to deliver it in the near future. When you disrupt an antiquated business model or the way customers live their lives, the growth can be explosive. It’s invigorating to feel like you’re on the verge of, to quote Michael Lewis, “The New New Thing.”"}, {"type": "sentence", "content": "It takes a special kind of leadership and company culture to enable true innovation to flourish. And as I’m sure you’ve heard, it has nothing to do with beanbag chairs, foosball tables and free meals."}, {"type": "sentence", "content": "No, it all rides on one key concept, and its absence is absolutely critical. You could perhaps call it a “conditional culture,” in which your value is entirely contingent upon and chained to the work you produce."}, {"type": "sentence", "content": "“Once you realize that your self-worth is hitched to what you’ve produced or created, it’s unlikely that you’ll share it, or, if you do, you’ll strip away a layer or two of the juiciest creativity and innovation to make the revealing less risky,” writes shame researcher Dr. Brené Brown in “Daring Greatly.” “There’s too much on the line to just put your wildest creations out there.”"}, {"type": "image", "content": "https://miro.medium.com/max/11562/0*wn8A6EyE5KMaAfio"}, {"type": "subtitle", "content": "Shame Is an Innovation Assassin"}, {"type": "sentence", "content": "Fear can be a powerful motivator or, in this case, de-motivator. When your employees are worried about the fallout or humiliation from taking a risk and presenting a new idea, they’ll never be able to reach their full potential."}, {"type": "sentence", "content": "“The secret killer of innovation is shame,” explains Peter Sheahan, CEO of global consultancy Karrikins Group. “Every time someone holds back on a new idea, fails to give their manager much needed feedback and is afraid to speak up in front of a client you can be sure that shame played a part. The deep fear we all have of being wrong, of being belittled and of feeling less than, is what stops us taking the very risks required to move our companies forward.”"}, {"type": "sentence", "content": "Brown further explains that shame-prone cultures are responsible for much more than just a lack of creativity. Indeed, organizations that shame employees for what they define as poor performance will see higher rates of disengagement, gossip, stagnation, favoritism and other destructive behaviors."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*4mZH6ZnY1sgvG0Ab"}, {"type": "subtitle", "content": "Three Tips to Support Creative Yet Sensible Risk Taking"}, {"type": "sentence", "content": "Foster an Open Culture that Redefines Vulnerability as Strength"}, {"type": "sentence", "content": "Failure and coming up short are critical requirements for growth and development, both for organizations and individuals. If employees are going to persevere through their failures, they can’t be afraid of humiliation."}, {"type": "sentence", "content": "Employees who share bold new ideas are opening up and making themselves vulnerable to harsh criticism often in the face of long odds of success. As a result, it’s a smart practice to celebrate these bold risk takers for their courage, not mock them for their failure."}, {"type": "sentence", "content": "“If you want a culture of creativity and innovation, where sensible risks are embraced on both a market and individual level, start by developing the ability of managers to cultivate an openness to vulnerability in their teams,” says Sheahan."}, {"type": "sentence", "content": "Don’t Lead Like a Know It All"}, {"type": "sentence", "content": "Over the years, several of my clients have been tech startups. When you’ve got skin in the game and your reputation riding on a new venture, it’s very tempting to want to micromanage and try to control every decision. Unfortunately, this leadership style can lower employee self-esteem, cause disengagement and reduce productivity in the long run."}, {"type": "sentence", "content": "“The notion that the leader needs to be “in charge” and to “know all the answers” is both dated and destructive. Its impact on others is the sense that they know less, and they are less than,” says Sheahan. “Shame becomes fear. Fear leads to risk aversion. Risk aversion kills innovation.”"}, {"type": "sentence", "content": "Base Employee Value on more than Success or Failure"}, {"type": "sentence", "content": "Leaders can reinforce their open culture by reminding employees that their value to the organization is not solely determined by their outputs or the successful completion of every initiative. When shame is attached to failure, employee efforts become dictated by the fear that any missteps will lead to disconnection or the sense that they don’t belong."}, {"type": "sentence", "content": "“When our self-worth isn’t on the line we are far more willing to be courageous and risk sharing our raw talents and gifts,” says Brown."}, {"type": "sentence", "content": "She encourages employers to build a culture of shame resilience, which is “the ability to practice authenticity when we experience shame, to move through the experience without sacrificing our values and come out on the other side of the shame experience with more courage, compassion and connection than we had going into it.”"}, {"type": "sentence", "content": "Keep in mind that some employees come “pre-wired” with the tendency to attach self-worth to performance or success — so it’s important to pay close attention to how employees receive feedback on an individual level."}, {"type": "sentence", "content": "###"}], "topic": "leadership"}