{"title": "What If a Tech CEO Tried to Save the World With Geoengineering? An Excerpt From ‘Veil’", "data": [{"type": "subtitle", "content": "Eliot Peper’s new science fiction thriller ‘Veil’ imagines a world in which the wealthy and powerful can hijack the climate at will"}, {"type": "image", "content": "https://miro.medium.com/max/4240/1*APwwtUyc3X1p-_lDyw7GIQ.jpeg"}, {"type": "sentence", "content": "As the climate crisis grows increasingly dire, a radical question is appearing on more politicians’ lips: What if we geoengineer our way out of the mess? The notion that we could reduce global temperatures with a sweeping technical fix and for relatively cheaply — by, say, spraying particulates into the sky to block the sunlight — is at first blush rather appealing. But then it would likely produce drastic and potentially devastating unintended consequences, too."}, {"type": "sentence", "content": "Enter Eliot Peper’s latest book, Veil. Peper’s work always has a ‘next five-minutes-to-five years in the future’ vibe, and the latest is no different; the speculative fiction writer has crafted a modern parable about ecological collapse, climate change, technology, and power."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*jJBf_KISTuG1yyknHGYrdA@2x.jpeg"}, {"type": "sentence", "content": "“This scenario raises so many questions that will define the coming century: what does it mean to exist within an environment in which we ourselves are the primary agent of change?” Peper muses about the inspiration for Veil. “What will the future look like when technologies like nuclear weapons, CRISPR, the internet, and geoengineering can give a single human being the power to literally change the world?”"}, {"type": "sentence", "content": "Good questions. To begin to explore the answers, we’re pleased to share an exclusive excerpt of Veil. Enjoy."}, {"type": "sentence", "content": "— OneZero Senior Editor Brian Merchant"}, {"type": "sentence", "content": "The surface of the Earth curved away in all directions. At 25 kilometers up, the planet’s shape was clearly visible and distance yielded truths that proximity occluded. Zia became viscerally aware of the essential strangeness of the solar system, that life for all its wonders was confined to a hunk of rock hurtling through spacetime along trajectories that could be traced all the way back to the Big Bang. The sun blazed in all its naked glory, that most intimate of stars edging ever closer to the horizon’s sickle edge. Clouds stretched out far below in a ruffled carpet of impossibly rich texture, 10,000 spires and hillocks furling and unfurling, ragged tufts transfigured by shafts of light into resplendent mythological fauna. Zia had a flash of an elementary school science class, the bow-tied teacher twirling a basketball on his finger, saying that if it were the Earth, its atmosphere would be no thicker than a single layer of plastic wrap."}, {"type": "sentence", "content": "Santiago touched his fingertips to the glass. The drone flew itself and they were the only passengers in its small cabin, joeys riding in the pouch of an algorithmic kangaroo. Time had hardened her father into an amber cast of his former self. As scared and outraged as she was, Zia couldn’t help but feel a twinge of curiosity about whatever it was he had gotten himself into. He drove her crazy, batshit crazy, but he was still her nothing-will-stand-in-the-way-of-progress dad."}, {"type": "sentence", "content": "“Once enough people started using the Interstice low-Earth orbit satellite network to connect to the internet, we ran into a new problem,” he said."}, {"type": "sentence", "content": "“Traditional ISPs fighting tooth and nail to stay in the game,” said Zia, remembering the years when his brainchild was under a constant barrage of vicious corporate espionage from ailing cable companies desperate to maintain their oligopoly at any cost."}, {"type": "sentence", "content": "“Greedy laggards were certainly a bump in the road,” he said, snorting at what were once archnemeses. “But what I’m talking about happened after they were dead and buried."}, {"type": "sentence", "content": "With so many people on Interstice, the network would get overloaded at peak times and connections would slow down.”"}, {"type": "sentence", "content": "“So put up more satellites,” said Zia. Old conversations reverberated at the ghostly edges of this one, scenarios spun out over the dinner table, crises averted, puzzles solved. The León triumvirate at its ingenious, bickering best."}, {"type": "sentence", "content": "“Then we’d have too much capacity at off-peak times,” he said. “We needed a way to make the network more adaptive, more resilient. So we built this fleet of high-altitude drones that provide regional signal boosts to even out the peaks and troughs.” He patted the bulkhead. “This beauty is my little secret though — I had her outfitted to carry passengers and you’re the first person besides me to ride her.” He spun a finger in the air. “The fleet is loaded with every exotic sensor we can get our hands on, and we give the data to scientific and educational groups pro bono.”"}, {"type": "sentence", "content": "Selai’s research depended on that data. “And sell it to governments and corporations at stupendous rates?”"}, {"type": "sentence", "content": "He shrugged. “They get what they pay for. Nobody else collects even 1% of what we can because nobody else has a reason to put drones all the way up into the stratosphere every day. You’ve been to our Pacific base, and we have an Atlantic twin off the coast of Senegal. It’s the single biggest bet Interstice has made in the past decade, and it worked.”"}, {"type": "sentence", "content": "So this project was the cave Santiago had retreated to after the funeral, the hole in which he had buried his grief. Zia struggled to draw breath under the weight of everything that had been left unsaid. There were some gaps you just couldn’t fill."}, {"type": "sentence", "content": "Zia tried to collect herself. “I’m sure the board is over the moon, but I’m failing to see how a successful R&D initiative got me kidnapped.” Last night, a doctor had come to Santiago’s villa and bandaged Zia up. She had called Himmat to reassure him that despite the rumors flying around the village, everything was going to be okay. A quick exchange of messages with Galang had confirmed he had arrived safely in the Maldives, which was a relief and a disturbing confirmation that Zia was the real target of the raid. Then 14 hours of beautiful, blank, exhausted sleep that ended when Zia woke screaming and thrashing from a dream she couldn’t recall."}, {"type": "sentence", "content": "His face tightened. “That’s because I just told you the same story I told shareholders.”"}, {"type": "sentence", "content": "The pregnant silence swelled. Her father was many things, but a liar wasn’t one of them. The year he started Interstice, he had published an essay mapping out his entire long-term strategy for the company. When his early investors had objected, he had responded that it wasn’t the idea that counted, it was the execution, and if they weren’t interested in coming along for the ride, he’d be happy to find alternative sources of capital. Over the subsequent years, his relentless execution had proven the essay right, and his investors had congratulated themselves on their prescience. Later, Santiago’s blunt honesty had sometimes proven to be a liability. Numerous senior employees had quit in the wake of receiving some of his “direct feedback” and Miranda had constantly coached him to soften his public statements. His patent disgust with playing politics was part of what had inspired Zia to get into diplomacy. Tired of pulling out the shrapnel of his candor, she picked up a healthy respect for nuance and cooperation. She suspected he hadn’t acquired a similar respect for her own choice of career path, and she didn’t like to admit how big of a role defiance played in why she had pushed so hard to get that ambassadorial post before the Heat Wave hit."}, {"type": "sentence", "content": "“So…” Zia said in a low voice. “What bit did you leave out?”"}, {"type": "sentence", "content": "“There!” he pressed a finger to the glass and the endlessly curious little boy shone through her father’s aging face."}, {"type": "sentence", "content": "Zia looked where he was pointing. The churning prairie of cloud ended in a surprisingly even edge that stretched for hundreds of kilometers in either direction. Beyond the creamy fringe to the northwest, ocean stretched to the arcing horizon in a heterogeneous gray and blue patchwork. To the northeast sat a peninsula, afternoon sunlight casting shadows that highlighted its topography, the coastline pocked by inlets."}, {"type": "sentence", "content": "“Okay,” said Santiago. “This is Luzon. See that city way over there on the east side of that huge bay? That’s Manila.” His voice turned husky. “And there, straight ahead, that mountain? That’s Mount Pinatubo.”"}, {"type": "sentence", "content": "Ringed by jagged peaks, an aquamarine lake filled the gaping crater of a massive stratovolcano. Pinatubo dominated the landscape around it, its lush slopes overlooking the surrounding farmland like a fickle geological deity. From this high up, it appeared simultaneously epic and domesticated, as if Zia could summon a mountain from the crust of the Earth with the ease of a game designer assembling a virgin world from scraps of code."}, {"type": "sentence", "content": "“In 1991, Pinatubo erupted,” said her dad in an awestruck tone. “Lava shot 35 kilometers into the sky, forming a cloud 400 kilometers across. Debris flows decimated the surrounding countryside. The high-pressure gas building up in the magma chamber shot billions of tons of molten rock straight up the center of the expanding tower of ash and ejecta. Some of that gas was sulfur dioxide, which oxidized to produce sulfate ions that combined with water vapor to create teeny tiny droplets of sulfuric acid that spread out across the planet’s stratosphere in a thin mist with a combined surface area approximating that of every grain of sand in the Sahara desert.” He looked up from Pinatubo to the glowing turmeric coal of the setting sun. “When sunlight reached Earth, some of it reflected off that fine aerosol mist, backscattering off into space instead of reaching the surface of the planet. As a result, global temperature dropped by half a degree Celsius for the subsequent two years, despite the fact that humanity was burning fossil fuel and releasing greenhouse gas like a hormone-addled teenager.” He sketched a circle with his hands. “Until those droplets finally fell back to Earth, Pinatubo’s particulate haze was a veil that cooled the planet, protecting us from ourselves.”"}, {"type": "sentence", "content": "Humanity was burning fossil fuel and releasing greenhouse gas like a hormone-addled teenager. Hairs raised on the back of Zia’s neck. That was a line from her mother’s unfinished manuscript, the rough-cut masterpiece that Galang had helped Zia compile and publish after her death — against Santiago’s wishes. It was part of the introduction, concluding a section detailing the ecosystem collapse, environmental degradation, and mass extinction brought on by anthropogenic climate change. The sentence had stuck with Zia because, as an only child, she couldn’t help but wonder if it alluded to her own teenage transgressions."}, {"type": "sentence", "content": "Zia jumped from reverie to speculation. There’s something I need to show you. Her father was not one for idle chitchat. He hadn’t brought her up here on a lark. Leaning forward, she caught a last glimpse of Pinatubo as it passed beneath the long wing of this strange aircraft. Her blood ran cold. She could feel rough bark under her hands, hear insects chattering, see the fog-shrouded volcano rising up behind the villas through a gap in the foliage. What had he just said? Protecting us from ourselves."}, {"type": "sentence", "content": "“Please don’t tell me you’re planning to blow up the volcano on your island base in order to slow down global warming,” she said."}, {"type": "sentence", "content": "“What?” Santiago’s genuine confusion was the sweetest salve. He shook his head. “Oh, no, no, no. Nothing like that. I mean, sulfur dioxide isn’t even that good of an aerosol. Plus, it accelerates ozone depletion and causes acid rain. And that’s not even mentioning all the other toxic gases and lava and ejecta and all the rest that wreak havoc when volcanoes erupt. No. That would be like treating a broken wrist by amputating the arm.”"}, {"type": "sentence", "content": "“Okay, gross,” she said. Her relief quickly curdled into frustration. She had been torn from her life to joyride 25 kilometers above the ground. She should be back in Chhattisgarh with Himmat, doing things that actually mattered. “So, why are we here?”"}, {"type": "sentence", "content": "“The dangers of climate change require serious immediate action but eliminating the industrial economy’s greenhouse gas emissions is extremely hard,” he said, sobering. “The UN failed to accomplish much of anything. National governments failed to accomplish much of anything. The private sector failed to accomplish much of anything. The scientific community failed to accomplish much of anything. Environmental activists failed to accomplish much of anything. Those failures mean business-as-usual continues and business-as-usual means condemning future generations to climate hell.”"}, {"type": "sentence", "content": "Zia frowned, remembering Selai’s graphs. “But global temperature has stabilized. As a matter of fact, it’s even dropped slightly over the past few years. Selai tells me it’s the big mystery in climatology right now. Reality is defying all the models.”"}, {"type": "sentence", "content": "Santiago’s shit-eating grin was terrifying. He patted the armrest affectionately."}, {"type": "sentence", "content": "“Mystery solved,” he said. “I call it: Project Svalinn.”"}, {"type": "sentence", "content": "Turbulence thrummed as they descended into the capricious troposphere with its dramatic and changeable weather. Clouds whipped past, turning the windows into blank panes displaying nothing but the fact that they were in a machine flown by a machine, two humans huddled in the center of a matryoshka of generations of technology lacquered onto itself. Zia tried to ignore the butterflies in her stomach, tried not to wonder whether her vertigo stemmed from the bumps and jolts of the drone or her father’s words."}, {"type": "sentence", "content": "“This fleet doesn’t just boost Interstice bandwidth and hoover data,” he said with the nervous enthusiasm of a child giving a tour of a newly constructed bedroom fort. “They spray a mist of purpose-engineered inert aerosols into the stratosphere, cloaking the planet in an envelope that reflects just enough sunlight to offset global warming. It’s not perfect. It doesn’t do anything to solve ocean acidification from the buildup of carbon dioxide, for example. But the most disastrous effects of climate change stem from the direct impacts of rising temperature. This program buys us time by adjusting the thermostat.” Santiago’s monologue accelerated into a breathless manifesto. “It gives us room to adapt, to transition the energy system away from carbon. It heads off the positive feedback loop of melting permafrost that would otherwise accelerate warming. It saves countless species from the brink of extinction. It’s a hedge against our inborn shortsightedness. It’s shelter from a storm of our own creation. And it works.”"}, {"type": "sentence", "content": "Her father’s eyes shone in the reflected light of the instrument panel. This was just the kind of silver bullet he would latch onto: a straightforward technical fix to an otherwise intractable problem. But Zia had lived with him long enough to see how such technical fixes were rarely straightforward and often produced new generations of intractable problems. Scientific progress was an escalating game of cat and mouse."}, {"type": "sentence", "content": "“Hold on,” said Zia. “Global temperatures started stabilizing years ago.”"}, {"type": "sentence", "content": "Santiago rubbed his hands together. “Yep,” he said. “I started working on the problem a decade ago and the first drones started flying three years later. Since they went up, we haven’t set a temperature record, Arctic sea ice has advanced, some glaciers have started growing again, sea levels are holding, aggregate wildfire coverage is decreasing, and that’s not even counting reductions in human suffering.”"}, {"type": "sentence", "content": "If that was true… “How do I not know about this?”"}, {"type": "sentence", "content": "“Nobody knows about this,” said Santiago. “Actually, to be precise, one other person besides the two of us knows about this: Ben Munroe, the chief scientist on the project. He lives over at the Atlantic base and manages all the modeling. But nobody else knows. I keep the entire engineering side of the project carefully sequestered in need-to-know teams distributed throughout Interstice and outside contractors. Ben does the same thing on the climatology side. The entire program is run remotely through a backdoor system I hacked personally and that only I can access, which annoys Ben sometimes.” He chuckled. “Honestly, it’s not that different from high-profile product development.”"}, {"type": "sentence", "content": "“Oh, come on,” said Zia. “You’re saying nobody suspects what you’re up to?”"}, {"type": "sentence", "content": "He shrugged. “We’re Interstice,” he said. “We have a good reason to be in the stratosphere.”"}, {"type": "sentence", "content": "“But — ” Zia’s train of thought caught up with her. Selai’s research. The annotated papers. The broken models. The fleet is loaded with every exotic sensor we can get our hands on, and we give the data to scientific and educational groups pro bono. “You’re — you’re fleecing the data.” Zia could hardly believe it, could hardly bring herself to say it. That was how she knew it must be true. “You’re scrubbing any evidence of the — what do you call them? Aerosols? — from the feed you sell to governments and research groups.” No scientist I’ve interviewed has been able to fully explain it, Galang had said. Lots of handwaving. “That’s why the climatologists can’t figure out what’s going on, why their models don’t work, why SaudExxon PR is having an extended field day. They’re all operating on a false premise. You’re lying to them.”"}, {"type": "sentence", "content": "Santiago’s face hardened. “You’ve read your mother’s books. The world knew about the risks of unmitigated global warming for decades, and did jack shit about it.”"}, {"type": "sentence", "content": "Her fingers dug into the armrests. “So you hijacked the climate.”"}, {"type": "sentence", "content": "He stared at the cloud-blank window. “I’m saving them from themselves.”"}, {"type": "sentence", "content": "Something unspooled inside Zia. Years of strict tennis training. Being shipped off to boarding school against her will. The unrelenting questions. The quiet and not-so-quiet judgments. The living-under-my-roof rules. Rationing of allowances. Condescension toward friends and lovers who didn’t meet an unwritten standard. This wasn’t an aberration. This was her father mercilessly pursuing his definition of what was best for the world. With such a starkly precise vision for what constituted the right thing, nothing would do except absolute control."}, {"type": "sentence", "content": "Scraps of cloud whipped past the window and then the drone dropped out of the bank and the view opened up like a time-lapse flower. There was the island poking up above the waves like the tip of a spear, its shaft obscured by the briny depths. Another long-winged drone was taxiing for takeoff, preparing to replace their own shuddering craft in a carefully choreographed high-altitude dance that stretched the sheerest of veils around this tumbling rock that life called home in an effort to make that home a little more hospitable for certain residents who couldn’t be bothered to clean up after themselves. The last crimson slice of sun dipped below the horizon, smearing bloody fingers across the arching dome of sky."}, {"type": "sentence", "content": "“What are the side effects?” Zia asked softly."}, {"type": "sentence", "content": "“It makes sunsets redder, for one,” said Santiago. “More light gets diffused coming through the atmosphere.”"}, {"type": "sentence", "content": "“And for two? And three? And four?” If there was one thing Zia had learned from her mother, it was that the Earth system was hellishly complicated. No model came close to capturing its entirety. One small change could cascade into 10,000 unforeseen consequences."}, {"type": "sentence", "content": "Santiago shifted in his chair. “Uptick in biomass accumulation,” he said. “Many plants seem to prefer diffuse light so they tend to grow a little faster.”"}, {"type": "sentence", "content": "She let silence expand to fill every nook and cranny of the cabin, then asked, “What is it you’re trying so hard not to tell me?”"}, {"type": "sentence", "content": "Santiago stilled, retracting into himself like a pill bug. The drone banked, lining up for landing. Zia held her breath."}, {"type": "sentence", "content": "“When Tambora erupted in 1815, it created a stratospheric veil twice as thick as Pinatubo’s, cooling the entire planet for years,” he said. “As a result, the Indian subcontinent didn’t warm up enough to suck in moist air from the surrounding ocean, and the monsoon failed.”"}, {"type": "sentence", "content": "Ice flowed down Zia’s spine and seeped out to her extremities. The bitter taste of soil on every breath. The petty viciousness of the BSF officer. The brittle don’t-fuck-with-me eyes of the 14-year-old girl who was selling herself for ration chits. The measured indifference of the mid-level government official who was diverting water intended for agricultural irrigation to an industrial facility rich enough to pay him off. The skyrocketing rates of alcohol and drug addiction."}, {"type": "sentence", "content": "A nation, crippled."}, {"type": "sentence", "content": "“Are you telling me that your pet project caused the drought in Chhattisgarh?” she asked. Her father forced himself to meet her eye."}, {"type": "sentence", "content": "“I’m telling you it’s not impossible,” he said."}, {"type": "sentence", "content": "Touchdown."}], "topic": "fiction"}