{"title": "Small Shifts for a Less Stressful Day", "data": [{"type": "subtitle", "content": "Small steps, big changes."}, {"type": "sentence", "content": "If there’s one thing I discovered in my last two years of self-employment is that you don’t need to change your habits in any major way, or try anything fancy to have a less stressful day."}, {"type": "sentence", "content": "The smallest shifts to your day yield the biggest changes in your mood. In fact, the smaller and simpler you keep these, the easier it will be to keep them up."}, {"type": "sentence", "content": "Results don’t take weeks or months to materialize, but are immediate."}, {"type": "subtitle", "content": "Move"}, {"type": "sentence", "content": "Every two hours or so, get up from your chair and move a little. Walk from your desk to the kitchen (don’t open the fridge), or do one better and step outside for a walk. 10 minutes will do."}, {"type": "sentence", "content": "A Stanford study found that walking boost creativity. Walking also improves blood flow and spikes serotonin levels, which combat stress."}, {"type": "sentence", "content": "You can listen to your favorite music or podcast as you walk, or simply walk in silence. You might find that not fixating on a single thought, but letting your thoughts flow as they will make the experience meditative, relaxing and enlightening."}, {"type": "subtitle", "content": "Stay aware of time doing things that don’t matter"}, {"type": "sentence", "content": "Scrolling through social media can be fun, lifting your head from your phone and realizing you just gifted social media an hour of your time without getting much (or anything) in return is definitely not."}, {"type": "sentence", "content": "We all need to kick back and relax, but relaxing time poorly spent won’t bring you any comfort."}, {"type": "sentence", "content": "Excessive social media use has been linked with symptoms of addiction, feelings of unhappiness and other psychologically damaging effects. Besides, it’s a largely unimportant task."}, {"type": "sentence", "content": "Time is scarce, to minimize stress in your day, make sure to use it wisely."}, {"type": "subtitle", "content": "Lose track of time doing things that matter"}, {"type": "sentence", "content": "When you lose track of time doing something that matters — a project that’s dear to your heart and you care a lot about — magic happens."}, {"type": "sentence", "content": "People call it achieving a state of flow."}, {"type": "sentence", "content": "Mihaly Csikszentmihalyi discovered and coined the term flow, he defined it as: “A state in which people are so involved in an activity that nothing else seems to matter.”"}, {"type": "sentence", "content": "Nothing else seems to matter but the task at hand. The process becomes the goal, you lose yourself in what you’re doing and feel lighter."}, {"type": "subtitle", "content": "Give it 10 minutes"}, {"type": "sentence", "content": "I learned this one from a Creative Writing teacher: “If you’re having trouble getting started, give it 10 minutes.”"}, {"type": "sentence", "content": "The task of sitting down to write an article, or a full chapter of a book, might seem daunting, but how does 10 minutes of uninterrupted writing sound? Not as bad."}, {"type": "sentence", "content": "You can apply the ten minutes rule to anything. The beauty of this rule is that after your 10 minutes are up, you’re unlikely to want to stop."}, {"type": "sentence", "content": "10 minutes are all it takes to get you going, and after that all you have to do is let your momentum take care of the rest — it might even lead you into a state of flow."}, {"type": "subtitle", "content": "Know when to give yourself a break"}, {"type": "sentence", "content": "The pressure of being as productive as possible can get to you, whether you’re self-employed or not."}, {"type": "sentence", "content": "But regardless of your work situation, you’re the one in charge of giving yourself a break. You’re the one in charge of noticing when you’re tapped out and need to be relieved of your post."}, {"type": "sentence", "content": "Step away from the computer. Close your eyes for a minute. Take the shift break you’re entitled to."}, {"type": "sentence", "content": "There’s a time to push through the pain, and there’s a time to stop and take a break — learn the difference. It will do wonders for your mental health and peace of mind."}], "topic": "mindfulness"}