{"title": "The year is 2194", "data": [{"type": "sentence", "content": "This is an optimistic vision for the future of humankind, even with its asterisks. We could all use one right now."}, {"type": "sentence", "content": "Have you ever read a science fiction article? Buckle up."}, {"type": "image", "content": "https://miro.medium.com/max/2250/0*lxv5mQWLVeN6Sa2k"}, {"type": "subtitle", "content": "In 174 years from now"}, {"type": "sentence", "content": "Just so we get up to speed here, here’s a quick rundown:"}, {"type": "sentence", "content": "The tenth billionth human was never born, though we got awfully close. Our lowest was around 4.6 billion, two years after The First World Flood (or 1WF for shorts). Population has increased since then, but at around 6.7 billion it stalled and it seems — to everyone’s surprise — quite stable around that number for the past 60 years."}, {"type": "sentence", "content": "Right now one’s chances of dying because of a natural disaster are fairly high. One’s chances of dying of sucide are fairly high. One’s chances of dying of any cancer, any flu or the bubonic plague are virtually zero."}, {"type": "sentence", "content": "We never found any other forms of intelligent life. We’re still searching. A couple of decades ago we got a possible evidence of bacteria in a nearby solar system. A probe is on its way, but it will take it 122 years still (and honestly, the capturing device we installed there is pretty old at this point). Let’s hope."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*pJt2ndrKvSJOujHk.jpg"}, {"type": "subtitle", "content": "The ‘Economy’"}, {"type": "sentence", "content": "This word belongs to history books. But don’t worry, I’ll do my best to run you through our system."}, {"type": "sentence", "content": "We have something called the Trade Network — which is a macro term for the many real trade networks that exist. There are a myriad of ways to exchange goods and services, so now you can choose which way favours your style of living and communicating. It’s complex, but it’s handy, whenever you find your mix, you’ll feel more comfortable exchanging things."}, {"type": "sentence", "content": "Anyone can create a trade network and new ones pop up all the time. The challenge is not to create one, but to populate them. The trade networks only make sense when there’s a lot of people around. Still, every now and then a really interesting one catches the world’s attention and yet a new way to exchange is born."}, {"type": "sentence", "content": "Yes, yes, we still got money. Many different kinds of money, actually, each with different inherent rules and communities. Just a funny sidestory: when we learn about the origins of trade networks, we spend as much time learning about the first civilisations that used conches as currency as we spend learning about the first cryptocurrencies."}, {"type": "sentence", "content": "A lot of the things you’d consider ‘work’ have been automated so long ago that we have a hard time imagining your lifestyle there in the past. I guess automation to us is like electricity or fire to you."}, {"type": "sentence", "content": "We had a big crisis when people started to become unemployable — there was just not enough to do that the bots couldn’t do — something like a mass hysteria. That’s also part of our history books. We’ve dealt with it."}, {"type": "sentence", "content": "There is inequality, but there’s no poverty. Actually, let me give you some context on that: you had something called the Bill of Human Rights, right? Well, it was not efficient. It was not enforceable, to be precise, thus it was a mere pretty idea. We found a better way and now there’s no poverty by design, though we also left some space for people who really wanted to grow — so they get a share of that immense benefit they give to society. As I mentioned, there are several different trade networks, so ‘success’ can look vastly different from case to case."}, {"type": "sentence", "content": "Food is really cheap, available, varied, delicious and mostly lab-grown."}, {"type": "sentence", "content": "A lot of people have gardens for pleasure, but when you actually try to eat that apple from your tree, you normally regret it. When you buy an apple from your local Go-mart, it is an exact clone of one of the best apples that ever existed, so there’s no point in consuming that suboptimal garden apple. Leave it there, it’s pretty. Pretty has value."}, {"type": "sentence", "content": "The labs produce the food basically on demand (we have algorithms that reliably predict demand), but that’s just a fraction of their work. Mostly they’re trying to create new kinds of food. Today, more people consume yilki — a lab-created grain — than rice. I often wonder how it was like to eat such boring foods as you do. Perhaps you didn’t notice it was boring because you didn’t know any better. Who knows?"}, {"type": "sentence", "content": "I’ve mentioned food, but similar rules apply to housing, medicine production, entertainment and so many other aspects of life."}, {"type": "sentence", "content": "It’s important to point out here that the absolute majority of exchanges are of digital products and services, not physical ones. Let’s use this as a segue to…"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*a7AKZqGJg1JBTk0H"}, {"type": "subtitle", "content": "Education"}, {"type": "sentence", "content": "I’ve heard that education in your time was some sort of preparation for a work life. Is that so? As we don’t share the same view on ‘work’ (everything that could be automated is not considered ‘work’ anymore), our whole learning system follows another paradigm."}, {"type": "sentence", "content": "The average human will spend six hours studying every single day."}, {"type": "sentence", "content": "Learning is a constant process that never stops. Children go to school, teenagers go to school, mid agers go to school, old agers go to school. Sometimes it’s the same school, sometimes it’s different. Everybody is some kind of teacher and that includes children teaching mid agers, yes."}, {"type": "sentence", "content": "Nobody is forced to go to school, though. We don’t force a lot these days. But the thing is: if you don’t learn, you get bored. Boredom is a pandemic and it kills a lot of people every year. If you fear death, you’ll cling to learning like nothing else."}, {"type": "sentence", "content": "Then there’s the question of what to do with all this knowledge! A lot of people seem to think that knowledge is its own finality and just learn and teach by the pure pleasure of it. Others try to become human encyclopedias or virtuosos in one topic or another. Finally, we have Progress, more or less what you’d consider work, which is basically improving our current infrastructure and systems, like the food-lab folks trying to create new foods."}, {"type": "image", "content": "https://miro.medium.com/max/1920/0*Z5zMtUXBouuWJzlz.jpg"}, {"type": "subtitle", "content": "‘Technology’"}, {"type": "sentence", "content": "Nowadays we call this Progress (and a progress with a lower case ‘p’ is a project that aims at improving the general Progress)."}, {"type": "sentence", "content": "We understand you had a technical acceleration after the steam machines, another one after the first appearance of the internet — which is still around, thank you very much — and yet another after the first trueborn automation. Yeah, that didn’t go super well, I’ll explain more below."}, {"type": "sentence", "content": "Anyway, what we consider now Progress has to look very different from the technological explosion of yesteryears. By the way, the term ‘explosion’ now refers to something bad. I can’t imagine why you used it in a positive way."}, {"type": "sentence", "content": "It’s frankly revolting to think you based your whole data analysis in a ‘try it out, see if it works’ method that didn’t take into consideration the supply chains of everything tested. Eventually humankind had to go back to Copernicus, Galileo and Bacon and re-write the whole scientific method (we have the Progress model now, it’s what named everything) in a way that it wouldn’t kill the planet."}, {"type": "sentence", "content": "We’re doing better, but there’s so much that’s beyond repair."}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*fyf_xCkQDYP_IMTM"}, {"type": "subtitle", "content": "Culture & Politics"}, {"type": "sentence", "content": "We don’t have ‘kingdoms’ and ‘nations’ anymore. The rise of the Trade Network made them too feeble and eventually obsolete, so we started to organise differently. Oh, I should point out that political influence is a tradable item now. It’s complicated."}, {"type": "sentence", "content": "Anyway, a long time ago we had something called ethno groups, which were digital meeting spaces used by people from the same ethnicity to keep their customs together even when they were apart. Those groups grew in size and power, to the point that they became an important political force on a global scale."}, {"type": "sentence", "content": "But as we’ve been living an intense process of miscegenation for the past 120 years, those ethno groups started to become more and more mixed."}, {"type": "sentence", "content": "Oh that’s another interesting thing! You still refer to people as ‘beautiful’ right? We don’t do that anymore, this word is for mountains and trees and such. We have a new concept of attraction called Jilky. When somebody is jilk to you, it means that they please you aesthetically (we never use those dry terms, but hey I’m trying to explain myself here), but the thing is that Jilky is always relative. There’s no such thing as objective Jilky, it’s always a matter of comparison. When the concept entered the Zeitgeist, people started looking for partners who looked very different from them, thus miscegenation. Myself, I can’t imagine living in a world where there’s some people who everybody thinks they’re pretty and others that everybody thinks they’re ugly."}, {"type": "sentence", "content": "Anyway, back to the ethno groups, as the Trade Network grew, they started to multiply and incorporate many of the functions previously held by nations — and they still do! Though now we call them just Ethnos."}, {"type": "sentence", "content": "Most people will belong to dozens of Ethnos. Some are about your neighbourhood, some are about an interest of yours like tempo music, some are about large portions of land (most directly descended from the former ethno groups). Strangely, there’s no single Ethnos that’s about the whole planet. I joined several that tried, but nobody ever got really good action out of those."}, {"type": "sentence", "content": "Power is distributed in many ways, but one thing everybody agrees it’s a huge part of the game is attention. If you manage to propose an idea that attracts attention, you might very tangibly change your environment — from the local to the global level."}, {"type": "sentence", "content": "We also have plenty of stories of people who managed to change how energy is distributed around the planet that can’t muster any attention when they ask their neighbours for a ladder. It’s complicated, but it works and we don’t depend on any single individual. No kings, no presidents. If any connection point in our web gets sick or tired, the progress continues."}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*E56av6kGobqGOEES"}, {"type": "subtitle", "content": "A particular example"}, {"type": "sentence", "content": "Now that I’ve mentioned a bunch of the big stuff, let me give you a case study that involves a lot of what I said: my current progress as an oniricist."}, {"type": "sentence", "content": "In 2078 there will be a new breakthrough in the study of dreams. Two decades later, they’ll create the first version of the oniros — a machine that allows people to manipulate their dreams. That means both creating and enjoying dreams, later on sharing too."}, {"type": "sentence", "content": "This opened up a new market (by the time Economy still existed) and a new demand: turns out some people are better at dreaming than others. While before the oniros there was not much you could do about it, now you could get the best dreams from the best dreamers from anywhere around the world."}, {"type": "sentence", "content": "So that’s what I do: I dream. I actually design dreams (I’d need to explain a lot here, just trust me ok?) and share them with other people. Once I’ve been even considered the 25th best dreamer in the world, which is quite nice."}, {"type": "sentence", "content": "That’s akin to what you called art, though not exactly. The former arts like dance, music and holopros still exist, but we call them ‘old arts’ now. The term art has been expanded to include more stuff like dreams."}, {"type": "sentence", "content": "So what do I do with my dreams? I put them out in several trade networks to get other stuff. Of course the Ethnos cover my basics, food and stuff, but a successful dream will get me some good treats! Just last week I traded a dream deal for cuddles, quality time with my elders and some music to give to my friends. That’s my trade of choice: whatever boosts my socials! But I also donate a lot to the dream professionals Ethnos."}, {"type": "sentence", "content": "See? It’s not that different. People don’t need to work anymore if they don’t want to, but they still learn, dream, exercise, trade, hang out and do all the other things you do!"}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*W-FIxMQq1jsZwz3v"}, {"type": "subtitle", "content": "Nature"}, {"type": "sentence", "content": "I think you’re gonna find the next bit a tad depressing, so I’m sorry in advance."}, {"type": "sentence", "content": "First of all, in 2097 we had the First World Flood. It killed 36% of the total population (14% directly and 22% indirectly). Only 6 years later, we had Second World Flood and though we were better prepared, we hadn’t yet learned the lesson and it killed 14% of the remaining population.Third World Flood happened in 2112, this time the preparations were extensive. Still 5% didn’t make it. We have had several minor floods since then, but we don’t name them like the first big ones."}, {"type": "sentence", "content": "Life changed a lot after that. Not that I’d know, I was born in 2172, so that’s history to me, but by what I read about the planet before the flood, yeah, I can see life was pretty different."}, {"type": "sentence", "content": "A sizable part of the land you inhabited is now deemed completely out of bounds for human habitation. That’s not just the shorelines, but a good chunk."}, {"type": "sentence", "content": "We have fine rains now, which I don’t think you had. It’s a kind of storm that carries a brown (or sometimes yellow) sediment. It hurts, it breaks things, it kills animals and we’ve built all of our architecture to prevent erosion from them. It’s a bit of a bummer really. Here where I live there’s a whole season of them, lasts for around 2 months and we basically have to stay home. Just in case."}, {"type": "sentence", "content": "The ocean is the biggest problem. We do our best to predict what’s gonna happen next, but sometimes the water just invades 1300km of land and takes us by surprise. Our algorithms do their best to foresee such events, but the seafloor changes so quickly that they don’t get the years and years of data they’d need to really predict the huge water bodies with precision. New anomalies change the composition of water, which then creates more anomalies."}, {"type": "sentence", "content": "I’ve read in the books that for the longest time human civilizations have tried to tame the natural forces and I guess this was a really popular idea, because until not long ago it was how the whole spiel was still perceived. Even after the floods it persisted. Nowadays we have a different stance on it and we mostly try to get out of nature’s way. I mean, I get that you didn’t have anything as severe as fine rains, so I guess it was easier for you to take control. That’s not the case anymore."}, {"type": "sentence", "content": "On a brighter note, we’re restoring many species that were considered extinct. It’s true that many times we have to alter their genes — there’s a whole debate if we’re only slightly altering the species or if we’re changing them in such a way that we should rename them all. Anyway, most people agree that this is a good thing and we’re happy we’re able to recreate those living things, even if they all come from labs."}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*TxIUaany6nO5tL60"}, {"type": "subtitle", "content": "Death"}, {"type": "sentence", "content": "I couldn’t sugarcoat the next bit even if I tried, so instead I’m going to be pretty blunt, ok?"}, {"type": "sentence", "content": "We die. We still die. As far as we can see, we’ll forever die. We die by some sort of programmed architecture that nobody seems able to reverse engineer."}, {"type": "sentence", "content": "Here’s the situation: with our current Progress, all the advancements in medicine and particularly our DNA manipulation, theoretically humans could live forever — or at the very least for a long long time. I’m talking millenia."}, {"type": "sentence", "content": "But we don’t. At around the age of 160, sometimes 170, even 180 though that’s a stretch — people fall dead."}, {"type": "sentence", "content": "Mind you, those are not unhealthy people. I’m talking 160ers who were running marathons, having active social and sexual lives, and presented stable levels of all possible chemical exchanges in their bodies. Dead, from one day to the other."}, {"type": "sentence", "content": "Cause of death? Nothing. No cause anyone can find. It’s a widespread phenomenon, embracing all cultures, all diets, all biomes."}, {"type": "sentence", "content": "In our simulations we can create the conditions for humans to live for much longer, even the pessimistic simulations give us a good 200 extra years, but observable reality is magnanimous. We die, pure and simply."}, {"type": "sentence", "content": "It’s a recurring joke how much resources and brainpower humanity already spent to fix this problem. Some say 26% of all Progress for the past 70 years has been dedicated to life extension, but nobody cracked the code."}, {"type": "image", "content": "https://miro.medium.com/max/2000/0*leI0kK4NkYdgPZfF"}, {"type": "subtitle", "content": "Life"}, {"type": "sentence", "content": "We’re still here. We die, but the human race goes on."}, {"type": "sentence", "content": "We’re very different from you, even genetically, but we’re still part of the same species."}, {"type": "sentence", "content": "There’s human settlements on the Moon, Mars and three other places you don’t know the names of. We’ve tried to change their landscapes many a time, but the landscapes fought back. We don’t try anymore."}, {"type": "sentence", "content": "There’s still beauty and laughter. There’s still death and misery."}, {"type": "sentence", "content": "Mostly, we’re happy to be here."}, {"type": "sentence", "content": "Consciousness is great, even with the asterisks."}, {"type": "sentence", "content": "This article was inspired by Gail Taylor’s own piece of optimism. Since I started writing it, three members of my direct family — my dad and two grandparents — have been diagnosed with Covid-19 and many more are under strong suspicion. Times are dark globally and also on a very personal level."}, {"type": "sentence", "content": "Still, instead of losing all my optimism, I feel it has become a necessity, at least if I want to push forward and build a world that’s better than my own for the future generations."}, {"type": "sentence", "content": "My ancestors have done their best to create this world in which I live, with less misery and more wonder than before. My generation has more information at hand, so it’s our duty to do the same. And better."}, {"type": "sentence", "content": "Let’s hold our hopes high and follow wherever they lead."}], "topic": "fiction"}