{"title": "Universities Are Too Expensive to Survive 2020", "data": [{"type": "sentence", "content": "Universities hold a unique place in the American economy. They’re significantly more expensive than other countries, but people continue to pay the cost. Students view education as an investment in their futures. Perhaps that’s why universities saw an uptick in enrollment during The “Great Recession” over a decade ago."}, {"type": "sentence", "content": "The landscape of higher education also hasn’t changed that much since then. Sure, there are more options to enroll in online courses, but nearly half of high school graduates are heading to four-year colleges after high school. The career outlook with a college degree is lukewarm, but it’s become a stepping stone for many students: necessary, but expensive."}, {"type": "sentence", "content": "Now students have a reason to reevaluate the expense. Higher education is changing thanks to COVID-19, classes are going remote, and students are beginning to question why they’re paying so much."}, {"type": "image", "content": "https://miro.medium.com/max/2672/1*qMdlgo035rZfQVoMCYKovw.jpeg"}, {"type": "sentence", "content": "Having worked in higher education for the past few years, I understand these concerns. It’s not just tuition driving up university expenses. Every operation on campus needs to be funded, and students are paying for those expenses. Students are assessed fees to help maintain campus operations and now that students are forced off campus they view these fees with a more analytical eye. Do they really need to pay a document fee? Or a transportation fee? Universities have mixed responses to such questions, but students now get less for their dollar."}, {"type": "subtitle", "content": "What Students Pay For"}, {"type": "sentence", "content": "Higher educations is not a cheap investment, and the cost has been climbing steadily for decades. Whether students enroll in a four-year private institution or go to a two-year public, costs are going up. Of course, the former option has a much higher sticker price, but anyone hoping to get their degree is going to be paying a lot for that piece of paper. So it’s not really a surprise that student loan debt is climbing higher each year. Students face a bleak reality when they graduate, and that’s before they even start looking for a job."}, {"type": "sentence", "content": "Paying for university doesn’t mean students are just paying to go to class. They’re paying for social events, building construction, facility maintenance, and all of the staff members who make these operations run. Whether or not these expenses directly impact the students, the campus forces students to make contributions to them. This is baked into tuition charges, and that’s after the university hires all of the faculty to fill roles in their academic departments."}, {"type": "image", "content": "https://miro.medium.com/max/2420/1*ha8nzvNQNJaNo7xW75LHbw.jpeg"}, {"type": "sentence", "content": "It seems like every university has some luxury that appears in all of its admissions brochures. Some schools have private beaches, lobster nights in the dining halls, or laundry service in the residence halls. These luxury aren’t free, they’re “included.” In fact, students seldom have the option to waive amenities that don’t directly benefit them, requiring student to pay expenses benefitting a fraction of the student population."}, {"type": "sentence", "content": "All of this is true, but student generally have this information available to them before they enroll. For years, it seemed like school were raising tuition costs and added more luxuries to the university simply because they could get away with it. Thanks to COVID-19, students are starting to see exactly what they’re paying for because they’re not getting it."}, {"type": "subtitle", "content": "Universities Aren’t Worth the Cost"}, {"type": "sentence", "content": "The Spring 2020 semester has forced students to study differently. Lectures are taking place online, and students are receiving less for their tuition dollars. When students are paying five digits for a single semester of tuition, they’re going to wonder why universities can justify the same costs when they offer so much less."}, {"type": "sentence", "content": "Perhaps the general public is more forgiving during the Spring 2020 semester. Universities opened in January without much fear of COVID-19 impacting operations. These universities probably reviewed 2009’s swine flu as a template and believe that would be the worst outcome. Come March, that assumption would be proven very wrong. They needed to respond quickly to the threat of COVID-19, forcing students to leave residence halls and resuming lectures in a Zoom chat. The lack of preparation negatively impacted students and staff alike, so some universities are preparing for the worst in Fall 2020. In April, Boston University announced they were considering the possibility that Fall 2020 would not host in-person meetings. In May, the California State Universities became the first in the nation to prepare for Fall 2020 courses being held online."}, {"type": "image", "content": "https://miro.medium.com/max/3128/1*rZEPWPpQ2rqbNBwGhByJqQ.jpeg"}, {"type": "sentence", "content": "Now, students realize tuition fees are really just paying for classes. All of the perks that would differentiate a private university from a state school are gone. This holds especially true for new students with no investment in the current faculty. If students can’t reap the full benefits of their tuition dollar, why bother paying for all those benefits?"}, {"type": "sentence", "content": "This is not a familiar situation for universities. Economic hardships are highlighting the costs of going to school rather than the longterm gain of obtaining a degree."}, {"type": "subtitle", "content": "Higher Education Is Different Now"}, {"type": "sentence", "content": "The Great Recession impacted millions of Americans. They lost wealth, employment, and financial security. On the other hand, college enrollment was growing. From 2006–2011 America saw an increase of 3 million students enroll in college."}, {"type": "sentence", "content": "Why does this happen? For enrollment to grow, two factors must be occurring at once. Firstly, “traditional” enrollment must remain steady. These are the students aged 18–25 who are going to college directly after high school. They’re the ones pursuing four-year bachelor’s or two-year associate degrees. During the Great Recession, there weren’t a lot of reasons for these students not to go to school. It’s not like job prospects were convincing students to take an alternate approach. Secondly, non-traditional students must be enrolling at an above average rate. These are people who never went to college before, are enrolled in non-degree programs, or are enrolling part-time while working. During the Great Recession, these people were compelled to invest in education. Even though tuition costs were rising, many people viewed college as a segue into better employment prospects."}, {"type": "image", "content": "https://miro.medium.com/max/3456/1*nQntlkQIrS5i1aZlA7Hhhw.jpeg"}, {"type": "sentence", "content": "COVID-19 is unique in the sense that it began at a specific moment in time. Job losses were very sudden, and there wasn’t the gradual decline you might have seen in 2007. Right now, we’re witnessing the Class of 2020 graduate over video chat into a crumbling job market. This does not make higher education look like an appealing option. If a continuing student was considering a return to college, they’re doing to think twice before taking on the debt."}, {"type": "sentence", "content": "The bigger concern comes with traditional students, as they’ve been given reasons to postpone their enrollment. College may still be a stepping stone, but it’s also a milestone in life and a transition into adulthood. All of the experiences incoming students expect are going away, or at the very least, they will be transformed by social distancing initiatives. Students may not want to live in a dorm, knowing a virus could easily spread through the halls. Sporting events won’t be hosting live audiences and Greek life will struggle to hold events. All of the parties, celebrations, and gatherings won’t be as enjoyable if everyone is in a face mask."}, {"type": "sentence", "content": "Universities wouldn’t be making these changes if they didn’t deem them necessary. The loss of enrollment is going to hit them hard, and some universities are already seeing layoffs. Students are also going to have to make decisions, and many of them are going to deem university expenses unnecessary. It’s hard to blame them, as they’re losing experiences and receiving less value for their money."}, {"type": "subtitle", "content": "Will Universities Survive?"}, {"type": "sentence", "content": "I remember when I started studying the higher education system Bill Gates said higher learning would go online. The best resources would be available from the comfort of your own home for a fraction of the cost, if not free. As I learned this, in a classroom of other students studying higher education, we all tried to find reasons why the traditional higher education model would remain. There were many reasons, and I believed them, but I also viewed the existing structure as invincible."}, {"type": "sentence", "content": "I didn’t anticipate a global pandemic would be the push that would take universities online, but most students now have some experience with online learning. Bill Gates was also correct when he stated all of the resources would be available for free online. For those truly seeking information, you can find the content in any course available in podcast or video form."}, {"type": "image", "content": "https://miro.medium.com/max/3232/1*jfPDqompSY1hhYgp_2LWPg.jpeg"}, {"type": "sentence", "content": "Still, people want the degree, but universities are going to be hit. State schools are less likely to feel the impact, as they are the budget-friendly option. In a lot of cases, students choose in-state tuition to save money. While they’re still receiving fewer benefits for their tuition dollars, they’re still paying less than those at private schools."}, {"type": "sentence", "content": "The most exclusive schools, particularly the Ivy Leagues, will feel less of an impact. Graduates have better job prospects, so investing in education alone is still worthwhile. Their selectivity also means they have plenty of applicants. While we know these schools want to remain exclusive and lower their acceptance rates, there are also thousands of students willing to jump ship if an Ivy wanted to tap into its waitlist."}, {"type": "sentence", "content": "Private schools, particularly those in the arts, going to be hurt the most. Students enroll at these institutions for the experiences they provide. Without the social aspect, they’re just expensive. There’s no compelling reason not to defer enrollment or earn some credits at a cheaper university if students are forced to attend classes online. These are the school who build their reputation around community and networking. There may be some substitute for certain activities, but the bulk of the experience is lost."}, {"type": "sentence", "content": "The longer we feel the impact of COVID-19, the worse the outlook will be for higher education. Costs are a concern, and compromised experiences will compromise enthusiasm. This is why universities still cross their fingers for a fall reopening. It will look different, but it’s better than having no in-person attendance."}, {"type": "sentence", "content": "It’s sad to see the challenges universities are facing. Students have studied for years only to see their college plans evaporate in front of their eyes. Meanwhile, they’re not seeing the promise of job prospect, and higher education doesn’t appear to be the same investment it was in the past. Universities are going to feel the impact of COVID-19, though some are in better positions than others. Nobody is going to leave is pandemic unscathed, and sadly, some universities won’t survive."}, {"type": "sentence", "content": "Originally published at https://www.michaelbeausoleil.com on May 21, 2020."}], "topic": "education"}