{"title": "Stop Saying You’re “Aspiring”", "data": [{"type": "subtitle", "content": "The mindset shift from future to present is essential."}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*i5a02mVSUOUmigfM"}, {"type": "sentence", "content": "I used to start out the many emails I sent to famous people exactly like this:"}, {"type": "sentence", "content": "Looking back on it, I realize it was largely a waste of time."}, {"type": "sentence", "content": "For one thing, it was all about me. It also made me look vulnerable — no, not in the good, Brené Brown kind of way. I was told as much by a New York Times bestselling author who kindly took the time to respond and speak with me. He told me if I wanted to be taken seriously as a writer, I needed to stop saying “aspiring.”"}, {"type": "sentence", "content": "There are things in life that will diminish your credibility, yes, and I understood that in his message. My message for you is to focus less on the mindset and public relations pieces, and more on the actual work. You might know inside that you’re aspiring, but the most important question is:"}, {"type": "sentence", "content": "What are you doing about it?"}, {"type": "sentence", "content": "The difference between aspiring and being is doing. When it comes to writing, you have no excuse. You can publish anything you’d like here on Medium. For creators and entrepreneurs alike, there is so much DIY content on the Internet that you can learn and profit from. You can do while you’re learning. You don’t have to wait. There’s no barrier to entry."}, {"type": "sentence", "content": "On our journeys to high achievement, we are often guided by an inspiring example or experience. We begin to think, “I aspire to be… that.” It’s great to have that mindset as it provides motivation and desire. But if you only live in that head space and do nothing about it, then the motivational part won’t lead to the fulfillment you seek."}, {"type": "sentence", "content": "In the course of my lifetime, I have chosen to emulate the qualities of great athletes, leaders, writers and entertainers who have transcended their craft and produced impactful work. This has helped me to condition my mindset to prepare and compete like a winner. But mindset isn’t enough. I’ve studied their moves, examples and actions and chosen to emulate them."}, {"type": "sentence", "content": "I’ve used the aggregate experience of these moments to make them the composite of my own work. I’ve aspired and then I’ve done. Where so many people miss out is not following through on their big goals and dreams. They dwell only in the abstract and don’t activate all of their powerful talents and skills to create something powerful."}, {"type": "subtitle", "content": "Turn it into Action"}, {"type": "sentence", "content": "Don’t let the fear of the process or fear of what others might think of you ever hold you back from the actual doing part. “Aspiring” is those that are still sitting on the sidelines. You have to get in the game to make an impact. There’s nothing stopping you. It’s one thing to stand in awe, it’s another to stay there stuck with no ability to move forward."}, {"type": "sentence", "content": "Add value to other people’s lives through what you write, say and do and by engaging in the work of others to help them on their journey. Whatever your chosen craft, have a problem-solvers’ mindset and focus on ways you can equip individuals with the tools they need to succeed at what they do."}, {"type": "sentence", "content": "As a writer and author, I love to know what motivates others and to understand the “Why” of what makes them successful. Writing for me equals happiness. It’s where I’m alone, yet surrounded by inspiration, warmth and the creativity and electrifying thought that occupies the ether. Writing builds my faith in myself, engenders hope and brings love and passion to my life."}, {"type": "sentence", "content": "The “doing” part of the writing is where aspiring meets excelling."}, {"type": "sentence", "content": "In an ironic twist, I recently had a former colleague reach out to me asking me for advice on becoming a writer. Ultimately, I said what I felt was the best possible advice I could give her: “If you say you want to be a writer, then start to write. There is nothing stopping you.”"}, {"type": "sentence", "content": "Put yourself out into the marketplace. Start doing whatever it is you want to do. Do what feels natural and keep going."}, {"type": "sentence", "content": "Join my newsletter for emotional intelligence and productivity content! and Check out my Amazon bestseller, Emotional Intelligence for the Modern Leader."}], "topic": "productivity"}