{"title": "without title", "data": [{"type": "image", "content": "https://miro.medium.com/max/1042/1*Ya8uGPYK86qLVW4qJzBqBw.jpeg"}, {"type": "sentence", "content": "In April 1953, the scientific community endured a great loss with the untimely and tragic death of Rosalind Franklin. A renowned Chemist. An exceptional X-ray crystallographer. A scientist whose mention in itself held the power to shake up the community and make us question: Had she been alive, would her name also make it to the list of the Women Nobel Laureates who changed Science? Many believe that would have been the case."}, {"type": "sentence", "content": "The controversy surrounding Rosalind Franklin not being credited for her work on the 3D structure of DNA finds its origin in 1968, a decade after she had passed away. But the story began much earlier than that."}, {"type": "sentence", "content": "The year was 1951. Rosalind Franklin had been awarded the 3-year long Turner-Newall Scholarship. She moved to King’s College London to start working in John Randall’s laboratory. Her field of research concerned studying the 3D structure of DNA. Maurice Wilkins also worked in the same laboratory, as a senior scientist studying the structure of DNA. Due to some initial conflicts and misunderstandings, the relationship between Franklin and Wilkins had a bitter start. Raymond Gosling, who was the PhD student in the lab had initially been supervised by Wilkins but had then been put under the supervision of Franklin as she joined the lab. This had apparently taken place in the absence of Wilkins, who was caught off guard as he rejoined the lab a few days later."}, {"type": "image", "content": "https://miro.medium.com/max/1600/1*xi0aPJguasJtlZj6yus5vg.jpeg"}, {"type": "sentence", "content": "In September of 1951, Franklin discovered that there existed a second type of DNA, that was more hydrated than the one known at the time (i.e. A DNA). She called this the ‘B DNA’. In the months that followed, she had gone on to make vital observations regarding the helical structure of the DNA. It was around this time, her PhD student Ray Gosling took the now infamous ‘photo 51’."}, {"type": "sentence", "content": "Another group from the Cavendish Lab, University of Cambridge was working on the structure of DNA. This duo consisted of James Watson, a physicist who had become quite enthusiastic about the DNA, and Francis Crick, a Biologist and fellow DNA enthusiast. Both wanted to create a model for the structure of DNA. In 1952, they created their first model of the DNA structure- a triple-helix with its nitrogenous bases projecting outwards. They called Wilkins and Franklin from King’s to review their model. Franklin, based on the observations she has made up till that point, dismissed the model almost immediately. It was their lack of knowledge on basic chemistry that had led them to commit blunders in modelling the DNA. Needless to say, the model was a complete disaster and ended up in Lawrence Bragg, the head of the Cavendish Lab ordering Watson and Crick to cease their work on DNA."}, {"type": "sentence", "content": "As time passed, things got tougher for Franklin at the King’s College, University of London. She found herself dreading her working environment so much that she decided to move to Birkbeck College in 1953. Raymond Gosling went back to work under Maurice Wilkins as a result. Being his supervisor, Gosling had shown Wilkins photo 51 and Wilkins was shocked. Things started to shift. Back at the Cavendish lab, in the spirit of unraveling the mystery of DNA before his American competitor Linus Pauling, Bragg decided to allow the DNA duo to resume their DNA modelling. Around this time, Watson visited Wilkins at King’s where Wilkins showed Watson his newfound golden data point- photo 51. Rosalind Franklin, the brain behind this data, was not told about this communication"}, {"type": "sentence", "content": "Watson and Crick went on to correctly hypothesise the DNA as a double helical structure and published their findings in 1953 in Nature. Alongside their groundbreaking discovery, were papers from Franklin and, Wilkins and Gosling who independently published their own work that supported the DNA structure hypothesis laid forth by the Cambridge duo. Photo 51 was published in Franklin’s paper."}, {"type": "sentence", "content": "James Watson, Francis Crick and Maurice Wilkins went on to win the Nobel Prize in Physiology or Medicine in 1962."}, {"type": "sentence", "content": "So, the controversy that followed 20 years later was based on the following premise: James Watson and Francis Crick couldn’t have delivered their final DNA model without getting help from the Franklin’s data that Wilkins shared with them. The data, here, refers to a photograph of B DNA, taken by Gosling and Franklin, using X-ray crystallography. This infamous photo, ‘Photo 51’, has been deemed as “one of the most beautiful X-ray photographs of any substance ever taken” by J. D. Bernal, the Irish physicist who was a pioneering force behind establishing the use of X-ray crystallography in molecular biology."}, {"type": "image", "content": "https://miro.medium.com/max/1600/0*zFjYdgzHxH62Yv1w"}, {"type": "sentence", "content": "The issue raised doesn’t just concern the fact that Rosalind Franklin was not awarded the Nobel prize for her outstanding contributions. Between her untimely death in 1958 due to ovarian cancer and the Nobel committee’s strict stance against giving awards posthumously, the above issue can easily be dismissed on the grounds that it was not until 1962, that the Noble prize selection committee finally acknowledged the discovery of the structure of DNA as a major scientific breakthrough awarding it a Nobel Prize in Physiology or Medicine in the year 1962."}, {"type": "sentence", "content": "Author and biographer Brenda Maddox called Rosalind Franklin the ‘Dark Lady of DNA’ in her account of her life she published in 2002 as a book with the same name. Maddox highlighted how it might have been the prevailing sexism of the 1950s work environment in science that robbed Franklin of the Nobel she was well-deserving of. This does make one stop and question: Would things have been different had it been a male in place of Dr. Franklin? On the periphery of things, it seems that the situation would have been the same, regardless of the gender but as one delves in deeper, it becomes more difficult to think of it in this singular, straightforward perspective."}, {"type": "sentence", "content": "Of Course, we view all this in hindsight so things may appear different than they might have been at the time but the underlying misogyny of this matter was brought out in the spotlight, quite explicitly, in 1968 when James Watson published his book ‘The Double Helix’. In the book, he was seen making various dismissive and sexist comments about Franklin, who he refers to as “Rosy”. It was but the start of a series of sexist and racist comments made by Watson that might have led to him ultimately be “shunned” by the scientific community, so much so that it came down to him auctioning his Nobel prize in 2014 to combat his poverty."}, {"type": "image", "content": "https://miro.medium.com/max/364/1*IczGjNcR6emXAD6_z1Nj7w.jpeg"}, {"type": "sentence", "content": "Rosalind Franklin’s story is more than the 1953 controversy and tension that surrounded her time in King’s College. It’s about a remarkable woman who was passionate about science, pursuing research with her own touch of perfection. Franklin’s work involving her making use of X-ray crystallography to unravel the structure of DNA is widely known but most people forget to look at her excellent portfolio that succeeded her until her tragic death in 1958. Franklin had carried out significant ground breaking research, uncovering the ability of coal to act as a molecular sieve (as her PhD thesis, 1945) at Cambridge University and the 3D structure of Tobacco Mosaic Virus at Birkbeck College after 1953."}, {"type": "sentence", "content": "2. https://www.theguardian.com/science/"}, {"type": "sentence", "content": "3. https://www.theguardian.com/commentisfree/"}, {"type": "sentence", "content": "4. BERNAL, J. Dr. Rosalind E. Franklin. Nature 182, 154 (1958). https://doi.org/10.1038/182154a"}], "topic": "science"}