{"title": "Don’t Quit Your Job (Build a 5-to-9 Instead)", "data": [{"type": "subtitle", "content": "How to find the time you supposedly don’t have for your side gig"}, {"type": "sentence", "content": "I get it."}, {"type": "sentence", "content": "You hate your job. You wish you could do something more meaningful with your life. You want more freedom, blah, blah, blah."}, {"type": "sentence", "content": "If it were 2015, I’d probably say something like “Quit your job! Follow your dreams! Who wants to die shackled to their cubicle?”"}, {"type": "sentence", "content": "When I left my full-time job to do God-knows-what, I even low-key bragged about it."}, {"type": "sentence", "content": "Yikes."}, {"type": "sentence", "content": "Do you know what happens when your “projects don’t yield positive financial returns?” You end up $26,000 in debt, emotionally scarred, and a bit more jaded than you should be."}, {"type": "sentence", "content": "I guess what I’m trying to say is, don’t quit your job. If someone is willing to pay you every other week for showing up and sitting at a desk, by all means, take the damn money."}, {"type": "sentence", "content": "But…"}, {"type": "sentence", "content": "If you dream of having a bit more freedom one day, or affording an expensive vacation every year, or paying off the house early, or having something else to do that’s fun and financially rewarding, sticking to your 9-to-5 isn’t going to be enough."}, {"type": "sentence", "content": "That’s why you need a 5-to-9."}, {"type": "subtitle", "content": "What’s a 5-to-9?"}, {"type": "sentence", "content": "What’s a 5-to-9? Well, it’s my clever way of saying having some side gig outside of your traditional job."}, {"type": "sentence", "content": "It works like this. Either you get up early at 5 AM and work on your side gig until it’s time to leave for “work” or you head home from “work” and work on your side gig until 9 PM. Either way, it’s 4 extra hours a day to devote to something else."}, {"type": "sentence", "content": "Now, I’m not Gary V. I would never suggest hustling outside of your traditional job until you drop dead. How I see it, a 5-to-9 is more strenuous than a hobby but more enjoyable than a real job. The goal isn’t output at all costs, it’s consistency and patience."}, {"type": "sentence", "content": "If you don’t want to do the math, working on your 5-to-9 Monday, Wednesday, Friday and a few extra hours over the weekend gives you about 16 hours a week. That’s 832 hours a year, the equivalent of dedicating 5 months of full-time work to this thing."}, {"type": "subtitle", "content": "How exactly does one fill up those 832 hours? Well, a 5-to-9 looks different to everyone:"}, {"type": "sentence", "content": "A 5-to-9 isn’t meant to be a full-scale operation, it’s one tiny piece of a much larger puzzle. It’s entrepreneurship in a box."}, {"type": "subtitle", "content": "How to find the time?"}, {"type": "sentence", "content": "If the literal interpretation of 5-to-9 doesn’t quite fit your schedule, there are ways to find time."}, {"type": "sentence", "content": "Leisure is important, and how one spends their leisure is up to them (although I will never understand how people spend hours playing video games, to each their own)."}, {"type": "sentence", "content": "When I say I’m too busy, it usually means I’m busy enough but I don’t want to give up some of the things I enjoy doing."}, {"type": "sentence", "content": "I read, I work out, and I watch British T.V. shows with my wife. That’s the extent of my leisure. The rest is spent either raising my two boys or working. However, this is where a good old cost-benefit analysis comes into play."}, {"type": "sentence", "content": "Ask yourself these questions:"}, {"type": "sentence", "content": "In other words, why exactly do you want a 5-to-9? I hate to say it, but the end goal of a 5-to-9 is some kind of financial return. Save your passions for a hobby. If you are giving up some amount of leisure time for this thing, you should be rewarded for it."}, {"type": "sentence", "content": "How big does that reward need to be?"}, {"type": "sentence", "content": "Or maybe you don’t have spare leisure time and really are busy with life’s responsibilities. I’m ignorant of the fact that people have it much different than me. Maybe you’re caring for a sick relative, or juggling two part-time jobs, or going through a divorce."}, {"type": "sentence", "content": "No time hacks or a one-size-fits-all solution will help you. Maybe your 5-to-9 is only one hour on Sunday after church when everyone’s napping and the house is quiet. Maybe that one hour is a seed of a much bigger, life-altering idea."}, {"type": "sentence", "content": "Start with that one hour. Protect it. Grow from it."}, {"type": "sentence", "content": "We all have a finite amount of time. It's not something we can magically create. At the end of the day, it’s the end of the day."}, {"type": "subtitle", "content": "How to fill the time?"}, {"type": "sentence", "content": "Alright, let’s say you have your 5-to-9 all blocked out on your calendar for the indefinite future. Now what?"}, {"type": "sentence", "content": "You get to work, that’s what."}, {"type": "sentence", "content": "In all seriousness, it’s hard at first not to get distracted and bogged down on the next steps. Instead, focus on the simple things. Focus on doing the things you want to do."}, {"type": "sentence", "content": "You don’t need a website (yet), you don’t need to register a business (yet), you don’t need a co-working space (ever). You need to practice. You need to get better. You need to show up. Or as one of my favorite thinkers says:"}, {"type": "sentence", "content": "On a more practical level, pick a unique pain point and devote your time to finding every possible solution to that pain point."}, {"type": "sentence", "content": "Then, offer to teach your solutions to this unique pain point to other people for free. For those people who don’t want to solve it themselves, solve it for them (but charge them handsomely)."}, {"type": "sentence", "content": "This is how you build up a client base. This is how you learn what people want and are willing to pay for. The gurus tell us to create PDFs and eBooks and sell them for $0.99. Ignore them, go straight to the top. Find who has a unique pain point and solve it."}, {"type": "sentence", "content": "That’s business in a nutshell. I wish someone had told me that a long time ago. It would have saved me from a lot of guesswork."}, {"type": "subtitle", "content": "What’s next?"}, {"type": "sentence", "content": "You keep going."}, {"type": "sentence", "content": "You keep growing."}, {"type": "sentence", "content": "Eventually, admin work will creep in like setting up a bank account or doing your taxes, but those are good problems to have. They mean you are really onto something."}, {"type": "sentence", "content": "Until the day comes when your 5-to-9 causes you to neglect your other responsibilities, you keep doing what you’re doing."}, {"type": "sentence", "content": "If you want to learn a thing or two more about building your 5-to-9, I’m launching a new free email course to share everything I know."}, {"type": "sentence", "content": "Keep going. Keep growing. Don’t quit your job."}, {"type": "subtitle", "content": "Get the Mini Post-Grad Survival Guide"}, {"type": "sentence", "content": "A 5-day email course with amazing tips on budgeting, investing, and productivity for 20-somethings. Learn how to spend $40 per week on groceries, among other things, by signing up for free."}], "topic": "freelancing"}