{"title": "The “Perfect Triangle” Approach to Defining Your Niche", "data": [{"type": "subtitle", "content": "A simple formula to find your marketing sweet spot of expertise and reputation."}, {"type": "sentence", "content": "Fellow freelancers and solopreneurs, search for “find your niche” and you’ll be inundated with “advice” telling you one of the first and most important steps in building a successful indie business is to define your target niche."}, {"type": "sentence", "content": "I’ve previously talked about how “finding your niche” is bullshit, which explains how specialising in a niche can be a way of marketing but it doesn’t have to restrict your services and clientele. And it doesn’t have to come first."}, {"type": "sentence", "content": "But, truth be told, it’s not that black and white. The bad advice is bogus, but there’s still great value in being seen as a niche expert— when the strategy and timing are right."}, {"type": "sentence", "content": "Let’s explore the different kinds of niches you can try to own, as well as their benefits and drawbacks. When you find the right balance between these three cornerstones of business positioning, you build the perfect niche triangle — a formula for maximising your expertise without narrowing your opportunities."}, {"type": "subtitle", "content": "🌎 Niche location"}, {"type": "sentence", "content": "Using location to define your niche is an age-old way to target your clientele. Before international communication (or even travel) was commonplace, you had to specialise in a location whether you liked it or not! Most businesses existed to serve only their immediate surroundings."}, {"type": "sentence", "content": "Now, of course, we have a global economy and it’s easy to work with clients and colleagues all over the world. But that doesn’t mean you should."}, {"type": "sentence", "content": "Specialising in a location is one of the easiest ways to find new clients and build a strong reputation. In fact — although it’s counter-intuitive — I often suggest going ultra-local is the best way to start freelancing and find your first clients. Resist the pull of going global, because that comes with global competition at global (third-world) prices."}, {"type": "sentence", "content": "The smaller your location niche, the fewer competitors you have. The more local your work, the faster you can build a strong reputation and generate word-of-mouth referrals from your network."}, {"type": "sentence", "content": "Have you ever played that kid’s game telephone? The shorter your message has to go, the clearer it remains. Word of mouth is the same. It’s got more trust and power when it comes from a local."}, {"type": "sentence", "content": "I could work for clients across the world, but most of my work — by choice — is right here in my home city of Auckland. I’m a remote worker, but I prefer to keep it local. The future of work is local-remote, because it means better communication and deeper trust without losing the benefits of working when and where you choose."}, {"type": "sentence", "content": "The downside of local work, like any narrow niche, is a limitation on your potential client pool. If you live in a city of 1 million or more, you can probably work local for your entire life and never run short of clients. If you inhabit somewhere less urban, you may need to broaden your target location — perhaps your state, region, or country."}, {"type": "sentence", "content": "Every niche should have a location component. It’s up to you to balance the pros and cons of defining your ideal clientele by a strict location or a broad area."}, {"type": "subtitle", "content": "💪🏼 Niche service"}, {"type": "sentence", "content": "Another common way to define your niche is by service offering. This is natural and necessary because you want to be delivering what you’re good at and you enjoy doing."}, {"type": "sentence", "content": "If you try to offer more services than you can expertly deliver, you’ll dilute your effectiveness and end up harming your reputation by missing expectations and producing sub-standard work. On the flip side, if you’re a very narrow specialist who offers too few services, you may struggle to find enough demand for your work. Or even worse, your speciality could go out of style or become obsolete."}, {"type": "sentence", "content": "Finding your service niche is about playing to (and building on) your strengths. Choose what you’re most passionate about and skilled with — your core services — and build your business around those. Never stop learning and expanding your skills, but don’t veer too far from your bread and butter either, unless you’re planning a major pivot."}, {"type": "sentence", "content": "Every business needs a support network of complementary services to give it flexibility and added lateral value. You don’t want to be a specialist or a generalist, the sweet spot is being both at once: T-shaped, M-shaped, Comb-shaped, specialized generalist, deep generalist, or multi-hyphenate are all ways of describing the skillset with multiple areas of expertise supported by a broad range of general skills. This brings maximum value to your clientele and attracts the best projects."}, {"type": "sentence", "content": "Your definition of services is usually the most important aspect of your niche because establishing expertise is key to landing your ideal clients and building a reputation in your location. Choose a package of marketable skills that allows you to build expertise in at least 1 or 2 of them, and be very competent in all the others. Strip away anything that doesn’t meet those standards."}, {"type": "subtitle", "content": "🤷🏽‍♀️ Niche industry"}, {"type": "sentence", "content": "A final way you can define your niche is in the types of clients you choose to work for. Most commonly, this is specialising in an industry. You may have a passion for fashion and choose to focus your attention on retail clients. Or you have a background in travel that makes you extra valuable to tourism businesses. Or maybe you just love food, so you're drawn to working in dining and hospitality."}, {"type": "sentence", "content": "It could be that your skillset or style naturally aligns better with the needs of some industries more than others."}, {"type": "sentence", "content": "One or two successful projects in a specific industry can lead to much more similar work. Years ago I designed a very admired car rental website and for years afterwards, I received enquiries about similar projects. I found myself with a niche ripe for the taking, but I declined those jobs to avoid a conflict of interest with my long-time client."}, {"type": "sentence", "content": "The industry is not the only — and often not the best — way to niche down on clientele. You can define a niche by client organisation type and size. For example, specialise in working for startups (funded ones, not bootstrapped!), small owner-operated business, non-profits, or corporate clients, regardless of what field they’re in."}, {"type": "sentence", "content": "You can even get more granular and specialise in clients that share common values or desirable attitudes. Like specialising in projects for environmentally-conscious companies, or working only with clients who display exceptional communication skills."}, {"type": "sentence", "content": "Sometimes I define my niche as simply this: I work for good clients. It doesn’t matter what industry they’re in or what stage of business growth they’ve achieved. If they’re nice people who know how to collaborate and they respect and value my services, they’re my niche."}, {"type": "subtitle", "content": "🎯 Find your perfect combination"}, {"type": "sentence", "content": "Your niche should be defined as a balanced combination of the three factors discussed above:"}, {"type": "sentence", "content": "Finding your niche is simply defining your ideal state (and allowable range) for these anchor points. Each one becomes a side of your “perfect triangle”."}, {"type": "sentence", "content": "The shape and area of your triangle are affected by how broad or narrow you define each side, and that total area (represented as green to purple gradient colour above) represents the size of your potential client pool."}, {"type": "sentence", "content": "If one side of your niche triangle is very narrow, you may have to allow the other sides to stay broad to make up for it. If your niche is too restrictive on all three sides, you’ll likely build strong expertise and reputation in that niche but your skills are too specialised to remain flexible, and your client pool is too small to sustain you. If your niche is wide on all three sides, your potential clients are nearly infinite, but you’ll find it difficult to gain mastery or reputation in any specific location or service."}, {"type": "sentence", "content": "The ideal niche is usually a triangle with at least one side that’s narrowed in on a specialised focus, while the others stay broader to keep your client pool at a healthy size."}, {"type": "sentence", "content": "Keep in mind that your perfect triangle is unique. What works as a niche for you may be entirely different than what works for me, or anyone else. It’s based on where you live, what you’re good at, who you work with best, and what you enjoy doing. There’s no universal right answer. There are no two niche triangles exactly the same. And there’s no rule that says your triangle can't evolve over time."}, {"type": "subtitle", "content": "🧭 Your guide to choosing the right work"}, {"type": "sentence", "content": "Assess new opportunities by determining where they fall in your triangle."}, {"type": "sentence", "content": "If any potential project is a close match on two sides of your niche triangle, you may be able to excuse the less-than-ideal third. Likewise, if any single point falls completely outside your acceptable range, it may be a dealbreaker, even if the other two sides are a perfect fit."}, {"type": "sentence", "content": "Your ideal clients are the ones that fall comfortably within all three boundaries of your triangle — they satisfy all the base needs of your niche. But remember your niche isn’t set in stone. Making an occasional exception to allow projects outside your comfort zone is a good way to grow and evolve your career. You may even discover a new niche."}, {"type": "sentence", "content": "You know you’ve finally “made it” in your freelance career when you rarely have to accept a project that’s not in your niche sweet spot. But that usually comes after years of stretching and refining your boundaries as you build reputation and value. You have to earn the freedom to be picky with your niche."}, {"type": "subtitle", "content": "✋🏼 Don’t niche too quickly"}, {"type": "sentence", "content": "A common error is to over plan and define a rigid niche too early because you’ve been told its a prerequisite for getting off the ground. This can be extremely harmful — hampering your business growth and personal development."}, {"type": "sentence", "content": "It takes trial and error to confirm the right balance of your services and clientele. That often means working for some bad ones before you realise why they’re the wrong fit for you. Or stretching your craft to learn new skills until you settle on what you’re strongest at. Each time your triangle is prodded and poked you adapt it for the next project. It begins as a large and liquid organic form and only solidifies into a confident shape as your career matures."}, {"type": "sentence", "content": "Be patient and give your niche maturation the time it deserves. If you pigeonhole yourself to early, you may find it hard to pivot later. Keep your options open until it’s clear they don’t serve you anymore. Then trim off extraneous pieces one by one — like carving a marble statue — until you’re left with a minimal form you can sustain. If you carve before you have a confident vision of that final form, you’ll have spoiled the chance to get there."}, {"type": "subtitle", "content": "⛓ Avoid niche jail"}, {"type": "sentence", "content": "A niche can serve you very well if you define and maintain it properly. But more damaging than having no niche at all is getting stuck in one that no longer serves you."}, {"type": "sentence", "content": "Your niche is not a marriage. It doesn't have to be exclusive. There’s no rule against having more than one, sometimes completely unrelated niches. Create multiple niche triangles that are each perfect for you for different reasons. Maybe they overlap or exist on entirely different planes. It doesn’t matter so long as each on its own is robust and serves your business growth and goals. Growing multiple niches is a good way to cater to diverse skills that don’t fit together but remain too valuable to throw away."}, {"type": "sentence", "content": "You can position yourself as a specialist for each client without having to pivot your entire business to that niche. Your niche can be nothing more than a marketing tool to attract the right clients — it doesn’t have to underpin your entire business structure or strategy."}, {"type": "sentence", "content": "Remember your niche is your compass, your north star, your value sweet spot. If it leads you astray, find a new guide. A niche that’s restrictive without increasing your value is just a prison."}, {"type": "sentence", "content": "Subscribe to get my best articles in your inbox.This story can also be found on solowork.co"}], "topic": "freelancing"}