{"title": "The Restaurant", "data": [{"type": "subtitle", "content": "Fiction Friday"}, {"type": "sentence", "content": "Tanya stood in the remarkably cramped kitchen of the restaurant — Deborah’s, it was called — feeling quite disconcerted and claustrophobic. It was around half past two in the afternoon. The insidious midsummer heat seeped effortlessly through the walls, and for Tanya it felt like an out-of-breath stallion breathing directly down her neck. She was incredibly flushed red from all the work she had carried out since morning, traversing through the stoves and dwelling in the steam. Even the water had become too hot to do the dishes anymore without burning her hands. After sometime, her palms were all crumpled like a piece of paper, the skin wrinkled and folded over as if treated to some fairly corrosive acid."}, {"type": "sentence", "content": "The smell, the stench of the detergents was suddenly so overwhelming to her that she could have simply puked all over the counter, in front of the others who were working there. The ceramic plates were sticky with the leftover food, ketchup and olive oil. It made her sick. She flinched in disgust. Her mouth felt dry, but she could still taste an acrid fluid creeping at the back of her tongue. Her knees buckled suddenly in a kind of morbid angle, as if warning her of a fit, a seizure, or whatever it is working-class people are accustomed to get these days."}, {"type": "sentence", "content": "But still, she continued relentlessly."}, {"type": "sentence", "content": "She took plates and cups and saucers and scrubbed them — caressed them, even, with a touch of detergent, before finally laying them aside to dry upside down so that the water wouldn’t stagnate in all their concavities. Her mind was numb and she worked almost mechanically."}, {"type": "sentence", "content": "When her shift was over later that day, she trotted over like an elderly woman and found a spot on a park bench directly opposite the restaurant block. The sun was low over the western horizon, a half circle of such geometric certainty that it looked traced with a compass. She was terribly worn out. She had discarded her apron and her work clothes over at the restaurant, and had swapped them for a sleeveless blouse and a coat that served to cover her arms and neck."}, {"type": "sentence", "content": "As she was sitting in the shade waiting out the time for her bus home, she looked at the huge neon letters — Deborah’s — supported on solid structures and arranged as though weaving through the centre of an extravagantly huge donut. The restaurant itself — she had learned from the informal maître d’ — belonged to one Garry Oscar, who had bought a dozen such places as if on impulse. She looked at the restaurant and wondered, as if for the first time, if she would become anything more in life."}, {"type": "sentence", "content": "As she was having such inconsequential thoughts, she noticed that a tall, well-built man was walking towards her. Their eyes met a moment, but she, like the lady she was, dropped her gaze to the ground and drew the curtains of her shimmering red hair. There wasn’t anyone around at the moment and her first instinct was to reach for the pepper spray that she had in her handbag."}, {"type": "sentence", "content": "But before she had any time to react, he came towards her and said, “Hi, there!” For a second her cheeks crimsoned in marked shyness, but when she turned to look at him, she convulsed her face in an effort to appear stern and uninterested."}, {"type": "sentence", "content": "“Well, hello,” she managed to say. Looking at him now, she saw that he was shabbily dressed, but still emanated a strong, unmistakable aura of authority. She would have said he had been in a brawl, had it not been for his clean-shaven, almost baby-like face. He appeared to be out about some business, deterred paradoxically as if against his own will, and what could she be if not a waste of time?"}, {"type": "sentence", "content": "“It’s a really hot day, huh?” he began."}, {"type": "sentence", "content": "“Yes, it is,” she replied, now skeptical of his intentions."}, {"type": "sentence", "content": "“Uh…” he started with a drawl, but seemed to choke on his own words. After recovering himself, he blurted out, “Would I be so bold if I were to ask your name?”"}, {"type": "sentence", "content": "“You would, if you wouldn’t introduce yourself first.”"}, {"type": "sentence", "content": "“Ah, terribly sorry. My name is Malcolm Harbor.”"}, {"type": "sentence", "content": "“I am Tanya — Tanya Rose.”"}, {"type": "sentence", "content": "Although he was visibly nervous, he motioned to the space beside her, and, drawing in a huge gulp of air, said, “Can I sit here, Tanya?”"}, {"type": "sentence", "content": "She reluctantly nodded. A flurry of thoughts raced through her mind. She felt at one instant confused for having let a stranger sit down beside her, but somehow, in a general, feminine sense, she felt disarmed. Her palms turned cold, even in the heat, and she sat with her clasped hands resting stolidly on her lap."}, {"type": "sentence", "content": "Malcolm, for one, kept stealing glances whenever he could. He had been seeing her in the park almost every day for more than a month, and it had taken him so long to finally muster the courage. He considered her immensely beautiful. Her hair was wavy, and each wave seemed to give rise to several others such that the effect produced was, to him, kaleidoscopic. She wore rings on her ears and her eyebrows were, as if drawn, swept in a fine parabola — only inferior to the alluring curves of her hips. Although she was skinny and even slightly pale, she was rigid and taut like a really tense rope. He saw her and he was almost floored."}, {"type": "sentence", "content": "“So you’re working here, huh?”"}, {"type": "sentence", "content": "“Who said anything about that? I run this place,” she said, sarcastically."}, {"type": "sentence", "content": "“Oh, nice. It’s a good place.”"}, {"type": "sentence", "content": "The rest of their conversation went by in a blur, although neither seemed invested in any of what the other was saying. It was as if Tanya was perfectly aware of the ulterior motive Malcolm had in his mind, but couldn’t get herself to say anything about it. He was close to squalid, but so far he had acted the perfect gentleman. He was a man of the streets, it seemed evident, but somehow it was okay with her, her own ideas of a wealthy man saving her from her current life now boiling down to nothing more than a fantasy. But it was okay."}, {"type": "sentence", "content": "When it was time for her bus, she stood up to leave."}, {"type": "sentence", "content": "“So, will I see you again tomorrow, Tanya?”"}, {"type": "sentence", "content": "“Well, I don’t know about that, Mister.”"}, {"type": "sentence", "content": "At her home, Tanya almost forgot this meeting even happened. For the most part, she was convinced this was probably nothing more than a random incident, something that could have happened to any girl who might have been sitting in the park. It all felt like her delusion, an effect of the heat, the work at the restaurant. But when she went to bed, however, the last thought that lingered in her mind was about being excited to get back to work tomorrow, to the stinking kitchen that she had never liked. She was secretly glad, somehow even content."}, {"type": "sentence", "content": "Her dreams that night were too abstract to remember the next morning, but she woke up with a feeling which was not much unlike having the pit of her stomach invaded by a swarm of butterflies. It made her heart beat faster, and her arms and legs flail around in anxious frenzy until she managed to dress herself up for the day. She took the earliest bus possible."}, {"type": "sentence", "content": "She was dropped off at the corner, and she walked the remaining distance. But this walk today had a new meaning, a new compulsion. She did not curse the bus ride like she usually did, or feel lost like she usually was. There was a rhythm to her steps, a spontaneous oscillation of her arms, a vibrant energy about her whole self. There wasn’t a care or worry in this whole world she wouldn’t have overlooked just so she could get there to a place she had forever loathed."}, {"type": "sentence", "content": "When she finally reached her destination, however, there was a surprise waiting for her."}, {"type": "sentence", "content": "The surprise was in the form of an illusion — at least that’s what she thought it was for the first few minutes. She looked at the pebble-dashed exterior of the building, cut with a really modern facade, and thought she was going crazy. There was something wrong about the restaurant and she managed to figure out what it was."}, {"type": "sentence", "content": "She walked closer to the restaurant, her eyes riveted and focused, her teeth screwed together as if someone had her neck hanging by a noose. In just a second she was overwhelmed with emotion, her legs trembling until she felt sure she was going to fall down."}, {"type": "sentence", "content": "She walked hesitantly. As if on a hunch, she crossed the road over to the other side and entered the park."}, {"type": "sentence", "content": "There she saw a man sitting on a bench, fully dressed in a starched shirt and blazer, looking noticeably out-of-place. But as she approached him, she was able to recognize him. And not only did she recognize him, she realized who he was, who he really was."}, {"type": "sentence", "content": "“Mr. Garry Oscar…” she said haltingly. The man stood up and took a bow. “Mr. Garry Oscar, I don’t really indulge men who practice deception.”"}, {"type": "sentence", "content": "“I am extremely sorry, Tanya. I really am. When women come to me, they usually come only for my gold. That is one of the reasons I hate this part of my life. I try to be as humble as I possibly can. But yesterday, I saw something in your eyes. Don’t tell me it was a lie.”"}, {"type": "sentence", "content": "Tanya sat in silence. She wanted to say something, but she suddenly realized that no word would leave her mouth, as if her tongue was numb. However, her lips quivered to break free in a smile that she held back to not look like a six-year-old on Christmas day."}, {"type": "sentence", "content": "“I did not exactly come to you, now, did I?” she managed to say."}, {"type": "sentence", "content": "Garry Oscar said, “No, you didn’t. But do tell me if you like my gift.”"}, {"type": "sentence", "content": "Tanya looked once more at the restaurant. There, instead of the neon letters spelling out the name of Deborah, there was a new assortment of letters put together only the previous evening, possibly during the dead of the night. They spelled her name — “Tanya’s”."}, {"type": "sentence", "content": "“Well, what can I say,” she said."}, {"type": "sentence", "content": "“Say you like it.”"}, {"type": "sentence", "content": "She blushed until the color of her cheeks matched her hair. “I love it, Garry.”"}], "topic": "fiction"}