{"title": "Forgetfulness May Depend on Time of Day", "data": [{"type": "subtitle", "content": "Psychology"}, {"type": "subtitle", "content": "Researchers have identified a gene in mice that seems to influence memory recall at different times of day."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*kYgYHjHjjFsPKnBp"}, {"type": "subtitle", "content": "Did You Know?"}, {"type": "sentence", "content": "For a time during the 1960s, it was hypothesized that all the cells of the human body were capable of storing memories, not only those in the brain, an idea known as cell memory or cellular memory."}, {"type": "sentence", "content": "This was based on memory transfer research using cannibal flatworms, and on anecdotal evidence of organ transplants where the recipient was reported to have developed new habits or memories. Of course, such theories are now considered pseudoscientific and have not made it into peer-reviewed science journals."}, {"type": "sentence", "content": "Etymologically, the modern English word “memory” comes to us from the Middle English memorie, which in turn comes from the Anglo-French memoire or memorie, and ultimately from the Latin memoria and memor, meaning “mindful” or “remembering”."}, {"type": "sentence", "content": "In more physiological or neurological terms, memory is, at its simplest, a set of encoded neural connections in the brain. It is the re-creation or reconstruction of past experiences by the synchronous firing of neurons that were involved in the original experience."}, {"type": "sentence", "content": "Because of the way in which memory is encoded, it is perhaps better thought of as a kind of collage or jigsaw puzzle, rather than in the traditional manner as a collection of recordings or pictures or video clips, stored as discrete wholes."}, {"type": "sentence", "content": "Can’t remember something? Try waiting until later in the day. Researchers recently identified a gene (in mice) that seems to influence memory recall at different times of day and tracked how it causes mice to be more forgetful just before they normally wake up."}, {"type": "sentence", "content": "Many memory researchers study how new memories are made. The biology of forgetting is more complicated to study because of the difficulties of distinguishing between not knowing and not recalling."}, {"type": "sentence", "content": "“We designed a memory test that can differentiate between not learning versus knowing but not being able to remember,” offers a lead investigator."}, {"type": "image", "content": "https://miro.medium.com/max/10200/0*OSEbYKsGZNT9XwkB"}, {"type": "sentence", "content": "Researchers tested the memories of young adult male and female mice. In the “learning,” or training, phase of the memory tests, researchers allowed mice to explore a new object for a few minutes."}, {"type": "sentence", "content": "Later, in the “recall” phase of the test, researchers observed how long the mice touched the object when it was reintroduced. Mice spend less time touching objects that they remember seeing previously. Researchers tested the mice’s recall by reintroducing the same object at different times of day."}, {"type": "sentence", "content": "They did the same experiments with healthy mice and mice without BMAL1, a protein that regulates the expression of many other genes. BMAL1 normally fluctuates between low levels just before waking up and high levels before going to sleep."}, {"type": "sentence", "content": "Mice trained just before they normally woke up and tested just after they normally went to sleep did recognize the object."}, {"type": "sentence", "content": "Mice trained at the same time — just before they normally woke up — but tested 24 hours later did not recognize the object."}, {"type": "image", "content": "https://miro.medium.com/max/8478/0*Pi5_-YYAfSv-ceoi"}, {"type": "sentence", "content": "Healthy mice and mice without BMAL1 had the same pattern of results, but the mice without BMAL1 were even more forgetful just before they normally woke up. Researchers saw the same results when they tested mice on recognizing an object or recognizing another mouse."}, {"type": "sentence", "content": "Something about the time of day just before they normally wake up, when BMAL1 levels are normally low, causes mice to not recall something they definitely learned and know."}, {"type": "sentence", "content": "According to Kida, the memory research community has previously suspected that the body’s internal, or circadian, clock that is responsible for regulating sleep-wake cycles also affects learning and memory formation."}, {"type": "sentence", "content": "However, the purpose of having memory recall abilities that naturally fluctuate depending on the time of day remains a mystery. I would parenthetically note that mice are naturally nocturnal."}, {"type": "sentence", "content": "I’m Dr. Michael Hunter."}, {"type": "sentence", "content": "Reference"}], "topic": "neuroscience"}