{"title": "How to Refresh and Renew Your Mind for Forward-Progress", "data": [{"type": "subtitle", "content": "Tweak your goals as life changes."}, {"type": "sentence", "content": "It’s a beautiful day and you wake up full of energy, ready to tackle your goals. Before you know it, the day is over and you’re blaming yourself for not having done any of the tasks you had planned. You regret and decide tomorrow will be different. Unfortunately, the same thing happens again… and again, and again."}, {"type": "sentence", "content": "We’ve all been there. We’ve judged ourselves for not following up on our goals. Weeks pass and nothing seems to get better. Some days we’re doing the bare minimum, some others we don’t accomplish anything."}, {"type": "sentence", "content": "Your goals and purpose are not driving you anymore. It’s official, they’re outdated and something needs to change. But how can you be sure they’re outdated? It could be a simple rough patch after all, right?"}, {"type": "sentence", "content": "It may be your life has evolved and your goals need to catch up."}, {"type": "subtitle", "content": "1. You’re Procrastinating Again"}, {"type": "sentence", "content": "You used to wake up and dive right in. Now, you spend an hour on YouTube before scrolling through Instagram’s newsfeed. You then turn on your console and geek for a few hours or call a friend you talked to the day before."}, {"type": "sentence", "content": "Even if you succeed in sitting down to write that story, code something, or practice a new skill, you spend half the time with your mind on something else and take countless breaks."}, {"type": "sentence", "content": "I was there a few months ago. I’d wake up, open a browser on which I hadn’t installed a YouTube blocker, and close it at the end of the day, hating myself for it. I wanted to write, practice my craft, and discover new things. Yet, I’d end up botching a tiny article with almost no editing just for the sake of saying:"}, {"type": "sentence", "content": "Procrastination is the most dangerous sign because you can’t procrastinate 24/7. You will act a bit here and there but, even then, the heart and mind won’t be in the right place. You’ll focus on finishing the task without putting much thought into it. You won’t learn anything. You won’t improve. You won’t be getting any closer to your goals. And, on top of all this, it’ll take time for you to notice."}, {"type": "subtitle", "content": "2. Your Focus is Wrong"}, {"type": "sentence", "content": "You were writing to develop your skills as a writer. You were practicing your instrument to become a rockstar. You were coding because you wanted to improve your skills as a coder. You were studying a language to go live in a country."}, {"type": "sentence", "content": "Now? You’re focused on something else. You’ve made a bit of money and you’ve become addicted to your stats. You’re flying through music sheets without caring about the quality of your output. You’re coding in the exact same way without trying to better ways to write. You’re reviewing over and over again vocabulary you already learned."}, {"type": "sentence", "content": "One of my stories last September “exploded” compared to all the others. While I was making about $15 each month back then, I “jumped” to $65. I spent days — if not weeks — writing focused on my statistics. Was I writing just for the money?"}, {"type": "sentence", "content": "It took me most of an 11-hour flight to redirect my focus. I spent time analyzing why money had become so important. I had a stable job and had been writing for 10 months without caring much about the money. I needed to reevaluate my reasons for writing."}, {"type": "sentence", "content": "Did your focus change? Towards what and why?"}, {"type": "subtitle", "content": "3. Your Excitement is Gone"}, {"type": "sentence", "content": "You used to be full of energy. The simple thought of starting working on your goals pumped you up. You couldn’t wait to start. You couldn’t stop yourself after starting."}, {"type": "sentence", "content": "Now, you’re following the steps you set and that’s it. After procrastinating, you start the task with the only goal of getting it over with quickly. You skip reviewing what you produced. You spend half the time on it thinking about the next thing on your agenda."}, {"type": "sentence", "content": "I felt this with writing around April 2019. I had set a goal of publishing an article a day for a year — which I did and wrote about in this story. I was, however, just flying through. I wrote short articles, didn’t review them, and ignored the grand scheme of it all. I needed to find the excitement again."}, {"type": "sentence", "content": "If your excitement is gone, there are two possibilities. Either something’s changed in a stable environment, or nothing changed except your environment. Find which one."}, {"type": "subtitle", "content": "4. You’re not Learning Anymore"}, {"type": "sentence", "content": "This one can be found in all of the above. It can be a conscious choice or a subconscious one. Either way, you’re not learning anymore. It’s both a cause and result of your goals being outdated. As Rick Huganir, a researcher at John Hopkins University, explains, learning rewires the brain."}, {"type": "sentence", "content": "What keeps us going forward is the discovery of new knowledge. Take that off and any activity becomes “pointless”. The brain craves new information so it can keep on making better connections and getting rid of less important ones."}, {"type": "sentence", "content": "I spent years struggling with this in my journey of learning Korean. I stagnated and wondered why, while the answer was in front of me all along: I wasn’t studying it actively anymore. I barely used the language and was expecting myself to improve. Since I had moved to live in Japan, my goal of living in South Korea was not adequate anymore and needed to be updated."}, {"type": "sentence", "content": "But how?"}, {"type": "image", "content": "https://miro.medium.com/max/10624/0*H7kd5necFqCWJdPc"}, {"type": "subtitle", "content": "How to Renew Your Goals"}, {"type": "sentence", "content": "To update your goals, you need to set them aside for a moment. If you’ve noticed your goals are outdated, you need at least a day during which you don’t expect yourself to work towards them."}, {"type": "sentence", "content": "Every time I’ve reevaluated the reasons to write or learn a language, I took the day off. No learning on the agenda. The entire focus needed to be on the longer term, on improving my goals."}, {"type": "sentence", "content": "Once you’ve found time to reflect on your goals, it’s time to get in the meat of things."}, {"type": "subtitle", "content": "Ask Questions"}, {"type": "sentence", "content": "There’s one famous Cameroon Proverb that sums this part:"}, {"type": "sentence", "content": "If you ask yourself questions, you will find answers. It may take time for them to arise, but you’ll find them. You already know, deep inside, the reasons your goals became outdated."}, {"type": "sentence", "content": "If you don’t find the answers, keep asking more questions. As you keep asking, answers to previous questions will arise."}, {"type": "sentence", "content": "Don’t focus all of them on your goals. Ask yourself about yourself, too. Take this time to discover who you are, and why you are. Develop more self-awareness along the way."}, {"type": "subtitle", "content": "Notice Repetitive Answers"}, {"type": "sentence", "content": "In the above process, you’ll find yourself coming back to similar answers. Focus on those and dig deeper. Where, exactly, did you stray out the path?"}, {"type": "sentence", "content": "When I was reevaluating my goals for writing, I noticed I was focusing more on external rewards than I used to. Why? Because my work wasn’t fulfilling anymore. I was trying to rush myself into self-dependency. I wanted the freedom to do what I enjoyed without the hardships that come with the journey. That meant I had to reframe the importance I put on writing."}, {"type": "subtitle", "content": "Reverse-engineer the Answers"}, {"type": "sentence", "content": "By diving deeper into your answers, you will find some that deserve to be dissected into more precise ones. Find what you can act upon. Discovering what is still exciting to you will make your brain more attentive. You’ll notice those parts with more ease in the future."}, {"type": "sentence", "content": "I discovered I hadn’t lost any excitement in writing. The sudden “surge” of readers meant more eyes were on me. I had a sudden case of impostor syndrome. Was I really qualified to write about these topics? To remind me that I was, I had to dive into my memories. I remembered that most of my friends were coming to ask me about language-learning. Some had also told me I had inspired them to look into self-improvement. Yes, I had the right to write and inspire others."}, {"type": "subtitle", "content": "Find Improvement Potential"}, {"type": "sentence", "content": "As we saw earlier, you need to learn to fulfill your brain’s needs. If your goals are outdated, it means you aren’t learning anymore. For this reason, you need to look for new areas of improvement."}, {"type": "sentence", "content": "Within your topic, find where you lack knowledge or skills. Change them into tiny habits and find satisfaction in working toward each. Make developing those a part of your journey."}, {"type": "subtitle", "content": "Share Your Concerns"}, {"type": "sentence", "content": "Nobody wakes up one day thinking their goal is outdated. It’s a process that takes weeks at least. By the time you start fixing them, you’ll have already spent quite some time worrying. You’re not alone. Contact your friends and family. Share with them your concerns in an inspiring conversation. Nobody likes seeing people they care for worrying. Ask for advice and support and take note of what is useful."}, {"type": "sentence", "content": "In my case, I shared my worries with the woman who was my girlfriend and two other close friends. Their support and advice contributed a lot to me figuring out what wasn’t going well. One of those was that I had almost entirely stopped seeing friends and didn’t rest at all. I was close to burning out."}, {"type": "sentence", "content": "You cannot fix your goals just once. Our lives evolve day after day. Our goals need that too. You’ll have to go through this process over and over. Don’t take your goals for granted but don’t think your lack of motivation or results is the end of the world either. With the right mindset and some constant tweaking, you can find the drive to improve once again. The excitement will come rushing back."}], "topic": "productivity"}