{"title": "Behind the scenes of decision making", "data": [{"type": "sentence", "content": "It’s lunchtime. Your friends are ordering double cheese pizza. You are tempted to order the same, but you had promised yourself you would eat only healthy. You are deciding whether to go with the crowd and order pizza or to save yourself the guilt and have a healthy meal, say, a salad. To your friend sitting next to you, you just appear to be reading the menu. But, what is actually going on in your brain when you’re deciding?"}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*J-TUcX9nWKjrjiJD3YZkEQ.jpeg"}, {"type": "subtitle", "content": "The neural battle"}, {"type": "sentence", "content": "In the depths of your dark cranium, your brain cells, the neurons, light up emblazoned by electricity and fire at each other in specific patterns. Some networks excite each other, while some inhibit the others. When you have a decision to make, a neural battle is unleashed. A battle that is essentially between different versions of you."}, {"type": "sentence", "content": "One network votes for pizza. Neurons in this network may cover different areas of the brain responsible for smell, sight, memory, and emotion. They send electrical and chemical signals that activate other neurons in the same network. Another network, similar to the pizza network, represents salad. Both the networks of neurons, ones representing pizza and salad, fire at each other trying to be the dominant one. The network that succeeds, will determine the choice we make."}, {"type": "sentence", "content": "For instance, when you see your friends ordering pizza, neurons that stand for pizza light up, say, in memory and emotional centres of the brain, and bring up the memory of the best pizza you had. If the memory is a happy one, perhaps you were with your family or friends and had a spectacular time, the neurons intensify their firing and try to inhibit the neurons representing salad. This will be easy if your memories of the last salad you had were not particularly pleasing. However, the neurons voting for salad, especially the ones in the front part of your brain responsible for will and self-determination, will try to inhibit the neurons representing pizza. But, the signals they send will not be enough to suppress the activity of the intensely firing pizza neurons. Yet another network in your brain says you can have the pizza if you promise to exercise the next day to make up for your bad choice. And so the decision is made. Within seconds."}, {"type": "sentence", "content": "When your friend asks you what you want to eat, the decision now whizzes to your motor cortex, where the response is prepared and you speak up to order pizza."}, {"type": "subtitle", "content": "What about life-changing decisions?"}, {"type": "sentence", "content": "It’s still the same, but at magnitude much higher than what’s required for simple everyday decisions. Instead of a battle, a cerebral war ensues and different neural networks fire equally fiercely. Each network is trying to triumph, but not succeeding quite as easily, because what’s at stake for a decision-made-wrong is huge. No network is firing intensely enough to inhibit the other network, and you don’t make a decision right away."}, {"type": "sentence", "content": "If you are too stuck to decide, your subconscious will take the matter in its hands. It will continue working on the issue, even after you go to sleep, striving to reach a solution to help navigate your way through the world. When you get the gut feeling to choose one choice over the other, it may be the work of your subconscious."}, {"type": "subtitle", "content": "Your neurons define you"}, {"type": "sentence", "content": "Every waking moment, all the thoughts buzzing through, all the decisions you make — from something as trivial as ‘which colour?’ to as big as ‘do I say yes to his proposal?’ arise from your cranial vault lighted by the billions of neurons forming different patterns with each other. Sometimes, the decision is made within seconds, while at other times, it takes much longer. These everyday battles and wars between neural networks that make your choices ultimately determine who you are."}, {"type": "sentence", "content": "The next time you make a decision, whether simple or life-altering, take a moment to think of the intricate process and efforts your brain has taken to help you decide."}], "topic": "neuroscience"}