{"title": "Cal State Cancelled The Fall Semester: Why Other Schools Won’t Follow Suit", "data": [{"type": "image", "content": "https://miro.medium.com/max/12000/0*M51OPS0ymrfZTqsC"}, {"type": "sentence", "content": "This week the California State university system shocked students, parents, and the country at large by formally deciding to continue remote learning into the fall semester. Most colleges have plans, some flexible some deadset, to reopen for in-person classes after the summer. But the general consensus up to now has been that schools will in fact find a way to be carried out in-person for the next school year. So the news of Cal State’s decision immediately sent shockwaves through the higher education community. Harvard quickly followed suit, announcing that all medical, dental, and graduate classes for the fall semester would also be conducted remotely. This seems like a big moment in modern American and global education systems, as right now tens of thousands of students will not be returning to campuses this fall."}, {"type": "sentence", "content": "So that begs the question, will other schools follow the Cal State model? The answer for most colleges is a simple no."}, {"type": "sentence", "content": "Due to the pandemic, the big question is will reopening schools contribute to the already anticipated second wave of Coronavirus? Schools have been worried about this since the beginning of the pandemic lockdowns. And many schools feel that regardless of the answer, staying online for the fall is just not possible. It is undeniable that colleges and universities pose the potential to be cesspools for Coronavirus infections. On-campus, students are subjected to overcrowded dorm life and heavily packed classrooms. Off-campus, the school has no way of regulating gatherings and parties which also increases the risk of making many students sick. Logistically speaking unless schools do opt for downsizing on-campus offerings or continuing remote learning, students and staff will likely fall ill. But many schools are willing to take this risk regardless of the harm that it could cause."}, {"type": "sentence", "content": "Universities are already losing a significant amount of money due to the closures of their campuses. Between refunding housing and fees, losing money for sporting events, and the potential to see a decline in student attendance in the wake of the virus, schools are struggling to find financial means to stay afloat. Additionally, state and federal funding will likely decrease post-pandemic due to the financial recession that the country is currently in. For example, California public colleges and universities alone are expected to lose over $10 million in funding in the wake of COVID-19. These financial issues are at the forefront of university heads' minds. For these reasons, many schools likely will take the risk of sickening what they perceive to be a small percentage of students for the sake of staying financially viable."}, {"type": "sentence", "content": "Some colleges and universities are taking significant mitigating steps to help stop a potential spread. For example, Arizona State University plans to create a stockpile of COVID-19 tests in order to ensure that students in the fall that are experiencing symptoms can be tested. They have also begun planning a quarantine dorm for students who become infected with the virus. But the question of whether simply having tests will prevent a widespread outbreak is up for debate. Regardless of testing availability or quarantine space, more serious alterations to the academic lifestyle would need to be taken in order to ensure the safety of both students and staff. Events would need to be limited in size, social distancing even in classrooms would need to be required, and monitoring of students who live off-campus but commute for classes would need to be fleshed out. Many of these steps seem almost impossible to carry out even for larger, more established schools."}, {"type": "sentence", "content": "Another big issue at hand is what this potential transition to online learning would mean for college athletics. Students already were stripped of Spring sports this year, so many colleges are attempting to limit any further reduction in sporting events next year. For many schools, athletic programs make up a significant chunk of their income. Losing that source of income during an already financially unstable time could mean big trouble for schools that are getting by on thin margins. The California Collegiate Athletic Association (CCAA), a Division II collegiate conference, has already announced that they will not be holding any sporting competitions this fall due to COVID-19 concerns. Division I California State programs are still attempting to find ways to carry out the athletic programs despite online learning, but no specifics have been made public yet. Regardless, many schools likely will not be able to carry athletic scholarships for sports that are not being played, as well as find funding to offset the lost revenue from those programs. For these reasons, it seems almost impossible to guarantee that all or most universities will be able to set aside on-campus fall activities despite the potential harm it poses."}, {"type": "sentence", "content": "There is also the ongoing topic of tuition reduction for online learning. Although Cal State has made the decision to remain online for the fall, it will be continuing to charge the same amount for traditional tuition. This is the sentiment of most colleges and universities around the country, having refused to reimburse students or reduce tuition for online courses. Due to this high price tag for undeniably lesser classes, if remote learning continues into the fall many students will likely opt for cheaper alternatives such as community college or gap years. This would ultimately drive revenue down, as well as enrollment. And with more students suing universities over the lack of refunds for virtual classes, schools likely see the potential hassle of fighting over costs to be an easy fix by simply going back to normal instruction."}, {"type": "sentence", "content": "Regardless of what schools ultimately choose, it is undeniable that this will either be a moment of resilience or an utter disaster. The moment that large outbreaks begin on campuses schools will be forced to scramble in order to mitigate the damages and prevent seeming negligent. If students fall ill or die due to the refusal to accept that in-person instruction risks their safety, lawsuits will be plentiful. And if the decisions of schools like Cal State come out of this scenario seeming to have been proactive, then it may change the way that the university system in our country operates from here on out."}, {"type": "sentence", "content": "Only time will tell how the cards will fall, but one important thing to remember is that student’s health and safety are not disposable. The price tag attached to virtual learning, no matter how steep, should not overshadow the millions of lives at risk. Especially when those students' are the sole reason that these universities continue to be able to operate. The higher education system claims that they have the best interest of the students in mind, but right now it truly seems that it is trumped by the economic potential of a premature reopening. Come fall, we will truly see whether re-opening universities will lead to a case resurgence, but for now the only hope is that schools will begin to recognize the risk that their actions have on both the members of the university, and the country as a whole."}], "topic": "education"}