{"title": "4 Simple Steps To Begin Your Meditation Habit", "data": [{"type": "subtitle", "content": "And cement it for good"}, {"type": "sentence", "content": "Everyone experiences the need for a breakthrough in their life at some point."}, {"type": "sentence", "content": "Personal or professional loss and new life challenges can prompt this craving for personal growth."}, {"type": "sentence", "content": "Sometimes, we can find ourselves overwhelmed by life-changing external circumstances. Other times, the ordinary passivity of our lives catches up with us, provoking us to seek more meaning in our lives."}, {"type": "sentence", "content": "We seek habits to help us improve our lives, but we feel too depleted and worn out to invest in ourselves."}, {"type": "sentence", "content": "The endless content around us, our emotions and feelings have a profound effect on our well-being. When we react to anything around us, we lose energy and over time, we end up feeling perpetually exhausted."}, {"type": "sentence", "content": "If you want to feel more in control over this continuous energy expenditure, a regular meditation habit is an excellent place to start."}, {"type": "sentence", "content": "Jeff Wiener, the CEO of LinkedIn uses a daily meditation practice to help carve out time to think, instead of always reacting"}, {"type": "sentence", "content": "Billionaire tech entrepreneur, Marc Benioff attributes his beginner’s mindset of being open-minded and eager to his routine of meditation."}, {"type": "sentence", "content": "Tina Turner referred to meditation as spiritual life support, helping her deal with the isolation of being a young singer and later, with domestic abuse."}, {"type": "sentence", "content": "In The Untethered Soul, author Michael Singer parallels our life events to a TV show, writing:"}, {"type": "sentence", "content": "Meditation is a fundamental step towards self-discovery."}, {"type": "sentence", "content": "It returns the focus that we have given to our external surroundings, back to us."}, {"type": "sentence", "content": "In a systematic review conducted by Johns Hopkins University, mindful meditation matched the effect of antidepressants in reducing symptoms of anxiety and depression. A study at UCLA found that meditators had better-preserved brains than non-meditators over 20 years."}, {"type": "sentence", "content": "If that daunts you, even a 2-week meditation course illustrated better memory and cognitive reasoning."}, {"type": "sentence", "content": "Personally, for me, meditation has made a life-changing impact on my well-being, helping me reflect, find control over my mind and improve my relationships."}, {"type": "sentence", "content": "The evidence is clear, so why do we find it so difficult to establish the cheapest habit for self-growth that needs no equipment?"}, {"type": "sentence", "content": "Still, when we find a way to plough through our mind and meditate, we can access the benefits forever."}, {"type": "subtitle", "content": "Decide on a method"}, {"type": "sentence", "content": "The first thing you will need to decide is how you will meditate. The options include guided meditations through an app or silent meditation with a timer."}, {"type": "sentence", "content": "Having tried both, I am biased towards silent meditation."}, {"type": "sentence", "content": "Although it may seem insanely tricky to sit in silence with incessant thoughts, I feel that you see the benefits of meditation earlier than when guided."}, {"type": "sentence", "content": "Guided meditations are great for beginners, looking for an anchor for their thoughts. Apps such as Headspace or Calm provide an ideal starting point."}, {"type": "sentence", "content": "Once you become more comfortable, I do recommend switching to silent meditation."}, {"type": "subtitle", "content": "Create a meditation routine"}, {"type": "sentence", "content": "Next, you will need to recognise the best time to meditate. To be honest, I feel that the actual time of the day doesn’t matter. It should ideally be a time when you are least likely to be disturbed."}, {"type": "sentence", "content": "Tethering it to an aspect of your life, like meditating after breakfast or before sleep will make it more automated and effortless to maintain."}, {"type": "sentence", "content": "Find a spot in your home that is quiet and can be solely for meditation, allowing its association with slowing down and calm."}, {"type": "sentence", "content": "Assign a time limit for your meditation. I recommend starting with 5 minutes and progress in 2–5-minute increments."}, {"type": "subtitle", "content": "Let your mind wander"}, {"type": "sentence", "content": "Meditation has nothing to do with stopping your thoughts and everything to do with not reacting to them."}, {"type": "sentence", "content": "Sit upright, but you don’t have to. Focus on your breathing, the air coming through your nose, illuminating your whole with life, releasing the pressure as it goes out."}, {"type": "sentence", "content": "When you realise that you that your meditation practice is a safe place where your mind can wander, you will learn two things:"}, {"type": "sentence", "content": "When I find the mind-clutter growing, I meditate to regain my power of reaction. I don’t meditate to reason with my thoughts; I simply watch them pass through me."}, {"type": "sentence", "content": "Allow yourself just to be."}, {"type": "subtitle", "content": "Accept that not all benefits are immediate."}, {"type": "sentence", "content": "In the current pace of the world, we expect instant gratification and results from everything we do."}, {"type": "sentence", "content": "Although meditation will help you find calm and peace during its practice, the extension of mindfulness in other areas of life takes time."}, {"type": "sentence", "content": "Meditation is a summative practice that needs continuity. The benefits add on and establish themselves in small increments each time you practice."}, {"type": "sentence", "content": "As your confidence in facing your thoughts grows, you will start feeling more in control of what you think, eat, wear or consume in any other way."}, {"type": "sentence", "content": "Meditation is like a muscle. It will grow stronger each time you use but shrinks when you let go of it."}, {"type": "sentence", "content": "The full-proof way to achieve mindfulness is to be realistic in how long you want to meditation and not let go, for even a day."}, {"type": "sentence", "content": "On days when I can’t find my forty minutes for meditation, I settle for five."}, {"type": "subtitle", "content": "Finally"}, {"type": "sentence", "content": "Doubt and fear limit our ability to form productive habits."}, {"type": "sentence", "content": "A meditation routine will provide you with the influence on your mind that is needed to upgrade other habits with less resistance."}, {"type": "sentence", "content": "Being patient with yourself and staying accountable will help you make meditation a part of your life."}, {"type": "sentence", "content": "It is as straightforward or as difficult as you make it, but either way, it will be the best decision you make for yourself."}, {"type": "sentence", "content": "Like what you read so far? Subscribe to my free newsletter here."}], "topic": "mindfulness"}