{"title": "The Culture War Comes for the Scientists", "data": [{"type": "subtitle", "content": "Two very unscientific takedowns of Imperial College coronavirus modeler Neil Ferguson"}, {"type": "sentence", "content": "Few works of scientific analysis have had as much impact on public policy as the COVID-19 model developed by epidemiologist Neil Ferguson of Imperial College London, whose grim projections of many deaths if the virus spread unchecked influenced the decision to adopt strict lockdown measures not only in the United Kingdom, but in the United States and other countries as well. Now that debates about managing the pandemic have turned nakedly and nastily political — and scientists have been targeted for personal smears and vilification, to the point that even the head of the Royal Society spoke out in protest — it’s not surprising that Ferguson has been singled out."}, {"type": "sentence", "content": "On May 10, The Daily Telegraph published an opinion piece savaging Ferguson by science writer Matt Ridley, co-written with British politician David Davis. Then, on May 15, an attack on Ferguson’s model by data scientist Chris von Csefalvay appeared on the website of City Journal, a publication of the right-of-center Manhattan Institute."}, {"type": "sentence", "content": "The most notable part of the Ridley/Davis attack was its thin veneer of science over a complete lack of scientific rigor. Perhaps Davis, an MP and businessman, has an excuse for his ignorance, but Ridley has been a zoologist, and a science editor for The Economist."}, {"type": "sentence", "content": "Shocked by the unfolding outbreak in Lombardy, Italy, and responding to the urgency of the situation, Neil Ferguson used an epidemic model he had created 13 years ago, for an avian flu outbreak in Thailand in 2005. On March 16 of this year, he delivered a 20-page report to the British government, stating that the U.K. death toll could reach 510,000 within roughly 3 months unless the British government dropped its laissez-faire approach (also called the herd-immunity approach), which was based on a previous model that had already come under harsh criticism. According to Ferguson’s model, isolating suspected cases, but not undertaking other measures, would result in around 250,000 deaths and the National Health Service being overrun."}, {"type": "image", "content": "https://miro.medium.com/max/1836/1*8mpWiANIwjCrh9ihuSAuxA.jpeg"}, {"type": "sentence", "content": "How does Ferguson’s model compare with reality? On March 21, the U.K. had 3,983 confirmed COVID-19 cases and 194 deaths; Italy had 4,032 deaths. On May 18, the U.K. had 243,695 confirmed cases, and 34,636 official deaths, but excess-mortality figures strongly suggest the death-toll has been significantly under-calculated. By April 24, excess deaths — those above yearly averages for the same time period — totaled 38,499 in England and Wales alone, far higher than the 27,222 officially caused by the virus in those areas. And all that is despite the U.K. government implementing a strict lockdown."}, {"type": "sentence", "content": "So by any measure, Ferguson’s model, as hurriedly repurposed as it was, gave reasonable predictions — well within the ranges of probability given by newer models, and well within the evidence gathered in the U.K. since March. In his criticism of Ferguson, Ridley brought in some absurd speculations from Sweden, but didn’t tackle deaths per capita, which last week were the highest in the world."}, {"type": "sentence", "content": "In contrast to Ferguson, a University of Oxford team headed by Professor of Theoretical Epidemiology Dr. Sunetra Gupta published a preprint on March 24 suggesting that around 50 percent of the total U.K. population had already been exposed to the virus. This was a ludicrous over-estimate, as shown by the steadily climbing numbers of confirmed infections and deaths since that date."}, {"type": "sentence", "content": "If that preprint’s model were remotely accurate, new infections would have started steadily falling in the U.K. after April 1, and new deaths would have started falling by April 15 at the latest — even in the absence of any suppression or mitigation efforts. As of mid-May, those numbers are still not steadily declining, despite the lockdown. In fact, new studies suggest that only 3.8 percent of the British population have been infected by the SARS-Cov2 virus. One paper even concludes that without counter-measures, the death toll could have been higher than predicted in Ferguson’s model."}, {"type": "sentence", "content": "Ridley and Davis ignore the many other models with similar predictions and lay full blame on Ferguson, yet pointedly disregard other salient political facts: French President Emmanuel Macron telephoned British Prime Minister Boris Johnson on Friday March 20 and threatened to close the France-U.K. border unless Johnson took immediate steps against the COVID-19 epidemic. This fact, which the Telegraph reported as forcing a “reluctant” Johnson’s hand, seems to have been even more pressing than Ferguson’s epidemiological model."}, {"type": "sentence", "content": "The British government was also advised that they were losing the trust of the public in the U.K., who saw neighboring countries adopt quarantine measures. That last fact seems to have panicked the cabinet into action, as did Macron’s threat."}, {"type": "subtitle", "content": "Scientific Modeling: Inherently Imperfect, Importantly Informative"}, {"type": "sentence", "content": "Modeling an epidemic is essential for forecasting needs and developing policies to address them. The world’s first epidemic model was created by the famous 18th Century mathematician Daniel Bernoulli, for smallpox. For governments and health systems, knowing in advance what to expect is vital. A hospital, a health-system, and a nation must have some idea of what supplies they will need, of what shortages might happen, and how many will likely die if they choose any particular response. Forewarned is forearmed."}, {"type": "sentence", "content": "But a model is only helpful if you actually use the results for actions. On that, the U.K. government’s record is woeful. Creating a computer model of an epidemic is an enormously complicated job, utilizing relevant data on how people interact, and accounting for various social factors. It’s a long task for a group of researchers, who typically build on previous work. Ferguson employing a model he created years ago is nothing against him. Faced with an urgent situation, he used the tools he had to hand; his results were well within the ranges of other reputable models, and above all within reality."}, {"type": "sentence", "content": "Yet Ridley and Davis attack Ferguson’s record in epidemiological modeling while failing to note that newer models suggest a similar range of deaths. They also engage in prurient scandal-mongering, opening their critique with a gibe about Ferguson’s “romantic love-trysts” (he had to resign his post as a scientific advisor to the government after violating the quarantine to meet with a married lover). But Ferguson’s failure to follow his own advice does not make his model wrong. And Ridley, of all people, is not in a good position to criticize others for personal failings. He had to step down as chairman of the Northern Rock bank in 2007 following accusations from British parliamentarians that he had harmed the reputation of British banking."}, {"type": "sentence", "content": "Chris von Csefalvay’s broadside, which concludes with the line, “As Socrates might have put it, an unexamined model is not worth trusting,” is at least more adult than Ridley’s. But like Ridley, von Csefalvay does not account for the urgency of the situation as it unfolded in early March. He too fails to note that Ferguson’s predictions were well within the bounds of other models and in broad accordance with the reality of what has actually happened — 34,636 confirmed deaths from COVID-19 in the U.K. in two months, and likely about 20,000 more. He also doesn’t acknowledge that any complex model takes a long time and a large staff to create."}, {"type": "sentence", "content": "Von Csefalvay is a strange case. He variously describes himself as a virologist specializing in bat-borne diseases, as on his Twitter biography, or as an epidemiologist. Yet his academic record shows no signs of any formal education in medicine or biology, let alone in the sub-disciplines of epidemiology or virology. His only formal education seems to be in data science. He claims to have written some papers on specific viruses, and the epidemiology thereof, but he also claims all those papers are “currently classified.”"}, {"type": "sentence", "content": "Ultimately, neither of these two attempted takedowns has any scientific merit. Neither proposes any alternative model. Yes, models must be examined, especially when they influence public policy. But examinations of Ferguson’s model should acknowledge that he acted as best he could in an urgent situation, and that his predictions were largely confirmed by the death toll in the U.S. — especially New York City — and the U.K. It’s clear that the critics are using Ferguson as a proxy for attacking the lockdowns and other quarantine measures they see as overly restrictive."}, {"type": "sentence", "content": "Meanwhile, the same critics ignore the tragedy of avoidable “harvesting” — a chilling epidemiological term for excess mortality. As of May 20, Germany has had 8,090 confirmed COVID-19 deaths, compared to the U.K.’s 35,341 — even though Germany has a larger population and, until mid-April, more confirmed cases. The difference? Germany took real action, early and consistently, which kept death rates to under a quarter of the U.K.’s."}, {"type": "sentence", "content": "This is a far greater scandal than any flaws in Ferguson’s model."}], "topic": "science"}