{"title": "Selling the story", "data": [{"type": "subtitle", "content": "Stories are everywhere."}, {"type": "image", "content": "https://miro.medium.com/max/10368/0*LIPZfUfY4pKeMhGk"}, {"type": "sentence", "content": "Stories are present in all parts of our lives: Every social media platform has a story feature these days, we look for the best ones on Netflix for entertainment purposes and we even tell stories about ourselves when we interview for a new job. And you’re reading this article right now because you’re interested in the narrative around a particular topic. We were told stories when we were children, before we went to bed and our interest comes from an ancient desire to gather around a fireplace and to be taken on a dramatic adventure told in words."}, {"type": "sentence", "content": "As any type of designer, we’ve become pretty good at telling stories to our users, clients and customers but we’re missing out on one important fireplace: Using storytelling as a tool when it comes to interacting with our own team, the people within the business that we interact most often and most closely with. I see this happening in the form of links to designs simply being shared, rather than being presented. This leaves the receiver with the task of having to figure it out for themselves when what we should be doing is to be crafting a narrative around our solution and telling the story of it, because every solution is a story waiting to be told."}, {"type": "sentence", "content": "On a daily basis, we’re working with personas, business objectives, user journeys and problems that have to solved and these elements already make up all the ingredients necessary for a good story. The problem (and its solution) is usually the part of any story where the tension reaches its peak and this just happens to be our expertise — we solve problems on a daily basis and we’re usually involved in the process of getting to the solution from start to finish, so we’re perfectly equipped to be telling stories around our solutions, so the next time the opportunity presents itself, don’t hesitate to grab it!"}, {"type": "subtitle", "content": "Here’s how."}, {"type": "subtitle", "content": "Stronger relationships in the business"}, {"type": "sentence", "content": "The main benefits of going with this approach that I’ve experienced in the past have been very impactful on the relationships I’ve been able to build within the business."}, {"type": "sentence", "content": "When telling the story in the right way, we’re motivating people by getting them excited about the solution and excitement can be a very strong motivator. Your stakeholders will approach you with solutions to problems they’re encountering along the way, rather than throwing the problem back at you because you got them invested in it in the first place. I’ve seen this happen especially with developers — when you manage to get them invested in your solution, turning it into our solution, they will go above and beyond when implementing it, rather than just executing on something that’s been imposed."}, {"type": "sentence", "content": "Another benefit of this approach is being transparent about our processes and the act of designing which has become somewhat mystical. By breaking down the barriers around design and being transparent about how we got to a particular solution, we’re opening the doors to more meaningful collaboration and increased involvement which leads to more perspectives and better feedback when working on a solution."}, {"type": "sentence", "content": "The last and most important benefit of using storytelling is that we’re contributing to increasing the value of design within the business. This is something we still have to work on every single day, as we have to earn the trust within businesses. By tailoring the narrative for our audiences, opening up about how we got to the solution and highlighting how it fits into the big picture, we’re showing that we’ve really made the problem our own, emphasising the skills we applied to solve it and why it really matters. This helps us to get closer to defining the ROI (return on investment) of design, which has been difficult to assess for so long."}, {"type": "subtitle", "content": "Opportunities are everywhere"}, {"type": "sentence", "content": "Just like with any other skill, storytelling has to be practised. The good thing: The opportunities to tell a good story come at us every single day, so let’s take advantage of them in our everyday interactions with the people we work most closely with, within the business."}], "topic": "design"}