{"title": "Supply and Demand in the Bond Market", "data": [{"type": "sentence", "content": "In finance, bonds are instruments of indebtedness of an issuer to the holders, under which the issuer owes the holders a debt and an interest (the coupon) or to repay the principal at a later date (maturity date)."}, {"type": "sentence", "content": "In other words, a bond is a form of loan where two entities act: the creditor that is the holder of the bond and the issuer of the bond that is the debtor. They are used by the issuer in order to gather external funds to finance long-term investments, or in the case of government bonds, to finance current expenditure."}, {"type": "sentence", "content": "Bonds are commonly issued by governments at all levels and corporations and are typically not secured by collateral. They are more frequently traded than loans, and moreover, they can be held by retail investors while loans can’t. Also, generally, they are sold in relatively small denominations of around $1,000 to $10,000."}, {"type": "sentence", "content": "The Bond Market is a financial market that has as a primary goal to provide long-term funding for public and private expenditures, allowing participants to issue new debt on the primary market, or buy and sell securities on the secondary market."}, {"type": "sentence", "content": "Government bonds are an important component of the bond market, in fact, government bonds are often used to compare other bonds and also to measure credit risk, because the yield on government bonds in low-risk countries such as Germany or the United States is considered a risk-free rate of default."}, {"type": "subtitle", "content": "Supply, Demand and Market Equilibrium"}, {"type": "sentence", "content": "To understand in-depth how the prices of bonds are determined is important to look at how the forces of supply and demand behave in the bond market."}, {"type": "subtitle", "content": "The Demand Curve"}, {"type": "sentence", "content": "In order to make our analysis easier to understand let’s consider the demand for a bond with a one-year maturity, that makes no coupon payments but that pays the owner at maturity the $10,000 face value. In this case, given that the holding time is one year, the return on this bond is equal to the interest rate as measured by the yield to maturity, which is obtainable from the following equation:"}, {"type": "sentence", "content": "Assuming that the bond sells for $9,750, the expected return (interest rate) is 2,5%. At this interest rate level, we can assume that the total quantity demanded is $100 billion (point A). Then, at a price of $9,000, because the expected return is higher (11,1%), suppose that the quantity demanded is $200 billion (point B)."}, {"type": "sentence", "content": "Then, as you see in the following graph, we have plotted the demand curve following the assumption shown before, which shows that a lower price the expected return is higher (everything else being equal), and therefore the quantity demanded will be higher."}, {"type": "subtitle", "content": "The Supply Curve"}, {"type": "sentence", "content": "The supply curve shows the relationship between the quantity supplied and the price of the bond when other economic variables are held constant, it describes the behavior of suppliers that in this case are borrowers (companies, and governments) that issue bonds in order to finance their activity."}, {"type": "sentence", "content": "The supply curve for this example is based on the same assumption that every variable besides the price of the bond and interest rate are held constant, and therefore when price increases the expected return (interest rate) goes down, which makes it less costly to borrow by issuing bonds, therefore supply goes up."}, {"type": "subtitle", "content": "Market Equilibrium"}, {"type": "sentence", "content": "In economics, market equilibrium refers to a situation where the supply curve and the demand curve meet, that is the price where the amount that individuals are willing to buy (demand) equals the amount that individuals are willing to sell (supply)."}, {"type": "sentence", "content": "In our example, the market equilibrium is where the quantity of bonds demanded equals the quantity of bonds supplied, which is point E, where demand and supply meet."}, {"type": "sentence", "content": "In fact, for example in point A there is excess supply because at that interest rate borrowers are more likely to issue more bonds because it is cheap, they have to pay low interest to lenders, and on the other hand, lenders think that they can obtain better returns elsewhere, therefore they will demand fewer bonds. This means that prices will go down, towards the market equilibrium, where suppliers prefer to issue fewer bonds, and lenders are willing to buy more bonds because they can get a return that is more interesting than before."}, {"type": "sentence", "content": "On the other hand, in point C, where demand is excessive with respect to supply because returns are very high, the price will go up, leading to an increase in supply and a tightening in demand, towards the market equilibrium."}, {"type": "sentence", "content": "This mechanism might take some time but it is important to understand how it works because in the bond market, and in markets in general because in the long term prices tend to head toward market equilibrium."}, {"type": "image", "content": "https://miro.medium.com/max/1000/0*uIv9ZoqpaXeGTCUM.png"}, {"type": "subtitle", "content": "How changes in equilibrium interest rates affect prices"}, {"type": "sentence", "content": "In the following section, we will analyze why equilibrium interest rate changes by using the supply and demand framework for bonds introduced before."}, {"type": "sentence", "content": "A change in the equilibrium interest rate is caused by a shift in the demand (or supply) curve, which can be caused by changes in some factors other than the interest rate and bond price. The demand (or supply) curve shifts only when the quantity demanded (or supplied) changes at each given price (or interest rate) of the bond, therefore it is a different mechanism with respect to the one that causes movements along the demand (or supply) curve, that usually happens as a result of a change in the price of the bond, and therefore causes the quantity demanded (or supplied) to move from one point to another along the same curve."}, {"type": "subtitle", "content": "Shifts in Demand"}, {"type": "sentence", "content": "In order to understand what makes the demand for bonds to shift it is useful to look at portfolio theory, which tells us how much of an asset people will want to hold in their portfolios, and it states that it is influenced by four main factors:"}, {"type": "image", "content": "https://miro.medium.com/max/1000/0*jNPeAYdGsueWI3pc.png"}, {"type": "subtitle", "content": "Shifts in Supply"}, {"type": "sentence", "content": "As in the case of demand, the supply curve for bonds can shift too, and it is a result of changes in the following factors:"}, {"type": "image", "content": "https://miro.medium.com/max/1000/0*o7_GFPf1_61fGrT5.png"}], "topic": "economy"}