{"title": "Amazon, Antitrust, and Private Label Goods", "data": [{"type": "sentence", "content": "In the debate over private-label goods, it’s important to keep in mind why consumers prefer them."}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*Q6O_fh9V3C9MRLBpXxPKcA.png"}, {"type": "sentence", "content": "by Alec Stapp | Director of Technology Policy"}, {"type": "sentence", "content": "Last week, the WSJ published an investigation with the headline: “Amazon Scooped Up Data From Its Own Sellers to Launch Competing Products.” As the article notes, in a Congressional hearing last year, an Amazon associate general counsel said, “We don’t use individual seller data directly to compete” with businesses on the company’s platform. The reporter for the WSJ claims to have seen evidence of Amazon managers violating this self-imposed rule in order to improve its private label goods business (i.e., Amazon-branded products)."}, {"type": "sentence", "content": "There are two issues at play here. First, there is the question of whether Amazon violated Section 5 of the FTC Act by engaging in “unfair and deceptive practices” in order to entice third-party sellers onto its platform. Amazon is currently conducting an internal investigation into what occurred and a Congressional committee has already said it will be looking into the matter. These investigations are necessary and worthwhile for determining what exactly happened and who knew what when."}, {"type": "sentence", "content": "The second issue is about antitrust law. Stacy Mitchell, the executive director of the Institute for Local Self-Reliance, said, “An exec testified in July that Amazon doesn’t use data from sellers to create its own rival products. Turns out it does. This is monopoly behavior, hence the coverup.” But as Doug Melamed, a professor at Stanford Law School, said in comments about the situation, “Using the data to improve product offerings is not, and ought not be, unlawful under US law. The issue is whether Amazon obtained the data by misappropriation or misrepresentation.” Professor Melamed is correct on the question of antitrust law. To understand why, it’s useful to discuss the history of the retail industry and how it works today."}, {"type": "subtitle", "content": "1. All major retailers use data on what sells in stores to build their private label businesses"}, {"type": "sentence", "content": "It is common practice for retailers, including grocery stores and department stores, to use data to develop their own store brands to directly compete with name brand products. As Benedict Evans, an independent analyst, put it in reaction to the story, “It can be pretty entertaining to watch critics of Amazon discover ‘retail.’” The practice of using information about which products are selling well to develop private label goods is nearly as old as the retail industry itself. Sears launched its catalogue business in 1888. By 1927, the retailer was selling its own tools and appliances under the Craftsman and Kenmore in-house brands."}, {"type": "image", "content": "https://miro.medium.com/max/2248/0*AJMVDi06iwh575Z4"}, {"type": "sentence", "content": "These days, selling private label goods is practically de rigueur for a company competing in the retail industry. Here are the shares of revenue from private label goods for some leading retailers according to data compiled by Morgan Stanley:"}, {"type": "sentence", "content": "By comparison, Amazon share of total retail sales from private label goods is only 1% (excluding its proprietary electronics such as Echo voice assistants, Fire TV, and Ring doorbells). As Jack Hough writes for Barron’s, “Private labels work best for products with decent turnover and excessive margins. […] Remember when HDMI cables sold for $30 a decade ago? Now, you can find them for $7.” Most private label goods are commodities akin to HDMI cables. The large and concrete benefit of lower prices to consumers outweighs the negligible effects on innovation (the HDMI cable has reached its final state and requires no new investment)."}, {"type": "subtitle", "content": "2. Amazon is not dominant in retail"}, {"type": "sentence", "content": "While private label goods may be ubiquitous in retail, some critics argue that Amazon is so dominant it’s qualitatively different from when other retailers do it. Hal Singer, a managing director at Econ One, argued as much on Twitter: “It’s not just that Amazon has access to better information. It’s that, unlike a grocery chain, Amazon is DOMINANT PLATFORM PROVIDER.” But retail is a much more competitive market than many realize. For instance, Amazon is still much smaller than Walmart. Here are US retail sales figures for 2018 (the most recent year of data):"}, {"type": "sentence", "content": "It seems difficult to argue that it’s a problem when Amazon uses data to inform its private label business, but not when a company more than three times its size ($388 billion vs. $121 billion) does the same thing at a rate 15 times higher (15% vs. 1%)."}, {"type": "subtitle", "content": "3. Online retail platforms are more open to competition than physical stores"}, {"type": "sentence", "content": "But maybe it’s something special about the online retail market as opposed to the brick-and-mortar retail market? Perhaps sellers feel they have no option but to sell on Amazon if they want to sell online? That doesn’t seem to be the case. According to data from eMarketer, more than half of Amazon sellers also sell on eBay. Slightly less than half sell on a personal website as well. More than a third also sell on Walmart. It also seems worth noting that prior to the internet, third-party sellers had no option at all for selling directly to consumers. They had to negotiate with one of the big box retailers for placement on store shelves. Online platforms give them a new channel for reaching customers directly."}, {"type": "subtitle", "content": "4. Retailers don’t have private data on cost structures for manufacturers"}, {"type": "sentence", "content": "So, private label goods are not unique to Amazon in the retail industry and the company does not have a dominant position in the market. But maybe because Amazon is a “tech” company it has much more data than brick-and-mortar retailers and therefore has an anti-competitive advantage? Shaoul Sussman, a legal fellow at the Institute for Local Self-Reliance, tried to make that argument:"}, {"type": "sentence", "content": "Sussman’s claim that a retailer could “reverse engineer the majority of another brand’s cost” is unfounded. No retailer has nonpublic information about the vast majority of a manufacturer’s fixed costs (property, plant, and equipment) or variable costs (raw materials, labor, etc.). Knowing the amount spent on shipping, storage, and marketing is only a small fraction of a company’s cost structure. Understanding marketing costs is helpful, but that doesn’t mean Amazon knows the cost structure of manufacturing the product. In some cases, that might be publicly available information. But that means every other competitor has access to it, too."}, {"type": "sentence", "content": "Yes, Amazon has more data than rival brick-and-mortar retailers (particularly on what consumers look at but never purchase), but the jury is still out on how much of a competitive advantage this affords them relative to big players like Walmart (which also has its own online marketplace and spends more on IT per year than Microsoft and Facebook). And even if this is an advantage, that would not necessarily be an antitrust issue if it’s used to deliver consumer benefits. (Of course, that does not absolve Amazon of the need to truthfully represent to sellers how it’s using that data.)"}, {"type": "subtitle", "content": "5. The only difference between a platform and a retailer is inventory risk"}, {"type": "sentence", "content": "Sussman thinks there is another key difference in Amazon relative to other retailers:"}, {"type": "sentence", "content": "First, it’s important to know that ad fees on Amazon are analogous to slotting fees in brick and mortar stores. Brands have been paying for promotion in retail long before the e-commerce revolution. Prime shelf space and prime search rankings are both scarce resources that are auctioned off to the highest bidder. According to data from the Center for Science in the Public Interest, food manufacturers spend 70% of their marketing budgets on these “trade promotion fees” and 30% on advertising. At the end of the day, it’s all marketing."}, {"type": "sentence", "content": "Second, while it’s true that Amazon is simultaneously a retailer, producer, and platform, this is not economically different from traditional retailing. I’ve already explained how legacy retailers also engage in private label and are therefore “producers.” And while they are not “platforms” in the technical sense of being open to anyone (sounds… anticompetitive), the business model is not significantly different."}, {"type": "sentence", "content": "Traditional retail charges a markup on the price paid to wholesalers or manufacturers (a percentage of the final retail price). The retailer can either purchase that inventory outright and assume the risk of it not selling, or it can include a “sale or return” provision, which reserves the retailer the right to return the inventory to the wholesaler or manufacturer if it does not sell. Inventory risk is just another cost and can be traded off with other contract provisions during the negotiating process."}, {"type": "sentence", "content": "Platforms, on the other hand, do not take custody of the inventory and instead provide services to sellers. In exchange, the platform charges a percentage of the final retail price. Whether it’s a platform or a retailer, the business is the same: Partner with companies selling goods and collect a profit margin on the final retail price. The rest is just accounting."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "In the debate over private label goods, it’s important to keep in mind why consumers prefer them. According to survey data from Nielsen, 70% of people say they purchase private label brands to save money. This is unsurprising as private label goods tend to be less expensive than name brand goods while offering similar levels of quality. It’s as clear an example there is of direct horizontal competition."}, {"type": "sentence", "content": "While the FTC should look into the allegations that Amazon violated its own Chinese wall — and therefore misled sellers — politicians such as Senator Warren and Congressman Cicilline are conflating a consumer protection issue with an antitrust issue to support their own ideological crusade. Contrary to what they may claim, the accusations of antitrust violations in this case are dubious."}], "topic": "economy"}