{"title": "The 5 Best Wordpress Plugins for Blogging", "data": [{"type": "subtitle", "content": "Take your blog to the next level with these 5 road-tested tools"}, {"type": "sentence", "content": "Wordpress is the number one content management system (CSM) in the world. It powers over 34% of all websites on the internet, including 15% of the world’s top websites. Wordpress is also used massively for blogging. There are 17 blog posts published on Wordpress per second. Each month, 409 million people read over 70 million posts and 77 million comments."}, {"type": "sentence", "content": "Wordpress wouldn’t the platform it is today without its wide range of plugins. They allow you to customise your website and implement any new function you can think of (e-commerce, members area, download sections, advanced forms, landing pages…) As of this writing, there are 55,000 plugins available on the Wordpress plugin directory, which has received over 1 billion downloads."}, {"type": "sentence", "content": "You can technically build a blog on Wordpress without plugins, but you won’t get far. Plugins are necessary to take your blog to the next level. They will enable you to drive more traffic with SEO, design awesome template-based content, and incorporate cool widgets outside of the limiting framework of default themes."}, {"type": "sentence", "content": "With that in mind, let’s take a look at the 5 best Wordpress plugins for blogging."}, {"type": "subtitle", "content": "Yoast SEO"}, {"type": "sentence", "content": "Yoast is a Search Engine Optimisation (SEO) plugin. SEO is the process of increasing the quality and quantity of website traffic by increasing the visibility of a website or a web page to users of a web search engine."}, {"type": "sentence", "content": "The plugin helps you do that by making it easy to provide the necessary information for Google to rank your content higher up in the search results. It adds a section at the end of the admin page where you write your content. It asks you to input your focus keyphrase, your Google text snippet, and more. It shows you the SEO score and the readability score of your content."}, {"type": "sentence", "content": "It’s an extremely powerful tool, and it gives you a ton of advice on how to improve your score if it is not high enough. The suggestions are easy to understand. Here is an example:"}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*aKSI-ByZ5OjrzX018u8hXA.png"}, {"type": "sentence", "content": "In the premium version, you can optimise your online ranking even more, with synonyms of your keyphrase, outdated content notifications, link suggestions, content insights…"}, {"type": "sentence", "content": "SEO is super important when blogging, and Yoast definitely makes the process easier. At the end of day though, remember one thing: content is king, and if it is not kick-ass in the first place, it won’t gain exposure. Focus on content first, promotion later."}, {"type": "subtitle", "content": "Contact Form 7"}, {"type": "image", "content": "https://miro.medium.com/max/1420/1*UtqDZVNUBP3J3l9Zg36S6w.png"}, {"type": "sentence", "content": "With over 5 million active installations, Contact Form 7 is the number one form plugin for Wordpress. It was originally intended for contact forms only, hence the name. But overtime, it grew into a tool to set up any type of form you could think of: newsletter subscription, event signup, downloadable material…"}, {"type": "sentence", "content": "The plugin’s bare bones are simple, and the interface is also a piece of cake. But what makes this tool extremely powerful is the set of extensions you can add on top of it to do whatever you like:"}, {"type": "sentence", "content": "These extensions come as separate plugins, and some are paid. All you have to do is install one of them, and the sync is automatic and seamless."}, {"type": "subtitle", "content": "Elementor"}, {"type": "sentence", "content": "Elementor is the number one free Wordpress page builder, with over 5 million active installations. Creating custom pages and content in Wordpress can be challenging, as themes usually have limited editing capabilities, and the Wordpress editor doesn’t let you get under the surface of things."}, {"type": "sentence", "content": "Elementor gives you the option to edit your pages from scratch, using a simple drag-and-drop interface. It also handles responsiveness, meaning that you can design each of your pages for mobile, tablet, and computer screens. All you have to do is select the building mode while making your page, and adjust the content accordingly."}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*RAkCIvw3jRJmJ6PO4TebSQ.gif"}, {"type": "sentence", "content": "This plugin is especially great for building landing pages, meaning standalone webpages created for specific campaigns (newsletter signup, freebie download, webinar registration…)"}, {"type": "sentence", "content": "Elementor doesn’t interfere with the theme you already have in place. You can choose to build a page with the main theme properties (width, font properties, spacing…) but you can also start from scratch by selecting “Elementor Full Width” as a page template. That page will be operating on its own, and won’t inherit any default formatting from the theme."}, {"type": "subtitle", "content": "Widget Shortcode"}, {"type": "sentence", "content": "At 90,000 active installations and only version 0.3.5, this plugin is not one the most popular ones. But it is nonetheless one of my favourites."}, {"type": "sentence", "content": "Wordpress comes with a lot of widgets. They are blocks of content you can add to your site’s sidebars, footers, and sometimes other areas. The problem is that the locations where you can add these blocks depend largely on the theme you’re using. Most themes only allow for custom content in the sidebar and the footer. If you want to have a subscribe form halfway through a post content, or a popular posts section right under your header, you can only do that with code knowledge."}, {"type": "sentence", "content": "Widget Shortcode fixes that issue. It creates a widget instance of your choice, and assigns a shortcode to it, that would look something like this:"}, {"type": "sentence", "content": "Copy-paste that code inside your actual post, and you’re done. The subscribe form will show up right in the middle of your content."}, {"type": "sentence", "content": "This is very powerful, and allows you to break free from the theme boundaries. Another example could be the “Related Posts” section at the end of an article. Not every blogging theme offers that option, and when they do it’s not always easy to configure. With widget shortcode, you can download a separate related posts plugin, set it up separately, assign it a shortcode, and copy-paste the code at the end of your articles. Super easy."}, {"type": "subtitle", "content": "Max Mega Menu"}, {"type": "sentence", "content": "Another less popular plugin (300,000 active installations) but still really convenient. This one allows you to customise the menu of basically any theme."}, {"type": "sentence", "content": "If you get a professionally-built theme, chances are the menu section won’t look too bad. But it won’t be customisable, and custom menus are always better. You want your menu to be perfect, because it’s one of the most important parts of your blog."}, {"type": "sentence", "content": "What if you want to include these in your menu:"}, {"type": "sentence", "content": "Well, unless you’re a developer, good luck getting that up and running. Menus in themes are usually hard-coded and not very dynamic."}, {"type": "sentence", "content": "Max Mega Menu converts your boring menu into a mega menu. It allows you to add any widget up there. You can also completely change the style of your menu as well as its behaviour in mobile, tablet, and desktop mode."}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*DRSIHXXdtB3aGbI5dQmizA.gif"}, {"type": "subtitle", "content": "Bonus: BlankSlate"}, {"type": "image", "content": "https://miro.medium.com/max/2356/1*kun_MNaBwy2Q48bPy9dV-A.png"}, {"type": "sentence", "content": "BlankSlate is actually not a plugin, but a theme. It is the cleanest, most minimalist theme you can find out there. It’s mostly targeted at developers to build themes for clients. But it’s also a great way to design your own pages within Wordpress, making sure you won’t interfere with any existing rules."}, {"type": "sentence", "content": "All the plugins presented in this article are reputable, road-tested pieces of code that usually install fine. But Wordpress is an ever growing machine, and you might run into trouble trying to install specific items, simply because it interferes with one tiny piece of code in your existing theme."}, {"type": "sentence", "content": "With this theme, no interference. You can literally start from a blank slate, design your pages one by one in Elementor, and have all your custom content run properly. More work, but better results."}, {"type": "sentence", "content": "Thanks for reading! Feel free to let me know about your favourite Wordpress plugins for blogging, in the comments section below! Any feedback on the piece is also greatly appreciated! Until next time!"}], "topic": "freelancing"}