{"title": "Does Jeff Bezos deserve a trillion dollars?", "data": [{"type": "image", "content": "https://miro.medium.com/max/3000/1*kxXEEqSgx0x61MVQGFF9rQ.jpeg"}, {"type": "sentence", "content": "Two years ago, while speaking at a forum hosted by the Bush Center, Amazon CEO Jeff Bezos told an anecdote about the early days of his company, when it was just him and 10 employees selling books out of his Seattle home. They were packing orders on a concrete floor when one of his workers had “the most brilliant idea” that “doubled” productivity:"}, {"type": "sentence", "content": "This is the richest man in the world — with a net worth of nearly $150 billion. The guy who had to be told that tables would be useful in a company that ships packages is now worth roughly double the GDP of Guatemala."}, {"type": "sentence", "content": "A story came out recently about how Amazon’s windfall from the COVID-19 pandemic might make Bezos the world’s first trillionaire, re-igniting the usual debates about inequality and whether or not billionaires — much less trillionaires — should exist."}, {"type": "sentence", "content": "Bezos’ defenders invariably return to the mythology of how he started this online bookseller “in his garage” and built it into a globe-spanning e-commerce powerhouse. But as the aforementioned story about these humble beginnings shows, if the veil of this Great Man myth is pierced, one often finds men that aren’t so great — or at the very least not worthy of the obscene wealth they’ve accumulated."}, {"type": "sentence", "content": "Make the case that Bezos doesn’t deserve his wealth, and you’ll get some combination of three arguments:"}, {"type": "subtitle", "content": "1. He took the risk"}, {"type": "sentence", "content": "Jeff Bezos took a big risk and he was rewarded accordingly, or so it’s said. But he didn’t. Not really."}, {"type": "sentence", "content": "Bezos got his start-up capital from 22 different friends and family, most of whom pitched in $50,000 each in exchange for a 1 percent share. They included associates from his brief career on Wall Street as well as various siblings and other relatives. His parents invested $250,000, which would be almost half a million dollars today."}, {"type": "sentence", "content": "It was Bezos’ initial investors who absorbed the most risk. The main risk he took was alienating his friends and relatives if he failed and lost all their money."}, {"type": "sentence", "content": "In the end, it paid off for everyone who bought a share on the cheap. His parents are multi-billionaires while his sister and brother are each pushing a billion. But the “risk” obviously paid off disproportionately for Bezos himself who now owns 14 percent."}, {"type": "sentence", "content": "To the extent that he was risking anything, what did he stand to lose? If his book business failed, he’d just go back to his cushy Wall Street job, where he’d earn a steady six figures and claw his way up to the C-suite eventually. Worst-case scenario: He’d only be worth tens of millions instead of a $150 billion."}, {"type": "sentence", "content": "Amazon workers risk so much more for so much less. They’re risking their lives right now so that Bezos can be the first trillionaire. Eight Amazon workers have died since the COVID-19 crisis began and outbreaks have been reported at multiple warehouses."}, {"type": "subtitle", "content": "2. He worked hard"}, {"type": "sentence", "content": "It’s probably true that Jeff Bezos worked hard — but so do most people. The average worker puts in 47 hours a week and nearly a third work 50 hours or more. They’re not all billionaires. In fact, almost two-thirds of Americans live a precarious existence, unable to afford even a small emergency."}, {"type": "sentence", "content": "Assuming you didn’t have bills, food or rent, you’d have to work 2.5 million years to accumulate Bezos’ net worth through ordinary labor at the median annual income of $59,000."}, {"type": "sentence", "content": "And while Bezos probably put in a lot of hours during the first decade of his company, he’s working progressively less as his net worth grows exponentially. He’s part of the leisure class now, flying private jets to give talks in Davos and dividing his time between his massive multimillion-dollar vacation properties."}, {"type": "sentence", "content": "Back in April 2018, he got roasted on Twitter after posting his vacation pics of a dog-sledding trip to Norway. As it so happens, that was around the time that 54-year-old Candice Dixon started work in a California Amazon warehouse. Two months later she had to quit because the breakneck pace of the company’s quota system caused devastating injuries to her back. Now she has chronic pain and is barely able to function."}, {"type": "sentence", "content": "Dixon was profiled in a piece in The Atlantic highlighting how Amazon’s pursuit of speed, efficiency and profit leads to greater workplace injuries — and in some cases, deaths. It detailed how the company maintains an Orwellian internal surveillance regime to track its workers’ movements at all times to micromanage every single aspect of the process."}, {"type": "sentence", "content": "In one fulfillment center in the United Kingdom, workers were forced to urinate into bottles because they couldn’t step a way for just a moment to take a bathroom break. In another, workers were required to continue working around the body of an employee who died on the job. Jeff Bezos can be out of the office for months at a time, and the whole operation keeps on chugging."}, {"type": "sentence", "content": "His fortune is built on hard work — just not his."}, {"type": "subtitle", "content": "3. He had the vision"}, {"type": "sentence", "content": "Jeff Bezos “had a vision.” Then he “took a risk” and “worked hard” to make it happen. That’s how the myth goes."}, {"type": "sentence", "content": "His vision was basically “What if we sold stuff on the Internet?”"}, {"type": "sentence", "content": "In the mid-Nineties, this was a pretty common idea floating around in the ether — especially on Wall Street, where Bezos had previously worked. There were a lot of people who had the same idea. Some of their ventures took off, like eBay, which was founded just a year after Amazon. However, most didn’t survive when the dotcom bubble burst."}, {"type": "sentence", "content": "Obviously, some subjective factors — strategies, management innovations, etc. — explain why Amazon succeeded where others failed. Bezos likely deserves some credit for those, but it’s hard to say how much or whether his wealth is proportional to his contribution to the company’s success."}, {"type": "sentence", "content": "Returning to the story about the packing tables — Bezos’ biographers and fans would probably try to spin that by saying that sometimes geniuses lack common sense. Maybe a guy can be an architect of a vast, highly complex logistical system and still be too much of an idiot to realize “Hey, what if we used tables?”"}, {"type": "sentence", "content": "What makes Amazon profitable — aside from the literal backbreaking labor of hundreds of thousands of employees — is its business model, and that didn’t spring fully formed out of Bezos’ bald head like Greek gods from the mind of Zeus. It’s the collective work of thousands of managers, executives, engineers and systems analysts, all of whom are as — if not more — talented and capable than Bezos."}, {"type": "sentence", "content": "And a lot of the innovations that make a company work better come from ordinary employees. According to Bezos, the idea for Prime came from a junior software engineer. It was then workshopped and implemented by various teams within the company."}, {"type": "sentence", "content": "Many of the more forward-thinking companies are tapping into this, which they refer to as EDI, or employee-driven innovation. Ricardo Semler, of Semco, built a successful enterprise in Brazil around democratic, participatory management."}, {"type": "sentence", "content": "So if it wasn’t the risk he took, his personal labor or his paradigm-shifting ideas that put all those zeroes on his net worth, then what was it?"}, {"type": "sentence", "content": "There’s also a tautological argument based on free market fundamentalism that goes like this: Bezos deserves what he has because he has it. He founded the company, so he deserves whatever the market rewarded him with, and it’s not up to the government or anyone else to decide how much wealth a person should have."}, {"type": "sentence", "content": "So let’s start with the basic premise that everyone is entitled to a fair share of the wealth that they create, including Bezos and Amazon workers. How is that decided? If the government is a poor instrument for determining what’s fair, then the absurd inequality that exists worldwide is proof the market is even worse."}, {"type": "sentence", "content": "Putting aside questions of justice, fairness or whether it’s moral for people to live in mansions while others live in slums — there’s also the matter of whether it’s rational and healthy for a society to distribute resources this way."}, {"type": "sentence", "content": "Unlike the libertarians who revere him today, Adam Smith, the father of modern economics, was deeply concerned with inequality and warned against the concentration of wealth into fewer and fewer hands. He considered the ultimate aim of capitalism to be “universal opulence.”"}, {"type": "sentence", "content": "In the Wealth of Nations, Smith wrote: “No society can surely be flourishing and happy, of which the greater part of the members are poor and miserable.”"}, {"type": "sentence", "content": "Today’s self-styled classical liberals — the kind of people who rush to the defense of Jeff Bezos and Elon Musk — are students of Ayn Rand not Adam Smith, whose policy prescriptions were more akin to those of a modern social democrat. Defining a wealthy society as one with low profits and high wages, Smith argued for a living wage equal to twice what it costs to support a family of four."}, {"type": "sentence", "content": "Smith denounced landlords as parasites who “love to reap where they never sowed, and demand a rent even for the natural produce of the earth.” He favored both inheritance taxes and progressive taxation, writing that the rich should be taxed “something more than in proportion” to their wealth."}, {"type": "sentence", "content": "He also recognized a fundamental asymmetry between capital and labor in terms of bargaining power, which drives down wages. Smith was likewise particularly far-sighted in his prediction of how the wealthy would corrupt democracy by pushing for laws that favored their own self-interest."}, {"type": "sentence", "content": "Though Amazon is regarded as a capitalist success story, it would be anathema to Adam Smith. It’s a huge industrial Leviathan barreling toward monopoly. Amazon aggressively fights against any efforts of its staff to organize while sacrificing workers’ well-being for the sake of profit."}, {"type": "sentence", "content": "Free market ideologues who regard themselves as Smith’s heirs focus almost exclusively on individuals, but he was concerned with the prosperity of entire societies."}, {"type": "sentence", "content": "It has to be recognized that the individual can’t be separated from the collective. Amazon’s high profits are inversely correlated with its workers’ low wages. Every dollar that it avoids paying in taxes is a dollar that can’t be spent on affordable housing and other social programs."}, {"type": "sentence", "content": "So the question of whether he deserves to be a trillionaire or a billionaire can’t be asked in isolation. The real question: Does he deserve to live luxuriously more than others deserve to live decently?"}, {"type": "sentence", "content": "The answer is no."}], "topic": "business"}