{"title": "Hurt So Good: Trauma’s Silver Lining", "data": [{"type": "image", "content": "https://miro.medium.com/max/11098/1*rXUi8r9x7bXWpj4EIQtQvA.jpeg"}, {"type": "sentence", "content": "Not everyone needs to know death to know life. Not everyone needs to know death at all. And yet, me and death are like this. *cue crossed fingers*"}, {"type": "sentence", "content": "I didn’t understand life for a long time. At first it was because of my careless caretakers. They didn’t have a handle on life, mine included. They gave me life in the most unintentional way possible: a three-day Scrabble game on cocaine. And if you subtract nine months from my birthday, plus the two days I put my mom through labor, you get Valentine’s Day. What’s more romantic than strategic word puzzles with a fuck buddy? Better yet: What’s more sexy?"}, {"type": "sentence", "content": "Like most people, I feared what I didn’t understand. Eh, more like judged with envy. Most kids at school radiated life, you know, that thing I didn’t understand. They were all smiles, getting along with everyone, going home to parents who might still be together or who at least provided the basic essentials. I hated those kids."}, {"type": "sentence", "content": "Life to me was survival. Life was death touching me. Death to my serenity, death to my dreams, death to my friendships, death to my voice. Being raised by someone with severe mental illness is death. Being the only one with a neurotypical brain in a household is death. Who you are doesn’t matter — hell, you don’t exist — when you’re never acknowledged. Your life, the spark of creativity and youthfulness inside, does not matter when it is shushed, ignored, and neglected. And so I went silent."}, {"type": "sentence", "content": "I feared what I didn’t understand, so I didn’t ask questions. I didn’t know that other families weren’t like mine. I thought life equated to money and beauty — the epitome of why the popular kids were popular. And behind closed doors, I figured their parents drank too much, slept all day, and made the kids share one can of Spaghettio’s for dinner. I didn’t know I was being abused and neglected because I didn’t ask."}, {"type": "sentence", "content": "My poor parenting began to reveal itself as the drugs set in — the cocaine, the Adderall, the off-brand uppers, marijuana, ‘shrooms, triples Cs, LSD, salvia . . . Since I already knew death so well, might as well bring drugs to the party. And, since misery loves company, I attracted other dead-headed folk. Together, we “lived” it up for ten years. Granted, it was a revolving “we,” because I consistently killed myself and my surroundings in my evolution to today."}, {"type": "sentence", "content": "The very magic that allowed me to access painful memories and realizations was what kept me from confronting and healing from them. I was one of those functioning alcoholics but my drug of choice was marijuana. All through high school and college I was stoned. In class, during exams, and probably walking to get my diploma and two degrees. If I hadn’t been, perhaps I’d be a 4.0 student, but I’ll settle with a cumulative 3.89 college GPA. Yeah, I hid my demons well and school was my sanctuary. Life could’ve been a lot worse for me if I wasn’t lucky to not get caught white-nosed and joint-handed."}, {"type": "sentence", "content": "My mind has always been an active one, a thoughtful one. Living so intimately with death has me obsessed with existentialism and the means to which it can be discovered: drugs, astrology, relationships — anything but church! In an attempt to ground myself during a high — I know, how naive — I’d journal. This is how the revelations of abuse and trauma came to be."}, {"type": "sentence", "content": "I have worked out most things on paper. This is mostly because people don’t want to talk about the hard stuff. I do have to give credit where it’s due, however. I’m looking at you Marilyn, my weekly therapist of two-and-a-half years."}, {"type": "sentence", "content": "In doing the hard work, I’ve come to discover a pattern of killing myself and beginning anew. In some ways this has become a defense mechanism: no one can get too close to me, I can abandon mistakes, and I can rewrite."}, {"type": "sentence", "content": "This has served me well until now. Each Tara that I was until today was an unhealthy one. She’d chase boys to fill the void left by her parents’ abandon. First alcoholics who bought drugs from her family — you know, a familiar face that fit right in with the toxicity I’d been raised with. Then guys who didn’t know their worth. A breakup signified a new Tara emerging, with a one to 24-month gap of heavy drug relapse in-between the next."}, {"type": "sentence", "content": "The next Tara was always better than the last. Sure, I’d literally grown up, but I’d also become more responsible, more self-aware, and more in-tune with my values. It was in establishing my value system that really set the ball in motion for health. I set boundaries. I knew my worth. I honored my passions and didn’t lose my chameleon self in my relationships anymore."}, {"type": "sentence", "content": "I wouldn’t be where I am today without my ten-year depression. And the five years I chain-smoked; first Parliaments (because cocaine) then Marlboro Lights — until they changed to Gold. The three years I spent single and slutty. The nine years I wasted on guys too gay (literally) or toxic or broken. The years I danced with death, 2007–2017."}, {"type": "sentence", "content": "I’m grateful for the bad choices I made. I’m also embarrassed, but mostly grateful. By being sweet to my inner child who was just looking for love and acceptance the wrong way, I hear her now and give her what she really needs. I don’t blame her for the promiscuity and the substance abuse; I blame her parents. But we know carrying that hate is a burden, too, so we best stop that shit."}, {"type": "sentence", "content": "Then again, if it hurts so good, what’s the harm?"}, {"type": "sentence", "content": "I am in the scariest part of my journey, the one in which I am supposedly healed and have to continue a linear path toward life. I’m still triggered by death, but it’s more external than internal. It’s others’ toxicity that says, “Hey, remember me? Would you like to go out sometime?”"}, {"type": "sentence", "content": "It’s tempting — death. I like it for the nostalgia and escape. But I’m not running anymore — neither toward my former selves nor from them. Instead, I’m setting down roots. I’m building a foundation. I’ve found my person, my husband, and am living my best life with him and our baby. Yes, we’ve created life! I know it well! I don’t want our daughter to intimately know death. But one day, when she’s old enough, she’ll read about how I’d come to know it and never forget it."}], "topic": "mental-health"}