{"title": "Traveling into My Shadows", "data": [{"type": "subtitle", "content": "And why it helped me see my light."}, {"type": "image", "content": "https://miro.medium.com/max/6144/1*8VZ7oYMY-TZcfvLDffFC4Q.jpeg"}, {"type": "sentence", "content": "My therapist told me I had to travel into my shadows."}, {"type": "sentence", "content": "My shadows?"}, {"type": "sentence", "content": "I had no idea what she was talking about."}, {"type": "sentence", "content": "What were these shadows? More specifically, what was my shadow? How could she be sure I had one? Where did it come from? Why should I look at it?"}, {"type": "sentence", "content": "The concept did not seem appealing at all."}, {"type": "subtitle", "content": "My Shadow Monster"}, {"type": "sentence", "content": "Still, as I thought about it, I could feel it lurking. It felt like a threatening, black monster with raised arms, claws extended, towering behind me; ready to strike."}, {"type": "sentence", "content": "Sometimes, the monster surfaced. Surfaced in yelling at my young child who was small and tired and not at his best. In those moments, I was not the happy radiant being I imagined myself to be. I handed myself over to the monster. Not that I noticed. The monster had a way of taking over so my normal senses stopped working. Sometimes I would realize later. Most of the time, I didn’t."}, {"type": "sentence", "content": "I came across a book called ‘The Shadow Effect’ by Debbie Ford, Deepak Chopra, and Marianne Williamson. Of course! What a “coincidence”. Shadow work had come up and shortly afterwards the book found me. I should have known by then."}, {"type": "sentence", "content": "The book stated that all of us have a shadow side. Light can only exist where there is darkness. Day can only exist where there is night. We only know and recognize the light by knowing and acknowledging the shadow. We need the opposites. Both sides of the coin. Where there is one, there is the other. So, within everyone both sides exist; the light and the dark. The beauty and the shadow."}, {"type": "sentence", "content": "But what exactly WAS the shadow?"}, {"type": "sentence", "content": "I thought of my monster. I did not want it in my life. I tried my best to push it away. To cover it with a white veil so no one would see it. I did not look its way. If I did not see it that meant it did not exist, right?"}, {"type": "sentence", "content": "Deepak Chopra, Debbie Ford, Marianne Williamson: The Shadow Effect, published by HarperOne, 1st edition, 2010 introduction, page 1:"}, {"type": "image", "content": "https://miro.medium.com/max/746/1*OlzlCFy4fNA56KRnn6vukA.jpeg"}, {"type": "subtitle", "content": "Climbing Down into the Shadows to Find Myself"}, {"type": "sentence", "content": "Dark thoughts. Unacceptable behavior."}, {"type": "sentence", "content": "I gulped."}, {"type": "sentence", "content": "Yelling at a young child most likely qualified as a shadow part. I admitted that."}, {"type": "sentence", "content": "So, there it was, my shadow."}, {"type": "sentence", "content": "Now that I acknowledged it, it seemed to grow in size. All of those situations where I behaved in a way I deemed unacceptable. All of my dark thoughts. There had to be millions of them. They felt heavy. It was hard not to collapse under this weight."}, {"type": "subtitle", "content": "Projecting My Shadows and Seeing My Shadows are Two Different Things"}, {"type": "sentence", "content": "I kept reading and stumbled upon the concept of projection."}, {"type": "sentence", "content": "What did that mean?"}, {"type": "sentence", "content": "I mulled this over. Eventually, it dawned on me."}, {"type": "sentence", "content": "Whatever I did not like in any other person, whatever I criticized in them, whenever I was pointing my finger, all of these were clear signs that I carried the exact same trait within ME, locked away in my shadow part."}, {"type": "sentence", "content": "Whenever I was judging someone else, I actually had to look at MYSELF."}, {"type": "sentence", "content": "What a strong concept!"}, {"type": "sentence", "content": "I had not heard of this and I was fascinated. I started observing my environment. Not only my own reactions, but also how other people interacted and what blames were going back and forth. More than once could I clearly see the patterns of the blame-game playing out where in fact, it was merely a projection."}, {"type": "sentence", "content": "This was also true for me, of course."}, {"type": "sentence", "content": "I noticed how I criticized our daughter for her low self-esteem and not speaking up! I knew what she had to change. She had to finally speak her truth. This issue had been sitting between us for many years!"}, {"type": "sentence", "content": "At last, it clicked. Yes, there it was: my OWN shadow. My own low self-esteem. My “not-speaking the truth”. I was shocked. I had not seen this before."}, {"type": "sentence", "content": "Another one came up; something else I criticized in my daughter. She tended to focus on one small flaw while the other 95% of her life were running beautifully."}, {"type": "sentence", "content": "I blushed when I finally managed to see that message."}, {"type": "sentence", "content": "I have to admit that these realizations did not just happen from one second to the next. It was a process. I compare it to a puzzle of many small pieces. You fit them into the picture, but you cannot see where it is going in the beginning. You get more pieces and put them in. Slowly, you can guess which might still be wrong! In the end, when enough pieces are in, the whole picture appears; the truth. If you want to see it, of course."}, {"type": "sentence", "content": "These times were not easy for me. I turned everything upside down. It was like taking a house apart and rebuilding it from scratch. I questioned everything. Do I need this? Why is this here? What is the purpose?"}, {"type": "sentence", "content": "The embarrassment when realization struck. Was this really me? Had this been my pattern all this time? HOW HORRIBLE! I saw those shadow parts, but that did not mean I liked them. Really, I didn’t. Shame kicked in."}, {"type": "image", "content": "https://miro.medium.com/max/6144/1*N6jK_Jr92efD8dFOlLJxhA.jpeg"}, {"type": "subtitle", "content": "Releasing my Shadow Monster"}, {"type": "sentence", "content": "I spent a lot of time crying. I cannot remember when it started, possibly during my meditations. There was so much grief and sadness washing over me. It was very strong. I let it go because I simply did not have the power to keep it inside any longer. I finally cried all the tears I had held back for years. Sometimes, I would sob for hours in a row. It did not feel nice. I shook. More and more tears streamed out. There was so much grief, I felt overwhelmed by it. I wailed, sobbed, all the time hoping no one would see me. I did not feel comfortable sharing this part of me, not even with my husband or my kids. I would wait until the house was empty before I sat down to do my daily crying. I would feel a bit better the day after. But there was still so much sadness and grief, I would most likely plunge into a new set of crying the next day. It was exhausting. I felt very tired and overwhelmed."}, {"type": "sentence", "content": "My therapist said it would not be an easy journey. I saw what she meant. But there was no going back. It was as if I had embarked on a ship towards a new destination and I had to stick with it. I had to ride it through. There was no way of getting off that ship any more."}, {"type": "sentence", "content": "I am still on that journey today."}, {"type": "sentence", "content": "So much has shifted in the last years."}, {"type": "sentence", "content": "At first, it felt as if I was losing myself."}, {"type": "sentence", "content": "Now, I understand that I have become more whole with every tear I shed and every bit of grief I let go. With every moment that I accept myself for who I am, I am giving my true self permission to surface."}, {"type": "sentence", "content": "I am no longer pushing away my shadow. I am holding it with love. It is still there, it still has power. But it is much smaller and I forgive myself for whatever it is bringing up. Sometimes that can take a few hours or even a day. Still, it is a part of me — one of my greatest teachers."}], "topic": "mental-health"}