{"title": "Why Major League Baseball Is the Bellwether for the U.S. Economy", "data": [{"type": "image", "content": "https://miro.medium.com/max/2180/1*k6bozwCYQ45ECVAO45M3dg.jpeg"}, {"type": "sentence", "content": "I am a diehard Los Angeles Dodgers fan and quantitative asset management professional (“quant”, if you think of me as a soulless, purely statistical creature), so my interest in connecting baseball and the economy is only natural. Well, natural if I am 37 days into a quarantine. Despite my professional training, the distinctiveness of the current situation does not lend itself to the type of pure statistical analysis and inference in which I am trained. Instead, I am looking more and more to high level data, back-of-the-envelope calculations, intuition, and historical precedent to help understand the current environment. This approach is consistent with what I have learned professionally through this crisis: during unprecedented events one must accept that all models come with greater uncertainty and context can help us understand their conclusions."}, {"type": "sentence", "content": "Statistical models are of course still valuable when used appropriately. For example, there are plenty of data and historical precedents available for me to comfortably conclude that the US and global economies have entered a recession. I do not, however, have troves of data that can help me accurately predict when and how much economies recover when the worst pandemic since the Spanish Flu is pitted against the single largest coordinated fiscal and monetary response since the Great Depression."}, {"type": "sentence", "content": "One approach I use to contextualize my understanding of large scale data is exploration of high influence observations. In statistics, an influential observation is “one whose deletion from the dataset would notably change the result of the calculation.”¹ Some would logically suggest that Microsoft, the largest US company by market cap, or Walmart, the largest US company by revenue, would be good influential observations to choose. Others may advocate that plummeting global energy markets may teach us the most. However, as I sit here today, I believe that how MLB solves the quandary of when and how to play its 2020 season may well be the single most important observation to understanding the state of our economy and the stage of its recovery. I believe MLB will solve this problem; but, it won’t be seamless, it won’t be the same, and it’s very possible it all goes sideways for baseball and the economy."}, {"type": "sentence", "content": "To make the baseball of relevance to our discussion, we first have to understand the economics, so let’s start there. For those of you who are tired of talking about economics, cruise down to the section entitled “All this Uncertainty Is Especially Plentiful in Major League Baseball.”"}, {"type": "subtitle", "content": "Financial Markets Indicate that the Future Economic Situation is Wildly Uncertain"}, {"type": "sentence", "content": "My clearest conviction about our future economic prospects is that they are dramatically more uncertain than they were prior to COVID-19. We have many ways to measure uncertainty, but perhaps the cleanest metric I am aware of is the volatility index, or ‘the VIX’ as it is commonly referred to in finance. Technically, the VIX measures our expectations of the magnitude of future price movements of the S&P 500 over the next month. For purposes of this article, I am thinking about the question it helps me answer: how much uncertainty is involved in forecasting the stock market’s future price? Higher index values reflect higher expectations of uncertainty about the future price of the S&P 500, which is a decent proxy for the economy as a whole.²"}, {"type": "sentence", "content": "Understanding the uncertainty that the VIX conveys is critical to understanding when the economy will recover. This is due to the stylized fact that we tend to become more certain about our ability to forecast the future before economic activity begins to rebound. That is to say that the VIX tends to be a negatively correlated leading indicator of the S&P 500 and the economy."}, {"type": "image", "content": "https://miro.medium.com/max/4342/1*ocNnPLDoP22Oya9TfXhQvQ.jpeg"}, {"type": "sentence", "content": "As Chart 1 shows, COVID-19 has completely changed our worldview with respect to this question. Prior to late February, we were remarkably certain about future asset prices, and have since become historically uncertain. In fact, according to the VIX, at the market close on March 16th we were more uncertain about the stock market’s future than we were at any market close since its creation in 1993. The VIX has declined substantially from its March 16th peak of 82, but remains in the 30s."}, {"type": "sentence", "content": "In Chart 2, reflecting the VIX since 1990, we see that VIX reached 35 at the close on just 333 previous days or 4.4% of days over the last 27 years. One hundred and fifty of those 333 closing values were registered in the wake of the global financial crisis of 2008–2009. We remain very uncertain about the future."}, {"type": "image", "content": "https://miro.medium.com/max/4334/1*UqcWdp8U4SUxbaosSwaWGA.jpeg"}, {"type": "subtitle", "content": "Financial Market Uncertainty Extends to Individual Businesses"}, {"type": "sentence", "content": "In order to better understand why increased certainty in our financial system tends to lead an economic recovery, one can think about business managers in such an environment. If the financial system is uncertain about our future prospects, business managers likely will be as well."}, {"type": "sentence", "content": "If the business managers are uncertain, it is difficult for them to forecast demand, which makes it difficult to appropriately staff their businesses to meet that demand. The worst course of action for the business managers would be to overestimate demand, staff their businesses assuming that demand will materialize, and then have no one to sell their product to. If they do that, they lose money, and will very quickly be in danger of insolvency. So, because they prefer the safety of solvency to forecasting uncertain demand, they lay people off."}, {"type": "sentence", "content": "While most people are aware that jobless claims over the last five weeks are unprecedented, I feel strongly that neither the financial community nor the average person really appreciates the magnitude of these lost jobs. The numbers are so large that it is difficult to understand what they mean. Just spend some time with Chart 3, which reflects weekly new US initial jobless claims, seasonally adjusted, since the late 1960s."}, {"type": "sentence", "content": "If I cut the last two months of data off the chart, my software automatically changes the maximum value on the y-axis from 7,000,000 to 700,000, reflecting the previous all-time high of 695,000 claims in October 1982 (Chart 4). The number released on March 27th was 6.86 million."}, {"type": "image", "content": "https://miro.medium.com/max/4000/1*mx5aI-eqmrie7EhV6Ne3CA.jpeg"}, {"type": "sentence", "content": "Let’s zoom into the last twelve months to get a bit deeper into the numbers in Chart 5."}, {"type": "image", "content": "https://miro.medium.com/max/4014/1*2dWCZ1i9cujPKDkS02wlKQ.jpeg"}, {"type": "sentence", "content": "That’s five consecutive weeks in which the number of newly unemployed Americans is more than five times the record over the previous 53 years. The cumulative number of seasonally adjusted claims over the last five weeks is 26.5 million, more than all unemployment claims filed over the prior 120 weeks, combined. While much has been made of the payroll protection program (PPP) loans to small businesses, the jobless claims tell us that those loans might be mitigating the situation, but there is not enough money going around to prevent layoffs. That much is certain."}, {"type": "sentence", "content": "What’s uncertain is when and if the business managers will rehire these workers. I say “if” because of the magnitude of the above numbers. This level of layoffs is indicative of businesses completely shuttering their operations. However, because virtually all businesses have non-operating fixed expenses that they must pay regardless of output, some businesses will be forced to close permanently."}, {"type": "sentence", "content": "To that end, the National Restaurant Association’s March survey suggests that some 30,000 restaurants permanently closed in March, and another 110,000 intend to do the same prior to the end of April. Thus, the newly unemployed worker is now uncertain whether there will be a job to come back to post-lockdown. In turn, they will likely spend relatively less. In the extreme case, this could lead to a deflationary spiral that even the world’s largest stimulus package can’t compete with."}, {"type": "sentence", "content": "The business managers will take this into account and attempt to figure out when to rehire, buy raw materials, and attempt to scale up future output. However, since the environment is so uncertain, their best course of action is to wait. This helps ensure solvency and maintain flexibility until they can operate profitably. In a nutshell, this is why decreasing uncertainty is a leading indicator of an economic recovery."}, {"type": "subtitle", "content": "All this Uncertainty Is Especially Plentiful in Major League Baseball"}, {"type": "sentence", "content": "In order to understand the broader problem, I aim to explore a business which has become more uncertain specifically because of the COVID-19 outbreak and response. Such a business should be:"}, {"type": "sentence", "content": "There are plenty of businesses which fall into one camp or the other, but few that fall into both. For example, travel focused business models such as hotels, airlines, and cruises are heavily impacted by social distancing guidelines and mass gathering restrictions. However, demand for those businesses, has plummeted and is anything but rapidly evolving. To that end, CNN reported on United Airlines CEO Oscar Muñoz’s letter to its employees, noting that, “travel demand is essentially zero and shows no sign of improving in the near-term.” On the other end of the spectrum, Netflix reported that it added a record 15.8 million subscribers over the first quarter, and is uncertain whether those subscriber additions are temporary or permanent. The additions are themselves a function of the company’s means of content delivery and its subscribers’ ability to consume the product while complying with public health restrictions.³ Each of the aforementioned businesses reflect high influence observations with respect to understanding, ex-post, how the pandemic has changed our lives. On the other hand, they each lack one of the two critical elements driving this environment’s uncertainty. Therefore, they do not contain significant information content with respect to understanding how we solve the uncertainty of our situation going forward."}, {"type": "sentence", "content": "MLB, on the other hand, satisfies both conditions.⁴"}, {"type": "sentence", "content": "Attending a sporting event is likely the single worst activity one could engage in if trying to reduce the R0 or “flatten the curve” of a highly infectious disease. The most effective measures we currently have to prevent the spread of COVID-19, social distancing and mass gathering restrictions, explicitly prevent the typical in-person patron experience we have come to enjoy at a baseball game. This portion of MLB’s business model is under siege. To date, the public health response has made it globally impracticable to supply sports to live patrons (and via television for that matter).⁵ Making things worse, because MLB plays games in multiple countries,⁶ states, and cities — all of which have different, rapidly evolving guidelines — it is not clear if MLB will be able to return to the markets in which it has traditionally supplied live fan experiences."}, {"type": "sentence", "content": "The demand side of the equation is equally uncertain. Even if MLB were legally able to supply an in-person live sports experience, would people go? How many Americans would be willing to personally encounter hundreds or even thousands of people in close quarters, all of whom have some unknown probability of passing them COVID-19? I, for one, would prefer a television experience right now."}, {"type": "sentence", "content": "Meanwhile, sports fans are starving for live sports content in an unprecedented fashion. Last Sunday, ESPN aired the first two episodes of its 10 part Michael Jordan documentary series. It averaged 6.1 million viewers for the first two episodes. By contrast, last year’s NBA Finals Game 1, one of the biggest live sporting events of the year, pulled in just about twice that many viewers."}, {"type": "sentence", "content": "If that statistic doesn’t convince you that demand for sports content is changing, perhaps my personal anecdote will. I consume about as much sports content as anyone, which makes April one of my favorite times of year. Between The Masters, the start of baseball season, the end of the NCAA basketball tournament and the stretch run of the NBA and NHL regular seasons, I estimate that I watch somewhere between 40–60 glorious hours of sports programming in a normal April. (My fiancé might say I have a problem, acknowledged, but not the point here.) In a moment of weakness over Easter weekend, I found myself watching a replay of last year’s The Masters final round — you shouldn’t find that surprising. What you might find surprising is that those two hours of re-run golf consumption represent the entirety of the sports content I’ve watched this month. While Tiger’s victory will always be an awesome moment, for me, sports must be live to be interesting. David Carter, a professor of Sports Business at the USC Marshall School of Business, summed up my experience:"}, {"type": "sentence", "content": "For these reasons, it is my belief that MLB reflects the type of high uncertainty business that helps provide context for the prospects of an economic recovery."}, {"type": "subtitle", "content": "MLB isn’t the only sport affected by COVID-19, but it has the most to lose."}, {"type": "sentence", "content": "In order for a future price or value to be uncertain, there must be a significant probability of downside. If there is no downside, then prices can only be flat or move upwards, thus limiting the range of possibilities and decreasing uncertainty. MLB’s range of outcomes include some very large downside scenarios relative to other sports."}, {"type": "sentence", "content": "As a result of unfortunate timing, MLB has played exactly zero games this season. Until they start playing, we have to seriously consider the possibility that the league may play zero games and at least conduct the theoretical exercise of MLB earning zero revenue during 2020.⁷ On paper, such a scenario would mean large haircuts of MLB’s team valuations."}, {"type": "sentence", "content": "According to Forbes annual team valuation study, the sum of MLB’s 30 teams’ total values was approximately $55.5 billion as of February. Given $10.7 billion in 2019 sales, MLB teams were collectively valued at 5.2x their trailing twelve month sales in the pre-COVID-19 world. If we assume that MLB earns no revenue in a season that it plays no games, its owners would then expect that, assuming no changes to the price-to-sales multiple, their teams would be worth a maximum of 20%, or $11B in aggregate, less than they were in the pre-COVID-19 world. But even that haircut underestimates the best case if MLB were to play zero games. Such a calculation also implies that MLB will earn all of the post-2020 revenue that it was projected to earn pre-COVID-19, and that those post-2020 revenues can be discounted back to present value at a rate of 0%. The implication of that assumption is that MLBs post-2020 revenues carry no risk; they’re 100% certain. If you’ve read this far, we’re on the same page that such an idea is misguided."}, {"type": "sentence", "content": "Fortunately, thanks to public markets, we have better tools than back-of-the-envelope calculations to figure out just how uncertain those future revenues might be. While 28 of MLB’s 30 teams are privately held, the Atlanta Braves are owned by the Liberty Media Corporation and the Toronto Blue Jays are owned by Rodgers Communications. It would be difficult to back out the value of the Toronto Blue Jays from the rest of Rodgers Communications, but the Liberty Media Corporation has done us a favor by setting up a tracking stock, BATRK, which aims to track the equity valuation of the Atlanta Braves."}, {"type": "image", "content": "https://miro.medium.com/max/4354/1*EnmndGTQU6yUJbIwrhOLNw.jpeg"}, {"type": "sentence", "content": "Based on BATRK’s performance vs. the S&P 500’s over the last two-plus months (Chart 6), we can conclude that public market investors agree that MLB teams find themselves in a precarious position. Future revenues do not appear to be anywhere close to risk-free or certain."}, {"type": "sentence", "content": "The public markets also offer us a window into how at-risk baseball is relative to a few pure-play sports stocks. In particular, we can compare BATRK’s performance to three of Europe’s soccer powerhouses: English side Manchester United (MANU), German side Borussia Dortmund (BVB), and Italian side Juventus (JUVE). As shown in the Chart 7, equity markets are quite a bit more bullish about the three European soccer teams’ prospects than the Braves’."}, {"type": "image", "content": "https://miro.medium.com/max/4240/1*7ThgILt-2VYxJcb4uGWeXA.jpeg"}, {"type": "sentence", "content": "BATRK’s underperformance of these teams likely reflects some combination of unfortunate timing and the Braves’ relative overreliance on game revenues. At the time lockdown measures began, the European soccer teams seasons were about two-thirds complete. The Braves still haven’t thrown a pitch this year. According to Forbes, MLB generated roughly 40% of its $10.7 billion in 2019 revenues from the patron experience through channels including tickets, concessions, and team owned stores. Though the Braves don’t break out these revenue streams separately, it is safe to assume that they earn a similar portion of their revenues from in-person patronage. On the other hand, Manchester United earns 20% of revenues from matchday, while BVB and Juventus reported that tickets accounted for just 10–15% of their most recent year’s revenue.⁸"}, {"type": "sentence", "content": "Broadly speaking, the differences between the Braves and European soccer teams also apply when comparing MLB teams with teams in other major North American sports."}, {"type": "sentence", "content": "The National Football League (NFL) doesn’t start until September and played all of its 2019–2020 season. At the time the National Basketball Association (NBA) and National Hockey League (NHL) suspended their respective 2019–2020 seasons, they were more than two-thirds complete."}, {"type": "sentence", "content": "MLB is also earning comparatively more from in-person patronage than their major North American professional sports counterparts. It is important to remember that the MLB season is a marathon. Each of MLB’s 30 teams play a 162 game regular season across just over 200 days. On the other hand, each NFL team plays 16 regular season games; NBA and NHL teams each play 82. Sum it all up and, each season, MLB hosts over 1,000 more games than the next closest major American sports league. As a result, MLB relies much more upon fans showing up and spending money than these leagues."}, {"type": "sentence", "content": "Furthermore, MLB, unlike the other leagues, does not have the option to push the season later on the calendar. Good weather is a requirement for MLB games, and the marathon schedule requires that its athletes have an extended recuperation period prior to the subsequent season. Meanwhile, the NBA and NHL play inside and typically have off days between games. As a result, these leagues could feasibly reschedule some of the missed games if public health conditions allow. Similarly, there is very little preventing the NFL from starting its 2020–21 season a few weeks or even months later if COVID-19 necessitated such a scheduling change."}, {"type": "sentence", "content": "Thus, MLB’s future prospects are highly uncertain relative to other sports."}, {"type": "subtitle", "content": "MLB Supports More than Its Owners and Players"}, {"type": "sentence", "content": "Yes, MLB owners make (and stand to lose) a boatload of money by producing baseball games. So do its players, who earn about 50% of baseball revenues. MLB revenues also pay for a large number of other employees and independent contractors including front offices, PR, marketing, scouting, minor league players, business operations, concessionaires, groundskeepers and more. MLB play also enables thousands of jobs via its media and apparel partnerships. These include full television production staffs, on-air talent, writers of newspapers and other online content, and retail sales associates."}, {"type": "sentence", "content": "The jobs MLB directly creates do not paint a complete picture of the sport’s job creating power. Because each baseball team is on the road for half of its 162 games per year, it supports a significant number of service industries. A baseball team will typically travel with around 50 employees including players. According to one estimate that means each of the 30 teams is paying for at least 25,000 miles of chartered flights, 35 or so hotel rooms for 75–85 nights a year, and ground transportation for 50…not to mention the $100 per diem each player and coach is entitled to spend for each night on the road. Each team also employs 10–25 scouts who are also on the road spending money for up to 200 days per year."}, {"type": "sentence", "content": "That’s before we even consider the fans."}, {"type": "sentence", "content": "When someone attends a sporting event, they usually spend money on other activities in addition to their tickets. This is particularly relevant to baseball because, as I keep coming back to, baseball teams play a lot of games. As a result, the fans support jobs in the communities surrounding ballparks. A 2017 study commissioned to estimate the economic impact of building a new stadium for the Oakland Athletics estimated that for every one dollar a fan spends on a ticket, he or she spends another dollar in the community that they wouldn’t otherwise spend. Fans are likely to park in local lots, many of which aren’t owned by the teams. They might stop for dinner at a nearby restaurant, have a couple of drinks at a local bar, or come home with something from a store in the area. In addition to the jobs, this commerce attracts businesses and supports real estate prices in the vicinity of the stadiums."}, {"type": "sentence", "content": "Perhaps there is no better example of baseball induced economic activity than Chicago’s Wrigleyville neighborhood outside of the Cubs’ historic Wrigley Field home. This area is chock full of bars and restaurants, most of which are filled to the brim 81+ times per year on game days. Here’s a video of Wrigleyville on what would have been opening day; that looks like a lot of lost commerce, jobs, and tax revenues."}, {"type": "sentence", "content": "To be clear, I am not suggesting that baseball or other sports are driving $15 trillion in annual US consumption spending. I am merely pointing out that, at its core, the US is a service based economy and the lack of consumption surrounding baseball is indicative of the dearth of event-driven American consumption currently occurring. At the very least — and with the best intentions — we are currently canceling mass gatherings including sports, concerts, movies, live performances, conferences, exhibitions, festivals, weddings, rallies, protests, and charitable events in an effort to stop the spread of COVID-19. Our uncertainty about when, how, and the degree to which this consumption will return is key to understanding our economic recovery."}, {"type": "subtitle", "content": "How Do Baseball and the Economy Move Forward?"}, {"type": "sentence", "content": "Baseball, like the rest of the US economy, needs to solve its uncertainty problem. Given the calendar crunch baseball is up against, it needs to do so quickly while demonstrating agility and adaptability. To that extent, baseball is saying all the right things. One MLB employee I spoke with said “everything is on the table, we’ll do anything to play — it just has to be safe.”"}, {"type": "sentence", "content": "With this in mind, at a 30,000 foot level, I believe there are four possible outcomes of varying likeliness for MLB:"}, {"type": "sentence", "content": "The Bull Case — 1%: MLB restarts Spring Training in late May or early June under restricted conditions. It is ultimately able to play a non-zero number of games in front of capacity crowds in 2020. The economy experiences a “V-shaped” rebound."}, {"type": "sentence", "content": "Base Case — 60%: MLB restarts Spring Training in May or June and completes an abbreviated 2020 season in a single geographic area, likely in MLB’s Arizona Spring Training homes. Games are played without fans present, but are widely telecast. The economy experiences a longer-term “U-shaped” recovery."}, {"type": "sentence", "content": "Bear Case — 35%: MLB starts but is ultimately forced to abandon its effort to play the 2020 season. The economy has an elongated, choppy, perhaps “W-shaped” path forward."}, {"type": "sentence", "content": "Worst Case — 5%: The 2020 MLB season is outright cancelled, and 2021 remains up in the air. The economy spirals into a deep recession or depression from which it takes years to recover."}, {"type": "subtitle", "content": "MLB’s “V-Shaped” Bull Case"}, {"type": "sentence", "content": "I want to be optimistic, so let’s start with the bull case. Notice that the bull case isn’t MLB plays a mostly normal season — that is off the table. Instead, the bull case reflects MLB playing even one game in front of a sold out crowd in 2020."}, {"type": "sentence", "content": "This scenario fundamentally requires two things: social distancing guidelines are dropped, and large gatherings are permissible in each of the 30 teams’ home cities. If there is a sellout, fans are sitting shoulder-to-shoulder with other fans, by definition, massively gathering and not social distancing. You can’t do that if either restriction remains in place, hard stop. But what would be required to drop these restrictions? There are two possibilities."}, {"type": "sentence", "content": "In the first scenario, we have found a vaccine for SARS-CoV-2. That vaccine is FDA approved, and it is manufactured, distributed, and widely adopted by the American public. While nothing is out of the question when something threatens our way of life, one cannot overstate the unlikeliness of this happening before the end of October. For starters, the average time from drug discovery to market is 10 years. For historical context, the record timeline to produce a vaccine was four years for mumps in the 1950s. Even if all of this happens in record time, it won’t happen before the baseball season is over."}, {"type": "sentence", "content": "Alternatively, perhaps there is a vaccine-free way. Some combination of four things is necessary:"}, {"type": "sentence", "content": "There are various estimates of the number of tests required to re-open the economy. These estimates start at around “a minimum of 500,000 per day,” and max out around 35 million. The “Roadmap to Pandemic Resistance” report compiled by the COVID-19 Blue Ribbon Panel, suggested it would require 20 million tests per day. I don’t know which is correct, but my fiancé (an MD with a Masters Degree in Public Health) says it’s somewhere in the millions, and it’s really not worth it for me to argue with her. As of writing, the Blue Ribbon Panel’s estimate of need is roughly 4 times more than the US has completed in total thus far."}, {"type": "sentence", "content": "On the contact tracing front, the Apple-Google solution is the most promising lead I’ve seen, but it is just a well formed concept in beta testing today. We have no idea how well it would work, if people would be willing to submit to their health data being collected, or what the enforcement mechanism would be to ensure that a person self-isolated when appropriate."}, {"type": "sentence", "content": "If that’s not enough, we’ll also need to learn that the infection fatality rate (IFR) is nowhere close to the observed case fatality rate (CFR). The difference between those two metrics is important. The numerator is the same: total known deaths attributed to COVID-19. The denominators, however, differ. The CFR’s denominator is the number of people who have tested positive for COVID-19. The IFR’s denominator is the number of people who, at any given time, test positive for COVID-19 or IgG antibodies. That second group of people contracted the virus and either never showed symptoms or recovered from its effects."}, {"type": "sentence", "content": "The CFR currently sits at an astronomical 5.7% in the US. However, the recent Stanford / Santa Clara study gives us hope that this metric could dramatically overstate the death rate attributed to contracting COVID-19. That study concludes that the IFR might be as low as 0.12%-0.2%, not dissimilar to the seasonal flu. However, a similar study completed in New York State extrapolated that the IFR is around 0.5%. While this number is an order of magnitude lower than the CFR, it is almost certainly too high to allow us operate freely and/or mass gather."}, {"type": "sentence", "content": "The last piece is an effective treatment or prophylaxis. If we had this, people would be much less afraid of contracting the virus and the IFR would plummet. Thus far, we have seen various ideas, but none of those ideas have passed the smell test. First there was the hydroxychloroquine and azithromycin treatment plan. On April 21st, the NIH recommended against this drug combination therapy. Then there was hope for Gilead’s remdesivir. Clinical trial data again showed no benefit to this approach. Bill Gates thinks we need something that is 95% effective for people to feel safe in public gatehrings. I have hope that something will work, but there’s nothing yet."}, {"type": "sentence", "content": "Let’s just say this scenario does play out. As a country, we have solved the uncertainty problem. This is the so-called “V-shaped” recovery. We are either on the path to eradicating the disease, or, we understand it, can manage its spread, and have reached an IFR low enough to tolerate fully opening our economy. The US economy is on the path to recovery and the stock market is almost certainly within 10% of the peak, which it will likely retake by the middle of 2021 if it has not already. After all, there was nothing inherently toxic about the US economy prior to COVID-19, its just that our economy isn’t built for a world in which social distancing is required and mass gatherings are prohibited."}, {"type": "sentence", "content": "I hope I am wrong, but if I am being honest with myself, a lot of things have to go right for this scenario to play out. Truthfully, as I write this, we are not close to most of them. Thus, based on nothing more than my desire to allow for the possibility of the bull case, I assign a 1% probability that an MLB game will be played in front of a sell-out crowd in an MLB Stadium this year."}, {"type": "subtitle", "content": "MLB’s “U-Shaped” Base Case"}, {"type": "sentence", "content": "As mentioned, MLB is currently formulating and evaluating all kinds of plans that would #LetTheKidsPlay in 2020. For purposes of my analysis, the base case includes any scenario in which MLB finishes its season, but is playing in front of less than capacity crowds. While those plans exist on a continuum of normalcy, I’ll dig into the plan for which I have the most hope — it calls for a somewhat reduced, but significant, number of games to be played in the teams’ Spring Training facilities and surrounding fields in Arizona. Fans do not attend these games, but they are widely broadcasted over several types of media. If things go really well, MLB teams could move back into their ballparks at some point later in the summer."}, {"type": "sentence", "content": "The conditions enabling this scenario to play out include:"}, {"type": "sentence", "content": "Mass gathering restrictions, however, have not been lifted."}, {"type": "sentence", "content": "From a health policy perspective, it seems possible, if not plausible. The University of Washington IHME COVID-19 forecast for Arizona states that, “after June 8, relaxing social distancing may be possible with containment strategies that include testing, contact tracing, isolation and limiting gathering size.” Furthermore, in areas like Arizona that aren’t as hard hit by the virus, it seems feasible to maintain a relatively COVID-19 free environment."}, {"type": "sentence", "content": "If health policy officials endorse the plan, it seems likely that local governments and the Arizona state government would do the same. After all, if this works, it looks great for politicians who help MLB pull this off and it brings significant commerce and tax revenues along with it. This is also likely to be successful because of the limited number of governments with which MLB has to work. If MLB were trying to play in its home stadiums in 2020, such a plan would likely require sign-off from two federal governments,⁹ 18 state or provincial governments, and 28 local governments including the District of Columbia. The Arizona plan is a much simpler coordination problem."}, {"type": "sentence", "content": "This plan would initially require the league and its players union, the MLBPA, to agree upon a number of conditions to exist that were fundamentally alien to us as Americans prior to the spread of COVID-19:"}, {"type": "sentence", "content": "As crazy as it sounds, I believe this plan is possible because all the stakeholders involved want to make it work. Where there’s a will, there’s a way. Probably the most underrated incentive is that the players love playing the game. They’ve played it all their lives, and they’ve reached the pinnacle of success in their careers; they don’t want to give that up if they can avoid it."}, {"type": "sentence", "content": "Outside of the love of the game, the financial incentives are aligned. For owners and players, this plan represents the most streamlined path to earning at least some money playing baseball in 2020. Fans, of course, get to watch the live sports they crave; a live content respite from coronavirus task force updates. While the in-person revenue stream and the economic activities induced by the games would be eliminated, you can imagine a world in which television ratings might be the highest in the sport’s history. This could result in increased future interest — and ultimately, future revenue — in baseball."}, {"type": "sentence", "content": "Finally, the nation has something to rally around. The morale-boosting effects of bringing baseball back would be immeasurable. Many of us are concerned about what the future might bring from both health and economic perspectives, and MLB’s return would give me, and many others hope. This isn’t a unique idea, it’s essentially the plot of A League of Their Own, a fictionalized account of the real-life All American Girls Professional Baseball League that was formed during World War II."}, {"type": "sentence", "content": "Based on where we are today, I assign a 60% probability to the base case outcome."}, {"type": "sentence", "content": "We completed the baseball season. That is a big deal. MLB has figured out how to reengage in large scale economic activity despite the presence of the virus. They didn’t have to abandon the effort and shut it all down. It’s not a homerun — MLB didn’t get the typical revenues they earn from the patrons nor did nationwide economic activity associated with a typical MLB season materialize. However, MLB did stimulate Arizona’s economy significantly. It has also significantly increased its brand value by widely disseminating its product on TV, radio, and other internet platforms, which new and existing fans are consuming at unprecedented rates. The uptick in fans could lead to MLB’s 2021 season being its best ever."}, {"type": "sentence", "content": "As for the US economy, we have not solved the uncertainty problem by the end of October, but we have dramatically reduced it. MLB is not playing in front of capacity crowds, so the US economy is not fully open. We are still trying to figure out how and when to do so, but there is a lot of optimism. Many companies are taking MLB’s lead and demonstrating the agility and adaptability required to operate in this environment."}, {"type": "sentence", "content": "This would be akin to a “U-shaped” recovery, or maybe something that looks more along the lines of the Verizon logo — albeit drawn by a toddler who hasn’t figured out straight lines yet. This scenario likely means that the economy is, at most, operating at a run-rate of less than 2019 GDP. However, it is not contracting further. We remain in a recession, but there are signs of rebounding and a depression isn’t likely. We’ve adapted to our new environment and this has reduced uncertainty enough that the market’s bottom has passed."}, {"type": "subtitle", "content": "MLB’s “W-Shaped” Bear Case"}, {"type": "sentence", "content": "MLB started, but it couldn’t finish the season. That is a very bad omen. On the bright side, it started. That means something."}, {"type": "sentence", "content": "There was some point at which public health advisors and governments agreed it was safe and worthwhile to play. Because MLB cares about its reputation and wants to make sure it doesn’t ruin its ability to generate revenue in subsequent seasons, it is confident that the public thinks it is appropriate for MLB to come back and play."}, {"type": "sentence", "content": "The players and the league came to an agreement regarding the manner in which they were going to play. They are on the same page regarding the risks and have created an environment in which all parties involved agree that the risks are worth the rewards. By agreeing, they have solved some of their uncertainty."}, {"type": "sentence", "content": "However, at some point between late May and October, MLB was forced to give up. There are a number of ways in which this could occur, but all of them start with the inability to operate within the confines of a pandemic. In all of these scenarios, the virus is winning the war. It probably reemerged because of complacency and overconfidence. We have seen this play out in Asia when China re-opened and subsequently closed movie theaters and Singapore experienced a second wave."}, {"type": "sentence", "content": "Most likely, one of three things has occurred:"}, {"type": "sentence", "content": "The parties no longer see eye-to-eye about the conditions under which they are playing, probably because one party insists on maintaining an elevated level of precaution while the other wants to expand its horizons. Perhaps, for example, infections and deaths are generally subdued across the country, but MLB continues to insist upon quarantining its players, ultimately leading the players to strike. On the other side of the coin, perhaps the virus situation is improving and MLB is told it can play with limited fans in its home stadiums. MLB decides to try this plan and the players refuse, again resulting in a labor stoppage."}, {"type": "sentence", "content": "I assign a 35% collective probability to one of these scenarios occurring. By doing so, I am saying that the base case is a little less than twice as likely as the bear case. I think such a probability is reasonable because I believe that MLB aims to operate under an abundance of caution and the season will only start if MLB is confident that it can finish."}, {"type": "sentence", "content": "If the bear case plays out, we remain uncertain about how to operate under our current circumstances. Whether the uncertainty is a function of COVID-19 flare ups, the larger public health landscape, or widespread discord between management and labor, we had progress, and that progress hit a wall. Each of these scenarios represent a choppy economic recovery with material downside for the market, which currently appears to be pricing a smooth recovery. It’s pretty scary stuff. Perhaps this looks like the W-shaped recovery described in the Washington Post."}, {"type": "sentence", "content": "We are uncertain if we’ve hit bottom, the recession remains in effect, and there’s a real probability that a recession will turn into a depression."}, {"type": "subtitle", "content": "MLB’s “Downward Spiral” Worst Case"}, {"type": "sentence", "content": "At long last, there’s the 5% I’d rather not explore."}, {"type": "sentence", "content": "MLB was never able to get on the field. Not here in LA, not in Arizona, not in Florida, nowhere. We never saw Mookie Betts play for the Dodgers in 2020. My only baseball memory from 2020 is that the Astros are cheaters."}, {"type": "sentence", "content": "From a less fan-centric approach, this is really, really scary. All of the scenarios that created the stoppage in the bear case are applicable to the worst case, but there was never any point at which MLB had things under enough control to begin."}, {"type": "sentence", "content": "Perhaps this occurs because government entities are not willing to allow all the activities that are required for an MLB season. Maybe the disease turns more deadly and there’s nothing we can do except quarantine ourselves until a vaccine is available (although I’d hope we can at least get to the Sweden plan). Maybe there aren’t enough tests available to justify MLB using those resources until late September. Maybe the players just aren’t willing to uproot their lives to go play in Arizona for a few months. MLB has lost a massive opportunity to grow its fan base; it shrunk instead. Suddenly, 2021 looks worse than 2020 for the league."}, {"type": "sentence", "content": "Whatever the reason, uncertainty reigns supreme. We have little, if any, additional certainty in October relative to what we have today. We don’t have a vaccine. We don’t have the means to go back to our lives in the absence of a vaccine. Hundreds of thousands of businesses have gone bankrupt and millions of Americans remain unemployed. COVID-19 remains the leading cause of death in the US. US GDP didn’t pick up in the third quarter, even relative to the depressed levels experienced in the second quarter. The VIX remains around 40, and the stock market is unquestionably lower than it is today. Things are bad, people think they are going to get worse."}, {"type": "sentence", "content": "This might be the scenario Mark Cuban was describing when he said, “It’s going to be brutal. There’s no way to sugarcoat it at all.” Mr. Cuban unambiguously described a depression — conditions that last years not months. If MLB never plays a game, that has become a very real possibility, if not a probability. This is not something we can ignore."}, {"type": "subtitle", "content": "We Are All Root, Root, Rooting for Baseball"}, {"type": "sentence", "content": "MLB is at a crossroads it must successfully navigate. Hopefully you agree with me that, to a certain extent, as MLB goes, so too does the US economy. I don’t know how it will turn out. As you’ve no doubt figured out by now, I’ve pretty much plucked my probabilities from mid-air, but I don’t think they’re unreasonable."}, {"type": "sentence", "content": "At the end of the day, all we can do is our best. We are going to give it our best shot. For the sake of the country, the economy, and baseball I hope our best is enough. We’re all rooting for it."}, {"type": "sentence", "content": "Disclosures: The views expressed in this article are solely my own and do not reflect the opinon of the investment management subsidiary for which I work or its corporate parent. This article is not intended to be, and should not be construed as, a piece of investment advice or recommendation to buy or sell any security."}, {"type": "sentence", "content": "My employer’s investment process relies upon factor investing, thereby targeting characteristics rather than stocks, though we may go long or short securities menioned in this article to harvest factor premia we identify. Amongst the firms mentioned in this article, our firm currently maintains a long position in NFLX and BVB as well as a long position in UAL as part of its factor enhanced index products."}, {"type": "sentence", "content": "[1] Burt, James E.; Barber, Gerald M.; Rigby, David L. (2009), Elementary Statistics for Geographers, Guilford Press, p. 513, ISBN 9781572304840."}, {"type": "sentence", "content": "[2] The S&P 500’s return is highly correlated with Nominal GNP, while its revenues, in aggregate, have a significantly positive corrolation with US business sales, making the S&P 500 a decent proxy for the US economy."}, {"type": "sentence", "content": "[3] Netflix content pipeline has undoubtedly been disrupted by production delays associated with COVID-19. This had very little effect on its current business but may begin to present an issue for the company in Q3 or Q4."}, {"type": "sentence", "content": "[4] There are other businesses that meet both these criteria. Most involve consumer discretionary spending (movie & concert exhibitors, for example), but they don’t the same definitive timeline in which to work, thus making baseball the most interesting of these."}, {"type": "sentence", "content": "[5] As of writing, the South Korean baseball league is two days into playing spring training games without crowds. Under that league’s rules, if anyone involved in the league contracts COVID-19, the league will be automatically suspended for three weeks."}, {"type": "sentence", "content": "[6] The US, Canada, and a pair of games each in the UK and Mexico, respectively."}, {"type": "sentence", "content": "[7] For a variety of reasons, the latter is unlikely, even if MLB actually does play zero games in 2020. There are, however, very real possibilities of 80–90% revenue declines if it can’t agree to terms with its broadcast partners in such a scenario."}, {"type": "sentence", "content": "[8] Source: Recent company filings."}, {"type": "sentence", "content": "[9] Can’t ignore the Toronto Blue Jays!"}], "topic": "economy"}