{"title": "Are You Really Cut Out to Be the Boss?", "data": [{"type": "subtitle", "content": "The truth about waking yourself up in the morning to chase your dream"}, {"type": "sentence", "content": "Regardless of your particular goal — to create the next best-selling phone app, buy a fast-food franchise, or grow your fledgling used car business into the number one automobile dealership in the state — it probably started with great ambitions and dreams of financial independence."}, {"type": "sentence", "content": "But if, after several years of hard work, you’re still struggling to keep your business afloat, or worse, your efforts ended in failure, debt, and disappointment, you may be asking . . ."}, {"type": "subtitle", "content": "What happened?"}, {"type": "sentence", "content": "Why did your competitor’s plan blossom into financial success while yours ended in failure?"}, {"type": "sentence", "content": "Granted, you may have faced problems with municipal zoning, financing, or bad timing. Or maybe you ignored one of the Three Basic Metrics of Success."}, {"type": "sentence", "content": "But there’s another reason for failure. And it’s one very few of us like to talk about . . ."}, {"type": "subtitle", "content": "Not everyone is cut out to be the boss."}, {"type": "sentence", "content": "Your venture may have been unsuccessful because you weren’t aware of the necessary changes in mindset, attitude, and life priorities."}, {"type": "sentence", "content": "Maybe you underestimated the time, commitment, or discipline it would take to get your new business off the ground."}, {"type": "sentence", "content": "Or maybe you didn’t consider the sacrifices — giving up time spent with family, recreational pursuits, or social activities — and decided to give it a shot because you wanted to join the fashionable trend of starting your own business."}, {"type": "sentence", "content": "For many, the final decision to become an entrepreneur came after asking themselves the question, “Why not?”"}, {"type": "subtitle", "content": "And now you know the truth."}, {"type": "image", "content": "https://miro.medium.com/max/10178/1*F9cL8sbZ2DUjQvfMFetFfw.jpeg"}, {"type": "subtitle", "content": "Running your own show is no cakewalk."}, {"type": "sentence", "content": "It takes long hours, is financially risky, and is filled with the stress of living a life completely out of balance."}, {"type": "sentence", "content": "So why is it such a popular concept? Why do so many people dream of owning their own business?"}, {"type": "sentence", "content": "Because the media promotes the notion of being an entrepreneur as universally appealing, implying the independence, potentially unlimited compensation, and freedom of self-direction as common aspirations coveted by all workers."}, {"type": "sentence", "content": "Based on such poster-child logic, we should see a steady and ever-increasing number of new business start-ups annually."}, {"type": "subtitle", "content": "The facts tell us otherwise."}, {"type": "sentence", "content": "Historically, the number of full-time workers starting or running their own business is a consistent 13 percent (based on stats from the Global Entrepreneurship Monitor)."}, {"type": "sentence", "content": "This may jump a point or two in the short term, but after factoring in the number of new businesses still operating after five years, the number doesn’t change much."}, {"type": "sentence", "content": "Yes, other sources (the Freelancers Union and Entrepreneur for example) claim much higher percentages, often alleging as much as a third of the workforce is engaging in some kind of self-employment. But this refers to the so-called “gig” economy, made up of part-time workers or those wanting to generate a second or side income, and does not reflect the actual number of full-time entrepreneurs."}, {"type": "subtitle", "content": "The numbers tell us not everyone wants to be an entrepreneur."}, {"type": "sentence", "content": "They also tell us something even more important: The overwhelming majority of people are satisfied — even happy — with a conventional eight-to-five job, even when they say they are not."}, {"type": "sentence", "content": "Although they may complain or argue they would much rather be in charge of their own professional destiny, their complaints usually reflect temporary disappointments and dissatisfaction inherent in ANY occupation."}, {"type": "sentence", "content": "And seldom do they consider their grievances sufficiently motivating to leave the illusion of security provided by an employer."}, {"type": "sentence", "content": "In short, they’re comfortable with the subservient relationship they have with the boss, and consider the inherent company bureaucracy a necessary and inescapable evil."}, {"type": "subtitle", "content": "So why does entrepreneurship and the idea of working for yourself continue to be such a hot topic?"}, {"type": "sentence", "content": "Because the idea of achieving financial freedom is a powerful aphrodisiac, used to sell everything from business manuals to how-to courses."}, {"type": "sentence", "content": "The experiences of the few who managed to find their way to the top of the financial pyramid are often touted as everyday success stories, written to entertain, sell a book, a training course, or to gain product recognition by exploiting an individual’s notoriety or celebrity through product endorsements."}, {"type": "sentence", "content": "Companies involved in multi-level sales or those using independent sales reps often use the “millionaire next door” pitch, citing the examples of a very few outstanding achievers as a recruitment tool. In spite of the fine print disclaimer at the bottom of the page, the implication is clear: They did it, and so can you!"}, {"type": "subtitle", "content": "In reality, over-the-top success is rare."}, {"type": "sentence", "content": "For example, after the success of Fifty Shades of Grey, the previously unknown author was touted as a less-than-average writer who found fame and fortune by relentlessly pursuing her passion."}, {"type": "sentence", "content": "But when long-time industry pros were asked to estimate the chances of another unknown author being able to garner the same level of success, the answer was a bubble-popping but realistic zero."}, {"type": "sentence", "content": "In other words, the success of Fifty Shades was an anomaly — an extremely rare happenstance of luck, competitive timing, market receptivity, social media marketing, and a big dose of FOMO (fear of missing out)."}, {"type": "sentence", "content": "There are plenty of souls out there who try kick-starting their own business, or jump into multi-level sales, or write a book, or offer their photography, paintings, or sculpture for sale, and then find themselves financially forced to give up when success, money, or recognition doesn’t come within the first year. Or two. Or three."}, {"type": "sentence", "content": "And while motivational speakers, success bloggers, and life coaches are quick to dismiss them as the complacent majority who live in a world of excuses, the reality is often just the opposite."}, {"type": "sentence", "content": "Many who’ve experienced an unsuccessful business venture look back on their failure as a learning experience — a real-world evaluation of their talent, marketing, and sales ability, and most important, their entrepreneurial mindset . . . or the lack of it."}, {"type": "sentence", "content": "This very personal feedback has allowed them to make better choices in their financial and career goals, with many returning to conventional employment."}, {"type": "subtitle", "content": "The result?"}, {"type": "sentence", "content": "They’re more confident and sure about their life-plan. And most are quick to point out that, without having tried to make it on their own, they wouldn’t have developed an appreciation for a traditional career path — nor would they be as happy."}, {"type": "sentence", "content": "So if you’re one of the many who tried and failed to make it on your own, you have two choices:"}, {"type": "subtitle", "content": "First, keep trying."}, {"type": "sentence", "content": "Learn from what happened, and start again. If this makes sense to you, and you can’t consider any other way of achieving personal success and satisfaction in life, then go for it. Give it everything you’ve got. Commit yourself 100% to the task and be prepared to make whatever sacrifices are necessary along the way."}, {"type": "sentence", "content": "Your most powerful resources are determination and persistence — long after reason and logic are exhausted."}, {"type": "subtitle", "content": "The second choice?"}, {"type": "sentence", "content": "Take satisfaction in having learned who you are and what makes you happy. Don’t let the stories of the few who inhabit the mansions of the rich and famous lead to frustration and dissatisfaction with your own life."}, {"type": "sentence", "content": "The mainstream media’s latest version of the perfect career, with its astronomical level of professional or financial success, is often nothing more than conjecture mixed with a touch of fantasy. Don’t let it adversely influence you with unrealistic expectations."}, {"type": "sentence", "content": "Discovering your personal strengths and weaknesses is an important part of finding fulfillment in life — even though your true identity may not mirror or “fit” the current trend and popular media’s latest avatar for success."}, {"type": "sentence", "content": "If you’re truly dissatisfied with some aspect of your life, take steps to change it. Otherwise, accept it, and make it a point to stop comparing yourself to those whose circumstances led them down a different path."}, {"type": "image", "content": "https://miro.medium.com/max/2034/1*bBZCfKZE6H3Y4Jh5XRv7Yg.png"}, {"type": "sentence", "content": "Join my email list and stay in touch."}, {"type": "sentence", "content": "Roger A. Reid, Ph.D. is the founder and host of Success Point 360 Podcast and author of Speak Up! A Step-by-Step Method to Conquer Your Fears and Give an Amazing Speech. A certified NLP trainer with degrees in engineering and business, Roger offers tips and strategies for achieving higher levels of career success and personal fulfillment in the real world."}], "topic": "leadership"}