{"title": "When This Is All Over, The Federal Government Will End Up Owning Large Chunks Of America", "data": [{"type": "image", "content": "https://miro.medium.com/max/2016/1*n_lFBS1iJfOgLQ1q70lwxA.jpeg"}, {"type": "subtitle", "content": "Businesses of all kinds, in all states of health. And states, and cities…"}, {"type": "sentence", "content": "Not because it’s trying to “take over”. But because it’s trying to prevent financial markets from locking up, and sheer economic collapse. To do that, the Federal Reserve is buying all kinds of corporate bonds (even low rated ones), and also bonds issued by governments to finance things like public work projects. And the Fed’s said it can and probably will continue doing this as long as it needs to, in an unlimited amount."}, {"type": "sentence", "content": "The Fed’s intention is not to “buy to own”. At least not super long term. Instead, it wants to just buy enough to encourage investors it’s safe to buy, and banks to lend money. But still, that’s a lot. So far, it’s worked. The stock market is down from its astronomical highs of the past few years, but it’s hardly been battered. At its lowest, it was about where it was just when Trump took office. And the S&P 500 stands today a whopping 444% higher than the low hit after the 2008 Recession. Even though right now economic conditions look about as bad as they have ever. Despite what the President says about the economy making a full recovery “a lot sooner than anybody would understand”, there’s still no real light at the end of the tunnel about when and how fast things might come back."}, {"type": "sentence", "content": "The Fed has one other big advantage: U.S. government bills, notes, and bonds are still considered the safest place in the world to keep money, so the Treasury’s having no trouble selling those at very low interest rates. And that keeps the dollar strong. While the U.S. government’s handling of this crisis could erode some of that confidence in the long term, right now there’s little threat to the flow of dollars continually coming in, short of an utter global economic collapse."}, {"type": "sentence", "content": "And that’s why we’re not here to argue against what the Fed’s doing. Because really it’s the only option. And it’s why we’ve become big fans of Fed Chair Jerome Powell. Because unlike this nation’s President, Powell doesn’t see the economy coming back because of magic, rather a lot of hard work. And for a banker, he seems remarkably sensitive to real-world impacts and the plight of people (especially lower income people), who are struggling through no fault of their own. To a far greater extent than the President, who’s publicly now having reservations with providing more direct relief, preferring instead “trickle down” stuff like payroll and capital gains tax cuts. But you have to have a job in order to benefit from a payroll tax cut; you have to have money to invest to benefit from a capital gains tax cut."}, {"type": "sentence", "content": "Anyway, if the U.S.’ economic standing and power in the world still gives this country so damn much leverage — our “exorbitant privilege” — why not use it? And then address the consequences when they inevitably come. What we don’t know right now is whether the eventual consequences will be a little hard to address or a lot hard, but they won’t be easy. And can they be addressed refreshingly quickly, or over an excruciatingly long period of time, or (probably) somewhere in between? What we do agree with is right now it doesn’t matter. Has to be done."}, {"type": "sentence", "content": "“Too big to fail” was a phrase that became popular during the last recession, when several banks and businesses were bailed out by the government even after their management made horrible, unforgivable business decisions. And even perhaps illegal decisions. Or at least very much not in the interests of the American public. But still, they got the bailout money. And the government (under both Presidents Bush and Obama), were rightly criticized for making sure bankers got a soft landing when no one else did. Even though it was those same bankers who were fully responsible for the financial crisis in the first place."}, {"type": "sentence", "content": "Now it’s all of America that’s too big to fail. And the blame goes to a virus. But it doesn’t help that the U.S. was already leveraging so damn much debt, even at a time when the economy was booming. U.S. corporations took advantage of tax cuts and low interest rates, even if it was just to buy their own stock in order to drive their stock price up and make the incentive-based pay that’s common among top corporate executives these days skyrocket too."}, {"type": "sentence", "content": "The Fed does have one limit though. Not in the amount of money it can spend, but in how it spends it. When the Fed buys a corporate bond, it’s not giving money to a corporation, it’s lending it. Because the corporation is obligated to pay that bond back."}, {"type": "sentence", "content": "So what happens if the corporation can’t pay that back? Or it goes bankrupt? One scenario is it liquidates, and even though the Fed may be at the head of the line of creditors, it gets paid back only at pennies on the dollar, and the U.S. taxpayer takes the hit. (The Fed often tries to limit this by taking collateral at the time it makes that kind of loan, but who’s to say the collateral will end up being worth anything?)"}, {"type": "sentence", "content": "And many times when companies go bankrupt, they continue to operate. They are allowed to reorganize, and get creditors off their back. In that case, debt they owe to creditors is often converted to equity. So instead of owning a loan to the company, creditors end up owning a lot of the company itself. (This process has already started happening with the many retailers going bankrupt, but trying to stay in business.) And in some cases those creditors demand and get significant say in how that company is subsequently run."}, {"type": "sentence", "content": "But does the Federal Reserve want to be in that business? Does the U.S. government? Do American taxpayers?"}, {"type": "sentence", "content": "It may not matter. The government is part of this now and will be part of that if it happens, whether it wants to or not. Is it necessarily a bad thing? Not really. Presidents Bush and Obama took a lot of heat last time around for essentially taking ownership of a lot of the auto industry for a period of time. But the American taxpayer ended up making money on that deal."}, {"type": "sentence", "content": "This time around though is unprecedented both in terms of cause and the astronomical amounts of money already committed, and how it’ll play out is completely unpredictable. Maybe corporations and cities bounce back and are able to service their debts and the Fed gets paid back and everything’s hunky-dory. Maybe they don’t, and the Fed’s carrying billions, maybe even trillions in bad debt for years. And/or finds itself in the position of being deeply involved in the management of many American corporations and towns because it doesn’t have a choice if it ever hopes to get taxpayers back any of their money."}, {"type": "sentence", "content": "Lots of people are optimistic that the virus will be cured (or disappear) one day relatively soon, and the economy will recover swiftly then. But still no one has any real inkling of when that will be, or how deep the economic wounds will be by then."}, {"type": "sentence", "content": "And in that sense you can almost think of an economic Depression and a person being clinically depressed as pretty much the same thing. And that puts the Federal Reserve in a position where it has to keep providing tons and tons of support, understanding, and relief just to prevent the economy from locking up and shutting down."}], "topic": "economy"}