{"title": "No Pitches, Please", "data": [{"type": "subtitle", "content": "THE STARTUP SHOW"}, {"type": "subtitle", "content": "Why You Need to Take No For An Answer to Find Your Early Adopters"}, {"type": "sentence", "content": "I’ve never quite understood the purpose of pitching your idea to everyone who asks."}, {"type": "sentence", "content": "Whenever people ask me about my startup, I answer."}, {"type": "sentence", "content": "I describe the problem that I’m trying to solve (the broken state of modern day hiring and how problematic that has become for the job applicant) and the use case of the 1st iteration of my MVP."}, {"type": "sentence", "content": "Describe, not pitch."}, {"type": "sentence", "content": "Describe means to:"}, {"type": "image", "content": "https://miro.medium.com/max/2290/1*tDIntFlHLKZxy2PJdYAf_w.png"}, {"type": "sentence", "content": "Pitch means to"}, {"type": "image", "content": "https://miro.medium.com/max/2080/1*7w-XRyaF15LgV8Wx1YNang.png"}, {"type": "sentence", "content": "I never pitch. I don’t even pitch to my users."}, {"type": "sentence", "content": "Do I tell them about what I’m doing? Sure. Do I tell them about my product? Do I try to build a relationship with them. Sure."}, {"type": "sentence", "content": "Do I try to convince them to use my product? Not really."}, {"type": "sentence", "content": "Why am I so averse to pitching?"}, {"type": "sentence", "content": "Because in the early stages, it can give me a false sense of confidence."}, {"type": "sentence", "content": "Right now, I run a small online Reddit community (less than 100 members) that educates people on the merits of direct messaging hiring managers."}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*s8uKGnYA5JBkpi0L7jJEkQ.jpeg"}, {"type": "sentence", "content": "Photo by Kon Karampelas on Unsplash"}, {"type": "sentence", "content": "In a few weeks, I plan to unveil a product that I’ve been working on that will allow them to send 10+ DMs (direct messages) in less than 10 minutes."}, {"type": "sentence", "content": "My plan is to present this product to my users and see how they react."}, {"type": "sentence", "content": "I expect conversion to be in the 10–20% range. If you’re still using the product in 3 months, congratulations:"}, {"type": "sentence", "content": "Now why do I do this? Why am I not in a frenzy to retain as many users as possible?"}, {"type": "sentence", "content": "Because I want desperation."}, {"type": "sentence", "content": "I want to know who out of my community members actually has the most severe form of the problem I’m trying to solve."}, {"type": "sentence", "content": "For once I identify these people, I’ll know how to find additional potential users who share certain characteristics with the users of my product who stayed past month 3."}, {"type": "sentence", "content": "See how much more focus this creates for my user interview efforts?"}, {"type": "subtitle", "content": "Am I Wrong?"}, {"type": "sentence", "content": "Perhaps I’m wrong."}, {"type": "sentence", "content": "Perhaps you do need to force-feed the benefits of your product to your user to get them to actually use your product and find value out of it."}, {"type": "sentence", "content": "Yeah, even reading that sentence annoys me."}, {"type": "sentence", "content": "Sometimes, when I’m reaching out to people on Reddit, they ask if I’m a grifter."}, {"type": "sentence", "content": "Apparently, I’m supposed to be that guy who sells snake oil. Who offers to help but never states his agenda."}, {"type": "sentence", "content": "That guy."}, {"type": "image", "content": "https://miro.medium.com/max/13136/1*0FMCfdNT1yXKAH2YBvMsog.jpeg"}, {"type": "sentence", "content": "Well, I’m not that guy. And that is because I never pitch my product to people."}, {"type": "sentence", "content": "I offer my product to people, but I never resort to any sort of heavy handedness."}, {"type": "sentence", "content": "I ask. I offer. I describe."}, {"type": "sentence", "content": "But I don’t pitch."}, {"type": "sentence", "content": "I will show you the benefits of my product and talk you through it, but in no way will I be chasing after you to convince you that you need my product."}, {"type": "sentence", "content": "When recruiting early adopters, any hesitation I will take as a sign of disinterest, which will be my cue to move on."}, {"type": "subtitle", "content": "When No is Good"}, {"type": "sentence", "content": "For those who end up refusing my product, I sometimes ask why."}, {"type": "sentence", "content": "Especially if that person qualifies as a user. I do this to try to understand why they said no."}, {"type": "sentence", "content": "It’s not to convince them to change their mind."}, {"type": "sentence", "content": "I once asked a friend why he didn’t want to pay for my product even though it could benefit him. Turns out, my product was just a nice to have."}, {"type": "sentence", "content": "I’m no longer working on that product."}, {"type": "sentence", "content": "Boy was that a hard conversation to have."}, {"type": "sentence", "content": "But it shouldn’t have been hard."}, {"type": "sentence", "content": "At the end of the day, your idea is not your ego. You want to actually be right, not just think you’re right (the Mom Test by Rob Fitzpatrick has some great insights on how to avoid false positives)."}, {"type": "sentence", "content": "If your users tell you you’re wrong by not giving you the answers to questions that you thought you had the correct answers for, the last thing you want to do is to try to convince them that they’re wrong."}, {"type": "sentence", "content": "Trying to argue with your users is like arguing with spilt milk."}, {"type": "image", "content": "https://miro.medium.com/max/8960/1*yvTjTCK7LlTP7pHGmF7MTA.jpeg"}, {"type": "sentence", "content": "Photo by Nathan Dumlao on Unsplash"}, {"type": "sentence", "content": "It is what it is."}, {"type": "sentence", "content": "You also don’t want to go down the road of satisfying your users’ every feature whim."}, {"type": "sentence", "content": "For that road leads you down a long and windy road of feature creep. You’ll end up wasting valuable time and engineering resources on something that nobody wants."}, {"type": "sentence", "content": "Respect the answers that a user gives you. That’s the data you want to rely on when building your product. Build your product based on what your users tell you during user interviews, and you won’t go astray as much."}, {"type": "subtitle", "content": "The Right Way to Find Early Adopters"}, {"type": "sentence", "content": "As someone developing a product, the last thing I want to be doing is convincing you that I’m right, that you’re wrong, and that you should buy my product."}, {"type": "sentence", "content": "You want to be offering your product to people that you think would find your product useful."}, {"type": "sentence", "content": "The key word is “offering.”"}, {"type": "sentence", "content": "Describe the benefits of your product to whomever you think might use it — once you’ve explained it to them, your job is done."}, {"type": "sentence", "content": "Follow up once in a while, but don’t go hounding them down to ensure that they pay your $20/month subscription fee."}, {"type": "sentence", "content": "In fact, if you find yourself not being able to get as many users as you thought you would to use your product, I would suggest that you review assumptions you made about your user, your problem, and the features you decided to build to solve the problem."}, {"type": "sentence", "content": "Everything that goes wrong when building your product is feedback. The more errors you find and the more of them you correct, the better."}, {"type": "sentence", "content": "The more of them you try to hide by arguing with or correcting your users when they try to give you feedback, the worse off you are."}, {"type": "sentence", "content": "Your potential user’s enthusiasm about your idea is not a commitment you can bank as market validation. After all, enthusiasm does not pay server costs."}, {"type": "sentence", "content": "But what if it’s enthusiasm paired with an actual purchase?"}, {"type": "subtitle", "content": "Maybe you are listening."}, {"type": "image", "content": "https://miro.medium.com/max/10526/1*ly10vQ0XKpfVGywY4paDxw.jpeg"}, {"type": "sentence", "content": "The Startup Show is a Blog and YouTube (here’s the first episode) series that is my attempt at giving you an unembellished and raw account of my startup journey. I read pages 33–40 of the Mom Test this week and did a lot of user interviews over Reddit DMs as part of my efforts to find define the profile of my product’s early adopters."}], "topic": "startups"}