{"title": "The Japanese Art of ‘Hanami’", "data": [{"type": "subtitle", "content": "Lessons learned from contemplating a tree in bloom"}, {"type": "sentence", "content": "“Look at them! They’re bowing!” I called towards my then partner while pulling his arm in my direction. Underneath a swaying cherry blossom branch, two deer joined into a playful bow. In Nara, Japan, just south of Kyoto, sika deer are roaming freely on the streets, poking their inquisitive noses looking for the wobbly limbs that often carry treats. They are smart — they figured out that there’s a higher chance at a bite of the specialty ‘deer biscuit,’ if they first court the humans with endearing kindness."}, {"type": "sentence", "content": "The town’s paths are clouded with light crimson petals swirling in the breeze. To our right, a thick branch is shading a group of three friends laying on a checkered blanket. Occasionally, pink flowers float in their perimeter, getting caught on the girl’s black hair, balancing on the handle of the woven basket, or even landing right inside the brown loafers resting on the grass. They are borrowing space, in the same way we all are — our interdependence unfolding naturally in the change of seasons."}, {"type": "sentence", "content": "The sakura — or cherry blossom — season is widely celebrated in Japanese culture as a symbol for ‘the ephemeral beauty of living.’ Japanese scholar and cherry-blossom lover, Notoori Norinage, described “the essence of the Japanese spirit,” as “the fragrant cherry blossoms in the early morning.” The flower is a perfect metaphor for this philosophy of life, due to its short bloom of roughly ten days. The life cycle of the sakura tree is similar to that of humans, reaching their peak after about twenty years and fading away at around the age of seventy. What better time to rejoice at the life’s changes than in spring — a transient season full of beauty, leading to months of warmth and connection with nature and each other."}, {"type": "sentence", "content": "Historians believe that cherry trees have been seen as sacred by the ancient populations of Japan, who were attributing them with divine characteristics and using their bark in hunting ceremonies while asking the spirits for fertility and safety. The red colour was also believed to protect them against evil spirits."}, {"type": "sentence", "content": "The geography surrounding the many temples of Japan evokes this divine connection. It is common for places of worship to be built in lush forests, often surrounded by trees such as pine, oak, ginkgo, or cherry blossoms. This is mainly because all these trees are part of shinboku, or considered ‘divine trees.’ A popular legend in the Chronicles of Japan tells the story of Empress Saimei. She commissioned the deforestation of the Shrine of Asakura in order to build her palace. This action greatly angered the Gods, which in turn, demolished the building as retaliation."}, {"type": "sentence", "content": "The symbol of the ephemeral life holds a certain existentialist quality to it, yet at the same time, it is grounded in a spirit of optimism and hope. Although the blossoms have a short lifespan, you can always count on them to reappear year after year, their bloom signifying yet another chance; a renewal of the human condition. At the same time, with each year, just as the trees age so do we — the flower’s state of decay only a reminder of our own mortality. In an anthology of poems dating from the Heian period (794–1185), which was later translated, the ancient writers captured this awareness: “each spring the blossoms / reach their brilliance once again / but seeing them so / we are reminded that to / watch them fall is our lot.”"}, {"type": "sentence", "content": "For the modern Japanese, the sakura season is one of celebration and friendship. It is just as much about embracing the warmth of spring, as it is about connecting with loved ones. Hanami — signifying cherry-blossom viewings — are a common way to celebrate, where locals meet under cherry blossom trees to drink sake and eat carefully-packed bento lunches. The tradition dates back to the Heian period where nobility would observe the condition of the cherry trees as a prediction for the quality of the harvest for the coming year. If the harvest looked plentiful, they would celebrate with drinks and food under the blooming trees."}, {"type": "sentence", "content": "We walked towards the road, where a lineup of local food stalls was forming ques with both locals and tourists alike. A wooden table filled with batches of dorayaki — a Japanese specialty pancake with sweet filling at its middle — caught our attention. During spring, vendors sell sakura-flavoured confectionery — marked by sweet flowery and plum flavours."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*V3KRk00aNue_IjnbkVodnQ.jpeg"}, {"type": "sentence", "content": "The season itself is characterized by a consumerist extravaganza, where everything from big brand names to local venues launch new pink-branded products to celebrate the specialty tree. McDonald’s has a sakura mochi McFlurry and Starbucks launches an entire collection just to mark the season every year. In stores, everything from detergent to KitKat is sakura branded. I encourage you to walk around and see what you may find. It is a time when everyone comes together in a spirit of celebration — it almost feels like Christmas, minus the evergreens and with a touch — or shall I say explosion — of pink colours all around."}, {"type": "sentence", "content": "Perhaps just like their ancestors, a blossoming of sakura-branded products reminds the Japanese of prosperity, just as much as they are encouraged to express gratitude with nature and each other. What better time than the change of seasons, when nature itself shows its abundance, to celebrate and be grateful for all the things we take for granted both inside and outside our homes?"}, {"type": "sentence", "content": "Today, I am sitting on a bench in the middle of a grassy patch nestled among 19th-century Gothic buildings. Located in the middle of the bustling city, The University of Toronto makes you feel like you’re anywhere but. I enjoy sitting among the past, just as much as I appreciate the glass towers reminding me of the present."}, {"type": "sentence", "content": "Another reason why I love this tiny park, hidden among the stone structures, is due to its one thriving flower tree, erected in a corner in full bloom. It has a certain magnetic, yet inconspicuous quality that halts everyone walking by."}, {"type": "sentence", "content": "Watching from a bench nearby, I see a small child, no older than five, looking up towards the blossoms. I imagine the tree seeming tall from the little boy’s vantage point. Without any notice, a white husky pup joins the scene, rummaging through the bedding of petals, while chasing a squirrel. This distracts the child who now joins in the race. The boy running after the dog who is chasing the squirrel who is jumping up the tree. This leaves both young ones looking up towards the sky, their eyes searching for the blue vastness hidden among the branches. Noticing his longing, the guardian of the little boy walks over to pull him up — his tiny arm now finally being able to reach the lowest-most petal."}, {"type": "sentence", "content": "There is an interdependence in the unfolding that I find comforting. Here we are engaging in hanami while fixated on this one tree, crossing generational and human-animal boundaries, transgressing built and natural environments. The tree standing in between the abundance of glass towers, in between classrooms and laboratories and research centres that accelerated our collective prosperity. At the same time, it shades a city marked by widespread inequality and poverty."}, {"type": "sentence", "content": "We marvel at nature, while often, we end up destroying it. Yet, just like nature depends on our collective care, we depend on the natural world for our livelihood. While the deer bow for biscuits, we should be bowing for oxygen. And then back at the deer for reminding us of our purpose, and what we need to give back for all that we’ve taken."}, {"type": "sentence", "content": "Fundamentally, the spring bloom represents a celebration of life, without ignoring its complexities and limitations. It symbolizes a transitory period marked by an acknowledgement of everything lost, and all the things gained. At the same time, it’s a reminder of all the things lost as a result of our gain. It challenges us to see our prosperity and its inherent disproportion."}, {"type": "sentence", "content": "The cherry blossom itself is a tree that has been passed across generations as a symbol of something greater that not only celebrates and unites us, but also reminds us of our transience. It calls upon our affluence and challenges us to reflect on our destruction. Because we might not be around for much longer, but what we leave behind will. And we ought to make our legacy, to echo the sika deer, exceptionally kind."}], "topic": "travel"}