{"title": "The Number One Reason Why You Keep Getting Stuck in Business", "data": [{"type": "subtitle", "content": "Ignoring opportunities is more important than spotting them."}, {"type": "sentence", "content": "Great ideas are dangerous. Especially in volume."}, {"type": "sentence", "content": "Put your hand up if you’ve ever started a side-side business. Or if you worked hard for weeks on a specific marketing strategy…only to hear about a new idea on a podcast and decide to start from scratch and bin your entire work."}, {"type": "sentence", "content": "I know I have to actively keep an eye out to make sure that I’m not getting distracted by the next “opportunity”. It took me a long time to gain the self-awareness to stop the self-sabotage: years ago, I had an app averaging 3,000 downloads on the App Store. A day. When I changed the pricing, it went down overnight by 90%. Instead of fixing it, I decided to pursue what felt like an easier idea: I don’t even remember what that was."}, {"type": "sentence", "content": "Switching between ideas all the time is known as ‘shiny object syndrome’: like a baby chasing the next item that temporarily catches its attention, CEOs tend to be equally quick to fall in love with a new idea (and then move on)."}, {"type": "sentence", "content": "Especially if you are starting a new business, “idea crushes” can come in the form of further information: a step-by-step article, the latest trend, a marketing tactic. If you’re a more established CEO, distractions usually step from not having a clear vision in front of you. Being town between raising investment or launching a new product is a classic example I get from coaching clients looking to get clear on what’s next."}, {"type": "sentence", "content": "Here’s why idea crushes are so seductive."}, {"type": "subtitle", "content": "Ideas are easy; practice is challenging."}, {"type": "sentence", "content": "The reason why it’s so easy to get distracted by the next tactic or the next book is that you are comparing theory with practice. When you evaluate a new idea in your mind, it’s usually a best-case scenario. Once you take action and translate it to life though, that’s when the rubber hits the road: you will get challenged, and things may not go according to your plans."}, {"type": "sentence", "content": "That’s usually when most people quit and move on to the next idea crush: they choose theory over practice. In the moment, that feels easy, but it’s keeping you stuck in a loop: start things, face a challenge, start from scratch."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*G1zI31wRFmD7qaqKRJ7vVg.jpeg"}, {"type": "sentence", "content": "You’re doing the hard part, but never allowing yourself to reap the rewards of your work."}, {"type": "subtitle", "content": "Being busy is just another form of procrastination."}, {"type": "sentence", "content": "It’s not your fault; I fell for it too. The myth of the hustle tells you that, the more you do, the better. If it sucks, you must be onto something good."}, {"type": "sentence", "content": "This attitude makes it easy to get distracted: you can always make more time for another tactic, another side side-project. Otherwise, …you are weak and not hustling."}, {"type": "sentence", "content": "In reality, though, being busy without discrimination is a great way to avoid taking a step back and reflecting on what matters for you and your business. It’s a way to fill your time with comfortable choices so that you don’t have to start the few things that will make a difference."}, {"type": "sentence", "content": "Because deep down, we don’t want to win: change sucks. If you focus on one thing at a time and it works, now you’ll have more to lose, your friends may judge you differently, you’ll have different challenges. Better to remain in the comfort zone, and keep doing things that don’t take you anywhere, so you can feel like you’ve shown up."}, {"type": "sentence", "content": "Once you realise the sophisticated trap behind the hustle, you will be able to let go of idea crushes, and follow the plan past the next barrier."}, {"type": "subtitle", "content": "Impostor syndrome: most CEOs don’t feel enough."}, {"type": "sentence", "content": "Entrepreneurs are the explorers of the business world: they decide to find their way. Each challenge is a new venture into lands they have never seen before."}, {"type": "sentence", "content": "Nowadays, we can access a lot of advice online: it’s an incredible time to have a business. But you still have to adapt the recipe to your situation and, most importantly, to your goals and objectives. It’s a lot of responsibility: you must find a way to reach your results."}, {"type": "sentence", "content": "That’s why idea crushes are so alluring and hit you when you start doubting yourself: ideas make you believe that the ultimate recipe is out there, and you no longer have to look for it."}, {"type": "sentence", "content": "Getting distracted is the Achille’s heel of business. Whenever your self-confidence is low, you get distracted and fall for yet another “idea crush”, until you realise that you keep starting from scratch, and never get closer to your destination."}, {"type": "sentence", "content": "The antidote is to build a solid foundation from the start: instead of being reactive to whatever next idea comes your way, take your time to understand where you want your business to go. Make your business an expression of yourself, and you’ll never get distracted again."}, {"type": "sentence", "content": "If you keep spinning your wheels and never make progress on your idea, check out my idea challenge to find and test your business in 5 days.Oh, and…if you’re on Insta, say hi!"}], "topic": "startups"}