{"title": "Messaging products: a structured approach to improving WhatsApp", "data": [{"type": "image", "content": "https://miro.medium.com/max/12480/0*un6rNLDC0BIHKhux"}, {"type": "sentence", "content": "Such is the scale of operations and usage of WhatsApp these days, it’s not only a mobile application anymore but a verb too. It is so embedded in our daily lives that as a Product Manager of the application, it may certainly make more sense to track the number of Daily Active Users(more than half a billion currently) rather than the Monthly Active Users to get a sense of the engagement levels."}, {"type": "sentence", "content": "In the messaging category of applications, there are tons of options to choose from but what really made it a sensation back in 2009, and what makes WhatsApp a no-brainer when selecting one in this category now? Through my personal experience, I can think of the following three main reasons."}, {"type": "sentence", "content": "Let’s begin with my approach and thinking process towards improving WhatsApp. This is a mini project that I took up personally back in 2018."}, {"type": "subtitle", "content": "1. Defining a Goal"}, {"type": "sentence", "content": "Wait, what do I even mean by improving WhatsApp? Improvement could be in many ways, and I would like to keep a target/goal in mind. Out of User Acquisition, Engagement( or Retention), or Monetization, I would take-up Engagement as a goal for this exercise."}, {"type": "sentence", "content": "But why would I do that?"}, {"type": "sentence", "content": "Consider this; if an average user is really spending a lot of his time on my application (read engagement), he will ask his friends to join in and create a profile with the app because he wishes to chat with them. Such is the power of networking effect! If I have better engagement levels for my app, then I have new users coming onto my app, which subsequently will lead to more revenues for me with my in-place monetisation streams."}, {"type": "subtitle", "content": "2. Identify and Understand the User"}, {"type": "sentence", "content": "Let’s take up the following users and think about their use cases on the app."}, {"type": "subtitle", "content": "3. Identify User Pain Points"}, {"type": "sentence", "content": "In terms of identifying the pain points for users, its best we do an end-to-end User Journey Mapping and identify points where a user may possibly face a problem or an issue. I conducted some user interviews and surveys with a considerable sample of the suggested user groups. I decided to conduct two major types of interviews being Exploratory interviews and Efficiency Interviews. I could identify the following possible pain points."}, {"type": "subtitle", "content": "4. Recommending Solutions"}, {"type": "sentence", "content": "We have our pain points with us now. It’s time to brainstorm some solutions for these given pain points. I managed to come up with the following solutions and relevant wireframes using Balsamiq."}, {"type": "image", "content": "https://miro.medium.com/max/242/1*MXjnYWicJBpKduLiJ2LnQA.png"}, {"type": "sentence", "content": "As discussed above, the app loses a lot of Engagement when a user has to switch to dedicated note-making applications to note down something important from the messages. Why not harness that engagement potential on our app itself and at the same time solve a major user pain point? A user can then open the NoteUp section and have a look at the notes that he/she has made. The user can also do a search from the search bar at the top."}, {"type": "sentence", "content": "2. Ability to set up a password for specific chats out of all the chats."}, {"type": "image", "content": "https://miro.medium.com/max/1254/1*mTsakhJ6lmDjtR4M6JOKmA.png"}, {"type": "sentence", "content": "There are many situations when people wish to protect some of their chats which may be of utmost privacy. This feature can let you lock some of your chats with the choice of a password in any of the standard ways of a PIN, fingerprint, etc. Also, this feature is one that is not present in any of the other messenger apps, hence making it a point of difference for our Product."}, {"type": "sentence", "content": "3. IG: Interest Groups"}, {"type": "sentence", "content": "According to research and survey results of 2017 from research firms like Nielsen, SmartInsights, eMarketer, etc., an average adult spends approximately 3 hours on his/her cellphone on a daily basis. This surely increases in an era where there is a global pandemic like the COVID-19. How about we extrapolate the feature of groups to have user interest groups which connect people with similar taste of topics to a single group. For example, people interested in memes, sports, or financial news can join a group from a list of public groups when browsed through. Of course, these groups will have no upper limit on the group size (WhatsApp currently has a cap of 257 users in a particular group)."}, {"type": "subtitle", "content": "5. Prioritising on a Solution"}, {"type": "sentence", "content": "Any Product Manager would love to add all his conceptualised features to his Product. However, that may be true only in a hypothetical situation. In real life, a Product Manager faces numerous constraints in terms of resources to be invested, time, and the effort required for implementing a feature. To prioritise a feature, I generally try to identify three or four parameters and based on them, map out a matrix to chalk out the feature rankings on those parameters. Something showed as below."}, {"type": "image", "content": "https://miro.medium.com/max/998/1*dpnVrQn9SkYngnpJruBzeg.png"}, {"type": "sentence", "content": "As shown above, as a Product Manager if I had to choose one feature to go ahead with, it would be NoteUp. Here I considered three parameters for ranking the features, Innovation, Ease of Implementation, and Customer Satisfaction. In some cases, when relevant, I try to incorporate a parameter called Revenue potential."}, {"type": "sentence", "content": "I won’t discard the other features that I have designed. Rather I would add them to my Product Backlog for them to be implemented in the future based on the Product Roadmap."}, {"type": "subtitle", "content": "6. Metrics to measure feature success"}, {"type": "sentence", "content": "I have a user problem that I am looking to solve and a solution to solve that in the form of a Product feature. But how will I know if the feature is a success among the users? METRICS! I’ll want to measure the following metrics for my feature going forward if launched in the market."}, {"type": "sentence", "content": "No of active users exercising the feature"}, {"type": "sentence", "content": "No of active users exercising the feature as a percentage of the DAU"}, {"type": "sentence", "content": "Average size of the notes in NoteUp on a user basis (can be characters or words)"}, {"type": "sentence", "content": "Average user time spent in the NoteUp section"}, {"type": "subtitle", "content": "What next?"}, {"type": "sentence", "content": "As a Product Manager, I have a top priority feature for my product which I am confident will doing well with my Customers. So do I have it developed and ship it in the market right away? ABSOLUTELY NOT! An Agile approach to product development is the key consideration here. I am just assuming here that the feature will work well in the market. I don’t have any data to support that. How would I get that data? How can I prove that my feature will really work well and prove a success in the market?"}, {"type": "sentence", "content": "My solution is based on a lot of assumptions. I would want to identify those assumptions that I am basing my work upon. Then I would convert those assumptions into testable hypothesis statements. Subsequently, selecting a suitable method of Validation that I would take up. It could be an internal validation with my team, External Validation based on external data, Customer Development interviews, by conducting MVP( Minimum Viable Product) Experiments, or by doing some A/B tests. Once a method is selected, I would define the Minimum Criteria of Success for the experiment, the fulfilment of which will be an indicator of the success of my experiment, and would decide if I should be pushing the feature in the market or not. The idea is to use a minimum amount of resources in Validating my ideas. This resonates with a Lean and Agile approach to Product Management."}, {"type": "sentence", "content": "This will be my broad overall approach to any Product Development exercise."}], "topic": "ux"}