{"title": "Priming the Market: Post-Pandemic Positionings in the Video Game Industry", "data": [{"type": "sentence", "content": "To say that 2020 has disrupted a lot of plans is to put it extremely mildly. With the entertainment industry so heavily dependent on live events and activations, the inability and unwillingness to operate and attend such events has left the early half of the year at a quiet standstill."}, {"type": "sentence", "content": "Of course, the predicament isn’t wholly universal, with at least one sector of the industry thriving because of the near-universal lockdown. But while the online-ready nature of gaming and esports is a thoroughly explored and analyzed topic at this point, what hasn’t yet been discussed much is life for the industry after its current audience is no longer quite so captive."}, {"type": "subtitle", "content": "STATUS QUO"}, {"type": "sentence", "content": "Here’s what we know for sure."}, {"type": "sentence", "content": "But it isn’t good news all around for the tech industry. Global PC sales have actually fallen a painful 30%, per DigiTimes (March 19, 2020). Granted, this is likely more due to the hardware category’s involvement in conventional enterprise than its role in digital entertainment — as well as the massive and ongoing interruptions to global logistics."}, {"type": "sentence", "content": "The logistics hit also affects hardware, to be certain. The 155% increase doesn’t represent the whole of the market’s demand, especially among Nintendo players, as the Switch console is currently experiencing severe availability issues across the board (Quartz, April 2, 2020)."}, {"type": "subtitle", "content": "PROSPECTS"}, {"type": "sentence", "content": "Here’s what we expect in the aftermath of the current lockdown:"}, {"type": "subtitle", "content": "Short-Term Normalization"}, {"type": "sentence", "content": "Current streaming and gaming numbers are built upon a structural, and temporary, monopoly. Other entertainment outlets are, as should be obvious, unavailable to the general audience as of this time. Where individuals might have used their available recreational time and budget on cinema, live events, or other forms of physically attendant encounters, they are now forced to use whatever is available at home."}, {"type": "sentence", "content": "That does mean a dip or flattening in viewership numbers once businesses are opened back up, as well as what will initially seem like a decline in game sales. That is, however, no reason to panic."}, {"type": "subtitle", "content": "Long-Term Advantage"}, {"type": "sentence", "content": "What’s not going to change, even if COVID-19 magically disappears tomorrow: each and every single console that’s been sold so far, as well as the appetite for more Switches and next-generation consoles come this holiday season. Their temporary unavailability has, if anything, stoked the global appetite for them too."}, {"type": "sentence", "content": "Audience bases that didn’t exist before, or would have taken much longer to reach, have now been made available thanks to social distancing efforts. Gaming as a habit will be further entrenched by multi-month stay-at-home orders as well, reaching households that would have normally been resistant or skeptical of their involvement. Spending habits will also reflect this — if nothing else, the $300 expense of even a Nintendo Switch creates a sunk-cost mentality among the audience, ensuring that they’ll want to extract full value from their purchase with both time spent playing and a well-stocked library of games."}, {"type": "sentence", "content": "This is applicable to the streaming and esports audience too — those that best positioned themselves to take advantage of the COVID-19 inflated audience will likely perform the best in its aftermath as well, retaining name recognition among an audience base that previously did not consider themselves part of the esports viewership. Cultivating that recognition will be vital toward staving off the worst of the post-pandemic market correction — and in further developing that new demographic later on."}, {"type": "sentence", "content": "In the much longer term, we will likely find a cultural shift in the perception of gaming in general. The greater exposure to the competitive gaming subculture, and general reliance on games as an accessible entertainment medium, helps further normalize gaming-related endeavors and cancels out prior negative stereotypes associated with gamers. The perceptual value of involved brands increases as a result, drawing in a wider demographic base."}, {"type": "subtitle", "content": "POSITIONING"}, {"type": "sentence", "content": "To paraphrase the well-worn adage, the best time to take advantage of the currently captive audience was yesterday; the second-best time is now. Established esports organizations like Cloud 9 and Team Liquid are already busy generating goodwill through online play and relief efforts. Conventional live entertainment outlets are also reassessing future involvements in the esports industry — NASCAR, in particular enjoyed a healthy 903,000 viewership mark for their iRacing events (Esports Observer, March 24, 2020)."}, {"type": "sentence", "content": "The longer the lockdown runs, the more normalized esports viewership will be among the mainstream audience — and the more reliant broadcast outlets will be on digital content in general. And with the overall timeline for COVID-19 expected to extend well into 2021 (New York Times, March 25, 2020), right this second is the time to get involved."}], "topic": "gaming"}