{"title": "Lessons from Netflix, Ted Sarandos & Reed Hastings — Part II", "data": [{"type": "subtitle", "content": "From Technology to Market"}, {"type": "subtitle", "content": "Choose Your Plan"}, {"type": "sentence", "content": "Netflix’s 2019 annual report states that Netflix is still the world’s leading subscription streaming service. As of right now, YouTube Premium has about 20 million subscribers, Amazon Prime Video has 114 million subscribers and Disney plus has 54 million subscribers. Based on a few online review sites the current rank based on user satisfaction seems to be:"}, {"type": "sentence", "content": "Other niche and up and coming services include, Crunchy Roll, Crackle, Apple TV, Twitch. The biggest threat to Netflix seems to be Prime Video, especially internationally. Prime Video seems to be able to integrate local and regional movies and shows better, attracting non English speaking users better. As well as the Prime Delivery, which adds to the appeal."}, {"type": "sentence", "content": "In the annual report, Netflix notes that the competition in the online streaming business is fierce and subject to rapid change. Primarily Netflix competes with anything a user might choose to do in their free time, that may be, video games, YouTube, other streamers, sleep, pirated content etc."}, {"type": "sentence", "content": "Another tidbit of interest is that there is also seasonality to Netflix growth, where October through March Netflix sees more membership increases. Proving that, yes even summer and beautiful weather and the ensuing outdoor activities are a competitor to Netflix."}, {"type": "sentence", "content": "In terms of risk, Netflix recognizes its ability to provide quality content to its users as crucial to its success, while the failure to do so being a risk factor. Especially since Netflix has to compete for the content, either through licensing or competing for limited number original productions."}, {"type": "sentence", "content": "The level of quality that other services provide is also sure to affect Netflix memberships. For example, if Disney starts offering high quality Marvel Cinematic Universe shows and Star Wars exclusives, that can only take away from Netflix’s bottom line."}, {"type": "sentence", "content": "Another difficult competitor area is the piracy based streaming services. The fact that these services are free make it one of the biggest market risks to Netflix and could adversely impact its business."}, {"type": "sentence", "content": "Netflix enters into multi season deals with other studios and producers, which poses a unique risk as Netflix’s revenue is largely subscription based and Netflix could have financing issues if memberships fluctuate. Furthermore being locked into multi year contracts limits its ability to adapt to the rapidly changing market."}, {"type": "sentence", "content": "In terms of global distribution of revenue, the biggest chunk comes from US & Canada at 10 billion, no surprise there. The next highest chunk comes from Middle East, Europe & Africa at about 5.5 billion. While Latin America and Asia & Pacific contribute about 2.7 and 1.5 respectively. For 2019, this total revenue was 20.1 billion USD."}, {"type": "sentence", "content": "Netflix’s entire annual revenue as of 2019 breaks into 5 categories:"}, {"type": "sentence", "content": "We figured that Netflix’s full time payroll must be between 1.3 to 1.8 billion annually. Based on the above breakdown, it’s not clear how this gets divided up. But after all the cake and watermelon, Netflix has a profit of 2.6B before taxes and deductions. While the after tax and interest payments is 1.8B, which yields an earning of around 4$ per share. Netflix shares are trading at 429, amid the volatile market fluctuations Netflix has just surpassed Disney in terms of evaluation. Netflix is now worth 187 billion."}, {"type": "subtitle", "content": "Your Video is Buffering"}, {"type": "sentence", "content": "For years Netflix was the biggest user of global internet bandwidth. You can imagine all those millions of users endlessly watching seasons and seasons of HD or 4K video. But in 2019, it has taken second place right after “HTTP media streaming”. HTTP media streaming represents primarily TV channels and cable networks delivering their own on air streaming online. At 12.9% of the internet bandwidth, Netflix is still ahead of third place video streaming provider YouTube."}, {"type": "sentence", "content": "During short peak periods, Netflix is even known to use almost half of all internet bandwidth. From an engineering perspective, it’s an incredible feat that Netflix can offer such high quality streaming to users all the time. Hardly no one ever has issues with Netflix streaming, at least due to Netflix’s fault. These days, if you have issues, it’s probably some connectivity issue on your device or with your Internet Service Provider."}, {"type": "sentence", "content": "But the streaming wasn’t always this good. In fact, in 2008 Netflix was having constant issues delivering reliable streams to users. This is way before mass adoption, way before millions of hours of streaming. Even at the inception of the streaming service, with only a few million users, it was clear that Netflix’s old system couldn’t deliver the service level agreement that it wanted to uphold."}, {"type": "sentence", "content": "One of the highest priorities for many essential service providers is the availability of the service. Just like emergency rooms are available 24/7 through the scheduling of employees. Computer systems like data centers and Netflix have to be available for service all the time. This feature of a system is called High Availability."}, {"type": "sentence", "content": "Frequent service outages that early Twitter and Netflix frequently displayed were annoying to users and could have lead to rapid subscription and usage drop off if not handled quickly and permanently. Netflix was using a monolithic system that had a single point of failure, and in order to diagnose and fix it, it had to keep the server down for days. So it decided to make their service distributed in an effort to make it highly available. To accomplish this Netflix switched to what is called the microservice architecture."}, {"type": "sentence", "content": "As you can imagine, just like the early days when video rental stores would have peak business during non work hours, Netflix’s current service demand “peak and valley” throughout the day. During the wee hours of the morning only a few million people might be watching whereas during peak times between 7 and 9 pm, most of the 60 million US subscribers might be tuning in. This presents an opportunity for the company to save money."}, {"type": "sentence", "content": "The ability to scale your service up and down based on usage demand is called scalability. If one server instance can serve 1 million users, there’s no need to have 100 of them on, when they’re not needed, during off times. But this does require the system to be able to detect demand and spin up new instances quickly to meet demand."}, {"type": "sentence", "content": "Being able to meet the demand exactly where it is quickly is one of the many indicators of a highly efficient system. Another feature that Netflix’s distributed system has is high fault tolerance. In the early days, even a small error could and would shutdown the entire service, whereas now smaller and independent instances limit the exposure of a total system outage. Furthermore, if one or few instance were to go down, as they do all the time, there are mechanisms to create new instances of these specific type of instances so that there’s no service disruption."}, {"type": "sentence", "content": "Netflix users are primarily downloading videos onto their devices, this type of streaming is called downstream bandwidth. To make sure the streams get to users without disruption, Netflix uses CDNs. Content Delivery Networks cache and store videos near the user. For example, if a user from Seattle requests a video, the nearest CDN from California might be serving them, instead of let’s say Australia."}, {"type": "sentence", "content": "For the internet, the architecture of the CDN serves an important purpose. Instead of putting a giant mall in the middle of the city, you place several small malls in several quadrants of the city and you dynamically allocate the goods in the malls based on demand. By placing data closer to people you can see how that might alleviate traffic you might experience going downtown at rush hour. Away from the internet highways and closer to the streets and avenues."}, {"type": "sentence", "content": "Netflix Tech Blog is one of the best places on the internet to learn how deep and complicated tech can get when applied to specific set of problems. And how Netflix is improving their services currently, often talking about millisecond improvements."}, {"type": "sentence", "content": "All in all, modern Netflix cloud infrastructure primarily aims to reduce the number of things that can break and distribute all responsibilities across multiple instances so that there’s no single point of failure."}, {"type": "subtitle", "content": "Recommended For You"}, {"type": "sentence", "content": "In 2006, Netflix announced a public competition that challenged teams to beat their internal recommendation engine, Cinematch. The Netflix Prize data set included 100 million ratings from half a million users on 18 thousand movies. With an incentive of 1 million to the winning team or individual."}, {"type": "sentence", "content": "The Netflix Prize was part, the desire to improve recommendations and part, marketing stunt. Cinematch was first implemented in 2000, only 1 or 2 years since the company’s inception. Given Reed Hastings specialized in artificial intelligence in graduate school, its no wonder he chose this path for Netflix."}, {"type": "sentence", "content": "There was this overwhelming disappointment in AI research and therefore rapid shrinking of funding in the 70s, 80s and early 1990s. The period called the AI winter. It’s not clear why Reed decided to go and spend his time learning this topic, that was unpopular at the time. Then take his company in that unpopular direction. Especially because the renewed hype in AI and machine learning only came back again around 2012. But what is clear is that Reed Hastings has always made bets on new technologies and more specifically when that technology would be feasible and profitable."}, {"type": "sentence", "content": "He brought the website and DVD to the video rental market, to what was a VCR and physical store with a catalog. He clearly understood the value of recommending movies to a massive user base through data science. Then he guessed when it would be first possible to stream videos, rather than ship them through mail. Then he guessed right that to become a TV brand, Netflix has to offer more and more unique content, and become not just a retailer, but a creator of content."}, {"type": "sentence", "content": "The thing to appreciate is the scoring percentage of Netflix. While Amazon and Google have high scores, they also shoot and miss a lot. Netflix has a very few of those “Swing and a miss” moments. The Netflix Prize could be argued as one of those, since Netflix didn’t end up using the improved winning algorithm due to engineering costs. But at least it succeeded in the marketing goal. After its announcement, the news of the competition, the prize and the company spread through tech blogs and media like a wildfire."}, {"type": "sentence", "content": "The idea behind the Netflix Prize competition was that using their internal linear regression they could achieve 88% accuracy. The prize winning algorithm could achieve 95% accuracy on predicting what users might enjoy watching. These class of algorithms are at most complicated regression algorithms. But the primary reasoning for ditching the improved implementation was because they switched from DVD rental to streaming."}, {"type": "sentence", "content": "It turns out that when people are streaming the mechanism for selecting movies changes as well. Whereas before people had to commit to a few choices with DVDs, in streaming people could sample a couple shows and ditch them if needed. This reduced the frustration people experienced, therefore making the improved recommendation of 8% to 10% not as valuable."}, {"type": "sentence", "content": "The second Netflix Prize competition was announced then cancelled due to privacy concerns. In 2010, a group of researchers reverse engineered and cross referenced the IMDB database with the Netflix anonymized data set and figured out the identities of certain individuals."}, {"type": "sentence", "content": "Does Netflix actually have the fancy Artificial Intelligence or Deep Learning algorithms that reports say they have? It doesn’t seem that way. The Netflix technology blog often writes about impressive cloud infrastructure and video encoding, but nothing on the recommendation front. The Dynamic Optimizer algorithm seems to use some machine learning, but not deep learning. In the end, if there’s no need why force it in?"}, {"type": "sentence", "content": "However the changed dynamic of online streaming, does present another opportunity. People’s selection of the movie depends quite heavily on the thumbnail of the show. So Netflix does personalize the thumbnails for each title, meaning the thumbnail you and I see could differ. And that difference could indicate what attracts us to these titles."}, {"type": "sentence", "content": "The customization doesn’t end there. Which categories you see first and the titles you see first in each category are all indications of what you like or what you’ve been into recently."}, {"type": "sentence", "content": "A typical user also might be adding movies to their list, rating movies and even stopping movies at certain frames. Which all add to Netflix’ interpretation of this user’s viewing behavior and what Netflix recommends and produces next."}, {"type": "subtitle", "content": "Why do we love TV?"}, {"type": "sentence", "content": "Why is it hard for us to remember a random series of words, but if it tells a story we can’t forget the words?"}, {"type": "sentence", "content": "Humanity has been around in this biological form for roughly 30 thousand years. And the printing press came in the last 500. How did we communicate for 29.5 thousand years or roughly 1'200 generations?"}, {"type": "sentence", "content": "All we had were words from our ancestors and parents telling us that tigers were dangerous and that river is not to be crossed. During this time we acquired and adapted to remembering stories and being able to often imagine ourselves in the character’s situation."}, {"type": "sentence", "content": "Then the printing press brought us books. With this new medium, we could suddenly read much longer stories, not just from physically close individuals but from authors on the other side of the continent. The increased length of the medium gave richness and depth to those stories. This form of story telling took away almost all restrictions on length. As we saw longer and longer novels."}, {"type": "sentence", "content": "Then we had motion pictures, that gave us actors, sets and mood-setting music and sound. Just recently we got special effects and the ability to not have to imagine impossible and far away locations and futures. In short, we have been enriching this story telling ritual, coming up with more and more ways to tell stories to each other. And making the story telling more and more immersive."}, {"type": "sentence", "content": "TV series then took away most restrictions on length for the visual story telling media."}, {"type": "sentence", "content": "— Bruce Rosenblum, chairman, Academy of Television Arts and Sciences"}, {"type": "sentence", "content": "Currently we have amazing science fiction series, with high production value spanning several seasons to tell us a story. Studios like Marvel Studios are even taking on more ambitious tasks like building entire Cinematic Universes. Soon we will be able to deliver this to almost everyone on Earth. This level of mass story telling was hitherto undreamt of."}, {"type": "sentence", "content": "On the technology tree, we’re also seeing developments in audio media and video games as well. There are podcasts and audio-books. The video game industry has given us the ability to literally be the characters in the stories and make our own decisions, blurring the line between story and reality."}, {"type": "sentence", "content": "What does the future of storytelling have in store for us? More and more immersion, where not just one but two and possibly even all the senses are involved. That gives us augmented and virtual reality movies and games."}, {"type": "sentence", "content": "Based on Netflix’s history and trajectory, it’s clear that it intends to go global, producing more diverse content in more languages. Netflix is not afraid to experiment with new ideas, like the choose your own story with multiple films. It’s not hard to imagine as AR and VR take on mass adoption — Netflix could be one of the first companies to experiment and find the most optimal path forward in these new media."}, {"type": "sentence", "content": "Netflix has distribution covered and has production covered. But could it do theatrical releases? Not according to Ted Sarandos. The movie-going experience is great but his bet is that convenience beats going to crappy theaters 9 times out of 10."}, {"type": "sentence", "content": "Is Netflix going to change the movie business to the point that it takes movie theaters out of business? Not anytime soon. Just the US box offices rake in 10 billion easily every year. Even though Netflix’s 20 billion is double the size, as with all things, big industries, like anything that’s big that has momentum, don’t tend to die out just overnight."}, {"type": "sentence", "content": "Given that, movie theaters we’re accustomed to, came into prominence around the early 1970s, is it possible that they last another 50 years? One of the main reasons that we go to the movies is immersion. It offers a big sound and a bigger screen. Another reason is movie-going is a social activity. With technology, we’re seeing that almost everyone can have a decent home theater for cheap and stream 4K movies. If a viewer wants to make it social they just invite their friends or go to someone’s house. There are newer services like Netflix Party that make it digitally social."}, {"type": "sentence", "content": "At this point, one of the only reasons that people go to movies is because the movie they want to see is only released in theaters. Movie theaters generally have to offer more to keep attracting people and the expensive snacks are not helping their case. There is common hearsay that says movie theaters don’t really make much money on tickets, rather they make the large portion of their money on snacks. If that’s true, that’s an inferior business model that might struggle to stay alive in the evolution of the market. The box office industry has been on the decline over the past 20 years and it seems like it’s a giant that’s slowly dying. On the opposite end of the spectrum Netflix seems like a healthy, growing organism in the ecosystem of the entertainment industry."}, {"type": "subtitle", "content": "Other Articles"}, {"type": "subtitle", "content": "Sources"}], "topic": "business"}