{"title": "How to wake up before your life is over", "data": [{"type": "image", "content": "https://miro.medium.com/max/3760/1*TkPEDnF-Y-PYB8JMHYHqsw.jpeg"}, {"type": "subtitle", "content": "Mindfulness gets me out of my head and into the present moment, the only place that real life is happening."}, {"type": "sentence", "content": "Why should you give a damn about mindfulness? Because life sucks without it."}, {"type": "sentence", "content": "Think of the last time you talked to a friend who really listened. Or explored a new city. Or had great sex. There was nowhere else to be and nothing else to do. You were present, vulnerable, and connected, and you felt fully, deeply alive. You paid attention without judging your experience, comparing what it was to what it should be like. You were mindful."}, {"type": "sentence", "content": "Contrary to the hype about mindfulness, you don’t need to buy it, read about it, or go out and get it. You can be mindful right now, as you can be at any moment. Meditation isn’t practicing how to be mindful. It’s practicing how to let mindfulness happen on its own."}, {"type": "sentence", "content": "Now think about pretty much every other moment of your life. Something felt off. Your body was tense, and you didn’t even know it. You wanted to be somewhere else. You had the sense that if only you had more money, lived in a different place, had a different job, then you’d finally be happy."}, {"type": "sentence", "content": "Let’s call that mindlessness."}, {"type": "sentence", "content": "You know when you copy and paste something, but you get sidetracked by a Facebook notification, forget about what you had copied, and then think, wait, what was I doing?"}, {"type": "sentence", "content": "You know when you have 150 unread emails, six texts, 10+ Facebook notifications, and two missed calls?"}, {"type": "sentence", "content": "You know when a friend is telling you how much their hurting after losing their job or getting dumped, but you’re thinking of what to say and miss what they said?"}, {"type": "sentence", "content": "That’s mindlessness."}, {"type": "sentence", "content": "The mindless mind thinks about one thing, then thinks about another, then thinks about another, then thinks about another… Like a teenager on YouTube, it flips through related videos without spending much time on any particular one."}, {"type": "sentence", "content": "When you’re mindless, you plan what to make for dinner and the thought of roasted chicken reminds you of what you ate at Brittany’s birthday last weekend, which reminds you of that awkward conversation with Brittany’s new boyfriend, which makes you think you’re a socially awkward person, which…"}, {"type": "sentence", "content": "If you’re like me, that should sound familiar. I’m almost constantly planning the rest of the week, worrying what someone thinks of me, ruminating about how screwed up our society is, rehashing old conversations, rehearsing future conversations, evaluating whether I’m having a good day, and on and on. I wake up and fall asleep scatterbrained every single day."}, {"type": "sentence", "content": "Unless I meditate. If I spend 20 minutes sitting in silence, noticing the movement of my breath, feeling bodily sensations, listening to sounds, most of the time calms my mind."}, {"type": "sentence", "content": "Not because I stop thinking. It’s a misperception that meditation “clears” the mind. Because I’m more aware that my thoughts are just thoughts. They’re not reality — they’re not as real as the breeze on my skin, the smell of coffee, the welling up of love in my chest."}, {"type": "sentence", "content": "That’s mindfulness. That’s, as scientist Jon Kabat-Zinn puts it, “awareness that arises through paying attention, on purpose, in the present moment, non-judgmentally.” That’s what it feels like to be alive in the body, not living inside the boundaries of limiting thoughts about how life should or shouldn’t be."}, {"type": "sentence", "content": "I remember the first time I got a whiff of pure, unadulterated mindfulness. A young Nepalese Buddhist monk named Tsoknyi Rinpoche guided about 200 of us through meditation and then talked about how mindfulness helps calm overwhelming emotions. Right around the first sentence, when he said something about “essence-love,” I tuned out. Looking around the airy sanctuary of a Unitarian Universalist church in fancy Bethesda, Maryland, I thought — I’m better than these people. I don’t need this hipster, rich people stuff. I’m normal."}, {"type": "sentence", "content": "But then Rinpoche joked about the poor quality of Indian hotels: “By the way, if you go to India, either stay in the cheapest hotel or a five-star hotel. Because the cheapest hotel is also no good.”"}, {"type": "sentence", "content": "The muscles around my eyes loosened and my mind refocused. This monk, sporting metal-rimmed glasses and a fresh buzzcut, was normal, too. The judgmental thoughts I’d been absorbed in were now sounding at a distance, like the voice of a younger me. Mindfulness was giving me a choice whether to follow my mind’s every whim."}, {"type": "sentence", "content": "Instead of following those thoughts or checking Facebook or walking to the bathroom — my usual tactics of escape — I decided to re-engage and listen, which paid off. Rinpoche would go on to tell a story that’s been helpful to me at numerous times in my life, which I’ve written about."}, {"type": "sentence", "content": "Simply put, it feels good to be mindful. Sights are more vivid, smells more vibrant, sounds more spacious, tastes livelier, feelings deeper. In other words, mindfulness gets you out of your head and into the present moment, the only place that real life is happening."}, {"type": "subtitle", "content": "Get my free ebook on meditation"}, {"type": "sentence", "content": "My ebook, How to Get Out of Your Head, will help you start or stick with a regular meditation practice. Get it for free here."}, {"type": "subtitle", "content": "Listen to my podcast"}, {"type": "sentence", "content": "On Meditation for the 99%, I take mindfulness out of faraway monasteries, expensive retreat centers, and Corporate America, and bring it to work, relationships, and, especially, politics. Listen everywhere podcasts are available."}], "topic": "mindfulness"}