{"title": "Dissecting 28 years of European pharmaceutical development", "data": [{"type": "subtitle", "content": "Data Journalism"}, {"type": "subtitle", "content": "An exploration of data scraped from the European Medicines Agency (EMA)"}, {"type": "image", "content": "https://miro.medium.com/max/5946/0*ZZpK1iEkKTTUz_F4"}, {"type": "sentence", "content": "Since the discovery of antibiotics, the availability of new drugs has substantially improved our lives. Drug development requires high investments that come with high uncertainty because we need to logically prove the safety and efficacy of new drug candidates before being freely administered in humans. Thus, pharmaceutical companies need to find a way through society’s health needs, international legal frameworks, and business motivations to succeed."}, {"type": "sentence", "content": "The European Medicines Agency (EMA) is the official regulator that directs drug development and decides whether to authorize marketing a new drug in Europe or not. In their webpage, they store information on every approved medicine and its corresponding marketing authorization holder (MAH) company."}, {"type": "sentence", "content": "To better understand the strategies implemented by successful European biotech companies and the EMA to keep developing new useful pharmaceuticals, I performed an exploratory analysis using information that I had previously scraped from EMA’s webpage on their 1222 drugs."}, {"type": "subtitle", "content": "EMA’s effective advocacy of orphan drug development"}, {"type": "image", "content": "https://miro.medium.com/max/3600/1*wOVlCD80N9Sz_YDxSI7bXQ.png"}, {"type": "sentence", "content": "According to the EMA, a drug acquires the “orphan designation” status when it is “intended for use against a rare condition”. Unfortunately, due to the small number of people that suffer from these diseases, they are likely to be disregarded as they represent a small market. In 2000, the EMA established a series of incentives (see regulations) for those companies who endeavour to develop orphan drugs giving an economic interest to those therapeutic areas with a high risk of being neglected. Basically, they offer a special treatment that speeds up the bureaucratic part of the process and cuts down its overall cost. Indeed, we immediately see the effectiveness of this policy as the number of approved orphan drugs has steadily increased since then. Obviously, we cannot see how many equivalent-to-orphan drugs had been approved before their definition but the trend seems clear."}, {"type": "subtitle", "content": "Complex and prevalent diseases retain pharma’s interest"}, {"type": "sentence", "content": "From the 414 different therapeutic areas for which the EMA has granted marketing authorizations, almost 20% of the approved drugs try to tackle only the 9 diseases listed in the figure below."}, {"type": "image", "content": "https://miro.medium.com/max/3600/1*yeMJwjUyTHeajdiTdm-QPg.png"}, {"type": "sentence", "content": "What do all these diseases have in common? Their biological complexity; they are caused by multiple factors that can be very diverse across the population. Thus, the lack of a complete understanding of how they work makes it extremely hard to discover and develop drugs that fit for many patients. On the other hand, do pharmaceutical companies chose which disease to tackle only by their complexity? Probably, as mentioned above, they also take into account the number of people suffering from these conditions, which represents both the social impact of the disease itself and the market size for the drug. For example, the fact that, in 2018, 34.2 million US-citizens had diabetes, from which at least 90% of the cases correspond to type 2 diabetes may explain why most approved drugs are indicated for treating it. Especially for complex diseases, we expect to see these constant attempts to develop new and better drugs to enter a large market and be able to increase market share. It seems to be a win-win situation."}, {"type": "sentence", "content": "Out of curiosity, I further investigated what caused the peak in myocardial infarction drugs between 2005 and 2010. It was caused by the approval of 28 different generic drugs based on clopidogrel."}, {"type": "subtitle", "content": "Drug development strategies of successful companies"}, {"type": "sentence", "content": "The number of approved marketing authorizations held by a pharmaceutical company can be considered as a measure of success since it indicates how well each company could navigate through the drug development process."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*lW_CU0Qqwqc9TMtfLTy19A.png"}, {"type": "sentence", "content": "The well-known Novartis approved 59 drugs with a rate of almost 3 drugs per year, from which none of them were generic. Conversely, Accord, the second pharma with the highest approval rate, approved 16 drugs in only 7 years. But, most of them (15 out of 16) were generic, which implies fewer studies and requirements than developing a completely new medicine. These were two examples of two very different strategies: Novartis has fully opted for innovation while Accord has opted for manufacturing many generics while developing fewer new drugs."}, {"type": "subtitle", "content": "Diversify or die, really?"}, {"type": "sentence", "content": "One common practice of venture capitalists is to diversify investments in order to spread the risk. Similarly, pharmaceutical companies have to choose which diseases they want to tackle."}, {"type": "image", "content": "https://miro.medium.com/max/4200/1*ApCdpGHgDi4GdDEsUqJO6g.png"}, {"type": "sentence", "content": "Developing drugs for different therapeutic areas ensures taking shares in many markets. We see how companies with a high approval rate and a high number of total approved drugs also own drugs involved in many therapeutic areas, which may be mostly related to the business side of drug development."}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*PinJnyYWRGWE-4WwNgNOvg.png"}, {"type": "sentence", "content": "In fact, most pharmaceutical companies choose to develop the same proportion of drugs than therapeutic areas or choose drug candidates with multiple indications. Then, after the approval of the medicine for the first indication, they do not need to go through the whole process again necessarily and increase the profits."}, {"type": "sentence", "content": "Not surprisingly, few companies have specialized in developing drugs for the same indications since it is a risky “business choice” that relies on the number and quality of competitors."}, {"type": "sentence", "content": "However, diversification of the therapeutic areas may become a double-edged sword. On the one side, finding new indications for approved drugs -also known as “drug repurposing”- maximizes and recycles the resources spent to go from bench to bedside and allows to increase the pool of available treatments for many diseases, which can help to cope with disease co-morbidities and secondary effects. On the other side, in the case that a drug cannot be repurposed, most biotech companies may have to start over developing new drugs that tackle different diseases in order to stay in business. Consequently, instead of leveraging their expertise, they may “repurpose” their trained teams to focus on a new, different aim and lose part of the experience acquired in the previous therapeutic area."}, {"type": "sentence", "content": "Diversification might slow down the overall advances in drug development to fulfill the business requirements. Nevertheless, what are the alternatives to the current model? Can we change it?"}, {"type": "subtitle", "content": "Exploratory Data Analysis with R"}, {"type": "sentence", "content": "For those who may wish to reproduce or further analyze these data."}, {"type": "subtitle", "content": "0. Load required libraries:"}, {"type": "subtitle", "content": "1. Prepare and wrangle data:"}, {"type": "subtitle", "content": "2. Summarize data:"}, {"type": "subtitle", "content": "3. Make figures:"}], "topic": "data-science"}