{"title": "What Does It Mean When Google Says It’s Carbon Neutral? And How?", "data": [{"type": "subtitle", "content": "Theciva"}, {"type": "subtitle", "content": "How Google keeps its power-hungry operations eco friendly."}, {"type": "image", "content": "https://miro.medium.com/max/1050/1*Zda8NKrMKdSmjj44cIh7gA.jpeg"}, {"type": "sentence", "content": "Consider some estimations by Google:"}, {"type": "sentence", "content": "Now multiply these numbers with these stats:"}, {"type": "sentence", "content": "I’ll leave it up to you to figure it out."}, {"type": "sentence", "content": "Those were some stats from three of Google’s most famous services — Search, YouTube and Gmail. These services store tons of user data — like emails, search history, videos on YouTube among others — on the cloud. The cloud here means one of Google’s 15 Data Centres across the globe."}, {"type": "sentence", "content": "Data centres are super power-hungry. They consume an estimated 200 terawatt-hours (TWh) power each year."}, {"type": "image", "content": "https://miro.medium.com/max/1570/1*EuTL48quBLtH4YwEy5mczg.png"}, {"type": "sentence", "content": "Despite so much power consumption, Google remains Carbon Neutral with their best in the class data centres and AI and ML. Google says their data centres consume the minimum power possible."}, {"type": "subtitle", "content": "What Does Carbon Neutral Mean?"}, {"type": "sentence", "content": "Being carbon neutral means a company has brought its net carbon — and other greenhouse gases including methane — emissions down to zero. This is done by investing in carbon offsets."}, {"type": "sentence", "content": "A carbon offset is an investment in an activity that reduces carbon emission."}, {"type": "sentence", "content": "Understand it this way: Google is awarded a carbon credit that denotes how much they have invested in carbon offsets, which means how much carbon they’ve prevented from entering into the atmosphere. These credits are verified by a third party. One credit equals one metric ton of carbon dioxide prevented from entering the atmosphere."}, {"type": "subtitle", "content": "How Can A Company Be Carbon Neutral?"}, {"type": "sentence", "content": "To be carbon neutral, a company needs to invest in carbon offsets to balance its inevitable carbon emissions. There are two ways a company can do that."}, {"type": "sentence", "content": "First, by minimizing (or if possible, eliminating) carbon footprints. A company can invest in renewable sources of power, reduce travels, and reuse recycled products."}, {"type": "sentence", "content": "But not always can you eliminate carbon emissions totally. So instead, you can invest in high-quality carbon offsets. This is the second way."}, {"type": "sentence", "content": "For example, take a hypothetical case of a Google data centre located in an area where renewable power sources are scarce. And there’s no future possibility of renewable energy sources. In such a case, Google, in order to maintain its title of being carbon neutral, can invest in any other way to prevent greenhouse gas emissions. Like, say there’s a large animal farm nearby. Animal wastes from that farm emit methane, a particularly potent greenhouse gas that’s more than 20 times as harmful as carbon dioxide. So, Google can invest in a project that allows the farm to collect the waste and process methane out of it."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*1AfrNVR7e1JJD6h197mxrg.jpeg"}, {"type": "sentence", "content": "Since here Google prevented a greenhouse gas from emission, it earns credits that balance the emissions from the data centres and thus make it carbon neutral."}, {"type": "subtitle", "content": "Carbon Positive Is The Word Or Carbon Negative?"}, {"type": "sentence", "content": "Some brands proudly say their product is Carbon positive, which should mean the opposite of carbon negative. But no, why’d they mention it proudly on their website that their products come with a hefty price tag to the environment? That’s just one of some other terms similar to Carbon neutral. And you should know them."}, {"type": "subtitle", "content": "Google’s Circular Economy Model"}, {"type": "sentence", "content": "Kate Brandt, Google’s sustainability officer, is obsessed with one idea: “circular economy” which aims to eliminate waste."}, {"type": "sentence", "content": "This idea is what eight-year-olds are taught in schools — Reduce, Reuse And Recycle."}, {"type": "sentence", "content": "An article on Google’s Sustainability blog, tells how today’s economy is linear. Products have a beginning when they’re made from raw resources and come to an end customer who eventually throws them to trash, making useful resources unusable. As demands of industries outgrow what Earth can provide in a year, the need to focus on changing this economy has increased."}, {"type": "sentence", "content": "Chris Adam, Google’s Supply Chain Manager believes that a strong foundation for reusability on a product begins at the design stage. They have to be made to be quite literally made again. He says, “The challenge is to design products and technology with regeneration in mind right from the beginning, without ever sacrificing performance.”"}, {"type": "sentence", "content": "So when a server at a Google’s data centre requires repair, they’re replaced with refurbished parts from old Google servers, that gives hard drives an extended useful life. In 2017, 18% of Google’s new servers were made from reused previous ones. The company also sold 2 million used machines to other companies, after wiping their data."}, {"type": "sentence", "content": "Hard drives, that can be no more used, are sent for recycling only after it’s made sure several times that the data is wiped."}, {"type": "subtitle", "content": "Efficient Data Centres"}, {"type": "sentence", "content": "Google relies on Artificial Intelligence and Machines Learning — things they’re great at — to minimise power usage for cooling data centres. They design the components for their servers all by themselves to maximise efficiency and minimise power usage and environmental impacts."}, {"type": "image", "content": "https://miro.medium.com/max/1200/1*FqymPrKEMrGwI2-TQtnoUA.jpeg"}, {"type": "sentence", "content": "Google says that the efficiency of their servers allow them to cater to a large audience with fewer numbers of data centres. They say they share their technology to everyone to benefit from."}, {"type": "subtitle", "content": "Buying renewable Energy"}, {"type": "image", "content": "https://miro.medium.com/max/2156/1*78YpMnJ7qI0ZR3kgSNZD2Q.jpeg"}, {"type": "sentence", "content": "Google matches 100% of its energy use with renewables. This has long been an effort to offset all the energy used by its data centres, but it was only in 2017 when Google could buy enough renewable energy to do so."}, {"type": "sentence", "content": "~ Urs Hölzle, Senior Vice President, Technical Infrastructure, Google."}, {"type": "sentence", "content": "Now it’s time that we have a look at some other big brands to see how they take up the Carbon neutrality approach."}, {"type": "subtitle", "content": "Amazon Pledges To Be Carbon Neutral By 2040"}, {"type": "sentence", "content": "Amazon has not yet been Carbon neutral. And they’ll take a long time to get at that point. Amazon has become the first signatory of the Climate Pledge. All companies that sign this pledge have to measure and declare their carbon emissions regularly."}, {"type": "sentence", "content": "Among some other sustainability goals, Amazon has pledged to be Carbon neutral by 2040. Which to be honest is a very very long time."}, {"type": "subtitle", "content": "Microsoft Aims To Be Carbon Negative By 2030"}, {"type": "sentence", "content": "Microsoft plans to be Carbon negative — meaning they’d remove more carbon from the environment than they emit — by 2030. According to Microsoft, they plan to shift to 100% renewable energy for their data centres, campuses and other buildings by 2025."}, {"type": "sentence", "content": "Even further, they plan to remove their previous carbon emissions by 2050."}, {"type": "subtitle", "content": "Apple Runs On 100% Clean Energy Since 2018"}, {"type": "sentence", "content": "In 2018, Apple announced that all of its retail stores, data centres and corporate offices in 43 countries, including India, now run on 100% clean energy. Apple’s data centres have been powered by 100% solar energy since 2014."}, {"type": "image", "content": "https://miro.medium.com/max/3520/1*nmUEoayTFHq1L2JLpV9e8w.png"}, {"type": "subtitle", "content": "Get Free Theciva Newsletters"}], "topic": "business"}