{"title": "Goodbye, Things: 15 Decluttering Tips That Proved To Be Useful", "data": [{"type": "subtitle", "content": "Taking my first tentative steps into the world of new Japanese Minimalism"}, {"type": "image", "content": "https://miro.medium.com/max/1280/0*UTST0UkAoLEChVNJ"}, {"type": "sentence", "content": "I borrowed the audiobook version of Goodbye, Things: The New Japanese Minimalism by Fumio Sasaki for inspiration. Halfway through the audiobook, I got so inspired I started saying goodbye to some things."}, {"type": "sentence", "content": "How can I not? It came with 70 tips for decluttering!"}, {"type": "sentence", "content": "The book is about his journey in minimalism and how it transformed his apartment, his thinking, and his actions. He stopped being lazy, stopped comparing himself with others, and cleaning his house became enjoyable. Imagine that! Minimalism basically freed him."}, {"type": "sentence", "content": "The following are tips I gathered from the book and applied to my decluttering session. So if I applied it a little different from the way he meant it, please excuse me!"}, {"type": "subtitle", "content": "1. Discarding is a skill."}, {"type": "sentence", "content": "According to Fumio Sasaki, decluttering is a skill that takes time to develop, and I agree. Even after a few rounds of decluttering, there are still things I know I should’ve gotten rid of."}, {"type": "sentence", "content": "Did you think that minimalists shouldn’t have excess things to get rid of? I can’t speak for anyone else, but I do. When we live, we accumulate and outgrow things."}, {"type": "sentence", "content": "Minimalism can be a one-off thing, but most of us will probably need to “weed our garden” every once in a while."}, {"type": "sentence", "content": "However, it’s okay that my progress is slower different because minimalism is a very personal journey and there’s plenty of room for differences."}, {"type": "sentence", "content": "As expected, it was difficult at first. I was mostly rearranging things rather than getting rid of them. Luckily, I had his tips."}, {"type": "subtitle", "content": "2. Start with junk."}, {"type": "sentence", "content": "Start your decluttering sessions clearing junk and the rest will come easier."}, {"type": "sentence", "content": "The first thing I got rid of was a sample of sunscreen that has expired. Then I got recycled the box my phone came in because it has been 6 months."}, {"type": "sentence", "content": "Just like that, I started decluttering."}, {"type": "subtitle", "content": "3. Get rid of multiples."}, {"type": "sentence", "content": "I also got rid of multiple yarn labels, you can say these are junk too. I keep yarn labels to know what hook to use for each type of yarn, but I really only needed to keep one for different colored yarn of the same weight."}, {"type": "sentence", "content": "In addition, I recycled 2 mostly-used notebooks. I try not to be wasteful when decluttering, but no one needs 4 half-used notebooks. They are clutter."}, {"type": "subtitle", "content": "4. Discarding memorabilia isn’t discarding memories."}, {"type": "sentence", "content": "My first visit to the States was like a big Greyhound adventure. Somewhere in California, I bought a vintage-looking brown floral dress with a pixie skirt and three-quarter sleeves. I love it so much I wore it out."}, {"type": "sentence", "content": "Every time I thought about getting rid of it, I remember that awesome trip and I just can’t do it. It’s silly because I’ll remember that trip whether I have the dress or not."}, {"type": "sentence", "content": "More on the dress later."}, {"type": "subtitle", "content": "5. Let go of the person you were."}, {"type": "sentence", "content": "I got very intrigued by felting a couple of years ago, so my partner got me a felting kit. I completed a project but haven’t felted since. The person who was interested in felting was gone."}, {"type": "sentence", "content": "Honestly, I don’t like to admit that. I’ve given up too many hobbies over the years and it’s associated with the feeling of failure. Well, it isn’t a failure."}, {"type": "sentence", "content": "I simply know that to get really good at felting, I’ll need more interest (and time) than I currently have. So, it was time to let go of that person who was curious about felting and let go of the kit."}, {"type": "sentence", "content": "This way I free up mental space for my current hobbies. Cheers to focused attention!"}, {"type": "subtitle", "content": "6. Don’t buy it because it’s cheap, and don’t take because it’s free."}, {"type": "sentence", "content": "I made both mistakes in Singapore. I bought a tiny notebook thinking I can use it for my daily to-do lists. It was only a dollar, so I bought it. I haven’t used it 2 months later — a classic impulse buy."}, {"type": "sentence", "content": "My mom has a bunch of crystals back home, and in her stash was a cute little clear quartz crystal ball. I adopted it."}, {"type": "sentence", "content": "These are little things and I kept them both, but if we don’t watch these impulses and just go crazy buying cheap things or taking free things, things can accumulate pretty quickly."}, {"type": "subtitle", "content": "7. Don’t get creative when decluttering."}, {"type": "sentence", "content": "I definitely get creative when I declutter. I had a bunch of keyrings and chains that I’d saved for many years for when I get creative — I had taken these out of old unwanted keychains."}, {"type": "sentence", "content": "This time around, I finally got around to getting rid of it. Even as I threw them away, I felt the tugging — I can crochet a little toy and attach it to the keyring!"}, {"type": "sentence", "content": "Well, if I hadn’t made a key chain in the last three years, I wouldn’t be making a key chain anytime soon."}, {"type": "subtitle", "content": "8. Get rid of it if you haven’t used it in the past year (unless they’re emergency items)."}, {"type": "sentence", "content": "The keyrings were a great example of this point. Somehow, I had developed a blind spot around them throughout the rounds of decluttering because I knew I could use them for something. But I forgot how long they’ve been lying untouched in my pencil case."}, {"type": "sentence", "content": "I also kept a faulty mouse just in case I needed it. I haven’t used it in more than a year because I have a trackpad! So out that goes too. Same with a book I meant to read but never did… Out."}, {"type": "subtitle", "content": "9. Let go of the idea of getting your money’s worth, and 10. Be quick to admit your (purchasing) mistakes."}, {"type": "sentence", "content": "In accounting, there’s a term called sunk cost. It describes a cost that has been incurred and can’t be recovered. It’s a done deal and the best thing to do with it is to move on."}, {"type": "sentence", "content": "I’m interested in lettering. Did I tell you I’m a serial hobbyist? So, I bought a book that’ll teach me more about the craft, and possibly turn it into a business."}, {"type": "sentence", "content": "I skimmed through it and quickly realized it’s not for me. Yet, I held on to the book because, well, I spent on it. I thought I should read it anyway to get my money’s worth, but I’m simply not interested enough."}, {"type": "sentence", "content": "Isn’t it funny how we try to make ourselves do something just because we spent money or time on it? Forcing myself to read it would’ve been a waste of my time on top of the money I spend."}, {"type": "sentence", "content": "I made a mistake, it’s time to move on and let someone else have the book!"}, {"type": "subtitle", "content": "11. If it’s not a “hell yes!”, it’s a “no”."}, {"type": "sentence", "content": "If someone had asked me if I’ll keep my Klean Kanteen insulated bottle which I’d forgotten to bring back to the States, I’d have said “hell yes!”."}, {"type": "sentence", "content": "This tip is a lot like the “spark joy” method. I find that they aren’t that applicable to less exciting things like scissors, clocks, lamps, etc. I’m not going to say “hell yes!” to those things, I’ll say “yes” because I need those things."}, {"type": "sentence", "content": "For non-essential things you aren’t sure you want to discard, it could come in handy."}, {"type": "sentence", "content": "I have 2 bracelets that good friends gifted to me years ago. Not being a jewelry person, I don’t wear them. I kept them for special occasions and because they reminded me of my friends."}, {"type": "sentence", "content": "When I asked myself if I still want to hold on to them, the answer wasn’t “hell yes!”. So, goodbye bracelets! I still love my friends though."}, {"type": "subtitle", "content": "12. Discard even if it “sparks joy”."}, {"type": "sentence", "content": "Many years ago, a good friend got me a keychain during her vacation. I’m usually not a fan of such souvenirs, but I love this keychain because it was a little wooden frame that featured the cut-out of a black cat under an acrylic panel."}, {"type": "sentence", "content": "It was small and quaint and reminded me of my black cat, Paige."}, {"type": "sentence", "content": "I used it the moment she gifted it to me, and years later, it has gotten very worn. The acrylic panel went missing a while back, the sides of the wood are worn thin and smooth. Both eyes, which was stuck on, fell off, and now its tail was coming off."}, {"type": "sentence", "content": "It still sparked joy, but I also recognize that it has gotten too worn. So I discarded it after I bid it a happy goodbye. I’ll always remember it."}, {"type": "sentence", "content": "I think I’ll be able to part with more items that spark joy from now on."}, {"type": "subtitle", "content": "13. If you’ve thought about discarding it for 5 times, discard it."}, {"type": "sentence", "content": "Earlier in the story, I mentioned the floral dress I bought during my first trip to America."}, {"type": "sentence", "content": "I wore it so much the elastics around the torso snapped off, and the undersides of the sleeves were tearing. The damages weren’t visible, but the fabric has taken on a washed-out look."}, {"type": "sentence", "content": "I’ve thought about tossing it so many times but never had the heart to."}, {"type": "sentence", "content": "In his book, Fumio Sasaki mentioned that thoughts are chains. There aren’t thoughts that are solitary. So thinking about discarding something is never just one thought."}, {"type": "sentence", "content": "Each time I thought about discarding the dress, I think about “losing” a piece of a good vacation. I think about the snapped elastics, the fraying fabric at the armpits, and the constant adjusting because of the worn elastic… Yet, I’ll argue that I’ll never find anything that fits me as well in this style again. So I put it back in the closet."}, {"type": "sentence", "content": "Sometime later, I’ll think about discarding it again. And the same thought process takes place."}, {"type": "sentence", "content": "We all know attention is a finite resource at any one point. I have better use for my attention, so… goodbye, dress!"}, {"type": "subtitle", "content": "14. Keep the gratitude, not the item. And15. If you can’t remember how many presents you’ve given, don’t worry about the gifts you’ve gotten."}, {"type": "sentence", "content": "The hardest things to part with are still things gifted to me that I like but have no use for. Guilt is a nasty thing. I feel like I’m hurting the giver. Are they going to understand why I’m so particular about my possessions?"}, {"type": "sentence", "content": "Fumio Sasaki wrote that it’s hard to keep track of what we gift to our friends over the years, so there’s no reason to worry about offending the person who gave us the gift we’re thinking about discarding."}, {"type": "sentence", "content": "Do you care what happened to the present you gave your friend 2 years ago?"}, {"type": "sentence", "content": "If he had given a friend something that proved to be useless, he wouldn’t want that friend to hang on to it too. Besides, true friendships/relationships transcend material objects."}, {"type": "sentence", "content": "I agree."}, {"type": "sentence", "content": "So keep the gratitude, not necessarily the item, unless you love it. The way I love my Klean Kanteen bottle — it was a gift from friends. I’ll hang on to it for life. It seems indestructible after all."}, {"type": "subtitle", "content": "Honorable mentions"}, {"type": "sentence", "content": "The following are tips I found useful but didn’t need to use this time around."}, {"type": "image", "content": "https://miro.medium.com/max/624/0*vAVibglOpbrLyKdI"}, {"type": "sentence", "content": "There are still 50 other tips in Goodbye, Things. So if you want to check it out, you’ll learn a lot more! I did."}, {"type": "sentence", "content": "For instance, I can be more principled! I break a lot of “rules”."}, {"type": "sentence", "content": "I keep things that don’t have a use — like my tiny collection of crystals and rocks. Things I haven’t used in a year, like pendants. They’re “hell yeses” at the moment."}, {"type": "sentence", "content": "I don’t digitize all my photos and cards because I like the feel of the physical thing. But I do curate what I keep."}, {"type": "sentence", "content": "The room to be different is part of what I love about minimalism. We’re supposed to find our own minimalism. Unlike other interests, I’ve never felt like this is a competition, and it isn’t. It’s super personal and personalized."}, {"type": "sentence", "content": "At the end of the day, minimalism is all about eliminating distractions and becoming more mindful. This way, we can live our lives more purposefully."}, {"type": "sentence", "content": "It’s pretty damn awesome."}, {"type": "sentence", "content": "Originally published at https://darkbluejournal.com on May 13, 2020."}], "topic": "mindfulness"}