{"title": "How Much YouTube Paid Me for My First 5 Videos", "data": [{"type": "subtitle", "content": "From $30 CPM to $80 and more, it highly depends"}, {"type": "image", "content": "https://miro.medium.com/max/10368/1*bTA1yvWAj2HyClz8Rr8R-A.jpeg"}, {"type": "sentence", "content": "As a 37-year-old woman, I never set out with the intention of being a “YouTuber.” I still wouldn’t give myself that title today as I only have five videos uploaded publicly to the platform."}, {"type": "sentence", "content": "In my mind, I considered YouTube to be a place for 20-somethings and teens to post makeup tutorials and lifestyle vlogs, not a place for a Gen X-er with a law license to post comparison videos and tutorials."}, {"type": "sentence", "content": "I was wrong."}, {"type": "sentence", "content": "In late 2017 I wrote a post on my website comparing two popular platforms for creating online courses that I was testing out. I shot a video in my living room with an inexpensive webcam and uploaded it to YouTube so that I could embed it in my article."}, {"type": "sentence", "content": "I created the video as an experiment to see if it would help my article rank higher on Google."}, {"type": "sentence", "content": "At first, the video got a trickle of views on YouTube. Maybe two to ten views per day for the first month after I published it. It was nothing to write home about, so I put it out of my mind and went back to focusing on other projects."}, {"type": "sentence", "content": "In the summer of 2019, nearly two years after posting the video, I logged into YouTube out of curiosity. I found that my first attempt at creating a YouTube video was doing far better than I expected."}, {"type": "sentence", "content": "I signed up for the Google Adsense program in June 2019 so that YouTube would show ads on the video, and I could start earning revenue. This is important to note because the revenue I’m about to show you is only for the last year or so that the video was actually monetized."}, {"type": "sentence", "content": "Had it been monetized from the beginning, the revenue would have been substantially higher."}, {"type": "sentence", "content": "From the screenshot below, you can see that my first video has been viewed 103,600 times since I posted it on October 6, 2017. However, since I didn’t monetize my YouTube channel until June 2019, my revenue is based on about 40,000 views."}, {"type": "image", "content": "https://miro.medium.com/max/5152/1*5N9O0F6L_9eKHVhellq9QA.jpeg"}, {"type": "sentence", "content": "For those 40,000 monetized views, YouTube paid me $1,236.22 for my first video as of the date of writing. I estimate that if the video had been collecting ad revenue from the start, my earnings to date would be closer to $3,000."}, {"type": "subtitle", "content": "Was It a Fluke?"}, {"type": "sentence", "content": "I’ve noticed that the amount that different YouTubers earn from their videos varies wildly. Many YouTubers report CPMs (the amount paid per 1,000 views) in the $1 to $15 range."}, {"type": "sentence", "content": "However, the CPM for this video is $60.62."}, {"type": "image", "content": "https://miro.medium.com/max/4196/1*1jJIn0-2yvlII6pPRvMKHg.jpeg"}, {"type": "sentence", "content": "I started to wonder if it was possible to create more videos with a similarly high CPM or if this was just a one-time fluke."}, {"type": "subtitle", "content": "My YouTube CPM Experiment"}, {"type": "sentence", "content": "In late 2019 I created a series of four videos to put this theory to the test. I wanted to see if I could figure out a formula for creating videos with a high CPM. This would allow me to reach my initial goal of earning $500 per month from YouTube, with only a handful of videos."}, {"type": "sentence", "content": "I assumed that the topic of the video had a lot to do with the higher CPM rate, so I put similar keywords in each title. But I also wanted to experiment with different video lengths."}, {"type": "sentence", "content": "I have always heard other YouTubers say that videos should be at least ten minutes long because this allows YouTube to place “mid-roll” ads in the video. The idea is — the more ads that YouTube shows on your videos, the more revenue you’ll earn."}, {"type": "sentence", "content": "Let’s see how each of the videos performed."}, {"type": "subtitle", "content": "Video #1"}, {"type": "sentence", "content": "The first video of my experimental series, “Can You Sell Courses on Udemy and Teachable?” has a CPM of $79.06."}, {"type": "sentence", "content": "The runtime of this video is 4:53, which does not meet the recommended ten-minute mark for YouTube videos. Therefore, mid-roll ads are not shown in this video."}, {"type": "sentence", "content": "Since I published the video on September 12, 2019, it has earned $145.90 from 3,400 views."}, {"type": "image", "content": "https://miro.medium.com/max/6096/1*LKGggCDH44shK9yuP-GICw.png"}, {"type": "subtitle", "content": "Video #2"}, {"type": "sentence", "content": "The second video of the series, “7 Podcasts to Help You Create Better Online Courses,” has a CPM of $31.59. While this is far better than the average YouTube CPM, it is substantially lower than the rest of my videos."}, {"type": "image", "content": "https://miro.medium.com/max/6124/1*nhDfDPkqiYMDEbrKBuCWJw.jpeg"}, {"type": "sentence", "content": "The runtime of this video is 11:20, so it does meet the “ten-minute mark” rule for maximizing revenue from YouTube ad placement."}, {"type": "sentence", "content": "This leads me to believe that while creating longer videos can increase your revenue overall, maybe it doesn’t have as much impact on CPM as many people think?"}, {"type": "sentence", "content": "I would need to create more videos of varying lengths to test out this theory, but the initial finding is intriguing."}, {"type": "sentence", "content": "Since I published this video on September 17, 2019, it has earned $21.98 from 1,300 views."}, {"type": "subtitle", "content": "Video #3"}, {"type": "sentence", "content": "The third video in the series, “7 Ways to Sell Online Courses That Actually Work” has a CPM of $74.58."}, {"type": "image", "content": "https://miro.medium.com/max/6056/1*ZaP8GRm7Iiuf3gpm5PjMFw.jpeg"}, {"type": "sentence", "content": "This video is much longer than the others with a runtime of 59:38. With this video, I wanted to pack in a ton of value to see what effect that might have on the CPM."}, {"type": "sentence", "content": "While I do get a lot of positive comments on this video based on the value it provides the viewer, the average watch time is only around 12 minutes. Therefore, I probably won’t be creating hour-long videos in the future."}, {"type": "sentence", "content": "I could have cut this video into seven shorter videos and possibly earned more revenue from seven times as many ad placements."}, {"type": "sentence", "content": "Since the video was published on September 24, 2019, it has earned $571.41 for 13,800 views."}, {"type": "subtitle", "content": "Video #4"}, {"type": "sentence", "content": "The last video in my experimental series, “My Exact Formula for Earning $10K/month with 1 Online Course,” has a CPM of $43.75."}, {"type": "image", "content": "https://miro.medium.com/max/6072/1*o2QRPheMdOwIslZ9fMIl_g.jpeg"}, {"type": "sentence", "content": "With a runtime of 15:57, this video is right in the sweet spot for YouTube to place mid-roll ads."}, {"type": "sentence", "content": "Since this video was uploaded on October 27, 2019, it has earned $267.16 from about 11,000 views."}, {"type": "subtitle", "content": "Overall Results"}, {"type": "sentence", "content": "Since my YouTube channel was monetized in June 2019, I have earned $2,297 from five videos, four of which were posted within the last six months. Last month I reached my initial goal of making $500 for one month of video views."}, {"type": "sentence", "content": "My next goal is to reach $1,000 per month. I’ll post a new article once I reach that milestone explaining the stats behind it."}, {"type": "image", "content": "https://miro.medium.com/max/5652/1*c5QmvJhgRExIA94TIwPpYg.jpeg"}, {"type": "subtitle", "content": "Key Takeaways"}, {"type": "sentence", "content": "There are a few insights that I have been able to glean from this experiment that I hope you’ll consider:"}], "topic": "social-media"}