{"title": "What is product design and what do product designers do?", "data": [{"type": "subtitle", "content": "A first-hand, updated account of the industry and role in 2020"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*BYqPvL-im5kZziVh.png"}, {"type": "sentence", "content": "In the mentoring calls I conduct with students and those looking for a career transition, the two most frequently brought up questions are — what is product design and what does the role of a product designer entail?"}, {"type": "sentence", "content": "I’m here to debunk the mysterious aura behind the field and shed light on what being it’s been like in my own shoes. While my day-to-day shifts based on numerous factors, most of what I do falls under a rhythmic routine that floats between different responsibilities. What I share below is a combined collection of my experiences at former internships and in my full-time role."}, {"type": "subtitle", "content": "What is product design?"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*ezF44T9ZvgjSsvAu.jpg"}, {"type": "sentence", "content": "Using data, product design identifies the right issues to be solved while also highlighting the business value behind the given project. User testing is then conducted to check assumptions and narrow the funnel of ideated solutions brainstormed. Ultimately, product designers determine if a design was successful by analyzing defined metrics to observe whether or not a desired outcome was achieved."}, {"type": "sentence", "content": "Contrary to popular belief, product design is not the transformation in beautifying a digital product. At its core, the field is a combination of many varying disciplines: graphic design, visual design, interaction design, information architecture, branding, business strategy, prototyping, data analyzation, user research, and sometimes coding."}, {"type": "image", "content": "https://miro.medium.com/max/1600/0*Sjxt24x-KL4AXghQ.png"}, {"type": "subtitle", "content": "What do product designers do?"}, {"type": "subtitle", "content": "Define the problem"}, {"type": "sentence", "content": "To kick-off the design process, product designers work with a multitude of stakeholders to solidify goals of intended projects and its relationship to the needs of the business. This can be represented as cooperation in validation of pain points, collaborative prioritization of various features, and unanimous agreement on a list of requirements. Questions answered in this phase include, but are not limited to:"}, {"type": "image", "content": "https://miro.medium.com/max/5200/0*oF_4MkATzn-e0qzx.png"}, {"type": "subtitle", "content": "Ideate solutions"}, {"type": "sentence", "content": "Once goals are clearly defined and agreed upon, a product designer can initialize the ideation phase. Typically, these first ideas originate from design sprints, competitive audits, low-fidelity sketches, and/or other ideation methods. This is my favorite part of the design process — the main task here is truly to create a range of explorations among constraints."}, {"type": "subtitle", "content": "Collaborate with other teams"}, {"type": "sentence", "content": "Product designers don’t design in bubbles; they collaborate. By providing background context on a problem and showcasing early-stage designs to other members on the team, one receives valuable feedback to expand on. This is highly beneficial in pinpointing certain design directions over others or proposing suggestions the author might not have considered. It’s also the perfect chance for one to better comprehend what other projects are in flux and offer a lending hand to others."}, {"type": "sentence", "content": "Additionally, branding, design systems, and marketing teams are great players to incorporate in the feedback channel. With the help of these teams, you can get approval for illustrations you created to supplement your designs, ask questions surrounding suitable components, or request friendlier copy text."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*k0NgF30AXTKJeykz.png"}, {"type": "subtitle", "content": "Validate solutions"}, {"type": "sentence", "content": "User research! It’s incredibly paramount to collect, record, and analyze data to either support your designs decisions or point attention to areas that need reconsideration. Thankfully, there are a variety of techniques that can be used to check if your designs are in alignment with your assumptions and hypotheses. This includes open/closed card sorting, unmoderated/moderated interviews, heuristic evaluations, and the RITE user testing method."}, {"type": "subtitle", "content": "Present your work to stakeholders"}, {"type": "sentence", "content": "All of the hard work a product designer puts into the design process is then shown to the leadership team. Once solutions are validated, team design reviews are held to check for any concerns in scope, constraints, or final decisions. Here, discussions are held with stakeholders and leadership to deliberate approvals to all the changes made to the product."}, {"type": "image", "content": "https://miro.medium.com/max/3156/0*yepS7nhi4lripYNQ.jpg"}, {"type": "subtitle", "content": "Work with engineers to implement designs"}, {"type": "sentence", "content": "At this point, one’s designs are finalized and it’s now up to the engineer to implement the designs accordingly. Every company takes care of hand-offs differently, but the main gist is that the product designer works with the technical team to make sure that the designs look up-to-par once it’s live."}, {"type": "subtitle", "content": "Record and measure metrics"}, {"type": "sentence", "content": "After launch, metrics are recorded in order to analyze for future months ahead. This is to ensure that the designs are performing well and to revert or make changes in the case they aren’t. With the data collected, you can truly see the impact you’re making as a designer!"}, {"type": "subtitle", "content": "Participate in hiring"}, {"type": "sentence", "content": "If there are open positions at your company, you’ll most likely participate in interviews that allow you to assess candidates in consideration. Your feedback is crucial in helping maintain the company’s bar for excellence in the expansion of the team. Every culture has their own checklist for attributes of a great addition and red flags that signal who may not be a great match."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*DcKcoctpqynN15tE.png"}, {"type": "subtitle", "content": "Build skills"}, {"type": "sentence", "content": "Tools come and go, projects change, and trends are ever-evolving. This is why it’s incredibly important to continually invest into one’s education through conferences, blogs, and courses. Whether it’s animation, illustration, prototyping, or visual design, there are resources to grow any skill nowadays."}, {"type": "subtitle", "content": "And repeat!"}, {"type": "sentence", "content": "There’s a plethora of design challenges out in today’s world. Once you start to more heavily incorporate design thinking and process into practice, it’s difficult to escape mind-chatter on ways to improve objects, processes, and products around you. One of the great curses of being a designer."}, {"type": "sentence", "content": "I hope this walkthrough was helpful in your understanding of this industry and informs your decision on whether this role would be a great fit for you."}, {"type": "sentence", "content": "Thanks for reading! Follow my newsletter to receive curated links to provoking reads I’ve found interesting in design. Feel free to send me a tweet, follow me on Instagram, or learn more about me from my website."}, {"type": "sentence", "content": "Other helpful links:"}, {"type": "sentence", "content": "All opinions are my own, views are my own, any advice given here is my own and do not represent an official statement by my employer."}], "topic": "ux"}