{"title": "Resisting Mammy Professorhood during COVID-19", "data": [{"type": "sentence", "content": "Why Black women in academia are not your mammies, even during a global pandemic."}, {"type": "image", "content": "https://miro.medium.com/max/15904/1*AlcoEKAfMHY6Zu1LYim8eA.jpeg"}, {"type": "sentence", "content": "I am an American rarity — I truly love my job."}, {"type": "sentence", "content": "My role as a professor gives me the privilege of waking up most mornings feeling eager to arrive on campus and enter the classroom because it brings out an element within me that no other environment can."}, {"type": "sentence", "content": "Equally rare, as a thirty-something, higher education professional with ten years of teaching experience, I found this passion for academia very early on in my career."}, {"type": "sentence", "content": "However, recently this sentiment has been tested. Like many academics managing the latter part of this past semester, I found myself dealing with the perfect concoction of uncharted territory, fear, anxiety, chaos, and extreme stress levels that are a part of the mess that the COVID-19 pandemic unexpectedly brought to college campuses nationwide."}, {"type": "sentence", "content": "In a motivating attempt, administrators at my university have encouraged faculty to lead with agility and grace. Although I agree with this well-intentioned recommendation, it does not take into consideration how the expectation of leading with grace and compassion shows up differently depending on racial and gender variables."}, {"type": "sentence", "content": "I, along with countless other women of color academics, bear the most severe emotional cost of this rallying cry."}, {"type": "sentence", "content": "Rather than demonstrating reciprocal grace, COVID-19 amplified some of my students’ and colleagues’ need to “mammy” me."}, {"type": "sentence", "content": "Like the house slave figure romanticized in the White imagination, as a Black woman, I am expected to be unconditionally nurturing, understanding, hardworking, and mothering without an ounce of regard for my humanity or my emotional and mental health boundaries. This historical archetype constantly shows up when Black women insert themselves in predominantly White spaces."}, {"type": "sentence", "content": "The COVID-19 pandemic has intensified the mammification that already existed in my role as a Black woman in academia. I attempted to be even more vulnerable with my students as an act of resistance against this mammification and to demonstrate that I am also struggling during this public health crisis."}, {"type": "sentence", "content": "Yet it backfired."}, {"type": "sentence", "content": "With one student in particular, I apparently did not meet their expectations of how a professor should show up during a global pandemic. I asked them to extend grace my way hoping that they would see me as human."}, {"type": "sentence", "content": "Instead, they told me to “stop making excuses and to do my job.”"}, {"type": "sentence", "content": "While I was amazed by how they managed to be such an expert on the job responsibilities of a professor while simultaneously failing to focus on their job as a student, I told them that a part of my job is not having to tolerate disrespectful and unproductive behavior from students."}, {"type": "sentence", "content": "Unfortunately, this was not the only case of blatant disrespect, abuse, and even harassment I experienced trying to teach as best as possible during a global pandemic."}, {"type": "sentence", "content": "What hurt most was being accused of not caring about my students when I put emotional boundaries in place to shield myself from such abuse. As much as academics claim they don’t take comments of this nature personally, I did."}, {"type": "sentence", "content": "These less-than-positive experiences became so common that it took a grave emotional toll on me. I had never dealt with this level of harassment and consequently, I cried for the first time in my teaching career."}, {"type": "sentence", "content": "So, I sought out advice from my people — academics."}, {"type": "sentence", "content": "But all I kept getting from colleagues and other academics were…excuses."}, {"type": "sentence", "content": "“Hurt people hurt people.”"}, {"type": "sentence", "content": "“Students are lashing out because they don’t have control over their lives and it’s stressing them out.”"}, {"type": "sentence", "content": "“Try to be a little more gracious toward them.”"}, {"type": "sentence", "content": "“They’re not worth your energy.”"}, {"type": "sentence", "content": "There is, of course, truth in the aforementioned statements and I’m sure it was meant to be encouraging. Yet, there is no just excuse for abuse."}, {"type": "sentence", "content": "This “advice” felt like sand slipping through my hands. They wanted me to build something with this advice but I couldn’t grasp it, I couldn’t do anything with it, and its fleeting nature was beyond disappointing. Moreover, the advice made me feel how I do when I receive general advice adorned with toxic positivity, which I have a particular aversion toward."}, {"type": "sentence", "content": "I felt like a parental figure contained in this box of how I was supposed to respond to students a.k.a. my academic children and even some of my colleagues. Like a maternal figure, I am expected to not complain about being a professor because “I knew what I was getting myself into” when I decided to choose a life as an educator."}, {"type": "sentence", "content": "But since when did one’s stress and anxiety become an excuse or a “right” to act ill-mannered toward educators?"}, {"type": "sentence", "content": "I feared and still fear being accused of not being student-centered if I spoke up about the abuse I experienced. I feared that I would be told that I was the “adult” in the situation and that I needed to ignore such treatment."}, {"type": "sentence", "content": "I would like to think that advocating for the humane treatment of faculty can coexist with student-centered pedagogy."}, {"type": "sentence", "content": "In fact, it was insulting that some implied I didn’t understand what my students were going through since women of color academics, specifically, are disproportionately asked to take on more teaching and service projects (without substantial reward for their time and emotional or intellectual labor), where there is a high level of interaction with students. Because of this intimate interaction, women of color academics may have a more complete understanding of the student experience than their counterparts."}, {"type": "sentence", "content": "As Dr. Whitaker goes on to explain in her article, “compared to our White counterparts, women of color are held to different standards. Whereas they are commended for innovation, we are commended for supplication. When they break rules they are labeled rebels; when we break rules we are labeled unemployed.”"}, {"type": "image", "content": "https://miro.medium.com/max/2160/1*lb0I8DGiQ_VkD3XTU7N3AA.png"}, {"type": "sentence", "content": "Even during a global pandemic, students and faculty reward male academics for their expertise and less for being kind. Kindness is an added bonus, but not required. The opposite is the case for female academics and this bias is exacerbated when we look at how race and gender intersect and inform the expectations of how women of color are supposed to express compassion and grace."}, {"type": "sentence", "content": "Through all of this, the best response I received was actually from my 24-year-old mentee and former student with whom I shared my experience."}, {"type": "sentence", "content": "She asked, “are you able to find ways to take care of your mental health as best as possible? How can I best support you as a friend/former student?”"}, {"type": "sentence", "content": "Unbeknownst to her, her questions were powerful. For the first time during this whole ordeal, I truly felt seen as human. She was able to meet me where I was during that time and acknowledge the emotional impact this experience took on me."}, {"type": "sentence", "content": "I am extremely thankful for her gaze upon me at that moment."}, {"type": "sentence", "content": "To clarify, I am not condoning the insensitive behavior I’ve seen from some professors who still think students can carry on as normal. Alternatively, I want to focus on the professors, like me, who made extraordinary efforts to ensure an inclusive and accommodating learning environment during this odd time, yet it never seems to be enough for some."}, {"type": "sentence", "content": "It is those extra efforts from faculty that not only deserve to be respected, acknowledged and seen, but also met with grace when we don’t always meet the mark."}, {"type": "sentence", "content": "Above all, I share my experience to shed light on the humanity of all faculty, yet with a special focus on the specific challenges and biases that women of color professors continue to face at a more intensified level during the COVID-19 era."}, {"type": "sentence", "content": "Women of color are frequently rendered as superhuman and this certainly shows up in academic spaces. This conscious and unconscious belief has particularly debilitating mental health and emotional costs."}, {"type": "sentence", "content": "Despite these horrific experiences, and what I firmly believe was probably my worst semester teaching, I still have this natural desire to protect my students because I care for them deeply."}, {"type": "sentence", "content": "And to those who think this piece is riddled with student blaming rhetoric, I am sorry that is all you got out of reading it. If that is your opinion, this article simply wasn’t meant for you."}, {"type": "sentence", "content": "Most of my students are hardworking and wonderful people to work with in my role."}, {"type": "sentence", "content": "Instead, my experience illustrates a long-standing culture that unjustly exploits the emotional labor of women of color academics, and how some students and higher education professionals actively participate in this process. One that continues to ask women of color to give more, as they are given less. To put simply, this is intolerable and inhumane."}, {"type": "sentence", "content": "To the majority of my students who understand that, like them, professors are multidimensional humans who are also stressed and anxious during this pandemic — you are seen and so appreciated. More than you will ever understand."}], "topic": "education"}