{"title": "How Covid-19 Affects the Brain, During and After Sickness", "data": [{"type": "subtitle", "content": "The virus’s mental health impact may mean a secondary epidemic"}, {"type": "sentence", "content": "Once Katie Swanson’s lips and eyelids turned blue, she stopped being able to sleep. The 28-year-old has always been “great at sleeping,” she says — an early-to-bed and early-to-rise type of person — but the coronavirus had her oxygen levels cratering, and she knew they might drop more as she slept."}, {"type": "sentence", "content": "“I was too afraid because I thought I wasn’t going to wake up,” Swanson says. “I was fully convinced I would die in my sleep.” Weeks after the peak of her illness, she’s still restless. “Every single night I have to take melatonin now,” she says, and that doesn’t always work."}, {"type": "sentence", "content": "A profound anxiety around sleep is one of a long list of mental symptoms Swanson says she experienced alongside the physical ones as she battled a case of the coronavirus severe enough to hospitalize her twice. And while her breathing has improved considerably—and her face is now a normal shade—the mental recovery has been much slower."}, {"type": "sentence", "content": "“My memory is really bad,” the California native says. “For a while, I couldn’t think of really basic words or definitions. I went weeks without talking to anybody because it was too much work.” It’s much more than the “brain fog” that can often accompany a bad cold or flu: She compares it to having a severe concussion."}, {"type": "sentence", "content": "Swanson’s experience isn’t exceptional: It’s become clear that the virus that causes Covid-19 affects more than the lungs. Nearly 40% of people infected, a team of Chinese doctors recently wrote, “develop neurological symptoms, including headache, disturbed consciousness, and paresthesia.”"}, {"type": "sentence", "content": "People with Covid-19 receiving critical care are at high risk of delirium, extreme confusion, or hallucinations. And severe illness, treatment, and recovery can leave lingering emotional trauma, raising the odds that a person will go on to develop anxiety, depression, or related conditions. But on top of all that, scientists are also beginning to understand that coronaviruses, particularly this one, have neurotropic properties, meaning the bug can attack the nervous system, entering the brain or the cerebrospinal fluid. The result may be neurological symptoms that accompany the infection, linger after recovery, or show up weeks, months, or even years later."}, {"type": "sentence", "content": "Last month, a trio of researchers in the department of psychiatry at the University of California, San Diego published a paper that examined the long-term mental health consequences of past epidemics. “Reports from the 18th and 19th centuries,” they wrote, “suggest that influenza pandemics, in particular, have been marked by increased incidences of various neuropsychiatric symptoms, such as insomnia, anxiety, depression, mania, psychosis, suicidality, and delirium.”"}, {"type": "sentence", "content": "In the wake of Covid-19, warns Emily A. Troyer, one of the study’s co-authors, scientists need to “do a better job of looking at the brain.” With nearly half of severely ill people developing some type of neurological symptom, there could be a second epidemic mounting around mental health. She says it’s likely already begun. Troyer points to Lorna Breen, the medical director of a New York City hospital’s emergency department who, after contracting and recovering from the virus herself, died by suicide in late April. Breen had no known history of mental illness, but battling Covid-19 had “altered her brain,” Breen’s sister later told hosts on the Today show. “We’ve asked the doctors to do some research on my sister’s brain to tell us if this was the case, but I’m certain. And then she went back [to work in] the most horrific, unimaginable conditions. The combination was just untenable.”"}, {"type": "sentence", "content": "For Troyer, the tragedy is a harbinger of the crisis to come — one that can be prevented by devoting resources to tracking patients’ mental health, working to understand exactly what the virus does to the brain, and encouraging survivors to speak up about the lasting effects, and seek help when they need it."}, {"type": "sentence", "content": "After three weeks in a medically induced coma, Charlotte Ralph was overwhelmed by delirium and fear. As doctors reduced her sedation, the stylist from the United Kingdom began having “very real and frightening hallucinations, which I can still remember vividly,” she says. The delusions ranged from being convinced her nurses were trying to poison her to “thinking I had run over a baby with my car and had to go into witness protection.”"}, {"type": "sentence", "content": "The critical care team put a whiteboard in Ralph’s line of sight, “telling me where I was, that I was not in trouble, and what day it was,” she says. “I couldn’t remember things from day-to-day; the team would have to reintroduce themselves.”"}, {"type": "sentence", "content": "Ralph’s doctors have since realized the crippling respiratory virus that landed her on a ventilator was Covid-19, but her illness struck before the pandemic was widespread, so family members were able to sit at her bedside. It was the only time she felt safe. “I can’t imagine what it must be like now,” Ralph says, “for all the people who can’t have visitors.”"}, {"type": "sentence", "content": "The delirium Ralph experienced is a common side effect of critical care, often called ICU confusion. Troyer says it may be especially prevalent in the coronavirus patients, with respiratory issues preventing enough oxygen from reaching the brain."}, {"type": "sentence", "content": "“We see such a broad array of neuropsychiatric symptoms,” says Troyer. “We get people with depression, excitability, people who are too sleepy, people who don’t sleep. There are delusions, hallucinations, psychosis.”"}, {"type": "sentence", "content": "In addition to the effects of low oxygen levels, some of the deleterious symptoms are related to the virus itself, explains Jordan Kohn, a co-author of the UCSD paper. Cells infected with the coronavirus can breach the blood-brain barrier, causing inflammation in the brain and central nervous system. “We’re just catching up to understanding,” he says, “but it seems to be a hallmark of severe cases of Covid-19. In something like 40% of patients it can cause encephalopathies — or brain diseases — as mild as headaches to much more severe incidences of hallucinations.”"}, {"type": "sentence", "content": "ICU confusion can happen to people receiving treatment for any condition — not just the coronavirus — and it typically fades as people recover. For some, that can take a while. “A recent meta-analysis of delirium among intensive care patients,” the UCSD co-authors wrote, “reported evidence of persistent neurocognitive deficits up to 18 months post-discharge.” Anecdotally, Troyer and Kohn say, doctors are reporting that the neurological symptoms of this virus seem particularly grave: Its survivors face a mental recovery that may take years."}, {"type": "sentence", "content": "Two months after being taken off her ventilator, Ralph is still dealing with graphic nightmares and insomnia. “I was put on a hefty dose of sleeping tablets to get my body clock normalized,” she says. “Weaning myself off them has been hard.”"}, {"type": "sentence", "content": "In the last few years, Ralph has been through chemotherapy, radiotherapy, and immunotherapy, and received a stem cell transplant to treat Hodgkin lymphoma, but this was very different: “I have never been so ill or so dependent, and the doctors didn’t expect me to survive,” she says. “Recovery has involved relearning to breathe, walk, talk, eat, go to the toilet… all of which had become lost to me.”"}, {"type": "sentence", "content": "Even without an attack on the nervous system, the virus exacts a psychological toll. When Beverly Rollins* first contracted the coronavirus, she felt a sense of shame. “I had a hard time telling people,” she says. “I felt like, ‘how did this happen to me? What’s wrong with me? Am I so weak that it got me?’” (*Rollins asked that her real name not be used for privacy reasons.)"}, {"type": "sentence", "content": "Rollins, a freelance translator in Montreal, felt “a profound aloneness,” isolated in her apartment. “When you’re sick, you should be allowed comfort.”"}, {"type": "sentence", "content": "As she recovers physically, Rollins is trying to deal with obstacles in the way of mental recovery. Getting the virus felt like an invasion, she says — “something insidious that had entered my body” — and that’s been haunting. Continued closures and social distancing measures have made it hard to start chipping away at another mental hurdle: getting out into the world again. “I feel infectious,” says Rollins. “I feel like I could hurt somebody. I’m afraid of myself.”"}, {"type": "sentence", "content": "The virus’s physical scars may make it more difficult to cure the emotional ones. In many people who recover from Covid-19, doctors are seeing lung scarring and heart damage that may heal very slowly or not at all, leaving some people unable to cope with stress the way they did before their illness."}, {"type": "sentence", "content": "Swanson, a triathlete who loves taking long training runs on secluded mountain trails, has no idea if she’ll ever run like that again. “There’s a high probability I’ll come out of this with chronic obstructive pulmonary disease or asthma,” she says a lung specialist recently explained. “I could be on inhalers for the rest of my life. My lungs and heart might never be the same, and that’s hard to accept. It’s hard to even say out loud.”"}, {"type": "sentence", "content": "Running, biking, and swimming have always been a major part of Swanson’s self-care routine, and she hasn’t quite figured out a replacement anxiety-reliever yet."}, {"type": "sentence", "content": "There are still more unknowns than certainties about the long-term impact of having Covid-19. Many of the neurological effects may not have begun appearing yet. For survivors of past epidemics, “there’s a much higher incidence of obsessive-compulsive disorder, post-traumatic stress disorder, and depression three to five years post-infection,” Kohn says."}, {"type": "sentence", "content": "Rollins, who has been in therapy for years to treat PTSD, is trying to head off lasting traumas she knows could develop out of her experience with the coronavirus. She’s avoiding news stories that act as triggers, and attending virtual therapy sessions and support groups."}, {"type": "sentence", "content": "“On the one hand I feel optimistic because I’ve got the tools and I don’t feel like I’m starting from scratch,” she says. “But I also feel like I’m waiting for the other shoe to drop. Is it really going to wallop me later? I’m trying to talk it out and get over it and process it.”"}, {"type": "sentence", "content": "When Swanson shared a candid, emotional missive about her illness on Facebook at the end of March, the post was shared a few thousand times, and she received hundreds of messages. “People were asking questions and looking for support,” she says. “I’m not a Covid-19 guru, and my experience isn’t any more valid than anyone else’s, so I started a Facebook group.”"}, {"type": "sentence", "content": "People were invited to share their stories with the group, called “Covid Symptom Support.” “It’s a place for people to check in,” Swanson says. “How are you physically? How are you mentally?”"}, {"type": "sentence", "content": "That’s exactly what needs to happen, says Troyer, if there’s any hope of preparing for the pandemic’s mental health fallout. “I know it can be scary to hear we’re going to have potentially large swaths of society with long-term psychiatric complications,” she says. “But it just means the medical community has to be on the lookout, and the public needs to know these are things we can talk about openly.”"}, {"type": "sentence", "content": "Lingering stigma surrounding mental health can keep people from sharing psychiatric symptoms with their doctors, and lead medical professionals to develop a dangerous “don’t ask, don’t tell” type of policy."}, {"type": "sentence", "content": "“I think part of the problem is it’s easy to talk about respiratory and gut symptoms, and it’s not easy to talk about the fact that you’re depressed or hallucinating or thinking about suicide,” Troyer says. “But there is no shame in telling your doctor, ‘Hey, I’m having this weird thing happening to me that wasn’t happening before.’”"}, {"type": "sentence", "content": "Swanson thinks it’ll take time for her own fear to fade. “I think I’ll be afraid to get sick again,” she says. “But I look at it this way: A few years ago, I was stung by a jellyfish. It was a freak accident, but it made me terrified of the ocean for a long time.” She knows the road to emotional recovery will be long, but she’s also deeply optimistic about the future. “Eventually,” she says, “I went back into the ocean.”"}], "topic": "neuroscience"}