{"title": "Isolation Survival Skills from a Lifetime of Mental Illness", "data": [{"type": "subtitle", "content": "Forget the pep talks. Here are day-by-day, hour-by-hour coping strategies."}, {"type": "image", "content": "https://miro.medium.com/max/2106/1*qQk12domCuYw7E7bpsMb_Q.png"}, {"type": "sentence", "content": "Shelter-in-place is the new normal, and you are more than likely finding it to be a challenge. You may find yourself struggling with things like:"}, {"type": "sentence", "content": "What’s happening is that you are likely experiencing a form of situational depression, because everything about this pandemic and its ongoing consequences is really pretty terrible. While the causes of situational depression and clinical depression are different, they both result in the same sort of symptoms."}, {"type": "sentence", "content": "In this article, I’ll explain some techniques for coping with those symptoms that I’ve learned from a lifetime of bipolar disorder. I’m no less susceptible to existential dread than you are, but I’ve spent a great deal of time learning how to manage it. Being isolated in my own apartment while feeling depressed actually feels pretty normal for me. It happens less than it used to, but it’s still familiar."}, {"type": "sentence", "content": "There are, of course, many well-meaning articles being put out by qualified doctors or therapists about taking care of your mental health during self-isolation. Unfortunately, most of them tend to say things like “be kind to yourself!”, “make a schedule!”, “exercise!”, “keep busy!”, “remember what you’re thankful for!”, etc. Those things are great if you can do them. But when I’m depressed, that advice is pretty far out of my reach."}, {"type": "sentence", "content": "I need things that are broken down to a level that helps me get through a bad day, hour-by-hour, with a lot of flexibility. So I’ll go through topics including what “be kind to yourself” actually involves, how to fill your days when you have a lot of time but not much ability to focus, and what to do when you find yourself overwhelmed and nearly immobile."}, {"type": "sentence", "content": "Before we get into that, it’s important to note that this does not replace medical advice or therapy. In particular, if you are experiencing thoughts of suicide, please call a hotline such as the National Suicide Prevention Lifeline. If you are trans, I recommend the Trans Lifeline in order to reach support that is understanding of trans issues. Get help now if you need it. Otherwise, on to the advice!"}, {"type": "sentence", "content": "Let’s start with the basics. You can’t get as much done as you used to, even though you have more time. What you’re experiencing is a change in your daily mental, emotional, and even physical capacity, caused by the stress of dealing with the pandemic. Everyday decisions suddenly have potential life-or-death consequences for you and for others. A recent article in Rolling Stone calls this “moral fatigue,” and notes that in many cases the correct choices are not clear:"}, {"type": "sentence", "content": "The uncertainty around everything, especially if you have lost your source of income, adds to this fatigue. As does the lack of human contact, particularly if you are an extrovert. Even if you are staying indoors with no possible risk of transmission to or from you, these other factors extract a cost from you each day."}, {"type": "sentence", "content": "One common way people think about this cost is the spoon analogy, a story originally told by Christine Miserandino. She was explaining what it is like to have a chronic illness (in her case, Lupus) to a healthy friend. They were in a cafe, so she gathered up eleven spoons from other tables, and gave them to her friend. They talked through a typical day, with Miserandino taking a spoon from her friend for each activity. They ran out of spoons before getting through the day. Healthy people usually have more than enough spoons for the day. People with chronic mental or physical illnesses often do not."}, {"type": "sentence", "content": "I regret to inform you that the pandemic is levying a tax on your daily allocation of spoons. Even if you don’t realize it, everything you do is costing you more than it used to. Not just the “moral fatigue” decisions, but mundane things like getting up in the morning or fixing lunch for yourself. The situational depression that results from all of the stress and uncertainty makes everything harder. But there is good news:"}, {"type": "subtitle", "content": "You did not suddenly become lazy and unproductive."}, {"type": "sentence", "content": "You are doing as much or more than you did before the pandemic. But a lot of that “doing” isn’t the sort of “doing” that you’re used to thinking about. So you don’t give yourself credit for it, and instead get frustrated with yourself. So remember to give yourself credit. It’s important."}, {"type": "sentence", "content": "Now that the pandemic is consuming many of your spoons, you can help yourself by prioritizing what you want to get done in a day, and accepting that you won’t get everything done that you used to be able to do. Especially on bad days. This is where you’ll hear advice to “be kind to yourself.” But what is the difference between being kind and being self-indulgent or giving up?"}, {"type": "subtitle", "content": "Being kind to yourself means listening to your mind and body."}, {"type": "sentence", "content": "When little things seem way too hard, it’s time to take a break. It may be time to take it easy for the rest of the day as much as you can. You can’t convince yourself to have more energy using logic. Trying to “push through” only consumes more spoons, so save that for real emergencies. Instead, learn what your new capacity is, and manage your daily expectations accordingly."}, {"type": "sentence", "content": "Keep in mind that you’ll have good days and bad days. This is normal (even without depression or pandemics involved). You won’t have many available spoons on a bad day. If you can, give yourself permission to do a lot less, or even to get nothing done. I find that if I can do that, I’m a lot less frustrated with myself the next day, and start that day with more capacity. A really bad day is your mind and body asking for some serious rest. It’s not being lazy to give yourself that rest. It’s an investment in being able to do more tomorrow."}, {"type": "sentence", "content": "Everyone’s mood changes during the course of a day. Often, you’ll find that you have a predictable daily cycle. There may be a low point that lasts a couple of hours. On a good day, you’ll just slow down a little during that time, but on a less good day you’ll feel pretty awful. And on a really bad day you won’t be able to do much at all."}, {"type": "subtitle", "content": "Being kind to yourself means working with your daily rhythm."}, {"type": "sentence", "content": "Maybe it takes you a while to get going in the morning, and jumping right into things doesn’t work well. Or maybe after lunch is your low time. In my case, it’s a few hours sometime around dusk. It’s a vague time range rather than being pinned to either the clock or the sun. But it’s consistently within that range, and sometimes I’ll just inexplicably feel awful during that time."}, {"type": "sentence", "content": "What gets me through those hours is the knowledge that this is my daily rhythm, and it will pass soon. I may be feeling hopeless despair, but I know it is temporary. So I take a nap, or stare at funny pictures on the internet, or do whatever other mindless distracting thing I can think of. I don’t try to accomplish anything else. When you’re at your low point, your accomplishment is getting through those two or three or whatever bad hours without acting from that place of despair. You don’t want to give up on anyone, or violate physical distancing to seek comfort, or really make any big decisions at all."}, {"type": "sentence", "content": "Learn when your low times are. Plan around them if at all possible. When you feel particularly down, check the clock and see if it’s near that time. If it is, think of yourself as being stuck on a boring bus ride. You’re not going to get anything useful done, but you will get to the end if the journey in a reasonably predictable amount of time, and things will pick up."}, {"type": "sentence", "content": "Free time is both great and horrible. Most of us now have more of it than we’d like, and it turns out to be harder to use it the way we’d want than it first appears. We don’t need to be productive every minute of every day, but most of us like to get things done now and then. With the pandemic making everything harder, you probably find you can’t focus on any one thing for very long. Maybe things that you usually enjoy don’t always lift your spirits anymore. As with overall energy levels and daily cycles, the way to handle this is to work with it rather than fighting it."}, {"type": "sentence", "content": "You’ll want to pick three or four-ish ongoing activities to help fill your free time. Then when you can’t focus or get into one of them, you can switch to another. It’s important to have this set of things chosen, because you may find that you’re not excited about anything. When in doubt, try any one of these activities."}, {"type": "sentence", "content": "Pick things that don’t have to be finished on someone else’s schedule, or aren’t things that you “finish” at all. These are free time activities. You’ll want your activities to require different types of focus. A good pattern is to pick at least one thing that you really want to do, and can make progress on sometimes. Then pick at least one thing that is more passive, like watching all episodes of a particular series. You can use recurring household chores, or you can stick with things you find fun. Having activities that require different kinds of attention increases the likelihood that there will be at least one that will work."}, {"type": "image", "content": "https://miro.medium.com/max/6912/0*bwX4BRdptzN9CIX7"}, {"type": "sentence", "content": "Don’t worry about losing interest in activities as long as you have enough to cycle though. In theory, one of mine is to read a specific book, but I just haven’t been able to summon that kind of concentration for several weeks. So I replaced it with “read Wikipedia articles about the evolution of life,” which I don’t bother to try to learn or remember. It’s just fun easy reading in small chunks."}, {"type": "sentence", "content": "What is important is giving yourself credit for whatever progress you make, including activities you might not think of as “productive.” Constant productivity is over-valued in our society, and rest is under-valued. Finished a season of a show you wanted to watch? That’s an accomplishment."}, {"type": "sentence", "content": "With this approach, you might not get as much done on any one project as you’d like, but you will make some progress on each. Putting this intention around the activities, including the “non-productive” ones helps you feel more in control of your life, without needing to adhere to a rigid schedule. I can’t stick to a schedule even on a good day, but I can remember to keep choosing from a small set of things that I want to do, whenever the time is available."}, {"type": "sentence", "content": "All of the above advice works pretty well for most days, even fairly bad ones. But what do you do when you find yourself unable to even attempt any of your activities? When you can’t think of any way to give yourself credit for anything? When you feel like everything is so pointless you can barely get out of bed or off the sofa?"}, {"type": "sentence", "content": "You’ve checked the clock and it’s not your low period. Giving yourself the rest of the day off would be pointless, as you’re already doing exactly nothing. You’re just ruminating on the pandemic or finances or not having seen friends or… basically all the awful things. These are the worst hours and the worst days. It can even be hard to remember that things were better, and will be better again (but keep reminding yourself that it will, even though it doesn’t seem to stick)."}, {"type": "sentence", "content": "When you’re this stuck, you need to give your brain something else to focus on without asking too much of it. You need to get your body moving at least a little bit. And you need to give yourself some positive feeling of accomplishment, however small. You’re going to do this by making a list of the most trivial things you can do right now, doing them right now, and then checking them off of the list. Right now."}, {"type": "sentence", "content": "The hardest part is getting started, because you need to find something to write with and something to write on. A phone or laptop will do in a pinch, but they have way too many distractions on them to be ideal. So summon up whatever reserve of energy you can find, no matter how stupid and pointless it feels, and get a pen and paper."}, {"type": "sentence", "content": "Next, look around the room for things to do. I just took a look in my bedroom, and I saw these things that I would write down:"}, {"type": "sentence", "content": "Normally, these things are so trivial you wouldn’t bother writing them down, much less breaking any of them into separate written steps. You’d just do them. But this is for when you’ve reached the “just keep putting one foot in front of the other” stage. It’s dark, and cold, and rainy, and you’re not sure how far you have to go and can’t bear to think about it. So just take one step, then another, then another, etc. The list is how you give yourself steps to take."}, {"type": "sentence", "content": "Write down a few things. Do a thing. It doesn’t matter which one, order isn’t important. Check the thing off of the list. Step, step, step. Finding things to do will distract your brain. Doing them will move your body. Checking them off will give you a tiny little burst of accomplishment. And those actually do eventually add up."}, {"type": "image", "content": "https://miro.medium.com/max/1280/1*nB5xlC6AXYfvOUkliZUghw.jpeg"}, {"type": "sentence", "content": "If you can’t figure out how to start your list, put “write a list” on it. Yes, I have done this. I then put down a couple more things, and check “write a list” off of my list. Just get started somehow. The things don’t have to be useful. “Move books to the other end of the coffee table” works if you can’t see anything else. Just keep going."}, {"type": "sentence", "content": "Usually, even at my worst, if I keep myself moving and thinking and doing this for a while, it will slowly pull me up to a more functional level. It will still be a bad day, but not a near-catatonic day. And that’s a significant accomplishment."}, {"type": "sentence", "content": "If you start to feel a little more energy, you can put more complex and useful things on the list. Just don’t jump straight from “flatten a box” to “clean the kitchen.” You’ll find some reason to not finish a big task like that and crash back to despondency and self-reproach. So maybe try “empty the dishwasher”, “load the dishwasher”, and “wipe down the counters” before you start assigning yourself whole rooms of chores."}, {"type": "sentence", "content": "Hopefully, you’ve never needed this and are thinking “this is an absurd idea to write down such trivial tasks.” But when you need to somehow get through a few hours or a day and have absolutely nothing left, I hope you’ll remember this and use it. It’s gotten me through some very rough times."}, {"type": "sentence", "content": "Physical distance doesn’t mean you’re alone, but one of the worst things about depression is that it makes it very hard to reach out. It messes with your sense of perspective and self-worth. It makes it hard to think that your friends would want to help. Even the ones who say “I’m here for you, you can message me anytime!” Maybe you do try reaching out to those friends, but none of them are looking at their messages when you need them."}, {"type": "sentence", "content": "This is why I started writing about my mental health on social media. Now I also do it because people have told me that it helps them, but originally it was a way of seeking support from my friends without putting any specific one of them on the spot."}, {"type": "sentence", "content": "Posting that you’re struggling with something will let whichever of your friends is able to offer a kind word, a cute meme, a “like”, or even IM or video chat, to see your post and help. Those who are not able to help right now can scroll on by. If you’re not comfortable posting to everyone, create a smaller filter of trusted friends."}, {"type": "sentence", "content": "Just keep in mind that not everyone sees every post all of the time, so it might take a while to get responses. If you urgently need help, use a hotline. But if you’re more in need of a friend, post and describe what you’re feeling and what you need."}, {"type": "sentence", "content": "I strongly recommend clearly stating whether you want advice or sympathy or something else. Because otherwise you will get unsolicited advice, and lots of it. It just seems to be how people work. They mean well, but they need guidance. Probably at both the top and bottom of the post. And maybe in the first comment. Possibly in all caps. You’ll get the hang of it."}, {"type": "sentence", "content": "If someone really can’t follow directions, screen them off of these sorts of posts. Delete comments that annoy you. You’re posting to help yourself, you don’t need deal with anyone who is making things worse. At all. Even if your brain is telling you you’re not worth it, set and hold boundaries. Social media can be a lifeline, but you do have to curate your audience to get the right responses."}, {"type": "sentence", "content": "These are five of the most important techniques that I use to manage my own expectations and keep myself going through difficult times. To recap:"}, {"type": "sentence", "content": "While I was writing this last bit, I started feeling unsure how to wrap it up and nervous that none of the things here are good advice for other people. I checked the clock and sure enough, it was my daily low point time. I tried looking at silly stuff on the internet but couldn’t concentrate or enjoy it. So I just laid down on my bed and semi-dozed for about an hour."}, {"type": "sentence", "content": "I was still feeling pretty horrible for most of it, even though two hours prior I’d been thinking that the day had been a really great mental health day. But I know my rhythm and reminded myself that it was temporary. And it was. Eventually I felt more rested, and got up, still feeling a little off. Over the next 30 minutes that “slightly off” feeling faded, and I felt good enough to write these paragraphs. Not as good as earlier, but definitely not bad."}, {"type": "sentence", "content": "So maybe that’s the best way to end this, with a story of how these are really techniques that I use all the time. I hope they work well for you, but remember that we’re all different and you may need to adapt them or just pick which ones help you and leave the others. Remember that none of this is a substitute for either psychiatric treatment or psychotherapy when those are needed, and you should call a hotline if you need immediate help. But for getting through a stressful time, day by day and hour by hour, I hope this article helps you understand yourself better and gives you some tools to manage this strange new world in which we find ourselves."}], "topic": "mental-health"}