{"title": "The Essential Games: Crimsonland (2003/2014)", "data": [{"type": "subtitle", "content": "Blast all the things"}, {"type": "sentence", "content": "Crimsonland isn’t a looker. Even when it first launched on the PC in 2003, it had an archaic art style straight out of the mid- 1990’s. It’s built entirely out of chunky 2D sprites. These are not the throwback hand- drawn pixel art that’s so popular in current indie games and retro revivals either, but rather 2D artwork based on glossy pre-rendered 3D models. The result is a visual package that was instantly dated and has only grown more awkward and ungainly with time."}, {"type": "sentence", "content": "But Crimsonland doesn’t need amazing graphics to reveal its core strength: fun game design. Based on the timeless dual-stick shooter template first popularized by Robotron 2084 and copied millions of times since then, Crimsonland has perfect action gameplay that’s full of satisfying close calls, intense shooting action, and challenging enemy variety."}, {"type": "sentence", "content": "Across Crimsonland’s huge menu of content, you’ll control a lone Trooper as he blasts aliens, bugs, zombies, lizardmen, and other monsters with a large variety of weapons. You move with the left stick and shoot with the right, and that’s it. All other abilities are unlocked through a randomized progression system, with each level dropping random powerups that might hinder or help depending on your playstyle and the enemies you’re facing. Reach the end of the level, and you’re demoted back to your default state. It’s equal parts rogue-like and arcade action, and once you get into its groove of unlocking new perks and earning new weapons, you’ll find a lot to like."}, {"type": "sentence", "content": "The game’s simple flat 2D backgrounds are boring by design…since they mostly exist to get covered in the blood of your enemies. Crimsonland’s one significant visual feature is the amount of red stuff that litters the ground at the end of every short level, and it provides a highly gory level of player feedback that earnestly recalls the hyper-violent first person shooters of the nineties."}, {"type": "sentence", "content": "With just enough depth and complexity layered on top of its core shooting action, Crimsonland will keep you playing for a few days. The main campaign mode contains over 100 stages, and there’s also a handful of bonus modes to enjoy and set online high scores in. The game offers local co-op if you’ve got a nearby friend who wants to do some enemy blasting with you."}, {"type": "sentence", "content": "I know that there are too many great dual stick shooters on the market, but Crimsonland is an iconic early example of the“modern” version of the genre. Released several years before the spotlight-stealing Xbox 360 game Geometry Wars Retro Evolved, it captures a key era of low- budget PC action gaming in a way that makes it a significant title in spite of the genre’s bloat."}, {"type": "sentence", "content": "Developer 10Tons created this game in the beginning, and they stayed in business long enough to re-release it on numerous modern platforms a few years ago. The official web site is right here, and you can buy the game on Switch, Xbox One, PS4, and PC. It also hit the previous generation of consoles, if you’ve got a PS3 or Vita still kicking around."}, {"type": "sentence", "content": "I’ve played the game on several platforms, and for this particular article I decided to try it on PS4. Impressively, the game includes full support for the DualShock 4 Touchpad, a piece of plastic so rarely utilized that I’m surprised it’s still included on the new DualSense controller. On PS4, you can move with the left stick and aim and shoot with the Touchpad, giving this particular version of the game some of the PC version’s mouse control precision that’s otherwise missing with an analog stick. The game still plays great regardless of your chosen control scheme, but I was shocked that the Touchpad did something other than open the menu."}, {"type": "sentence", "content": "10Tons is still making fun indie shooters to this day, but none of them have the specific bite that makes Crimsonland an enjoyable game. If you can get over your own revulsion at its hilariously dated visual style and force yourself to play it for just a few minutes, you’ll find that the minutes fly by."}, {"type": "sentence", "content": "Click here to view the index of my other Essential Games articles."}], "topic": "gaming"}