{"title": "You probably consume too much content", "data": [{"type": "image", "content": "https://miro.medium.com/max/1000/1*O3vIzVkwQXwD1EzKwGoFJQ.jpeg"}, {"type": "sentence", "content": "Screen addiction came to stay. At least is what the researchers say. But don’t be fooled by thinking this is a problem of the young."}, {"type": "sentence", "content": "You probably have the same problem."}, {"type": "sentence", "content": "You might not believe me right now. You might think I’m just being a pessimist person, who didn’t have anything better to do than to come here and try to talk bad at other people. Or you simply already know the truth and accepted that, and you know perfectly I am talking to you."}, {"type": "sentence", "content": "Let’s “draw” your day on a piece of paper, and see if I am right or not, shall we?"}, {"type": "sentence", "content": "First of all, if you’re reading this, I will assume you have at least one laptop and one smartphone for personal use. If you have that, you also probably have a TV. On top of all that, you can have all those goods, and still spent an additional 5$ per month on knowledge."}, {"type": "sentence", "content": "English might be your primary language, but it won’t be in a lot of cases. So, you had access to a good education — 12 to 15 years, perhaps. And most of the people who are here whose English is their primary language also had access to a good education."}, {"type": "sentence", "content": "Congratulations, you’re somewhat rich in the big scheme of things."}, {"type": "sentence", "content": "Where do rich people live? A lot of them in rich countries. How does your day looks like if you’re an American or a European?"}, {"type": "subtitle", "content": "America"}, {"type": "image", "content": "https://miro.medium.com/max/1500/1*amLUCDYjS6VKMzmujWQkfg.jpeg"}, {"type": "sentence", "content": "If you’re a typical American, your day sounds like this:"}, {"type": "subtitle", "content": "Europe"}, {"type": "image", "content": "https://miro.medium.com/max/3068/1*4dum1CW5NDasnxt-XgSmzg.jpeg"}, {"type": "sentence", "content": "If you’re a typical European:"}, {"type": "sentence", "content": "It’s slightly better, without a doubt."}, {"type": "sentence", "content": "But you still aren’t living in a perfect world — not even close."}, {"type": "sentence", "content": "You can still do a lot better."}, {"type": "sentence", "content": "If you don’t belong to any of this “big groups of people”, you can find similar reports for South America (with their incredible average of more than 3 hours per day spent on social media — it is in one of the previous links), South Korea, China, etc. — despite that in some regions, like Latin America, you would need to consider people with some wealth to do fair comparisons (for example, a household with TV, but no internet wouldn’t be a very good comparison or a family with 4 children). I would say, though, that a lot of people here aren’t in those situations (despite not being impossible)."}, {"type": "sentence", "content": "A lot of things change, but the takeaway is always the same: we produce a good or service while working (sometimes we distract ourselves doing this), we come to our homes and consume content, and then we sleep."}, {"type": "sentence", "content": "We need to stop only because we need to eat."}, {"type": "subtitle", "content": "The impact"}, {"type": "subtitle", "content": "1 — Fragmented attention"}, {"type": "sentence", "content": "Fragmented attention is the inability to keep yourself focused on one particular task."}, {"type": "sentence", "content": "How to diagnose yourself? Try to see how far can you go without being distracted. See if you’re just wasting a lot of your time dwelling, talking, or scrolling."}, {"type": "subtitle", "content": "How to solve it?"}, {"type": "sentence", "content": "Learn how to focus without any distraction on a cognitively demanding task."}, {"type": "subtitle", "content": "2 — Overconsuming news is bad for your health"}, {"type": "sentence", "content": "“The way that news is presented and the way that we access news has changed[…]These changes have often been detrimental to general mental health.” (see link below)."}, {"type": "sentence", "content": "How to diagnose it? See if the content you’re consuming helps your goals in some way."}, {"type": "subtitle", "content": "How to solve it?"}, {"type": "subtitle", "content": "3 — Social Pressure"}, {"type": "sentence", "content": "Both how to diagnose and how to solve it:"}, {"type": "sentence", "content": "Also, everyone should verify these signals once in a while:"}, {"type": "subtitle", "content": "To conclude"}, {"type": "sentence", "content": "Deep down, we fear we aren’t consuming enough. We fear we might be out of the loop."}, {"type": "sentence", "content": "We might feel we aren’t good enough, and that we need to check up what our friends and colleagues are doing, to never be completely lost on what we should be doing in life — who should we be."}, {"type": "sentence", "content": "We feel we might not be good enough citizens. Desinformed citizens are the worst citizens, right?"}, {"type": "sentence", "content": "Or we don’t fear at all — we just watch. We’re addicted to it. And we can’t stop."}, {"type": "sentence", "content": "Or we just watch because the idea of being in a home without the TV noise is even scaring to us."}, {"type": "sentence", "content": "How should we compromise the impact with all these fears? We just want to be okay."}, {"type": "sentence", "content": "For now, let’s just reflect on this:"}, {"type": "sentence", "content": "the average person has problems. We need to cut the average of our “screen consumption” A LOT, so, probably, you have a problem."}, {"type": "sentence", "content": "The sad thing is we’re all in it. A lot of us isn’t living to our full potential because we either spent too much time online, or we can’t filter what we see — ending up being stressed with fake news, or with simple media sensationalism."}, {"type": "sentence", "content": "We have millions of people who can be happier and healthier than they are without needing any extra money, material possessions, or any political or sportive event, but by winning a “simple” battle."}, {"type": "sentence", "content": "Even if you are not one of those people, chances are: you know someone. How terrifying is that?"}], "topic": "social-media"}