{"title": "10 symptoms you might be a designer", "data": [{"type": "sentence", "content": "Have you ever felt like a fish out of water? Many people at different stages of life face similar questions and struggles. There can be many reasons for this, starting from a mess in one’s own head to external factors. Once I could relate to these feelings very well. Coming from a family of technicians, engineer-oriented high school, and later university, pursuing a career in design was an absurd idea. It took some serious thinking to first ponder the possibility of doing a 180, and then a lot of hard work to make it happen. Did I mention it was scary as hell? Am I designer material? Do I have talent and skills for that? Would I ever be as good as other professionals in the field?"}, {"type": "sentence", "content": "This article will show you some indicators that personally helped me and might help you consider a career in design, or simply entertain you with some quirks of designers."}, {"type": "subtitle", "content": "Potential designer symptoms"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*sYhMmd3id2lz_fNz8_GZVw.png"}, {"type": "subtitle", "content": "Mining what’s shining"}, {"type": "sentence", "content": "Have you ever noticed like a bright product package is calling for you? It might be a useless knick-knack, but for some reason, its appearance attracts you like a magnet. Your consciousness begins to come up with various reasons why having it is crucial and how you can make use of it. Although, deep in mind, you know it is a self-deception speaking."}, {"type": "sentence", "content": "And art supplies stores become the kryptonite for your wallet! A happy place with different beautiful notebooks, stickers and so on, simply impossible to pass by."}, {"type": "sentence", "content": "Possible diagnosis: graphic designer, interior designer, fashion designer, photographer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*WhWwAVqxANVaGEq5R1Fghg.png"}, {"type": "subtitle", "content": "Aesthetics is an anesthetic"}, {"type": "sentence", "content": "You open your eyes, you look and you see. Seeing something beautiful creates a feeling of delight and inspires virtue within you. And it matters little whether the thing being admired is natural or man-made — as long as it resonates with an idea of beauty. Wonders of nature, people, architecture, technology, art, fashion, etc. — you name it."}, {"type": "sentence", "content": "But it doesn’t end just there! You seek the visual harmony in daily life: starting from symmetrical order of books on the shelf to a design connection from the hallway to the bedroom. 75% of your home is Instagram-ready and 5 basic principles of design are present in each room. And even if for others it may look like chaos, you know that each item has its place and circulates to create the desired order."}, {"type": "sentence", "content": "It’s not about following the trends or the vogue, but about surrounding yourself with beauty and, more importantly, an ability to find it in everything."}, {"type": "sentence", "content": "Possible diagnosis: photographer, graphic designer, interior designer, production designer, VFX artist, UX/UI designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*Ceq4AWaMd8H0M1XRSCxLhg.png"}, {"type": "subtitle", "content": "Artimism is the trait of your mannerism"}, {"type": "sentence", "content": "Do you like to get your hands dirty? Creativity haunts you, no matter how hard you try to evade it? It can manifest itself in various forms, sometimes for no particular reason or at the wrong moment. Turn a cookbook into an art masterpiece? Of course! Transform your old sneakers into a custom version of Dolce and Gabbana ones? No one will be able to tell the difference! Make a handmade gift? It deserves to be in a museum of modern art, no less!"}, {"type": "sentence", "content": "If these feelings resonate with you, then you came to the right place. Having sources of inspiration and creativity becomes essential for you. The splash of artistic energy gives inner satisfaction and inspires even further creativity. For example, I rhymed the symptoms just because and wrote another paragraph."}, {"type": "sentence", "content": "Possible diagnosis: photographer, graphic designer, interior designer, UX/UI designer, animator, VFX artist, fashion designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*oOAD-Lqs1OeBG79U_GuyAg.png"}, {"type": "subtitle", "content": "Colors and letters — the things you think matter"}, {"type": "sentence", "content": "Only designers and individuals who aren’t happy with typefaces can talk about them. People perceive a page as a whole, scanning the text, size, length of the lines — and the words become images. You, on the other hand, see where the geometry of letters end and the art begins. You know that type is a visual voice that communicates to the subconscious and fonts can evoke emotions. They can change the perception and turn words into stories. For you, the type is not just visualized letters, but a harmonious set of characters that has a spirit. Helvetica is the best buddy, Franklin Gothic screams confidence, Comic Sans is a party-animal at a school matinee, and Papyrus is a lazy choice for a movie title."}, {"type": "sentence", "content": "And don’t get me even started on colors! What is the first thing that comes to mind when you hear the word tangerine? Is it a fruit? A song by Led Zeppelin or Miley Syrus? Novel, movie, comics character? A location, perhaps? However, if it’s nothing from the above, but a rich color from the Orange color family, then you have some symptoms of a designer."}, {"type": "sentence", "content": "Possible diagnosis: graphic designer, typographer, UI designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*hCEQD5UWkPjftZUyycN2Ng.png"}, {"type": "subtitle", "content": "No time to wait gotta keep up to date"}, {"type": "sentence", "content": "You play racing with trends. Sometimes your smartphone becomes a black hole with tons of downloaded apps. And it’s not because you are in a desperate need of the new distractions during the day or have a severe hoarding disorder (app-edition). You just had to pacify the inner artist filled with curiosity and to check out the apps’ design you came across. And now you probably can’t bear to delete them…"}, {"type": "sentence", "content": "At the same time, your email is packed with newsletters from various tech sources. Even with the information overload, you feel the need to follow news and trends. In a sense, you become a collector of digital things that inspire you: articles, templates, fonts, tutorials, etc. Such obsessive behavior extends to the physical world as well. There is a sacred place, a den of your artistic alter ego with all sorts of goods: from favorite movie posters to craft beer labels, from license plates to the postage stamps. Everything has a design and serves as a potential reference for future ideas."}, {"type": "sentence", "content": "Possible diagnosis: UX/UI designer, UX researcher, graphic designer, video game designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*ye4utXGxR-OTJ1LuoEmd1g.png"}, {"type": "subtitle", "content": "You have a leaning for a hidden meaning"}, {"type": "sentence", "content": "Just like in school when doing a literature analysis, we go beyond trying to read between the lines, to understand a thought implicit in the words, you know there is always something more behind the things you see. In the same way, a brand is more than just a logo, but an idea or an image that comes to mind when thinking about products, services, or activities of a company. It’s a mix of both physical and physiological cues. From the practical side — “the car is fast.” And from the emotional — “the car makes me feel sophisticated and successful.”"}, {"type": "sentence", "content": "You can see a full-scale picture and then break it down into smaller steps or details. Thus, it’s not only the product that creates a brand but also the feelings that consumers develop towards the company. You understand that this feeling can be prompted by the brand’s name, visual identity, or the message conveyed. You see the beauty in how a brand can grow to such a magnitude that it can literally own a font or a color."}, {"type": "sentence", "content": "Possible diagnosis: graphic designer, industrial designer, UX/UI designer, photographer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*aPE3IXL3nGMTrUVP6QPEVw.png"}, {"type": "subtitle", "content": "Bad design should resign"}, {"type": "sentence", "content": "Everything is design. We are surrounded by design in our daily life: from a bed, you sleep in, to a device you use to avoid looking at people. It all has been thought, prototyped and developed to provide a quality user experience. When the experience is seamless and the design doesn’t require an external explanation — it becomes almost invisible."}, {"type": "sentence", "content": "As human beings, we usually take for granted the good design around us, but rarely can stop to appreciate and enjoy it. On the other hand, a bad design that leads to unpleasant experiences is way easier to notice. At best, it creates obstacles in reaching users' goals, at worst, it can physically harm or even cost lives. For most people, it’s enough to express the frustration and let it go, but you feel like the bad design is screaming for your attention. You see flaws, poor decisions, inconsistencies to the level that can make you cringe."}, {"type": "sentence", "content": "Possible diagnosis: UX/UI designer, industrial designer, interior designer, architectural designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*jEfrv6U79YhXyYgdmFxf8A.png"}, {"type": "subtitle", "content": "The base for a relationship is strong communicationship"}, {"type": "sentence", "content": "We all know some good talkers around us who always have something to say. However, good talkers are not always good communicators. In a world where self-centered behavior and intolerance are an unsettling norm, it’s easy to forget that listening is the other side of the coin that forms the communication process. A lot of people have a false belief that they know everything about everything and listen not with the intent to understand but to reply. Making assumptions becomes a way of determining judgment."}, {"type": "sentence", "content": "Not to blame, listening skill is not that simple or natural. The human mind has a tendency to wander away and it takes a conscious effort to truly hear what the other person is saying. It involves empathy — the act of putting yourself in another one’s shoes, trying to “feel as” someone. It helps to see things from this person’s point of view while staying out of judgment. You understand the importance of considering the experiences, intentions, and feelings of others without butting in with own your thoughts. Just like designers start by understanding, not rebutting or solving."}, {"type": "sentence", "content": "Possible diagnosis: UX researcher, UX/UI designer, industrial designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*r27HdcNp9WCfVZiPpGSIgg.png"}, {"type": "subtitle", "content": "You see, you solve, you evolve"}, {"type": "sentence", "content": "Have you ever found yourself interested in solving problems that weren’t your problems? Or has the thought “this could be better if […]” ever crossed your mind? Are you the type of person that doesn’t believe that “good enough” is good enough? If so, you might be diseased with the problem-solving urge that most designers are suffering from too. The desire to help and seek solutions is a part of your character."}, {"type": "sentence", "content": "Most people go around or avoid problems expecting the problems eventually will solve themselves. However, you feel like doing something to improve the situation is better than leaving it alone as is. Problems don’t scare you, in fact, you ignore the irrational fears and perceive the problems as challenges. You explore options going beyond a fixated mindset, focus inventively on what solutions might look or feel like and dream of things that never were. This process excites you making your blood boil and the problems become the genesis for good ideas."}, {"type": "sentence", "content": "Possible diagnosis: UX/UI designer, industrial designer, interior designer, architectural designer"}, {"type": "image", "content": "https://miro.medium.com/max/5600/1*UkrZo_h6c9d0TXlaOM0otw.png"}, {"type": "subtitle", "content": "The devil prevails in the details"}, {"type": "sentence", "content": "You’re punctilious to the core. Regardless of the nature of the activity, you always care a great deal and make sure it’s done right to the last smallest detail. It’s not about splitting hairs, but understanding how attention to detail helps to generate better outcomes."}, {"type": "sentence", "content": "By treating (almost) every detail like it’s the most vital detail you get closer to creating something amazing, something that is worth being created. Every step of the process brings you joy and fulfillment once accomplished. And it matters little if your extra efforts are not directly noticed by others as long as you get the quality result and trigger the emotions on a subconscious level."}, {"type": "sentence", "content": "Possible diagnosis: graphic designer, UX/UI designer, animator, production designer, video game designer"}, {"type": "subtitle", "content": "Doctor, I might be a designer, what now?"}, {"type": "sentence", "content": "If you have gotten this far, you probably have a feeling this path is the right one for you. First and foremost, you need to understand what design specialization is of interest to you. Try to imagine for a minute that you are about to start working on your design craft."}, {"type": "sentence", "content": "Depending on the answers to these questions, the prescriptions may be different. Still, there are a couple of universal steps you can take once you choose the design direction:"}, {"type": "sentence", "content": "For some, it will be easy, for others it will more difficult, but it’s never too late to start and with enough desire & effort, almost anything could be achieved!"}, {"type": "sentence", "content": "Thanks for reading💙 ️My name is Aleksa👋, I’m a Ukrainian who lives in a beautiful city called Amsterdam. Very excited to share the very first article with the world! I’m deeply passionate about design and love to connect with people who share this passion."}, {"type": "sentence", "content": "Feel free to reach out to me on Linkedin, Instagram, or Twitter."}], "topic": "ux"}