{"title": "Bonding Over Star Wars: Battlefront", "data": [{"type": "subtitle", "content": "Star Wars: Battlefront 2 helped me connect to my siblings during a time of family turbulence"}, {"type": "sentence", "content": "There are few games that I remember better than Star Wars: Battlefront 2 on the PS2. I remember playing it with my brother and friends when I was a kid, a lot. My friends and I would play on the cooperative splitscreen mode. We were on different teams and tried to kill each other."}, {"type": "sentence", "content": "I didn’t play the campaign of the game much, but I did played a lot of maps against my brother and his friends. I do remember that you can be Jedi or Sith and earn perks before a given match to play with."}, {"type": "sentence", "content": "I played Battlefront through the very early stages of my childhood, and even through the later stages of my childhood still, but I will always just remember the competitions."}, {"type": "sentence", "content": "Battlefront came before the Lego video games like Lego Star Wars, and yet, I remember times I spent playing with my brother very fondly. There was just no other game like Battlefront that I can’t really explain — and I’ve played the new Battlefront games on the newer consoles with my friends, but it was not the same."}, {"type": "sentence", "content": "My Battlefront memories are especially vivid because of what was happening at home when I was playing it. My parents were going through a divorce, we were moving, and there was a particularly high amount of tension at home. Myself and my brother, being children, tried to distract ourselves from the tension as much as we could, but to no avail."}, {"type": "sentence", "content": "What drew us away from a lot of the yelling and screaming was Battlefront, a game that absorbed us into either a story mode or trying to win a match and dwindling our opponent’s enemies. We completely obliterated the A.I. even at the most difficult level, and so we always played each other and had competitions over who could kill the most people on the other team."}, {"type": "sentence", "content": "I don’t think Battlefront was a particularly insightful game with an especially deep plot, but the game knew what it was. It was the kind of shooter competition game that allowed siblings and friends to bond, a model that the Lego Star Wars game likely based itself on."}, {"type": "sentence", "content": "As a child, there was nothing that could bond me to someone more than a competition. Whether it was on a court, playground, or the classroom, I always wanted to prove myself and, of course, prove that I was good at something and better than someone else."}, {"type": "sentence", "content": "And so Battlefront was that way to bond with my brother, to use perks like Jedi or turrets that shot at you when you tried to capture enemy bases. One perk allowed reinforcements that came when a team was close to losing, and I remember that I would overwhelm my brother only for him to get another chance with more troops, and then turn the tables on me."}, {"type": "sentence", "content": "Would I have liked playing Battlefront if I didn’t have my brother and friends to play with? Probably not. I had other much better solo games to play on the PS2, which included Final Fantasy 10, Final Fantasy XII, and sports games like The Show franchise of MLB and NBA games."}, {"type": "sentence", "content": "The fact that Battlefront was best enjoyed collaboratively was what made it special — and one of the best collaborative games I’ve ever played."}], "topic": "gaming"}