{"title": "Have You Ever Thought About It: How to break down an oil tanker?", "data": [{"type": "subtitle", "content": "India | Industry | Technology | Travel"}, {"type": "sentence", "content": "An Indian piece of cake"}, {"type": "sentence", "content": "Once upon a time on an Indian Island carrying the name of Diu, where the alcohol was even cheaper than in the rest of India and where there was barely any motorized honking vehicle -unlike the rest of India-, a Czech boy, A Flemish guy and a Dutch couple stayed on top of a seventeenth-century Portuguese church. Together the group explored the island, chilled and swam at the beach for days and thus they became friends. The Flemish guy was an experienced motorcycle driver and he taught the rest how to drive. He taught them how to use the clutch and not mistake it for the break. In a matter of days we learned how to ride a motorcycle.… in India."}, {"type": "sentence", "content": "The true test to our newly acquired motorcycle skills would obviously consist out of leaving the tranquility off the island and visit mainland India. We left the comfort of the relaxed island culture and tropical beaches in exchange for a couple of days of eating dust. We entered mainland India, where the cows were roaming freely over the road. After successfully dodging an Indian cow without bumping into something else because you’re dodging a cow would be the moment when we could call ourselves experienced motorcycle drivers."}, {"type": "sentence", "content": "Our road trip, in January 2011, would take us to three interesting places. Our first goal was Palitana, the central temple mountain of the religion of the Jains. The second goal was to see the last population of Asian lions living in the wild on a safari in the Sasan Gir Lion Reserve. The third and final goal was ambitious and even as much as only getting a glimpse of it sounded exciting enough. We had heard of an 8,5 mile stretch of beach in the state of Gujarat, known as Alang. Alang was the graveyard of the world for oil tankers, container ships, and cruise ships. The fellowship was born. We were on a quest."}, {"type": "sentence", "content": "It was rumored that Alang might be one of the most polluted places on the planet. They said the USSR’s nuclear submarines were demolished on the beach of Alang in the 1980s without any preliminary cautions being taken. Based on my travel experience in India the preceding weeks, I judged these rumors for being true. I learned during our quest there were three such places as Alang. Three places where developed countries dump their old ships. One was in Bangladesh, the other two were in India. I also learned that in 2002 Greenpeace had entered Alang as potential buyers of the material and had secretly filmed Alang beach during their visit. The footage was published by Greenpeace."}, {"type": "sentence", "content": "The Indians we met during our journey told us the place would be closed, fenced off, and off-limits for people. Authorities made sure no one could enter anymore after the visit of Greenpeace. But hey, what is to stop a fellowship once they are on a quest? Not much. The night before we stayed in a dodgy Indian hotel and we discussed how to approach Alang the following day. Surely four Caucasian backpackers couldn’t just drive through the main entrance and visit the beach? We all believed dodging the cows and eating the road dust had been the easy part."}, {"type": "sentence", "content": "We drove up the road to Alang Beach. Ten miles before we hit the beach the shops started. For miles and miles on our left and our rights shops were filled with what came out of the ships and what was still considered as useful, by Indian standards. A mile of old cruise ship couches. Then a mile of former cruise-ship kitchen stuff, from ovens to furnaces and refrigerators. Then a mile off tables, chairs, and who knows what else. The shops were huge, twenty yards in width and dozens of yards deep. All the reusable furniture was organized according to the local rules and customs, it was a mess."}, {"type": "sentence", "content": "We all wondered who would buy all of this. Who needs a twenty seater sofa? Or an oven with twelve levels? We slowly drove on while eyeballing the sides of the road. Finally, in the distance, we saw the top of a big ship. It was a sight to behold. Not much later the iron gate spanned over the road ‘Welcome to Alang — Sosiya recycling yard.’, became visible. The gate was reminiscent of the iron gates I had seen perched over the entrance of the Nazi concentration camp Auschwitz-Birkenau. We stopped to take a picture. Four backpackers entering a place like this through the front gate didn’t seem like a good idea. We decided to turn around and find another way."}, {"type": "image", "content": "https://miro.medium.com/max/7936/1*_zrKzaNwvaMQhKbpXYcRFQ.jpeg"}, {"type": "sentence", "content": "A little while later the four of us parked our bikes on a dirt road and climbed through barbed wire. On the horizon we could see the decks of the huge ships rising over the tree line. We heard the noises being produced by iron hitting iron or metal against metal. Some sounded far away, some seemed to come from close by. We heard the sounds of engines coming to and fro. We heard hard bangs, distant bangs. It was as if we were closing in on the weapon mines of the Orcs next to the tower of Isengard. It was scary but curiosity surely got the better out of all four of us. We were all thinking about how authorities would react in case they would discover us. We kept walking, through the fields, towards Isengard. CLING, CLANG. It was too intriguing to stop right there and turn back."}, {"type": "sentence", "content": "We hit the main road of the dockyards, running parallel to the beach. We saw a wall and a line of trees. Both the trees and the wall blocked our vision to the beach and the ships. The Flemish guy took the lead, he went down and we crossed the road and started casually walking alongside, on the sidewalk. I felt tense."}, {"type": "sentence", "content": "Eventually we hit an opening in the wall and caught our first glimpse of the beach. Two oil tankers the size of a European cathedral lay on the beach half a mile from us. The ships reached high into the sky, the shadows of the ships stopped below our feet."}, {"type": "sentence", "content": "The beach itself was filled by an army of Indian working men, old bulldozers, cranes, trucks and heaps and heaps of scrap metal in blue, brown, black. The metal scraps were stapled, like old cars. Some of the trucks looked like they had been driven over from the USSR in the 1930s. The cranes were in an even worse condition. The cranes swung the iron scraps around dangerously, though everybody besides us seemed to think it was safe."}, {"type": "sentence", "content": "We continued to walk beyond the opening, scared to be discovered by the people working on and at the ships. CLING, CLANG, these orcs are producing some serious weapons."}, {"type": "sentence", "content": "The force of our curiosity made us move back into clear sight. We were spotted by somebody wearing glasses, neatly and much better dressed than the four of us. The posh British accent combined with his body language and appearance made it evident that this man was well educated. The man’s attitude towards us made us relax. We were surprised by what he said."}, {"type": "sentence", "content": "“You’re in luck”, this time I noticed a slight Indian accent in some of his words. “Something big is going to happen in the next hour”, he said and his invitational hand gesture made us walk through the gate. After three days of road adventures through Gujarat, the fellowship had made it."}, {"type": "sentence", "content": "I think I can safely say none of us had expected to get a guided tour from the safety engineer on one of the most polluted beaches and arbitrary working conditions found on this planet. I think the man enjoyed showing the dockyard. He sensed that we were fascinated by what we saw and him being educated in Oxford, he knew very well Westerners our age don’t have a clue that places like this even exist."}, {"type": "sentence", "content": "We like to think of ourselves as successful countries. Especially countries like the Netherlands, where I am from. But here I was. On a stretch of beach of ten miles divided into 160 dockyards and every dockyard demolishing one or two ships from countries like The Netherlands, Denmark, Sweden, and Australia. The whole West was represented right there, although in garbage form."}, {"type": "sentence", "content": "The safety engineer explained how an oil tanker is demolished. We know how to build one, but how do you tear down one?"}, {"type": "sentence", "content": "“The ships are put in front of the beach of the dockyard which bought the ship. Two cylinders the size of a car attached to the ground by concrete and metal on the beach of the dockyard pull the ship in. An iron cable of a one-yard cross cut is spun from the cylinders to the tip of the ship. This line is used during high tide to drag the ships onto the beach”, he said. To this day I am trying to imagine how much force must be used to drag such a huge iron metal object onto a sandy beach."}, {"type": "sentence", "content": "Once the tankers and cruise-ships can’t be dragged any further the fun starts. The workers go inside the ship and start stripping any material or part which is useful. Couches, closets, windows, mirrors, cups, whole bar sets, chairs, tables, you name it. Everything of any value will be taken out. Once the ship is stripped completely its basically nothing but a lot of iron. Polluted with oil."}, {"type": "sentence", "content": "The suit-wearing Oxford-educated perfectly British accent speaking Indian man explained “in the old days we wouldn’t even take out the oil first. Nowadays, due to the visit of Greenpeace, the oil is taken out of the ships first. And the dockyards collect money to plant trees in other parts of India.” Does that make their business okay? I wonder."}, {"type": "sentence", "content": "“Now look at this ship as a cake”, the safety engineer said. “A big iron cake lying on the beach. In three months, the cake disappears. First, one slice of the cake is cut. The slice is pulled down and cut into smaller pieces. The smaller iron piece is thrown onto a truck and moved to an iron recycling factory close to Alang.”"}, {"type": "sentence", "content": "Twenty thousand Indian working men, a force larger than your average orc army, worked on the beach of Alang. Some wore shoes, some didn’t. Some wore helmets and others wore gloves. Most of the workers were dressed in a t-shirt, a pair of shorts, a helmet and a welding machine. The larger share of the workers did not wear proper protective gear. Imagine how hundreds of workers climb up the ship and start cutting the ship into one slice with nothing more than just hand welding machines. It takes ages. It means they have to cut through thick metal over a distance of 30 yards in width and a height of 40 yards. And then there are floors and rooms and walls inside the tanker."}, {"type": "sentence", "content": "The safety engineer said “We have just finished cutting one slice and within the next hour or so we are going to pull it down, using the same thick iron metal cable used to drag the ships onto the beach.”"}, {"type": "sentence", "content": "We sat next to the exit of the gate, in front of his office, on plastic chairs. We waited in vain."}, {"type": "sentence", "content": "The cable stretched over a distance of fifty to sixty yards. Workers from the dockyard had gathered and stood in the vicinity of where the slice would land. The workers stood dangerously close if you had asked me. The safety engineer did not see any potential danger in this."}, {"type": "sentence", "content": "The cylinder started turning and we could see the cable tightening. Every other few moments the energy it released made another sound which added to the constant iron and metal cacophony. The safety engineer gave orders through his walkie talkie. “Keep going, keep going”, he told the cylinder operator. “A little bit more, a little bit more.”"}, {"type": "sentence", "content": "BANG, a strong noise erupted from the cable. BANG! Another strong noise this time coming from the top of the ship. Something had given way up there. First I thought the cable itself was broken. I deemed it impossible a cable would be able to pull over this huge wall of metal."}, {"type": "sentence", "content": "For an instant, there was no tension on the cable. Immediately the cable tightened and then gave another strong pull. We all watched how slowly, a wall of iron the size of a cliff, started falling. The orc army started running. The wall started gaining speed. As the wall of metal started accelerating so did our emotions. To let our emotions out we started shouting and cheering. The faster the wall fell the louder our voices became. wooOOH!!!"}, {"type": "sentence", "content": "The ground beneath us trembled when the slice hit. The cloud of dust thrust into the air embraced the dockyard. The cloud of dust gradually disappeared and the workers started climbing on top of the slice to start welding. It was like watching ants cooperating to attack a larger insect. The level of human cooperation was unbelievable."}, {"type": "sentence", "content": "Several minutes and the first part of the slice fell on the ground. It was picked up by the crane which dropped the piece with a bang on a truck. Not much later the piece drove passed us out through the gate through which we entered, leaving no trace but flying dust particles behind."}, {"type": "sentence", "content": "‘You are lucky,’ the safety engineer had said. After having witnessed this action for two hours, after having been offered a peek into this world behind the barbed wire, walls and fences, we were thrilled and happy by what we had seen. Thus the engineer had been right."}, {"type": "sentence", "content": "It’s the workers who can not be considered lucky. For me the iron gate spanned over the entrance of Alang is reminiscent of the gate over the concentration camp of Auschwitz-Birkenau. Twenty thousand working men work on the beach of Alang in terrible conditions. Officially slavery is abolished. However in the current global capitalist economic system, it’s still present in a more modern form than the nineteenth-century version."}, {"type": "sentence", "content": "That same afternoon we drove back to the safe and sound environment of the island of Diu. As we drank our first untaxed beer, we talked about how our newly acquired motorcycle driving skills had been put to the test."}, {"type": "sentence", "content": "It was however not the motorcycle driving experience that stood out."}, {"type": "sentence", "content": "The visit to the Isengard of our planet earlier that day was by far the most memorable. In hindsight, we could have just entered through the main gate without a problem."}, {"type": "image", "content": "https://miro.medium.com/max/1920/1*lwyLtWFB8LBfbYA05KMHHQ.jpeg"}, {"type": "sentence", "content": "Thank you for reading this article. Ralph Deckers is a Dutch historian. He’s been traveling and guiding for years and has explored over 65 countries. Due to the corona crisis his tour leading work evaporated and so he decided to start writing on Medium."}], "topic": "travel"}