{"title": "Running a 1-Hour Dungeons & Dragons Virtual Team Building Event", "data": [{"type": "image", "content": "https://miro.medium.com/max/5120/1*xTwfIAoVTBNeHkgvKceSkA.jpeg"}, {"type": "subtitle", "content": "How I modified the D&D 5e system to build a 1-hour adventure for 10 coworkers and how you can use it to create an exciting virtual team get-together!"}, {"type": "sentence", "content": "Over the last 8 weeks my team has been very deliberately making sure that we all still feel connected and human during the stay-at-home order. We’ve been holding weekly virtual happy hours with rotating owners, ranging from trivia and card games to spreading kindness via post cards (which by the way if you haven’t checked out the Be Kind & Live Happy program it is seriously cool)."}, {"type": "sentence", "content": "When my turn came to own the weekly virtual happy hour I immediately knew that I wanted to run a Dungeons & Dragons session for the team. I thought it would be something new and unique (even for the team members who had played before). I have been running homebrew campaigns for roughly the last two years — so I knew that I could do it — I just had to figure out how to simplify the in-game systems enough that ~10 people who did not know how to play D&D could pick up and play through an adventure in about an hour. No easy task, but not impossible."}, {"type": "sentence", "content": "The rest of this article is geared towards people who have previous experience playing or running D&D games, since explaining the workings of the 5e system are way beyond the scope of this piece."}, {"type": "subtitle", "content": "Systems"}, {"type": "subtitle", "content": "Characters"}, {"type": "sentence", "content": "One of my favorite things about D&D is creating characters — but it’s time-consuming and complex. To simplify this process each character had only the following attributes:"}, {"type": "sentence", "content": "The philosophy behind generating these characters was to keep it as simple as possible while still retaining some of the core D&D elements like distinct class abilities and roles. Some guidelines I used to build out the actual values:"}, {"type": "image", "content": "https://miro.medium.com/max/1874/1*IUK8fd9SsMEXtaPkqkmZsA.png"}, {"type": "sentence", "content": "I put the character details and attributes into a shared spreadsheet and sent the link out a few days before the event in order to a) build up some hype, b) save time by not picking characters during the event, and c) get an estimate of how many people would participate."}, {"type": "subtitle", "content": "Skill Checks"}, {"type": "sentence", "content": "I removed saving throws and each character only has one skill that grants them a bonus. For that one skill, they get +5 added to their d20 roll; every other skill they just take the roll. This turned out to be a pretty good mechanism for making sure everyone gets involved, as people will want the character with a +5 investigation or +5 perception to check out rooms, +5 nature to follow tracks, etc."}, {"type": "subtitle", "content": "Combat"}, {"type": "sentence", "content": "The combat system had to be radically altered in order to function in this setting:"}, {"type": "sentence", "content": "This system was very effective at giving the players a bit of opportunity to experience the essence of a D&D encounter without having to deal with all of the dynamics that may cause them to lose interest (a round of combat took about 3 minutes with all participants getting to roll to hit and roll for damage)."}, {"type": "subtitle", "content": "Managing the Game"}, {"type": "subtitle", "content": "Setting Expectations and Explaining the Game"}, {"type": "sentence", "content": "It’s important to set the expectations for this session. I spent about 10 minutes doing this and answering questions. In general, I thought the important points to hit were:"}, {"type": "subtitle", "content": "Managing Combat"}, {"type": "sentence", "content": "The details of the game were managed within the shared character sheet (the characters I used can be found in this Github repository). Each person put their name next to the character they wished to play and input all gameplay information in the row associated with their character."}, {"type": "sentence", "content": "Each round, players will type in “attack” or “ability” in the Player Action column for their character on their collective turn. When they roll to hit, they input the dice roll value into the Hit Roll column and I highlight those that hit. Those that have a highlighted cell then roll for damage and input that roll into the Damage Roll column. Remaining enemy health is tracked on a separate spreadsheet."}, {"type": "sentence", "content": "If players use an ability that buffs another player (Bard, Cleric, Paladin) they first input the buff results into the Buff Gained column for their target ally. The remaining players then make their attack rolls."}, {"type": "subtitle", "content": "Managing Pace"}, {"type": "sentence", "content": "My team jumped right into the experience surprisingly quickly. They began interacting with each other and strategizing almost immediately. Keeping one eye on the clock and adjusting content on the fly will be key in making sure that your team gets through the adventure. If you’re struggling with engagement, giving them hints or dropping NPCs into the scenario can help them step out of their comfort zones."}, {"type": "subtitle", "content": "Dice Rolls"}, {"type": "sentence", "content": "There are several online dice rollers the players can utilize. I personally like teal dice roller since it shows realistic dice and it’s easy to use."}, {"type": "image", "content": "https://miro.medium.com/max/2312/1*nVomIhRRYB2dF36gfhKiOQ.png"}, {"type": "subtitle", "content": "Story"}, {"type": "sentence", "content": "The story was straightforward and fairly railroaded to reduce ambiguity for those who hadn’t played."}, {"type": "sentence", "content": "The adventurers hail from the nearby town of Heroesburg (which has a high number of adventurers per capita) and are heading to investigate reports of monsters in a nearby town. They start off in the forest at night to set the mood, one of the monsters launches past them in a blur. They chase the creature but it outruns them and as they spill out of the edge of the forest and into the town they can no longer see it."}, {"type": "sentence", "content": "The town consists of 2 main locations — a saloon and a butcher shop. There are tracks leading from the forest’s edge to the saloon, which has broken windows, smashed casks, furniture flipped over, and corpses inside. These corpses are partially transformed into werewolves, but not fully, and begin to resurrect and attack the characters as they go into the saloon (2 creatures, ~40 hp, each attack for 2d6 damage per turn, 8 AC). After combat, the adventurers hear movement in the back of the saloon as the large beast jumps out of the window, shattering it. As this happens, one more body pops up off the ground — a friendly NPC who owns the saloon and has been playing possum amongst the corpses for days. He describes the creature that’s been terrorizing their town as a werewolf and urges the heroes to hunt it down and kill it."}, {"type": "image", "content": "https://miro.medium.com/max/500/0*r0zJzTzsGxjDLmTp.jpeg"}, {"type": "sentence", "content": "The beast leaves tracks and a trail of blood leading to a building across the street, a butcher shop. The remnants of meat cuts mostly eaten by the beast hang in a back room where the players will find a cellar door that opens into a wooden stairwell. This stairwell leads down to a large basement with moonlight shining through a window, illuminating a werewolf that is that is devouring a large carcass. It turns to them, snarls, tells them they should have stayed in the forest, and attacks (100ish hp, makes a number of attacks equal to the half the number of players for 4d6 damage each)."}, {"type": "sentence", "content": "Using this system I successfully ran an hour-long adventure in which my team slayed a vicious werewolf. I followed it up by linking them to the D&D 5e starter set and telling them how they can use various online resources to manage and run amazing virtual games. Within 10 minutes, a number of them were talking about setting up a follow-up session as a future team event — so it seems to have been a hit!"}, {"type": "sentence", "content": "I hope that you can use this as a template for creating exciting and memorable experiences for your team. If so, please comment to let me know how it went!"}], "topic": "leadership"}