{"title": "The First Time I Drove Over the Hill to Downtown Los Angeles", "data": [{"type": "subtitle", "content": "I went to see the tall buildings, but I found myself in uncomfortable territory"}, {"type": "image", "content": "https://miro.medium.com/max/5846/1*POdx7_c0Jh_WUhT4eLGaFg.jpeg"}, {"type": "sentence", "content": "Recently, I saw a trailer for an upcoming musical remake of the ’80s movie Valley Girl. You may remember that it starred a young Nicholas Cage as Randy, the “bad boy.”The new movies looks awful, though Alicia Silverstone plays a mom in the remake, reminiscing about her younger days as Julie singing at the mall, a la her character Cher from Clueless. I also noticed one of my favs, Chloe Bennet from Marvel’s Agents of S.H.I.E.L.D. unbelievably playing a high school friend to the young Julie, but then I’m reminded of how old the actors were in the T-Birds and the Pink Ladies from Grease. But it was a scene from the new Valley Girl trailer in which they said “let’s go over the hill” that reminded me of my first time driving out of the valley into Los Angeles."}, {"type": "sentence", "content": "Growing up in the San Fernando Valley, a suburb north of Los Angeles, I was a reluctant driver. Traffic was increasing all the time, and I’d seen my share of bad driving. Still, southern Californians know how to drive in traffic, better than in most places. (Get off the road fast if it starts raining, though.) But in car culture, driving is freedom. So even though I was reluctant, I was excited to spread my wings when I turned 16."}, {"type": "sentence", "content": "The first time I drove a car, I crashed it. I “borrowed” my sister’s car when I was 15 and ran it over two trees on a corner lot. Lesson learned. Driver’s education and training was offered through our public high school. I was so tentative at first that my driver’s training instructor put his foot on top of mine to get me to accelerate. He had us drive through box canyon and casually pointed out, “Hey, that’s where the Manson gang hung out.” Helter-Skelter was a popular book at the time, and all my peers were reading it. His comments creeped us out, so we high-tailed it out of there."}, {"type": "sentence", "content": "My dad helped me with my driver’s training, accompanying me as I drove to and from work at a clothing store across the valley several nights a week. I wasn’t a fan of driving on the elevated freeway interchanges with their narrow, sloped ramps, but I finally mastered it at speed limit."}, {"type": "sentence", "content": "The big day came, and on my 16th birthday, I took the written test (100%) and a driving test with instructor (73%). Whew! Just made it. Seventy percent is the lowest passing score. Freeeee-dom!"}, {"type": "sentence", "content": "My first car was a hand-me-down green Plymouth Duster with white racing stripes on the side. It was perfect for me and my buddies to cruise around the valley. As our radius slowly started to increase, one night I suggested that we go over the hill to Westwood, where UCLA is located, and see a movie in Westwood plaza. Afterwards, we could drive around downtown L.A. where the big buildings are while all the traffic is gone for the day. My friends were psyched. Sounds rad, they said, as we all said back then."}, {"type": "sentence", "content": "The traffic going over the hill on the I-405 South, the San Diego Freeway, was always fairly heavy. We had to go over the famous Sepulveda Pass, the Big-S, that connects the valley to the Los Angeles basin, about 5 or 6 miles up one side and down the other."}, {"type": "sentence", "content": "After the movie in Westwood, we cruised downtown. Most of the valley doesn’t have one-way streets, but like many downtown districts, Los Angeles does. I had to watch the streets carefully to figure out how to get right smack downtown where the tallest buildings are. There was no GPS. I had a Thomas Guide map book in the car, but of course, I couldn’t read that while I was driving."}, {"type": "sentence", "content": "The streets were eerily quiet and dark. There was absolutely no traffic and no activity. Downtown Los Angeles isn’t built for nightlife, like say Vancouver, Canada, or San Diego or San Francisco. But then we saw a car without headlights riding slowly along."}, {"type": "sentence", "content": "This car was a dark green low-rider, a Chevy of some kind. The windows were dark, and the car followed the same path we were on. At one point, it seemed that he was pulling up next to us slowly, but then he sped beyond us. We couldn’t make out who was in the car, but it was definitely creepy. They turned away from us and for a time we were alone looking up at the enormously tall buildings."}, {"type": "sentence", "content": "Then we saw the car again heading toward us slowly. All of a sudden, we heard tires squealing in front of us as the dark green car tried to turn away quickly. But the car stopped quickly, barricaded in by a dozen police cars, Los Angeles black and whites, with lights blazing and sirens blaring, emerging as if from shadows, six in front and six in the back, skidding to a stop, blocking the green car in. I looked around to see if maybe they were filming a movie, a common site in Los Angeles. Nothing of the sort."}, {"type": "sentence", "content": "We had nowhere to go and were able to watch a lot of this from a stop sign about 100 yards away. Officers emerged from the cars with guns drawn and they pulled the occupants from the car quickly and cuffed them. And then we saw it. The officers opened the trunk and started off-loading a massive amount of firearms, what looked like automatic or semi-automatic rifles, by the armful."}, {"type": "sentence", "content": "Our hearts raced, and I looked for the nearest one-way to scamper back home. I turned right and my friends watched the events unfold from the back window. It was late by this time, and I made my way to the freeway for the 20 minute ride back to the valley. No one said a word."}, {"type": "sentence", "content": "We breathed easier when we saw the lights of the San Fernando Valley unfold as we came over the Sepulveda Pass. I never get tired of seeing the valley adorned in glittering night lights. The valley was our home, our safe haven in this wide weird wonderful world. We knew that terror and crime existed, but we were mostly sheltered from it."}, {"type": "sentence", "content": "Our world had yet to be shattered by mass shootings and terrorist bombings. The valley suburbs afforded us space to roam in safety, on foot, by bike, and by car. When we were ready to enter the harsher realities of the world, of the world over the hill, we could. But for this night, safety and solace in the valley was enough, where we could see the stars shine, where the aquaduct brought water from the north, flowing down through The Cascades above San Fernando."}, {"type": "sentence", "content": "Lee G. Hornbrook taught college English for 25 years in every time zone in the continental United States. He has lived on a sailboat and writes about film and movies, literature, baseball, and growing up in the San Fernando Valley. He edits the Medium publication Valley Dude and is at work on a memoir. Find him on Twitter @awordpleaseblog and at his personal blog A Word, Please."}], "topic": "travel"}