{"title": "This Is Your Brain on Remote Work", "data": [{"type": "subtitle", "content": "A look at the science behind working at home, and what you can do to avoid cognitive pitfalls"}, {"type": "image", "content": "https://miro.medium.com/max/7822/1*hSEhQtfVU1g1yNDaS3SgHg.jpeg"}, {"type": "sentence", "content": "We’re living through the biggest remote-work experiment in the history of the office, but even before the coronavirus pandemic forced nonessential workers to stay home, remote work was a popular option for U.S. workers. According to a 2019 Owl Labs survey of full-time employees, 62% of the respondents worked remotely at least once a month, and 83% agreed that “the ability to work remotely would make them happier.”"}, {"type": "sentence", "content": "But in exchange for gaining geographic independence and, in the case of the ongoing pandemic, increased safety, what might remote workers be losing by staying home? How does remote work actually affect the brain — and how might that affect a company’s operations? Do we lose productivity if we’re digitally connected but physically alone?"}, {"type": "sentence", "content": "It turns out that remote workers can build relationships and communicate just as effectively as they can in an office. Leaders, however, need to set them up for success. There are specific strategies and tactics that will ensure that your team can thrive in this brave new world. Here are the five key ways remote work impacts the brain and what you can do about it."}, {"type": "subtitle", "content": "Building relationships digitally is easier than you think"}, {"type": "sentence", "content": "There is a common misconception that remote workers won’t build strong relationships and company productivity will suffer as a result. The good news is this doesn’t appear to be true. In a remote world, bonding may take longer, but it does happen and can even “reach levels present in face-to-face communication,” according to a 2013 study published in Cyberpsychology."}, {"type": "sentence", "content": "In fact, remote communication could actually be better for business, because it can bring a team closer together. “For strangers meeting for the first time, digital communication has been shown to enhance the intimacy and frequency of self-disclosure,” according to the researchers. They noted that “strangers meeting in text-based environments show higher affinity for one another than strangers meeting one another face to face.”"}, {"type": "sentence", "content": "Perhaps more importantly, study participants reported the same level of bonding after video chats as they did after in-person interactions. The level of bonding did decrease, however, with audio and instant message communication."}, {"type": "sentence", "content": "What does this mean for business leaders? First of all, relax: Although we’re all facing myriad challenges right now, you don’t have to worry that remote work will degrade relationships between your employees. However, you may benefit from prioritizing video chat over other forms of communication."}, {"type": "subtitle", "content": "Frequent interactions are key"}, {"type": "sentence", "content": "All of this assumes that your employees are still remotely interacting with each other, but some jobs actually require very little communication. In normal times, these employees may have still had social interactions with co-workers in the office, even if their work was mostly completed alone."}, {"type": "sentence", "content": "Leaders need to pay extra attention to these workers right now who could be feeling isolated. Reach out to them and have a chat. Ping them on Slack to ask them about their weekends. And create opportunities for them to interact with others. Include them in meetings that they might not otherwise be in, or create social opportunities like virtual happy hours."}, {"type": "subtitle", "content": "Negotiations require a virtual handshake"}, {"type": "sentence", "content": "Business leaders also have to find new ways to establish trust when meeting people for the first time, especially before a high-stakes negotiation."}, {"type": "sentence", "content": "One study found that negotiators who shook hands achieved better outcomes. Negotiating parties who shook hands were also less likely to lie, according to the researchers."}, {"type": "sentence", "content": "Does that mean remote negotiations are doomed? No. The handshake works, the authors say, because it is a “signal of cooperative intent.” If you’re engaged in a remote negotiation, try doing the same thing verbally. Make sure to start the conversation in a friendly way and verbally express your intent to come to a mutually satisfactory agreement."}, {"type": "subtitle", "content": "Video calls are harder than in-person meetings"}, {"type": "sentence", "content": "My sister is a teacher, so she used to spend 5% of her workday on a screen. Now that number is closer to 100%. It didn’t surprise me when she reported feeling more drained at the end of the workday."}, {"type": "sentence", "content": "Video calls are harder than in-person meetings because you’re constantly either multitasking or resisting the urge to multitask. And resisting the urge to multitask, it turns out, may be just as hard as actually doing it."}, {"type": "sentence", "content": "A 2017 University of Texas McCombs School of Business study found that your cognitive capacity is significantly reduced when your smartphone is nearby, even if you’re not using it. In the study, participants were asked to take a test that required full concentration. Some participants were randomly assigned to put their smartphones on the desk face down, others placed it in a pocket or bag, and others put it in another room."}, {"type": "sentence", "content": "The participants who put their phones in another room “significantly outperformed” those who had their phones on the desk in front of them, and “slightly outperformed” those who put their phones away but kept them nearby."}, {"type": "sentence", "content": "“As the smartphone becomes more noticeable, participants’ available cognitive capacity decreases,” University of Texas marketing professor and study co-author Adrian Ward told UT News. “Your conscious mind isn’t thinking about your smartphone, but that process — the process of requiring yourself to not think about something — uses up some of your limited cognitive resources. It’s a brain drain.”"}, {"type": "sentence", "content": "This is certainly true on video calls — and you can’t put your laptop in another room. There are some things you can do to mitigate this challenge. Going on “Do Not Disturb” mode helps; shutting all applications and browser windows is even better. If you’re a manager, keep meetings short if possible and build in breaks for any meeting over an hour."}, {"type": "subtitle", "content": "Remote work often means longer hours"}, {"type": "sentence", "content": "Although many people celebrate remote work environments for their flexibility, that can also be a double-edged sword. A recent study by NordVPN Teams found that people in the United States are logging on for an additional three hours of work per day. Owl Labs also found that remote workers were 43% more likely to exceed a 40-hour workweek compared with nonremote workers. If you’re not careful, your employees could burn out, especially now, when many of them are also full-time caregivers and part-time homeschool teachers for their children."}, {"type": "sentence", "content": "Burnout has a significant impact on the brain. In an interview with Bustle, Dr. Sanam Hafeez, a New York psychologist, claimed that when you’re burned out, “your brain loses the ability to shift states easily, utilize energy, and maintain positive mood balance.”"}, {"type": "sentence", "content": "Business leaders should take this very seriously. Take another look at the hours your staff is logging during the day. If you find that they’re well beyond normal working hours, don’t be afraid to make drastic changes to encourage them to rest. Companies such as Volkswagen go so far as shutting off their email systems after working hours."}, {"type": "sentence", "content": "And be mindful of your own habits. A study by Microsoft found that for every hour a manager works outside of normal hours, their direct reports work an extra 20 minutes. If you’re stretching yourself thin, you’re likely putting pressure on your staff to do the same."}], "topic": "neuroscience"}