{"title": "How to Listen to Paradigm Shifts", "data": [{"type": "sentence", "content": "Reading Radical Uncertainty"}, {"type": "image", "content": "https://miro.medium.com/max/4080/1*lxm384fPJJQNhIH7t1fBBw.png"}, {"type": "sentence", "content": "As a follow-up to my previous article, Thriving in Radical Uncertainty, I want to go deeper into the first of the three themes that make up the paradigm strategic framework: Listen. This part of the framework is crucial because it is where leaders can discover where in the paradigm process they are at a given moment. Knowing this is crucial because it will shape the strategy, particularly when the environment is going through a paradigm shift. In a paradigm shift, the strategic approach should change because this period marks changing levels of uncertainty. This uncertainty requires greater levels of resilience, adaptability and innovation then “normal” periods where things are stable and the past offers credible clues to future results."}, {"type": "sentence", "content": "The listening phase, therefore, is focused on picking up signs of uncertainty, of barriers breaking down and general levels of dissatisfaction and no clear idea of how to address the dissatisfaction. All this indicates that there is a paradigm shift going on. As I mentioned in Thriving in Radical Uncertainty, these characteristics were present in the music industry in the 1990s and early 2000s. A similar situation emerged over the last 5–10 years with membership organisations."}, {"type": "subtitle", "content": "An example of listening: membership organisations"}, {"type": "sentence", "content": "Starting in 2015, I worked with a number of membership organisations. While they were in different sectors, they were all looking to digital transform themselves. As part of my standard methodology, I conducted extensive interviews with staff, members and the wider community within their specific sector. What came out of these interviews and additional research was a picture of frustration, confusion and uncertainty. Generally, the people in the organisation, regardless of their role, were frustrated. Leadership saw declining membership and revenue, but found the traditional levers to reverse these trends did not work. Staff were seeing real needs from members, prospective members and the wider community that were not being met. Members felt they were not getting what they needed and what they were getting didn’t match their needs or situations. In one case, there were many members who said that they would not have remained members if it were not necessary for their professional accreditation."}, {"type": "sentence", "content": "Another trend that emerged from the listening exercises was that the field that the organisations addressed had changed. For example, one organisation was faced with the fact that part of its members work was now being done by people who didn’t have specialist training in the field. While they may have attended some courses in it, the very nature of their generalist orientation meant that they may not have been up to date on the latest guidance in that field. The clear lines between professions were becoming blurred and there was a need to address the different communities of people who worked in the field."}, {"type": "sentence", "content": "In addition to the breaking down of the barriers, another source of confusion and frustration was the fact that there was now an abundance of information. In the print era, books and magazines were not so easy to distribute globally. As a result, a membership organisation in the UK would be the dominant source of knowledge for the topic. The likelihood that members would get material from the USA or Germany and find it relevant, was minimal. All that has changed now thanks to digital publications and global standards.An association I worked with found that many of its members were using material from the US because it was available online and was seen as being the standard for the practice. As a result, the UK organisation’s member renewal rate was on a steep downward slope."}, {"type": "sentence", "content": "This brings up the other characteristic of paradigm shifts that the listening exercise picked up: the frustration of not knowing what to do. Within the context of these organisations’ structure, it was difficult to see how to address what was happening. All of them were nationally based and built around serving a particular role, such as paeditrician or copyright lawyer or public sector accountant. They were also built around a print and physical event model that had certain fixed costs that had to be met through member dues. Given this operational and financial model, they were finding it difficult to see solutions to the changed environment. When they did try to undertake some form of digital transformation, for example, as I mentioned in a previous article, the implications of the change were too much for some to accept."}, {"type": "subtitle", "content": "The process of paradigm shifts"}, {"type": "sentence", "content": "In summary, what these listening exercises showed was that the paradigm that gave rise to membership organisations was collapsing. The foundational question of the sector’s paradigm was how to disseminate a scarce resource: knowledge, in an environment where publication and communication were expensive, fragmented and slow. The organisations had been successful because they were, for the most part, the only place that professionals could get up-to-date knowledge about their field, network with colleagues and develop professionally."}, {"type": "sentence", "content": "This had changed with the emergence of digital technologies and a gradually blurring of roles within sectors. The pool of people who needed some level of information about a topic has increased while the cost to publish and distribute that information and make it available almost to anyone, decreased."}, {"type": "sentence", "content": "If the foundational question that membership organisations were created to answer was no longer valid, what was their purpose? This is the issue that arises from the listening exercise and is the key one for the paradigm shift period."}, {"type": "sentence", "content": "What was clear, was that there was no clear “new normal” that everyone agreed on. Some people thought membership organisations were not even needed. Others saw them taking on a range of new roles but most thought that they could continue in the same basic model, just offering different products or reaching out to new audiences."}, {"type": "sentence", "content": "All this is characteristic of the early stages of the paradigm collapse. With the Covid-19 pandemic, everything has accelerated. It is much more clear that the old model is not going to survive. The disruption has cleared the field, so to speak, and open it up for innovation. Again, listening helps to identify the various potential new foundational questions that are being posed and need to be addressed, as well as which ones are starting to pick up traction. In this case, the fundamental question may be how to distribute appropriate and authoritative information and skills to a broad range of people involved in a particular topic. It may well be something else. What was clear from these listening exercises was that no consensus had emerged as to what the question was. If there had been consensus, then all the organisations would have to do would be to transform themselves into the new model."}, {"type": "sentence", "content": "Instead, there was uncertainty and some hints of a new direction. The result of these listening exercises was the realisation that the organisations would need to build the ability to handle the uncertainty and to begin to shape it."}, {"type": "subtitle", "content": "Thriving in uncertainty"}, {"type": "sentence", "content": "If the key characteristic of this phase of the paradigm shift is uncertainty, what can organisations do? The focus should be to build in resilience and adaptability in the organisation. This can include innovation, diversification and R&D. It also asks for a heightened level of sensitivity to the external environment from the organisation. This means engaging with customers, analysing trends and activity as broadly as possible to identify risks and opportunities as early as possible and track them as they develop. As a result, a different approach to strategy and to market analysis is needed. While it may not be something that many businesses normally do, it is precisely because we are not in normal times that listening is a key theme for thriving in radical uncertainty."}], "topic": "leadership"}