{"title": "What coronavirus means for the UK property market", "data": [{"type": "sentence", "content": "Kinden Property | 2020 May 05"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*kt3Bt5OpgdtRRbFP"}, {"type": "subtitle", "content": "Immediate Impact"}, {"type": "subtitle", "content": "Drop in demand"}, {"type": "sentence", "content": "Even before the lockdown restrictions were put in place, Zoopla reported a rapid decline in online browsing and registered demand since March 13th (when Boris Johnson asked the nation to work from home if you can). This bottomed out at around the end of March at a level that is -70% compared to activities as of March 1. Since then, browsing levels have recovered partially, more so than registered demand."}, {"type": "sentence", "content": "However, the severity of the drop is more of a “delay interest” rather than “stopped looking altogether” as evident in the improving demand as we move closer to potential lockdown ease. In the recent Savills Global Market Sentiment Survey, only 10% of estate agents said 30%+ of their buyers have stopped looking."}, {"type": "sentence", "content": "In the Prime Market, defined as the top 5 to 10%, Savills see their website traffic from w/c Apr 13 now back up pre-COVID levels, however this is mostly driven by a +38% increase from overseas viewers. New buyer registration at Savills is still much lower, although they see more robust recoveries in the country than London. Similarly, Zoopla notes demand recovering the most in Manchester and Liverpool."}, {"type": "subtitle", "content": "Activity brought to a Standstill"}, {"type": "sentence", "content": "Zoopla reported new sales agreed are down 90% since early March, with the remaining agreed on viewings that either occurred prior to lockdown or in more limited cases, investors going ahead post virtual viewing. With no clear date on lockdown being lifted, and the nature of pricing evidence being delayed, it’s unlikely we will see concrete evidence in the next 2 months."}, {"type": "sentence", "content": "Activity will take time to recover. Currently, Zoopla is predicting a 50% drop in transactions in 2020 compared to 2019. Savills see a 37% — 50% drop for 2020, back to a similar level in 2021 and a 13% increase for 2022."}, {"type": "subtitle", "content": "Seller Sentiment"}, {"type": "sentence", "content": "Since the lockdown, little new selling instructions are coming to the market. For those with existing selling instructions, only 6% are considering removing from the market or have already removed from the market according to the Savills Global Sentiment Survey. The remaining vendors are roughly split 50:50 between those leaving it at the same price, and those considering or already lowered the price."}, {"type": "subtitle", "content": "Driver for Medium to Longer-Term Impact"}, {"type": "sentence", "content": "It would be hard to assess the impact on house prices on a medium to longer-term without first looking at the impact on the wider economy."}, {"type": "subtitle", "content": "GDP and Unemployment Rate"}, {"type": "sentence", "content": "While most economists are talking about a V-shaped economic outlook, with a severe drop in GDP in Q2, and a bounce back in the quarter-on-quarter GDP number in Q3 (while on the road to recovery to pre-virus level). This is assuming the full lockdown lasts until the end of Q2 and begins to ease during Q3. While this is the most likely scenario as a base case, there also exists more downside than upside. For example, if the current lockdown is extended into Q3, or if there is a second wave when autumn flu season hits. Some notable figures like Ray Dalio are talking of a deeper drop and much slower recovery (in view of the US economy)."}, {"type": "sentence", "content": "The Office for Budget Responsibility (OBR) in the post-COVID scenario below sees real GDP drop 35% in Q2, recovering back to its pre-virus level by Q4, with half the second-quarter fall unwinding in Q3. This would add up to a 13% annual GDP drop for 2020 on a whole, worth noting that this would exceed any of the annual falls in the wars and the recent great financial crisis. The recent monetary policy report by the Bank of England assumes a -14% GDP for 2020 and +15% in 2021."}, {"type": "sentence", "content": "Unemployment pre-COVID was at historical lows of 4%. This also expected to increase very fast in Q2 as the sharp rise in Universal Credit already shows, even with the government pledged help in place. OBR sees unemployment rise to 10% before falling to 7% in Q4. BOE projects a similar view, it would take until 2022 for the unemployment rate to be around the 4–4.5% level again. To compare with the recent crisis, at its highest, unemployment was 8% in 2009."}, {"type": "sentence", "content": "Doing a simple back-of-the-envelope supports this view. Currently, 23% of the 28million employed workforce are on furlough, post lockdown businesses would be on the road to recovery, it’s hard to see them getting 100% of the furloughed employees back. Many companies will be cash-flow constrained and cautious, for business survival, it’d be easier to fire fast and hire slow. So if we assume 25% of the furloughed employees lose their jobs and 10% of the self-employed closeup. That would take the 4% unemployment rate to 7%."}, {"type": "subtitle", "content": "Housing Shortage"}, {"type": "sentence", "content": "The under-supply of new homes needed in England is an ongoing long term issue that will only be worsened. Estimates have put the number of new homes needed in England at around 340,000 per year, this accounts for new household formation that is growing by around 160,000 a year and a backlog of existing need for suitable housing."}, {"type": "sentence", "content": "The backlog included estimates of households that are overcrowded or living in unsuitable or unaffordable accommodation as well as adults who would prefer to live separately from their current households. The “need” being different from “demand” as given affordability households would all want more space."}, {"type": "sentence", "content": "Post each crisis, house building activities take a few years to recover, not to mention many nationwide house builders stopped on-site activities post lockdown announcements this time around. This under-supply would help to support the housing price in the longer-term horizon."}, {"type": "subtitle", "content": "Availability and Terms of Mortgages"}, {"type": "sentence", "content": "On a more positive note for the housing market, and in contrast to the last crisis, credit remains readily available and interest rate is already at historically low levels. While banks initially withdrew some of the higher LTV products, they are now starting to bring these back. Rates available to borrowers are similar to pre-COVID levels."}, {"type": "sentence", "content": "Looking at the next 2 years ahead, base rates are unlikely to increase either."}, {"type": "subtitle", "content": "Household Income and Wealth"}, {"type": "sentence", "content": "The drop in stock markets would have hurt the household wealth, some buyers would have seen their deposit pot shrink up to 30%, but it is likely to affect London more than the rest of the country. Similarly, areas with more concentrated employment in the industries most affected by COVID like travel, tourism will be hit with a higher proportion of unemployment reducing household income."}, {"type": "subtitle", "content": "Sentiment"}, {"type": "sentence", "content": "A key short term driver that is probably the hardest to judge right now. From recently speaking to a conveyancing lawyer based in London, some of her clients in the purchasing process have successfully negotiated a discount off the originally agreed selling price, but it was a more modest -5% level. While some buyers will pause, those that feel their employment is secure is likely to continue searching, although they will likely expect a discount."}, {"type": "sentence", "content": "Sellers, on the other hand, having not experienced a boom, are perhaps unwilling to give large discounts unless they are “forced sellers”, or looking to move on themselves in a chain transaction. This limited supply could help to support price drops from drops experienced post the last crisis ( -17% p.a. observed in 2009 Q1 followed up +10% next 12 months)."}, {"type": "subtitle", "content": "House Price Forecasts"}, {"type": "sentence", "content": "The economists at CEBR predicted that house prices will tumble by 13% by the end of 2020 as transactions dwindle and homebuyers are hit by a deep recession. — Apr 14"}, {"type": "sentence", "content": "In its interim financial statement, Lloyds Banking Group said it has been working on the assumption prices will fall by up to 5% this year, before recovering by 2% in 2021. — Apr 30"}, {"type": "image", "content": "https://miro.medium.com/max/2972/1*2ww_z8pa4ehLcfxnsl4MzA.png"}, {"type": "sentence", "content": "Based on the V-shaped economic outlook, Savills provides two scenarios."}, {"type": "sentence", "content": "Over a longer horizon, respondents in the most recent RICS sentiment survey currently expect price growth to average just over 2.5%, per annum, over the next five years. I.e. a cumulative of 13%. — Apr 20"}, {"type": "sentence", "content": "The forecast for 2021 being a rebound year is based on the assumption that GDP recovers to pre-COVID level in Q4 this year and we do not have prolonged double-digit unemployment."}, {"type": "subtitle", "content": "Winners and Losers"}, {"type": "sentence", "content": "Worth noting that, there may be a shift in what people desire in a property post this COVID-19 pandemic. After months of lockdown and working from home, people are rethinking their use of space. Estate agents are expecting to see green space in various forms being on top of buyer’s wishlist, as well as extra space for a home office."}, {"type": "sentence", "content": "With new remote working systems successfully adopted by many companies during the past months, companies that have previously resisted the working from home requests may find it hard to revert back to the pre-COVID office routine. If working from home is on the rise, along with the desire for more greenery and more home space, young families may look to move out of big cities. Combined with the affordability pressure in London, the £750k 2 bedrooms Victorian flat in South West London that yields only 2.5% has more to lose than a £500k 3 bedroom house 1–2 hour commute away."}, {"type": "sentence", "content": "Tina Liu"}, {"type": "sentence", "content": "Director | Kinden Property"}, {"type": "sentence", "content": "Sources and Further Reading:"}, {"type": "sentence", "content": "[1] UK Cities House Price Index — March 2020 — Zoopla Apr 28"}, {"type": "sentence", "content": "[2] Webinar: What Covid-19 means for the UK residential property market — Savills Apr 24"}, {"type": "sentence", "content": "[3] Savills Residential Global Market Sentiment Survey — May 04"}, {"type": "sentence", "content": "[4] U.K. residential market survey — RICS Apr 20"}, {"type": "sentence", "content": "[5] Coronavirus analysis — OBR Apr 14"}, {"type": "sentence", "content": "[6] Bank of England Monetary Policy Report — May 7th"}, {"type": "sentence", "content": "[7] Tackling the under-supply of housing in England — March 09"}], "topic": "economy"}