{"title": "I Am a Radical Feminist", "data": [{"type": "subtitle", "content": "Or so I’ve been told by a guy I didn’t sleep with"}, {"type": "image", "content": "https://miro.medium.com/max/12000/1*gAEHk6RGO0VxzSt-wlcmrw.jpeg"}, {"type": "sentence", "content": "There are a few places that are bound to absorb the odor of rotten utterances."}, {"type": "sentence", "content": "Twitter."}, {"type": "sentence", "content": "The comments section of pretty much any public figure or newspaper."}, {"type": "sentence", "content": "And Instagram DMs."}, {"type": "sentence", "content": "For the most part, I have given the first two a rest."}, {"type": "sentence", "content": "I’m not a massive ‘grammer, either. But I have heard tales of inboxes resembling the dark, putrid alley at the back of a glamourous theatre."}, {"type": "sentence", "content": "Now I know why."}, {"type": "sentence", "content": "There’s this guy (when is there not?) Let’s call him Jose*."}, {"type": "sentence", "content": "Jose and I didn’t speak for about 3 years, for a valid reason which I will get to in a minute."}, {"type": "sentence", "content": "One rainy day last year, I get a ‘Hi’ from a foreign number. I don’t recognise it and the Whatsapp picture just isn’t clear enough. To be fair, I’d just had a head injury so that probably didn’t help."}, {"type": "sentence", "content": "I’ll spoil the surprise for you — although you may have guessed — yes, it was Jose, messaging me from the pits of the ex-lovers underworld."}, {"type": "sentence", "content": "We have a polite exchange of niceties, with how-are-yous and where-are-yous. He attempts an allusive apology by saying he sacrificed our friendship for superficial purposes. That’s one way of putting it, I suppose."}, {"type": "sentence", "content": "After which, I find myself minutely perplexed and proceed to deal with my illness."}, {"type": "sentence", "content": "It may be relevant to mention that I noticed Jose was following my stories on Instagram way before he said hello."}, {"type": "sentence", "content": "So when I saw him sending a random meme to my Instagram inbox last week, I was slightly less perplexed."}, {"type": "sentence", "content": "There was more polite chatter, this time with increasing intellectual notes and political opinions. Eventually, time zones had the final say and our discourse ended."}, {"type": "sentence", "content": "Until one fateful day this week, when I was alerted to a faint smell of decay in my DMs."}, {"type": "sentence", "content": "An eerie feeling reminiscing of past emotional manipulation creeped up my spine as I read this."}, {"type": "sentence", "content": "However, as the newly matured confident young lady that I am, I replied with candour and grace."}, {"type": "sentence", "content": "Sure enough, my fungi detector had not been mistaken. The moulding pile of putridity came unabashedly into full view."}, {"type": "image", "content": "https://miro.medium.com/max/1902/1*WhAfEZaNJHTEslcCaXWaCg.jpeg"}, {"type": "sentence", "content": "Whilst I have a few many thoughts on this twist of events, I’d like to briefly relate how my relationship with this man came to a halt one June day in 2016."}, {"type": "sentence", "content": "He was touring Europe. I lived in London."}, {"type": "sentence", "content": "We’d met in London a year prior. He flew back to the US soon after."}, {"type": "sentence", "content": "We became close friends, pen-pal style. We spoke every day."}, {"type": "sentence", "content": "I said he was welcome to stay at my place when he gets to London in 2016."}, {"type": "sentence", "content": "He did."}, {"type": "sentence", "content": "On his second day over, it became apparent we wanted different things."}, {"type": "sentence", "content": "For the rest of his stay, I awkwardly proceeded to show him around, while he interspersed architectural commentary with self-victimising reminders of his rejection."}, {"type": "sentence", "content": "Before catching his flight back at 2 AM, he tried to kiss me. I pulled back."}, {"type": "sentence", "content": "He left expressing his disappointment via a hefty text. Upon reaching his homeland, he avoided my messages for days and, when replying, he injured me with such statements as ‘You’re a sub-species of humans’ and ‘Hospitality comes full service.’"}, {"type": "sentence", "content": "And why? On his second day, he had offered to engage in intercourse. I said no, with reasons including, but not limited to, me seeing someone else."}, {"type": "sentence", "content": "So he elected to guilt-trip me for my lack of consent, and end our friendship because he didn’t get sex."}, {"type": "sentence", "content": "It made me marvel how our comradery lasted as long as it did."}, {"type": "sentence", "content": "Considering the fact that, now, he sees the error of his ways, it is understandable why he’d dramatically ask, ‘do you hate me?’"}, {"type": "sentence", "content": "However, I did struggle to understand the extrapolation of his own wrongdoings to the implied assumption that ‘I hate all men.’"}, {"type": "sentence", "content": "Thankfully, he came to my cognitive rescue."}, {"type": "sentence", "content": "“Radical feminist.”"}, {"type": "sentence", "content": "I am a “radical feminist.”"}, {"type": "sentence", "content": "I should be so fortunate."}, {"type": "sentence", "content": "I should be so utterly blessed to have the time, patience, pathos, generosity, audacity, grit, “I don’t give a fuck”-ness to be a radical feminist."}, {"type": "sentence", "content": "In truth, what he described as “radical feminist” was related to some of my Instagram posts last year, sharing the achievements and promotional material for my business. I ran a leadership programme for women in work and study."}, {"type": "sentence", "content": "“Radical feminist.”"}, {"type": "sentence", "content": "Not only have I never expressed hatred towards men, I barely, if at all, mention them."}, {"type": "sentence", "content": "Think about that."}, {"type": "sentence", "content": "I barely mention men in my work and leisure, and I am being asked if I hate men."}, {"type": "sentence", "content": "When I do mention the existence of phallus-bearing humans, it is to quote reliable gender-segmented data checking the progress on income inequality or sexual harassment."}, {"type": "sentence", "content": "Not on my ‘gram, though. That’s for pretty pictures and rainbow emojis."}, {"type": "sentence", "content": "“Radical feminist.”"}, {"type": "sentence", "content": "One could give Jose the benefit of the doubt. He did lol through his remarks. Maybe he was joking."}, {"type": "sentence", "content": "Except no one was laughing."}, {"type": "sentence", "content": "Let’s agree, once and for all, that women are statistically disadvantaged relative to men of the same ethnicity/ nationality, and feminism is still perceived as an anti-men movement, as opposed to an equality movement."}, {"type": "sentence", "content": "Would it be funny if a white person said to a black person, ‘200 years ago I could have owned you lol.’"}, {"type": "sentence", "content": "Would it be funny if an abled person said to a disabled person, ‘you must campaign for disabled rights because you hate abled people lol.’"}, {"type": "sentence", "content": "If you cringe at that, then you should cringe at ‘you hate men cuz you’re a radical feminist lol.’"}, {"type": "image", "content": "https://miro.medium.com/max/1886/1*SXCLkKz8_jqG5hhMs1HjPw.jpeg"}, {"type": "sentence", "content": "This is the bit where I am expected to shake the ground and erect a monument of 10 Commandments for Not Being a Misogynistic Prick."}, {"type": "sentence", "content": "But you already know what they are."}, {"type": "sentence", "content": "We’ve had #MeToo."}, {"type": "sentence", "content": "We’ve had #TimesUp."}, {"type": "sentence", "content": "We’ve had studies upon studies upon studies on systemic misogyny, microaggressions and the socio-economic implications of gender inequality."}, {"type": "sentence", "content": "So I’ll spare you the 101."}, {"type": "sentence", "content": "I am speaking up because I am tired of staying silent."}, {"type": "sentence", "content": "I am writing about my experience with sexual harassment because I am heartbroken when yet another friend confides that she survived rape."}, {"type": "sentence", "content": "I am saying time’s up and me too and any other hashtag you give me, if it means our collective voice is louder."}, {"type": "sentence", "content": "I am beseeching all the men in my life and beyond who don’t want to be in the same category as “that guy.” Please speak up for what’s right. Please don’t correlate equality with hate. Please use your privilege to be an active ally."}, {"type": "sentence", "content": "I punctuated Jose’s dilemmatic assumptions with a cryptical ‘I see.’"}, {"type": "sentence", "content": "In another world, where he is more worthy of a direct response, Jose would be informed that:"}, {"type": "sentence", "content": "No, dear old friend. I do not hate you. In fact, I have no feelings for you whatsoever. The only reason I have entertained you in my thoughts for the last few hours was so I could showcase you to the world as a textbook example of male privilege and gender-based manipulation."}, {"type": "sentence", "content": "And that hurts more than being hated, doesn’t it?"}, {"type": "sentence", "content": "*Name has been changed for privacy purposes."}], "topic": "social-media"}