{"title": "The History of the id Tech Engine", "data": [{"type": "image", "content": "https://miro.medium.com/max/2048/0*t4ScJqCZGB7QiDiq.png"}, {"type": "sentence", "content": "In March, after several delays, id Software’s Doom Eternal finally hit shelves, and true to id Software form, it’s a damn fine looking game. That’s thanks to the latest iteration of id Software’s game engine, id Tech 7. Since its first appearance in Doom (id Software, 1993), id Tech has been at the forefront of pushing hardware to its limits, and the id Tech legacy lives on in the many games it gave birth to — games such as Jedi Outcast, Rage, Dishonored, and Valve’s GoldSrc and Source engine. While it might not enjoy the same dominance today as it once did (that title goes to Epic’s Unreal Engine), id Tech is still one of the most influential engines in gaming history. Here’s a look back at the powerhouse under id Software’s hood."}, {"type": "subtitle", "content": "Doom Engine (id Tech 1)"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*4dDwiQerp8jyWjgZXr-_jQ.png"}, {"type": "sentence", "content": "The Doom engine, as it was then known, was the brainchild of John Carmack, lead programmer and founder of id Software. After Wolfenstein 3D’s success, id Software decided to begin development of their next generation engine. With additional input from John Romero, Dave Taylor and Paul Radek, the engine debuted with Doom in 1993. What made id Tech 1 so revolutionary was its performance efficiency and rendering quality. While not a true 3D engine (the player is unable to look up and down, and rooms can’t be place over one another), Doom’s fantastic level design complemented the engine’s limitations and gave players the impression that the levels were far more complicated than they were. The Doom engine went on to power Doom II (1994), Heretic (1994), Hexen (1995) and the cult RPG, Strife (1996)."}, {"type": "subtitle", "content": "Quake Engine and Quake II Engine (id Tech 2)"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*IW3gEm2sudXYisOAgx0euQ.png"}, {"type": "sentence", "content": "By 1996, the games industry had been swamped with “Doom clones” as FPS games were frequently referred to. The Doom engine was beginning to show its age, particularly against the rival Build engine from 3D Realms. Enter the Quake engine. It’s hard to fathom the huge influence that the Quake engine had on the games industry, but this graphic gives a decent summary. Like Doom before it, Quake revolutionised first-person gaming. Not only did it feature excellent polygon-based graphics, Quake also set the standard for competitive multiplayer gaming with its rock-solid network code. The Quake engine received a new coat of paint and reappeared 18 months later in id Software’s Quake II."}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*SlxrMCIxr9wdP0shkmjJlQ.jpeg"}, {"type": "sentence", "content": "It was the additional refinements in the Quake II engine (later renamed id Tech 2) that really drew the eye of other developers, and the Quake II engine powered many of the major FPS games (and some other genres) at the time, games such as SiN (1998), Kingpin: Life of Crime (1999), Soldier of Fortune (2000), Daikatana (2000) and Anachronox (2001). Valve also modified the Quake II engine to create GoldSrc, the engine behind Half-Life and the basis of the later Source engine. It is somewhat amazing to think that, buried in the code of Counter-Strike: Global Offensive is some Quake DNA."}, {"type": "subtitle", "content": "Quake III Arena Engine (id Tech 3)"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*O0_ry4ndSiyKAREhkhC_Fw.jpeg"}, {"type": "sentence", "content": "In 1998, Epic released Unreal. For the first time, id Software faced some serious competition. The Unreal Engine was powerful, efficient and beautiful. Not only that, but many developers were opting to license it instead of using id Software’s Quake II engine. Before long, Epic had announced multiplayer shooter Unreal Tournament, while id Software announced Quake III Arena. The stage was set for the biggest showdown in FPS history — not just a showdown of games, but a showdown of the engines that powered them. While Epic merely had to give their Unreal Engine a polish, id Software threw everything they had at a new id Tech engine. Much of the Quake II engine source code was scrapped, and the new Quake III engine had impressive new features like curved surfaces, volumetric fog and advanced shaders."}, {"type": "sentence", "content": "You might call this turn-of-the-century showdown a draw. For every developer that licensed the Unreal Engine, there was another who chose the Quake III engine. Some of the games powered by id Tech 3 included Star Trek Voyager: Elite Force (2000), Return to Castle Wolfenstein (2001), Jedi Outcast (2002), Call of Duty and Medal of Honor: Allied Assault (2002)."}, {"type": "subtitle", "content": "id Tech 4"}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*uoXvABaWTPM8YBdWeQZPmQ.jpeg"}, {"type": "sentence", "content": "Despite the success of the Quake III engine, id Software’s territorialism over its flagship technology ultimately proved their downfall. Unlike Epic, id Software refused to licence id Tech 4 until Doom 3 was released. This ultimately allowed Epic to snatch up significant market share with their impressive Unreal Engine 2. When id Tech 4 finally made its debut, there was no question that this was a powerful engine — Doom 3 was easily one of the most impressive looking games on the market. However, this power came at a cost, and anything but the best gaming rig struggled to run id Tech 4 at a decent framerate. Meanwhile, id Software faced mounting competition from Source, Unreal Engine 2 and CryEngine. Other than Doom 3, id Tech 4 was used by Quake 4 (2005), Wolfenstein (2009) and the underrated Prey (finally released in 2006)."}, {"type": "subtitle", "content": "id Tech 5"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*HiGN9g8ZqE5kvr2n2Zvk3A.jpeg"}, {"type": "sentence", "content": "With id Software’s acquisition by ZeniMax Media in 2009, id Tech moved away from the traditional licensing model that had made them a household name. While John Carmack initially stated that id Tech 5 would eventually be released as open-source (as with previous id Tech iterations), id Software changed their tune prior to the release of the first id Tech 5 game, Rage (2011). In an increasingly competitive market, id CEO Todd Hollenshead announced that id Tech 5 would only be available for licensing to other ZeniMax Media developers."}, {"type": "sentence", "content": "The id Tech 5 engine continued id’s reputation for technical excellence — Rage looked spectacular in 2011. But it was Epic’s Unreal Engine that was now the king of the licenced game engines. In 2013, after 20 years, John Carmack left id Software, and id Tech was now in new hands."}, {"type": "subtitle", "content": "id Tech 6 & id Tech 7"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*TlukcF9f0hQLWnT-UsVjsQ.jpeg"}, {"type": "sentence", "content": "By the time 2016 rolled around, all that remained of the company that created Doom was a handful of staff (including Office Manager Donna Jackson, who joined during the production of Wolfenstein 3-D) and possibly a few developer comments in the id Tech source code. However, in May 2016, id Software went back to their roots with series reboot Doom. The first new entry in the series since the 2005’s expansion Doom 3: Resurrection of Evil, 2016’s Doom embraced the frantic pace and rampant violence of its origins while refreshing the formula with modern design philosophy. Doom’s id Tech 6 engine wasn’t so much of a leap forward like id Tech 2, 3 or 4 had been, but it was still one of the best looking games available at the time, and id Tech 6 was used again for Wolfenstein II: The New Colossus (2017) and Wolfenstein: Youngblood (2019)."}, {"type": "sentence", "content": "Following the surprise success of Doom, id Software announced Doom Eternal, initially due for release in November 2019 before finally gracing our screens in March. Like id Tech 6, id Tech 7 might not seem like such a spectacular leap forward, but is a refinement of what id Tech 6 did well, with about 1 million less lines of code."}, {"type": "subtitle", "content": "The Future"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*etXuuSa-YwRx-G-ZG24RoQ.png"}, {"type": "sentence", "content": "With id Software’s absorption into ZeniMax Media, we are unlikely to see a return to the days of wildly ambitious and risky attempts at pushing the envelope in technology and game design. For many years now, id Tech has mostly played second fiddle to the big licencing powerhouses: Unreal Engine, Frostbite, CryEngine and Source, among others. But it is important to remember that, whether it was Doom, Quake, Quake II or Quake III Arena, it is the games that were powered by id Tech that are the reason so many have chosen to become the developers of today’s games."}], "topic": "gaming"}