{"title": "What Is a Species Anyway?", "data": [{"type": "subtitle", "content": "The concept of ‘species’ is a building block of much of modern biology, but it’s not always as clear-cut as it seems"}, {"type": "image", "content": "https://miro.medium.com/max/1538/0*HnvzmpQTdQRmaLWj.PNG"}, {"type": "subtitle", "content": "The problem"}, {"type": "sentence", "content": "In a previous post, we discussed biological individuality. The initial observation was that it seems fairly straightforward at first. But following some reflection, it became obvious that it was a lot more complicated than it seemed."}, {"type": "sentence", "content": "The same applies to species."}, {"type": "sentence", "content": "Human beings like to categorize. An excellent example of this is biological classification. The system developed by Linnaeus, still widely used today, neatly frames the living world into a nested hierarchy. The kingdoms of life are subdivided into phyla, which, in turn, are composed out of classes. These are then further divided into orders, made up by sets of different families, consisting out of genera. And eventually, the genera are collections of species. This hierarchy can be further elaborated by adding prefixes such as sub-, super- or infra- to the levels. Nevertheless, among biologists, there is considerable agreement that the species level forms a fundamental natural unit."}, {"type": "image", "content": "https://miro.medium.com/max/598/0*4LdEFIOYdThWy8GS.jpg"}, {"type": "sentence", "content": "This seems an almost trivial observation. After all, the title of one of the most significant books in the history of biology is abbreviated as The Origin of Species. Yet, the relevance of species notwithstanding, there is still discussion about what they really are, even among biologists. The gradual nature of evolution results in an absence of sharp, clear discontinuities in the living world. As a consequence, several species concepts have been proposed, none of which seems to be able to claim universal applicability."}, {"type": "sentence", "content": "Fortunately, prevailing species concepts can be divided into four groups: phenetic, biological, ecological and phylogenetic species concepts."}, {"type": "subtitle", "content": "Phenetic species concepts"}, {"type": "sentence", "content": "Phenetic species concepts are based on the external similarity among organisms. Early concepts in this group simply relied on a type specimen to which others were compared. Later versions were numerical and devised statistical techniques which allowed for a description of the overall similarity between organisms based on the quantification of many phenotypic traits."}, {"type": "sentence", "content": "While tentative species identification in the field often relies on phenotypic qualities, the severity of the problems with phenetic species concepts have rendered them fairly unpopular."}, {"type": "sentence", "content": "One issue concerns the similarity measures used. There are several possible measures of similarity, and they do not always produce the same phenetic clusters that correspond to species. Thus, at that point, an arbitrary, subjective choice has to be made. And what about cryptic species, which cannot be differentiated from each other on grounds of phenotypic similarity? Cases of mimicry might also produce problems for phenetic species concepts, as these might produce very similar looking organisms. A final problem is the existence of polytypic species that can contain a number of distinct phenotypic forms."}, {"type": "subtitle", "content": "Biological species concepts"}, {"type": "sentence", "content": "Biological species concepts have been, and still are, very influential in biology. The original biological species concept was developed and defended by the famous biologist Ernst Mayr, and can be defined as follows:"}, {"type": "sentence", "content": "Biological species concepts have barriers to gene flow as their main criterion. That is, members of one species do not interbreed with members of another. The isolating mechanisms (which can be both pre- or post-zygotic) through which this is achieved are properties of individual organisms, and prevent the ‘fusion’ of populations of different species."}, {"type": "sentence", "content": "Biological species concepts face some problems. An obvious issue concerns asexual organisms. Another problem is hybridization. While perhaps not widespread among vertebrates (although more and more hybridization events are being discovered), among plants hybridization occurs often and, in many cases, produces perfectly viable offspring . Gene transfer between micro-organisms also poses a problem to a biological species concept. Bacteria which might be radically different can still share genes. Ring species are another challenge, as they illustrate that interbreeding is not always transitive. In ring species, each population in the geographical ring can breed with its neighbors, but populations separated by one or more populations cannot."}, {"type": "image", "content": "https://miro.medium.com/max/2560/0*-wjvOVz7qd4QvKa4.png"}, {"type": "sentence", "content": "Further, the lack of actual interbreeding between populations does not need to imply that they are different species. For example, spatially separated populations might not actually interbreed, but still belong to the same species. This means that they are potentially interbreeding, which is very hard to test without actually crossing members of the separated populations. Also, reproductive isolation is not an on/off event, it arises gradually. As aptly put by Kim Sterelny and Paul Griffiths:"}, {"type": "sentence", "content": "Finally, biological species concepts provide no way of recognizing species over time. That is, they lack a temporal dimension. After all, how can one ascertain reproductive isolation between organisms on the same lineage, but separated by time?"}, {"type": "subtitle", "content": "Ecological species concepts"}, {"type": "sentence", "content": "According to ecological species concepts, species are defined by the ecological resources they exploit. Another way of putting this is that conspecific organisms share an ecological niche. The underlying idea is that resource use and exploitation produce the different phenetic clusters that are recognized as species. The advocates of ecological species concepts maintain that the differences between species are mainly the result of differences between resource- and habitat-use."}, {"type": "sentence", "content": "This concept group, too, has its problems. A first important one is the difficulty in defining ‘niche’. Conversely, there are cases where two sympatric (potential) species appear to occupy the same niche. Another problem case is the formation of polyploid offspring in plants, where ecological concepts are powerless to distinguish between the two kinds of organisms. An interesting (and increasingly relevant) issue concerns organisms made or manipulated in the laboratory, which don’t possess well-defined niches. Finally, phenotypic plasticity poses a problem. When organisms of the same species can develop different phenotypes in response to environmental stimuli, this can result in different niche occupation."}, {"type": "subtitle", "content": "Phylogenetic species concepts"}, {"type": "sentence", "content": "The final concept group, phylogenetic species concepts, relies on patterns in evolutionary history, rather than on the processes responsible for those patterns. Species are branches on the tree of life. Thus, a species exists between two speciation events, or between a speciation and extinction event. It is noteworthy that this concept type, in contrast with the previous concept groups, applies over evolutionary time."}, {"type": "sentence", "content": "This points towards the main weakness of this concept group: a phylogenetic species concept needs to rely on another type in order to be able to account for the division of a lineage through speciation. By having to depend on another concept type, a phylogenetic species concept also becomes heir to the problems of the concept it needs to characterize speciation events."}, {"type": "image", "content": "https://miro.medium.com/max/1468/1*oVKaY-ZebrEDyqB7EcdKUw.png"}, {"type": "sentence", "content": "Another potential problem is that reconstructing the tree of life is not an easy task. There are methodological issues (aligning difficulties, too many possible trees, too much or too little divergence, different rates of evolutionary change,…). But there are also conceptual questions. For example, there are different statistical techniques for constructing phylogenetic trees (molecular distances, parsimony principle, maximum likelihood) which needn’t result in identical trees . If there isn’t an obvious ‘right’ technique, then which tree is the correct one? Also, given the importance of horizontal gene transfer and hybridization in many of life’s branches, isn’t the tree more like a web?"}, {"type": "subtitle", "content": "Now what?"}, {"type": "sentence", "content": "So, there are several species concepts, each with its limitations, that, in some cases, yield different divisions of the living world into species. Where does this leave us? Should biologists and philosophers continue the search for a unique, universally applicable species concept (‘monism’), or is this a fool’s errand and can distinct concepts (more or less) peacefully coexist (‘pluralism’)?"}, {"type": "subtitle", "content": "Monism"}, {"type": "sentence", "content": "One monist proposal involves the general lineage concept. The idea here is that there is a common theme underlying all species concepts, namely that species are equated with segments of population lineages."}, {"type": "sentence", "content": "Another idea is the family resemblance approach. The main idea is that species can posses one or more of the properties proposed by different species concepts, but that none of these properties constitutes a defining criterion. The possession of one or more of the criteria proposed by one of the species concepts then entitles a group of organisms to be labeled as a species."}, {"type": "sentence", "content": "Similar to the family resemblance idea is the homeostatic property cluster concept, which states that species share a relatively stable cluster of properties that allows them to be identified as species, even though none of the properties is necessarily required to be a species."}, {"type": "sentence", "content": "Counterarguments, however, have been made. The general lineage concept, for example, assumes that the disagreements between species concepts focus on operational differences, such as the timing of speciation or inferring boundaries and numbers of species, not ontological ones (are species ‘real’?)."}, {"type": "sentence", "content": "Likewise, the other monist approaches might capture how the term ‘species’ is used, but offer no way to confront whether or not the species category is real."}, {"type": "subtitle", "content": "Pluralism"}, {"type": "sentence", "content": "The main argument for pluralism is found in heterogeneity in nature and the impossibility of providing a satisfactory, unanimously accepted species concept."}, {"type": "sentence", "content": "Yet, pluralism is not without its opponents. One of the objections against a pluralistic account is that it will lead to a species concept bonanza. But, different concepts are currently being used and yet biologists are quite capable of communicating their research to each other. As long as it is clearly stated which concept is utilized, this issue can easily be avoided."}, {"type": "sentence", "content": "It is not inconceivable that one can define a set of criteria in order to distinguish ‘good’ from ‘bad’ species concepts. In other words, a filtering mechanism can be devised to filter the acceptable concepts from the completely arbitrary ones."}, {"type": "sentence", "content": "Does this means ‘species’ aren’t real? Not necessarily. It might be argued that different criteria may be used to demarcate species, and that (sets of) these criteria are justified by a species concept. Based on a concept — vetted by a ‘filtering mechanism’ as mentioned above — the species category can be defined. Important to note here is that there might be different (sets of) criteria, and thus different concepts, which, in turn, results in different realizations of the species category. This species category — which can differ slightly depending on the species concept used — picks out real and biologically relevant groups of organisms that play a role of importance in the evolutionary process."}, {"type": "sentence", "content": "So, what is a species? It’s complicated."}], "topic": "science"}