{"title": "Between Europe Inc. and Digital Giants, a Win-Win Cooperation Is Possible", "data": [{"type": "sentence", "content": "By François Candelon, Hans-Paul Bürkner, Sylvain Duranton, Nikolaus Lang, Rodolphe Charme Di Carlo, and Midas De Bondt"}, {"type": "image", "content": "https://miro.medium.com/max/7780/1*6BaS3wvftOqgcnY1xdd6lQ.png"}, {"type": "sentence", "content": "This is the third in a series of articles about the future of technology in Europe and the lessons from China to build its economic sovereignty."}, {"type": "sentence", "content": "It isn’t going to be easy to alter the win-lose relationship in the field of Artificial Intelligence (AI) between the world’s digital giants and the European Union (EU). However, the current dynamic needs to change, and soon, if the digital giants aren’t to eventually end up losing, too. Our studies show that the digital giants can, and must, proactively act to create a win-win for the EU and themselves. That will be necessary to benefit not just European consumers, companies, and governments, but also, to optimize the digital giants’ AI strategies."}, {"type": "subtitle", "content": "Digital Giants Are Winning at Europe’s Expense"}, {"type": "sentence", "content": "At present, the world’s digital giants — such as Amazon, Facebook, Google, Intel, Microsoft, and Alibaba — dominate the European AI landscape. In the absence of homegrown competition, they’re able to operate without making major investments locally, creating jobs on the continent, or often without paying as much taxes as they should. For instance, in July 2019, when France tried to take on the digital giants by levying a 3% tax, it almost resulted in a trade war, with the US ordering an investigation that could lead to retaliatory tariffs and other trade restrictions on France. As a result, the digital giants offer few, if any, economic benefits for European countries and companies."}, {"type": "sentence", "content": "Meanwhile, the EU’s industry players are losing out because they’re unable to capitalize on the digital giants’ presence. There’s relatively little demand for AI applications from them, so Europe’s AI readiness remains low. In addition, European digital companies find it difficult to expand geographically; the EU’s regulations restrict the use of key technologies, such as facial recognition, because of privacy concerns. With the scale of AI’s usage crucial for competitiveness, as we argued in a recent article, the current situation is unsustainable (See, for instance, Europe Can Catch Up in AI, But Must Act — Today)."}, {"type": "subtitle", "content": "Europe’s Attitude is Changing"}, {"type": "sentence", "content": "Until now, the EU has demanded little from the digital giants apart from basic compliance with data protection laws, platform business rules, and other related regulations. However, the EU is increasingly waking up to the fact that it is one of the world’s biggest digital markets, enjoys significant negotiating power, and should use it for its long-term benefit."}, {"type": "sentence", "content": "While multilateral negotiations will continue, the EU seems likely to take measures unilaterally to ensure a level playing field. For instance, the EU’s policy environment has changed a great deal in recent years, with the introduction of the General Data Protection Regulations (GDPR) as well as rulings against digital giants such as Facebook and Google. Several other reforms are in the pipeline such as the recently-unveiled data strategy. The EU’s attitude towards is increasingly becoming more protectionist, with policy-makers calling for “EU digital sovereignty” and “respect for EU values for AI.”"}, {"type": "subtitle", "content": "Digital Giants Must Make Two Commitments"}, {"type": "sentence", "content": "The digital giants must act quickly if they wish to avoid a stalemate that will ensure that everyone loses. Promising to work according to the EU’s regulatory frameworks and helping to build a competitive AI ecosystem in the region will be two fundamental steps in the right direction, with long-term sustainable benefits greatly worth the effort (see Exhibit 1)."}, {"type": "image", "content": "https://miro.medium.com/max/2308/1*ZJHe-hHtf1lXzS4b2CA7dw.png"}, {"type": "sentence", "content": "First, the digital giants should proactively commit themselves to working within the framework of the EU’s AI-related regulations. That will require AI applications to respect individual privacy, and avoid bias of any kind. Rather than sticking to the letter of the law, the digital giants should accept the spirit of the EU’s regulations, and, once they gain credibility in Europe, help refine them."}, {"type": "sentence", "content": "Committing to the EU’s AI regulations means that digital companies must be willing to accept the responsibility for damages once the regulations are enacted. Doing so will prevent messy rulings, lawsuits, and public disputes between the EU and the digital giants. An environment in which EU policy-makers and digital businesses work together is better than a distrustful regulation-compliance relationship, as EU Commissioner Thierry Breton and Facebook CEO Mark Zuckerberg agreed during a recent debate."}, {"type": "sentence", "content": "Second, the digital giants should commit to the development of a European AI ecosystem. That will entail developing and upskilling AI talent in Europe by, for instance, cultivating partnerships with leading universities there. Still, for more impact, digital giants should also support the scale-up of AI start-ups in Europe, just like venture capital firms would, while committing to retain those operations in the EU even if they acquire them. Finally, and even more crucial, the digital giants should partner with European industry leaders and share most advanced technologies with them, thus accompanying their AI transformation."}, {"type": "sentence", "content": "Creating an ecosystem will require the digital giants to enter into technology transfer partnerships with European players. They should go beyond localizing data centers in order to comply with local regulations and strike strategic partnerships, which will ensure the transfer of cutting-edge technology and capabilities to local players. Another way to facilitate the creation of an ecosystem would be to invest in Europe’s AI infrastructure, for example, through the European High-Performance Computing Joint Undertaking, whose mission is to develop a world-class supercomputing and data infrastructure to support a competitive and innovative ecosystem on the continent."}, {"type": "sentence", "content": "When they do so, the digital giants’ operating costs in Europe may rise in the short run. Greater compliance and collaboration efforts will require resources while supporting talent and ecosystem development is expensive. However, working with the EU to develop an AI industry in Europe is the only viable solution if the digital giants are to flourish. Given the size of the European market, no digital firm that aspires to be a global leader can afford to walk away from the world’s largest economy, largest trading block, and the largest investor in terms of attracting and making global investments."}, {"type": "subtitle", "content": "Cooperation is the only path towards success"}, {"type": "sentence", "content": "The digital giants need to recognize the strategic opportunity that the EU represents. It’s not just about size or purchasing power; the EU is one of the most sophisticated and differentiated markets for AI, especially for industrial applications. The EU provides opportunities to develop and train algorithms for several industries, and it will be impossible for any digital giant to claim that it has a global offering if it doesn’t have access to European markets, data, and Europe-trained AI applications. In addition, by nurturing the EU’s large talent pools, the digital giants can supercharge their AI teams."}, {"type": "sentence", "content": "The EU also provides learning opportunities because it offers a sophisticated point of view along dimensions that will determine the nature of competition tomorrow. For instance, privacy and ethics are high on the EU’s agenda, so operating there ensures that the digital giants are at the cutting edge of those issues. As the chairperson of the EU’s expert group on AI, Pekka Ala-Pietila, recently said:"}, {"type": "sentence", "content": "The EU is ripe with possibility, but to successfully seize the opportunity and thrive in Europe, the digital giants must:"}, {"type": "sentence", "content": "Build partnerships with Europe’s industry players. Europe is the home of world-leading companies in several industries such as aerospace, automobiles, chemicals, consumer goods, energy, food, maritime, and retailing. As the second wave of AI (in B2B) gains ground, European companies represent an opportunity for the digital giants to develop and refine AI applications in those industries. As mentioned earlier, such partnerships would also benefit European companies, which can use the new technologies to reinforce their global competitiveness."}, {"type": "sentence", "content": "Regard permanent establishment as an opportunity. The digital giants should look beyond regulation and tax-optimization, and treat setting up shop in the EU as a strategic decision. Those digital giants that move quickly to seize opportunities to strike partnerships with public and private players will gain an advantage. As a first step, the digital giants should identify, and set up bases in, Europe’s budding ecosystems of AI excellence."}, {"type": "sentence", "content": "Treat the EU as a future-critical market. As the current Covid-19 pandemic demonstrates, the digital giants, like all transnational companies, must build greater resilience to withstand “black swan” events. One way of doing that is to operate globally while limiting the interdependencies between regions. Companies that treat Europe as central to their operations, and not just as an export market, will be able to boost their resilience. The digital giants would do well to shift from a one size fits all strategy to a multi-local one."}, {"type": "sentence", "content": "Use regulation as a cornerstone, and proactively engage with policymakers. AI regulations will play an important role in shaping the EU’s business environment tomorrow. Merely complying with regulations won’t set up the digital giants for success; they must seek to understand Europe’s subtleties and shape future regulations. That will serve as a source of competitive advantage. Moreover, many multinational companies have already applied the EU’s GDPR regulation to their worldwide operations. That only reinforces the need for the digital giants to earn a seat at the table in Brussels, where future policies will be fashioned."}, {"type": "sentence", "content": "Review the AI applications portfolio to ensure it is EU-ready. Privacy issues, ethical concerns, and bias in AI applications anywhere in the world will immediately have a fallout on the digital giants’ operations in Europe. Evaluating the firm’s AI applications portfolio from a European point of view will be essential to gauge what modifications will be required in the future. For instance, if the EU decides against the use of face-recognition AI applications, the digital giants may have to reconsider their development. Otherwise, they will run the risk being shut out of the European market altogether."}, {"type": "sentence", "content": "Eventually, European governments, European companies, and the world’s digital giants will have to figure out ways of coming together to develop a range of AI solutions for the world. Treating the EU as a mere market, rather than as an equal partner, is unlikely to make that happen. Indeed, if they think twice about it, the digital giants will realize that they will probably be the biggest losers from persisting with a short-sighted approach to AI in Europe."}, {"type": "sentence", "content": "About the authors"}, {"type": "sentence", "content": "François Candelon is a Managing Director and Senior Partner at BCG Paris, and the Global Director of the BCG Henderson Institute. You may contact him at Candelon.Francois@bcg.com"}, {"type": "sentence", "content": "Hans-Paul Bürkner is Chairman of the Boston Consulting Group, and a member of BCG Henderson Institute’s Innovation Sounding Board. He was President and Chief Executive Officer of BCG from 2004 to 2012."}, {"type": "sentence", "content": "Sylvain Duranton is a Managing Director and Senior Partner at BCG Paris. He is the Global Leader of BCG GAMMA. You may contact him by email at Duranton.Sylvain@bcg.com"}, {"type": "sentence", "content": "Nikolaus Lang is a Managing Director and Senior Partner at BCG Munich, and the Global Leader of the firm’s Global Advantage practice. He is also an Alumni Fellow of the BCG Henderson Institute. You may contact him by email at Lang.Nikolaus@bcg.com"}, {"type": "sentence", "content": "Rodolphe Charme di Carlo is a Principal at BCG Paris, and an Ambassador at the BCG Henderson Institute. You may contact him at CharmediCarlo.Rodolphe@bcg.com"}, {"type": "sentence", "content": "Midas De Bondt is a Project Leader at BCG Brussels, and an Ambassador at the BCG Henderson Institute. You may contact him at de.bondt.midas@bcg.com"}, {"type": "sentence", "content": "About the BCG Henderson Institute"}, {"type": "sentence", "content": "The BCG Henderson Institute is the Boston Consulting Group’s think tank, dedicated to exploring and developing valuable new insights from business, technology, economics, and science by embracing the powerful technology of ideas. The Institute engages leaders in provocative discussion and experimentation to expand the boundaries of business theory and practice and to translate innovative ideas from within and beyond business. For more ideas and inspiration, sign up to receive BHI INSIGHTS, our monthly newsletter, and follow us on LinkedIn and Twitter: @BCGHenderson"}], "topic": "business"}