{"title": "Will COVID be Inflationary or Deflationary?", "data": [{"type": "subtitle", "content": "Economic forces are pushing in both directions and experts are divided on the outcome"}, {"type": "image", "content": "https://miro.medium.com/max/6830/0*8wGxwjdlGokDVitM"}, {"type": "sentence", "content": "There is a vigorous debate among financial analysts and economists today — what are we going to deal with next, inflation or deflation? The forces unleashed upon the world by a decade of zero (and even negative) interest rates, outlandish levels of government and corporate debt, extraordinary amounts of central bank money creation, and shortages of goods due to supply chain disruptions and work stoppages around the globe all seem to point to massive price inflation. On the other hand, the unwinding of this debt, restructuring, demand destruction, high unemployment, and the continual march of technological innovation seem to portend price deflation."}, {"type": "subtitle", "content": "TL;DR"}, {"type": "sentence", "content": "Just jump to the bottom to see the compilation of views from financial experts on this topic. Also, check back as I plan to update it as material becomes available and I get time to do more research/listen to podcasts!"}, {"type": "subtitle", "content": "Inflation vs. Deflation: Money and Prices"}, {"type": "sentence", "content": "So which is it?"}, {"type": "sentence", "content": "This is more than an academic question. It has real consequences for you, your financial security, and your future."}, {"type": "sentence", "content": "First, we need to define some terms."}, {"type": "sentence", "content": "It is important to distinguish between monetary inflation and price inflation."}, {"type": "sentence", "content": "Monetary inflation is an increase in the money supply. This debases the currency and redistributes your wages to the early receivers of new money who get to spend it on goods and assets before prices rise to account for the new money. This creates a host of pernicious effects, but most notably tends to lead to price inflation, or the rise in prices of consumer goods as each dollar becomes worth less and less."}, {"type": "image", "content": "https://miro.medium.com/max/1774/0*Cm10OCdNCgumUf-Y"}, {"type": "sentence", "content": "Price inflation, as defined above, can be caused not only by money printing, but also by increases in demand or reduction in supply. These latter causes are the culprits behind the sudden rise in prices of food items such as eggs and meat. Supply chains have been disrupted and consumers have been stocking up on these scarce goods forcing prices to rise to compensate."}, {"type": "sentence", "content": "Typically these supply and demand shocks don’t occur on an economy wide scale, so you won’t see large swings in traditional inflation measures like the PCE or the CPI. But, these aren’t normal times. Governments have deemed some workers essential and others not which has led to disruptions of supplies at every level of the value chain."}, {"type": "sentence", "content": "Consider the food supply which, in the US, relies heavily on trucking to reach far-flung markets across the continent. These trucks need regular maintenance to keep them on the roads and ensure that food reaches your local supermarket. Spare parts to conduct repairs are primarily imported from Canada, Mexico, and China. If manufacturing of spare parts in these countries and the US slows down significantly, we may see an additional shortage of spare parts thereby putting trucking fleets at risk.¹"}, {"type": "sentence", "content": "On the other side, there are deflationary forces which continue to push prices downward."}, {"type": "sentence", "content": "Shelter in place orders remain in effect for many around the world which has decimated demand for many goods and services. Most notably, we see the effects in the oil industry which has suffered through a fall in oil prices due to a decimation of demand. As far as prices are concerned, this is great for consumers because as fuel gets cheaper, so does shipping and personal transportation. All else equal, this will be reflected in lower prices you will pay for goods and services."}, {"type": "sentence", "content": "As the rolls of unemployed continue to rise, people are liable to curtail their spending. Again, this adds to deflationary pressure as people tighten their belts in preparation for harder times."}, {"type": "image", "content": "https://miro.medium.com/max/2096/0*p9-e1I0bTqQzJ3sN"}, {"type": "sentence", "content": "Depending on the outcome of these opposing forces: price inflation led by money printing and supply shocks on one side versus demand destruction and unemployment on the other — it’s not clear which will win out in the next year or so.²"}, {"type": "subtitle", "content": "What do the Pros have to Say?"}, {"type": "sentence", "content": "I have been keenly watching this space for some time and have compiled comments and views from some of the best and brightest in finance and economics to lay out their views for you. I don’t have all the information or brain power needed to figure this out, and recommend a balanced approach to be prepared for anything. But even defining what comprises a balanced approach is open for debate."}, {"type": "sentence", "content": "I’ve tried to lay out the views of the analysts below as concisely as possible with supporting quotes and links as well as dates because in this rapidly changing environment full of government intervention, views can change.³ Also, some of the views are more nuanced than simply inflation or deflation, so I tried to capture that where possible while still roughly putting them into one camp or the other (however imperfectly that may be)."}, {"type": "sentence", "content": "I encourage you to read through the following commentary (which I’ll update as time permits), weigh the arguments and decide for yourself how to position yourself. Nobody cares as much about your money as you do."}, {"type": "subtitle", "content": "Inflation"}, {"type": "subtitle", "content": "Dr. Ben Hunt, Epsilon Theory, Macro Voices May 13, 2020"}, {"type": "sentence", "content": "Currently, we’re in a large deflationary environment due to the job loss and economic destruction laid out above. However, the groundwork has been laid for a change given the effective merging of the US Treasury and the Federal Reserve through direct monetization of the federal government’s spending. After the US presidential election, we’re going to have a ~$2 trillion stimulus bill that won’t be targeted towards financial assets, but instead infrastructure meaning it will command real resources in the economy and at least half of it will be monetized directly by the Fed."}, {"type": "subtitle", "content": "Chris Cole, Artemis Capital, Macro Voices April 16, 2020"}, {"type": "sentence", "content": "State pension systems are wildly underfunded at every level, even before the crisis began. To bail these out, you can support the hedge funds which are managing these portfolios or engage in some type of MMT policy to devalue the currency."}, {"type": "sentence", "content": "As an aside, Cole recently authored a worthwhile paper researching an all-weather portfolio which can be found here."}, {"type": "subtitle", "content": "Dr. Pippa Malmgren, Macro Voices April 6, 2020"}, {"type": "sentence", "content": "The understanding of central banks is that you can print without raising inflation because it worked in 2008. However, all the forces that were holding inflation down, such as global supply chains and technology, are no longer there: export controls are in place, tech startups and VC’s are going bust. The central bank action is going to lead to a shift to secular inflation and rising inflation expectations. We’re already seeing that in grocery prices where people are paying more for things like eggs, which has led to more people being willing to pay higher prices for these goods. When these supply shocks settle in, inflation is going to take off thanks to these changing expectations coupled with more money in the system. If government intervenes and begins to nationalize industries, this will only exacerbate the shortages further destroying confidence in the system."}, {"type": "subtitle", "content": "Simon White, Variant Perception, Macro Voices March 26, 2020"}, {"type": "sentence", "content": "Governments have intervened with massive amounts of money creation through the Fed’s programs as well as actual helicopter money being directly deposited into the bank accounts of individuals. These will lead to higher budget deficits, debt, and a rise in inflation expectations. The risk of inflation is now higher than it has been this century and it needs to be priced into investment decisions."}, {"type": "subtitle", "content": "Jim Bianco, Bianco Research, Macro Voices March 19, 2020"}, {"type": "sentence", "content": "The transition to inflation is going to take some time to play out, but we’re seeing the first hints of it in the break down of the risk-parity trade between stocks and bonds. The previous era ran roughly 20 years as well from the late 1970’s until the 1998–2000 shift in parity trades. It will oscillate, but the new, inflationary era will see stocks and bonds begin to move together."}, {"type": "subtitle", "content": "Deflation"}, {"type": "subtitle", "content": "Lakshman Achuthan, Economic Cycles Research Institute, Macro Voices May 7, 2020"}, {"type": "sentence", "content": "Given the cycle indicators, there’s no inflation on the horizon. A few years from now things may change, but for the time being, there’s nothing to indicate a shift from a low inflation or deflationary environment to a period of high inflation."}, {"type": "subtitle", "content": "Dr. Lacy Hunt, Hoisington Investment Management Company, Macro Voices April 30, 2020"}, {"type": "sentence", "content": "Debt levels have reached an enormous level, but beyond 50% debt/GDP, we run into diminishing returns, meaning we need more and more debt to get the same amount of growth. The CARES Act and subsequent stimulus programs are going to greatly increase the debt in level in the US and further drag growth downward. The political incentives are set up to continue increasing debt and spending, which will only pull growth down more leading to lower interest rates and lower inflation. The only case where inflation would turn around — and we could get hyperinflation — would be if the Federal Reserve was able to spend money, which would take an amendment to the 1913 Federal Reserve Act."}, {"type": "subtitle", "content": "Jeff Booth, The Price of Tomorrow, The Investor’s Podcast April 25, 2020"}, {"type": "sentence", "content": "Technology is advancing at an exponential pace backed by Moore’s Law and the coming advent of quantum computing and other developments. This drastically reduces prices making products cheaper and more affordable for people around the world which will outpace the existing inflationary monetary policy. These digital technologies and COVID-19 are going to accelerate technological adoption which will destroy jobs and lead to unemployment and a dearth of high paying jobs."}, {"type": "subtitle", "content": "David Rosenberg, Rosenberg Research, Macro Voices April 23, 2020"}, {"type": "sentence", "content": "The monetary stimulus that has been used to bailout American companies is primarily going to be saved and used to protect operations. The economic assistance may not be enough, so we’re going to face double-digit employment for some time which will depress the economy and lead to deflation. More long term, the post-virus world will turn back some of the effects of globalization, which has worked to push prices down for consumers, as well as additional precautions for workers which will hamper productivity. All of this will then contribute to inflationary forces as supply will be restricted when demand returns leading towards a period of stagflation."}, {"type": "sentence", "content": "1. Labeling auto parts manufacturers as essential only moves the problem up one level because these facilities rely on their own suppliers for raw materials and maintenance of their manufacturing equipment. The economy is a dense web of interconnected dependencies of trade and transactions.↩"}, {"type": "sentence", "content": "2. Long term seems much clearer: price inflation via destruction of the currency will win out. But precisely when the long term finally becomes today is anyone’s guess. .↩"}, {"type": "sentence", "content": "3. A lot of these come from the excellent podcast Macro Voices. The host, Erik Townsend, has been asking this question for a few months now.↩"}, {"type": "sentence", "content": "Check out some of my other COVID-19 related posts!"}, {"type": "sentence", "content": "The Pandemic of Uncertainty"}, {"type": "sentence", "content": "Social Distancing to Slow the Coronavirus"}, {"type": "sentence", "content": "How Quickly Does an Epidemic Grow?"}, {"type": "sentence", "content": "Originally published at https://viorbit.com on May 19, 2020."}], "topic": "economy"}