{"title": "When Someone You Love Self-Harms", "data": [{"type": "image", "content": "https://miro.medium.com/max/13440/0*o6lNdgz8XEGg7-s8"}, {"type": "sentence", "content": "Self-harm can be a scary topic, one that most people avoid talking about. Yet a topic that is so important to discuss. According to The Recovery Village website, 17% of all people will partake in some sort of self-harm in their life time. Of that 17%, about one-half of those people will get help from friends and family rather than professionals (The Recovery Village). With those numbers, it is common for someone you know to have self-harmed, or even yourself. Knowing what you can do to be there for others and yourself in the difficult times of self-harm, may make it a little easier to deal with, and that is why I am here."}, {"type": "sentence", "content": "After self-harming myself for years, along with seeing people I love deal with the same things, I have really learned a lot from both sides. I once journaled, “I don’t know what is harder, having depression, or seeing someone you love have depression”. I stand by that statement today. I really don’t know which is worse, because both are just plain up hard things to go through. If you are dealing with your own demon’s or witnessing someone you love battle theirs, know that it isn’t forever, and better days are to come."}, {"type": "sentence", "content": "You may be wondering why the person you love is self-harming or you may not understand how they are doing such things to themselves. Wanting the answer of “why” is common, yet not always as easy as you may think to answer. Pinpointing exactly why someone is self-harming may not be possible and they may not even know why themselves. The emotions that revolve around self-harm can overcome you, making the person doing it almost numb to what they are doing. Don’t push for this answer of “why”, they may not know now, but someday they may, and that can be a great conversation for down the road."}, {"type": "sentence", "content": "Finding out that someone you are close to self-harms can be a real shock. You may have never seen it coming. That is okay! Never beat yourself up for not knowing something like that was/is going on. Often times, self-harming is kept secret, making it nearly impossible for anyone to find out. If you notice that someone may be partaking in self-harm, bringing it up to them in a calm and welcoming manner is very important. Self-harm is nothing to be ashamed of, yet something in which the participant is very ashamed. Letting the person know that you are there for them with support and love, is one of the best things you can do."}, {"type": "sentence", "content": "Something to remember is that every part of a mental illness, including self-harm, is different with each person. Yes, there can be similarities among people but no two cases are alike. Kind of like a snowflake, always unique. While being there for someone you love while they are struggling, it is important to find out what would help them in their specific case the most. Learn the best ways to communicate with them about their self-harm. They may not want to talk about it much, admitting to self-harming is very scary. If the person you love told you themselves, that alone is a great sign of trust and comfort within you."}, {"type": "sentence", "content": "I distinctly remember telling my parents that I was self-harming. It wasn’t until about two years after I started that this happened. They were shocked, no indications that their little girl was addicted to cutting herself. As a parent, finding out your child was capable of doing this without you having the smallest of clues, can be terrifying. The whole subject of self-harm can be terrifying, but it is possible to overcome. Having the help of other people can really change the game for someone who is self-harming."}, {"type": "sentence", "content": "Getting the proper help for someone who is dealing with self-harm is very important. Professional help can truly be a game changer. Maybe it is because of my years of therapy that I am a big advocate for getting professional help, but trust me, it helps. Getting the tools you need to help towards getting out of the state of self-harm is priceless."}, {"type": "sentence", "content": "Becoming educated on self-harm will greatly benefit you in being there for your loved one through their self-harm journey. With the internet at our fingertips, it is easy to get educated on all sorts of topics revolving around self-harm. Learning about what someone is going through is a great way to show that you are taking it seriously and wanting to support them. Here are a few articles to help get you started:"}, {"type": "sentence", "content": "· Cutting and Self-Harm By Melinda Smith, M.A., Jeanne Segal, Ph.D., Lawrence Robinson, and Jennifer Shubin. https://www.helpguide.org/articles/anxiety/cutting-and-self-harm.htm"}, {"type": "sentence", "content": "· Self-Harm published by The National Alliance on Mental Health https://www.nami.org/About-Mental-Illness/Common-with-Mental-Illness/Self-harm"}, {"type": "sentence", "content": "· Self-Harm published by Medline Plus https://medlineplus.gov/selfharm.html"}, {"type": "sentence", "content": "Understand that recovery from self-harm isn’t always an overnight process. Recovering is a journey. Everyone’s journey will be far from the same. It is hard to always know what the right things to do and say to someone you love who is struggling. The thing is, you don’t always have to know the perfect thing to say, in fact sometimes nothing even has to be said. Simply being there, supporting and learning with them along the way is one of the best things to do."}, {"type": "sentence", "content": "Keep in mind that relapses happen. When they do happen it has the possibility of bringing up a lot of doubtful thoughts towards the overall journey. About two years into my self-harm recovery journey, I had a minor relapse. I felt so ashamed. I had worked so hard to make it this long and I felt as if I had to start all over. Even though I had a great support system, I was terrified to admit it to anyone. A few weeks after my relapse, I finally told my therapist, and her response? Calm and unworried. She explained that relapses happen and that instead of beating myself up for cutting again, I should focus on how amazing it is that I went so long! If you notice that your loved one may have relapsed without telling you, it isn’t that they don’t trust you, they may just be disappointed in themselves. Don’t let this bother you, instead make sure that your loved one knows that you are not ashamed and that the journey will continue!"}, {"type": "sentence", "content": "When someone you love is going through a tough mental state, it can start to get very draining on you as well. Make sure you are giving yourself the love that you deserve as well. In time, this will get easier, as hard as it may seem now. Stay strong and stay positive, better times are coming!"}], "topic": "mental-health"}