{"title": "5 Fast Facts About the HEROES Act of 2020", "data": [{"type": "subtitle", "content": "The HEROES Act delivers the goods, but at what cost?"}, {"type": "image", "content": "https://miro.medium.com/max/5120/1*7SG3VUqU87Gl6IyGwv4qiQ.jpeg"}, {"type": "subtitle", "content": "Introduction"}, {"type": "sentence", "content": "You’ve been hearing a lot about stimulus bills for the past few weeks. The first one was the CARES Act signed into law in March. That was the law that gave many Americans a $1200 stimulus check. That bill helped many people, but the overwhelming consensus was that it didn’t go far enough."}, {"type": "sentence", "content": "Since then we’ve heard a lot about other stimulus plans. There was the Emergency Money for the People Act, the Automatic Boost for Communities Act, and the Rent and Mortgage Cancellation Act. We’ve discussed the first two at length on this channel."}, {"type": "sentence", "content": "The issue with the other proposed bills is that they may have been too liberal to get through a conservative senate and signed into law by a conservative president. However, a new bill has emerged that may have the ability to succeed where the other bills failed."}, {"type": "sentence", "content": "It would take a real hero to come up with something that a very divided nation can agree on. But it seems that the House of Representatives has delivered just that. The Health and Economic Recovery Omnibus Emergency Solutions, or HEROES Act, is the latest in a wave of stimulus packages being debated in congress."}, {"type": "subtitle", "content": "1. Housing Benefits"}, {"type": "sentence", "content": "The HEROES Act will offer many forms of assistance that our nation currently needs. One of the first things the HEROES Act would do is protect the nation’s over 40 million renters by banning eviction for nonpayment for a year after the date the bill passes into law. The bill also supports homeowners by allotting $75 billion of homeowners' assistance to present default and foreclosures."}, {"type": "sentence", "content": "Most notably, the HEROES Act bolsters renters by providing $100 billion in rental assistance. These funds would be administered by an existing nationwide grant rental assistance program that will verify the need of all applicants and distribute vouchers to cover the cost of rent and utilities."}, {"type": "subtitle", "content": "2. Unemployment Benefits"}, {"type": "sentence", "content": "There are currently 36.5 million Americans unemployed at the time of this writing. The HEROES Act aims to extend unemployment benefits provided by the CARES Act. Most importantly, it would extend the $600 per week federal unemployment benefit until January 2021. The unemployment benefit will continue to be extended to gig workers, independent contractors, part-time workers, and the self-employed through March 2021."}, {"type": "subtitle", "content": "3. Student Loan Forgiveness"}, {"type": "sentence", "content": "Originally, the CARES Act deferred student loan payments for people with select federal student loans until September 30, 2020. The HEROES Act would continue to defer payment up to September 2021 for all federal student loans including HEAL loans not owned by the Department of Education, some FFEL Program loans, and Federal Perkins Loans."}, {"type": "sentence", "content": "Most notably, the HEROES Act seeks to cancel up to $10,000 of student loan debt for some federal and private student loan debt holders. The $10,000 of debt cancellation would be applied to the loans with the highest interest rates, and then to the loans with the highest principal balance if the debt holder does not specify otherwise."}, {"type": "subtitle", "content": "4. Stimulus Payment"}, {"type": "sentence", "content": "What most readers might find exciting is that the HEROES Act has a provision to include a second round of stimulus payments of up to $6000 per household. Much like with the first round of payments, people with an Adjusted Gross Income of up to $75,000 per year would receive a one time check for $1200."}, {"type": "sentence", "content": "Basically, if you were eligible to receive the first round of stimulus checks, you’ll be eligible to receive the second round. However, if you have an AGI of $99,000 or more, or are married and have an AGI of over $198,000, you will not receive a stimulus check."}, {"type": "sentence", "content": "Things are a little different this time around though. The first round of stimulus checks excluded adult dependents, many of whom are college students. The HEROES Act allows up to three dependents, regardless of age, to also receive $1200. This allows for up to five people in one household to receive $1200, maxing out at a total of $6000 per household. So this time, college students would receive benefits. Also, the first round of stimulus payments left out immigrants with Taxpayer Identification Numbers or TINs. The HEROES Act, if passed into law, would include them."}, {"type": "subtitle", "content": "5. Hazard Payment"}, {"type": "sentence", "content": "Arguably the most noteworthy portion of the HEROES Act is the “Heroes Fund”. This $200 billion fund gives hazard pay to some essential workers. This hazard pay comes in the form of an additional $13/hour pay premium on top of the worker’s regular pay rate. This pay is for all hours worked in essential industries through the end of 2020,” valuing up to $25,000 for essential workers earning less than $200,000 per year, and up to $5,000 for essential workers earning more than $200,000 per year."}, {"type": "subtitle", "content": "Challenges Ahead"}, {"type": "sentence", "content": "The HEROES Act sounds like an answer to the prayers of many Americans. However, it’s important to remember that the act hasn’t been signed into law yet. The HEROES Act only narrowly passed in the House of Representatives by a vote of 208 to 199 on May 15. One has to also consider that the bill contains another $3 trillion of economic aid."}, {"type": "sentence", "content": "COVID-19 is among the most significant events in the past 100 years. However, it’s not the only economic event taking place in the United States. Bloomberg.com says that the nonpartisan Committee for Responsible Federal Budget predicts that the national deficit, the shortfall between how much money the country makes and spends, will be $3.8 trillion this year if Congress doesn’t engage in anymore stimulus spending. That might not sound like a lot of money to some people. But it’s 18.7% of our country’s Gross Domestic Product. The United States hasn’t spent this much as a percent of its GDP since World War 2."}, {"type": "sentence", "content": "The Committee goes on to predict that the national debt could increase to over 100% of the country’s $21 trillion economy by October 2021. They also estimate with nearly 37 million Americans out of work, the GDP is likely to shrink by 3.9% when compared to fiscal year 2019. Regardless of anyone’s personal feelings towards our politicians, this is among the considerations the Senate and the President have to take into account before signing the HEROES Act into law."}, {"type": "subtitle", "content": "My Recommendation"}, {"type": "sentence", "content": "With the HEROES Act, increasing national debt and deficit, as well as a shrinking GDP, there are a lot of moving parts to make any kind of recommendation as to the best way forward for the country. Please also remember that I’m not an economist or a politician. With that said, I’m going to take my best shot at recommending a solution for moving forward."}, {"type": "sentence", "content": "I’d recommend that the Senate and the President sign the HEROES Act into law, on the condition that everyone understands that there will have to be difficult decisions made in the country’s future regarding its economy. It is important that the United States win the war against COVID-19. If we’re going to spend like we’re at war, we might as well treat the problem like we’re at war in other regards."}, {"type": "sentence", "content": "Bloomberg.com noted that the United States hasn’t spent this much as a percentage of its GDP since World War 2, and I feel like that’s an important comparison."}, {"type": "sentence", "content": "The United States took some noteworthy steps in revitalizing its economy. Most notably, the US sold Victory Bonds and expanded the middle class by making college and housing affordable."}, {"type": "subtitle", "content": "Bond Programs"}, {"type": "sentence", "content": "The United States needs to fight COVID-19 with every weapon available to it. But it can’t do that if it’s concerned about the fiscal impact of those actions. I would support a program similar to a Victory Bond program where the US sells a portion of its debt in the form of bonds to Americans. The bonds would mature over time. The longer the bonds are held, the more interest they’d accrue and perhaps they’d fully mature sometime in around 2040."}, {"type": "subtitle", "content": "Making College Affordable"}, {"type": "sentence", "content": "I would also like to see the middle class expanded. This was done through the introduction of the Montgomery GI Bill after World War 2. The GI Bill allowed veterans to be able to afford to go to college and seek high skilled, high paying jobs. The 21st century equivalent to this would be to make higher education affordable or even free to Americans going into college today."}, {"type": "sentence", "content": "This was the case in the United States up until fairly recently. Community colleges were free up until 1984 in the US. In-state public schools were charging $4563 on average for the 1984–1985 school year. That amount would be $11,365.47 in 2020, which is still roughly half the average $20,770 price of public college in the US for the 2017–2018 semester."}, {"type": "subtitle", "content": "Helping Americans to Buy Homes"}, {"type": "sentence", "content": "In another parallel to World War 2, the VA Home Loan made buying a house affordable for veterans returning home from the war. This could be duplicated today by forgiving the $1.6 trillion student loan debt in the US. Many Americans make student loan payments that are roughly equivalent to mortgage payments. Essentially, they are paying for a house they will never own, keeping them from buying a home and paying the taxes and fees that come with homeownership. Forgiving this debt would cause the majority of the 44 million Americans who owe student loans to purchase homes once the crisis ends."}, {"type": "subtitle", "content": "Conclusion"}, {"type": "sentence", "content": "The House of Representatives narrowly passed the Health and Economic Recovery Omnibus Emergency Solutions, or HEROES Act on May 15. The act still needs to be voted on in the Senate and signed into law by the President before it becomes law. It offers many features that the CARES Act did, like giving Americans another $1200 stimulus check. But this time, it aims to help more people by enhancing eligibility for payments, giving hazard pay to essential workers, and keeping people in their homes."}, {"type": "sentence", "content": "The HEROES Act is nice, but it’s not free. It comes with a $3 trillion price tag. This in addition to the country’s other obligations could put the US at having a debt higher than its GDP. This hasn’t occurred since World War 2. I believe World War 2 solutions, with a modern spin, would help solve our country’s 21st-century debt problems."}], "topic": "economy"}