{"title": "View from COVID-19: losers and winners in the tech landscape", "data": [{"type": "sentence", "content": "Today, many companies are fighting for survival as COVID-19 ravages economies across the globe. It is still unclear how badly this crisis will effect the global economy, but even in this difficult time, there are some companies that seem to have come out ahead of the competition."}, {"type": "sentence", "content": "Hussain Kazmi and I decided to take a closer look at some of the losers and winners in the pandemic induced meltdown, and the reasons behind their performance. To do this, we focused mostly on tech companies with a large online footprint (e.g. Booking.com, Uber, Netflix, Zoom etc.). We make use of publicly available news about these companies, their performance in the Apple app store as an indicator of audience growth, and their stock market valuation as an indicator of broader investor sentiment around the business case."}, {"type": "subtitle", "content": "Losers (Gone with the COVID)"}, {"type": "image", "content": "https://miro.medium.com/max/1800/1*L_4_Txn5pkNDSpb7Nb1wLQ.png"}, {"type": "sentence", "content": "It’s quite clear that airlines are among the biggest losers of the Covid-19 crisis. By this time, we have all seen news about the countless airlines that have had to suspend operations and let go their staff. Many of us have also received their “we are in this together ” emails (as if, my Ryanair overweight luggage charge still hurts). But the pain does not end with the airlines and airplane manufacturers. Even tech-first companies which are active in the travel and/or holiday business, e.g. AirBnB and Uber, have had to cut jobs due to dramatic decrease in businesses. Similarly, companies such as Booking and Expedia have seen a dramatic drop in their current operations."}, {"type": "subtitle", "content": "Booking.com"}, {"type": "sentence", "content": "Take Booking, for instance. Even though the company made a profit of almost $5bn last year, it has posted a loss of almost $700m in the first quarter of 2020 (travel bookings have plunged by almost 85%). This was reflected in the stock market valuation of the company, which started to plummet in the second half of February, and bottomed out more than 40% around March 23rd. While the stock prices for Booking.com stock have started rebounding since the beginning of April, this is disconnected from the market reality where newly booked room nights in April were down 85% YoY (as opposed to 60% in March)."}, {"type": "image", "content": "https://miro.medium.com/max/1334/1*XVA-TBkW6CMUoXLsuiAuwQ.png"}, {"type": "sentence", "content": "A similar picture also emerges if we take a look at the Apple App Store rank of the Booking.com app in the US (it’s a good indication of change in number of downloads for their mobile app), where the app fell below the top-300 rank somewhere in mid-March. In just a couple of weeks, it had even fallen out of the top-1500 positions, before making its way back into the top-600 by mid-May."}, {"type": "image", "content": "https://miro.medium.com/max/4840/1*yUY06o9Sr4bI4BjgK6Jw-A.png"}, {"type": "sentence", "content": "Hardly surprising then that the business is going through tough times. Interestingly, according to the Booking COVID-19 policy, all the responsibility for cancelations and refunds is with the hotels and type of booking you made:"}, {"type": "subtitle", "content": "Uber + Uber Eats"}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*R_r7UD082Hix4Vjx_R4Qqg.png"}, {"type": "sentence", "content": "Another tech company that has been strongly affected by COVID-19 is Uber, which has recently disclosed plans to lay off 3,700 employees (about 14% of the total workforce). However, in this case the situation is not as straightforward. On the one hand, gross bookings in the core ride-hailing business are down 3% YoY. On the other hand, bookings in the Uber Eats division are up more than 54 percent YoY as more and more people order food delivery as an alternative to eating out."}, {"type": "sentence", "content": "Regardless, UBER stock prices followed a largely similar trajectory as Booking.com in February and March. However, since the bottoming out in mid March, Uber stock has rebounded much faster than Booking (possibly in part due to the stronger than expected Uber Eats revenues, a factor distinguishing Uber from Lyft, its closest competitor in the US):"}, {"type": "image", "content": "https://miro.medium.com/max/1300/1*SREuCDXQat0gxkL5Psp2Yw.png"}, {"type": "sentence", "content": "These findings are also borne out by the App Store rankings, where we see that UBER Eats is now ranked higher than its ‘big brother’:"}, {"type": "image", "content": "https://miro.medium.com/max/1494/1*oSMyqo7uQGwni-VYNovWpQ.png"}, {"type": "subtitle", "content": "Winners"}, {"type": "sentence", "content": "That’s enough doom and gloom for now!"}, {"type": "sentence", "content": "Not all companies have suffered during the global pandemic. In fact, for some of them it has brought an amazing opportunity for growth. Among the obvious winners are remote work companies and, perhaps to a lesser extent, social media and gaming companies."}, {"type": "subtitle", "content": "Rise of t̶h̶e̶ ̶Ma̶c̶h̶i̶n̶e̶s̶ remote work"}, {"type": "image", "content": "https://miro.medium.com/max/3200/1*KmTexXu5hr8QOBjNaZnlqw.png"}, {"type": "sentence", "content": "In mid March, Italy went on full lockdown, followed by Spain, and many other countries. Here in Sweden restrictions have been much lighter in comparison, but even so, people prefer to work from home when possible."}, {"type": "sentence", "content": "In these new circumstances, lots of companies had to reevaluate the way they communicate. This provided an unprecedented opportunity for providers of conference call services and corporate messengers that have consequently become very hot recently. Zoom is perhaps the single most quoted success story in the pandemic, and for good reason. It has skyrocketed from an average ranking in the hundreds (by number of downloads) to the first place in top free apps in the United States, and has managed to remain there for several weeks since the second half of March."}, {"type": "image", "content": "https://miro.medium.com/max/4804/1*a3yc2jcPeazPiE6s7KGpXA.png"}, {"type": "sentence", "content": "Unsurprisingly, its stock prices have more than doubled in this period, painting a stark contrast to the stock prices we saw of Booking and Uber (which are still well below their earlier peaks):"}, {"type": "image", "content": "https://miro.medium.com/max/1314/1*mAmHWQCkKA94MKqCtO0Gfg.png"}, {"type": "sentence", "content": "Another beneficiary is a famous corporate messenger — Slack. The company had big problems last September, when the company stock lost 33% of its valuation, as investors worried about the company’s slowing revenue, competition with Microsoft and potential shareholder lawsuits. But since remote work became the new norm, share prices have been trending upwards, and, as of today, still appear to be keeping this trajectory."}, {"type": "image", "content": "https://miro.medium.com/max/1300/1*KYJXunDm9c3gAEltOY0Nvg.png"}, {"type": "sentence", "content": "However, unlike for Zoom, the rosy picture for Slack does not extend to their App Store Rankings. According to the App Store, popularity of the mobile version also went up in mid March, following the same trend as Zoom. However, after this initial surge in popularity, Slack has fallen back to its historical average value (or even a bit lower than before):"}, {"type": "image", "content": "https://miro.medium.com/max/4820/1*qgfmgWbJ0OBcanQHhSPHnA.png"}, {"type": "sentence", "content": "One reason for this could be that while Slack is mostly used for corporate needs, Zoom has quickly become one of the main tools not only for business meetings, online classes, but also for virtual hangouts with friends and families. This is not even taking into account the amazing backgrounds and potato skins that have gone viral with using Zoom."}, {"type": "image", "content": "https://miro.medium.com/max/2272/0*YkjsR-5Cq7-iW0IE"}, {"type": "subtitle", "content": "It’s C̵o̵r̵o̵n̵a̵ ̵t̵i̵m̵e̵ Playtime!"}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*cl9PYaBdshBjJDx3fu_jJQ.png"}, {"type": "sentence", "content": "During these uncertain times, many of us are actively looking for ways to distract ourselves from saaaaad thoughts. Casual gaming serves this purpose like nothing else, and a 65% increase in time players spend in mobile games is a great indication of this trend."}, {"type": "image", "content": "https://miro.medium.com/max/4352/1*a0CT3PqSJSduazyFs7te8A.png"}, {"type": "sentence", "content": "Such an increase in usage is, of course, followed by an increase in revenues. This is also reflected in the stock market valuation of Activision Blizzard, which has a number of popular mobile gaming apps in its portfolio (e.g. Candy Crush Saga and Call of Duty):"}, {"type": "image", "content": "https://miro.medium.com/max/1300/1*-y7tsEaAiJjyprvaaSzvPQ.png"}, {"type": "sentence", "content": "Funnily enough, there is no significant growth in TOP-Free charts for games, which means that the growth is mostly driven by an already engaged audience."}, {"type": "image", "content": "https://miro.medium.com/max/4800/1*ECAaoPPspNg_XEZD0UrDAw.png"}, {"type": "image", "content": "https://miro.medium.com/max/4808/1*cW-mOTNvWoltDV5R_tUlHw.png"}, {"type": "sentence", "content": "This all looks quite good for mobile games, but, as for Uber, the overaall picture is a bit more complicated. Despite the increase in usage, mobile ads market is going down. As a result, games and other apps, which are highly dependent on ads as their main monetisation strategy, are losing money."}, {"type": "sentence", "content": "The main reason is that many advertisers had to cut their budgets due to the pamdemic. This has negatively affected CPMs (cost per 1000 impressions, one of the most common ways to price ad impressions), which means that even increased number of ad impressions within a mobile app can end up with lower revenue."}, {"type": "sentence", "content": "Even Facebook, one of the biggest players in the digital advertising market, is reducing its ad revenue expectations despite having a large increase in traffic, a pattern being repeated across digital publishers."}, {"type": "subtitle", "content": "Netflix, but no chill"}, {"type": "sentence", "content": "The time people spend with their digital devices, as you have probably noticed at this point in the article, has increased dramatically. Of course, this applies to entertainment services such as Netflix as well."}, {"type": "sentence", "content": "Netflix has more than doubled the number of new subscribers it expected in the last three months as more people signed up amid the coronavirus pandemic. The streaming giant announced that it added 15.77 million new paid subscribers globally, well above the 7 million it had expected, as people worldwide sought ways to entertain themselves during the lockdowns. This has been accompanied by the biggest increase in its stock valuation, since it initiated an initial public offering in 2002."}, {"type": "image", "content": "https://miro.medium.com/max/1314/1*oSAvloNiwu__tG1LMkJutQ.png"}, {"type": "sentence", "content": "Unlike Netflix, the coronavirus outbreak and lockdown conditions have brought mixed fortunes to online-dating platforms like Tinder, according to its chief executive Elie Seidman."}, {"type": "sentence", "content": "On the one hand, Tinder users made the most swipes ever recorded in a single day on Sunday 29 March and users’ engagement is increasing rapidly. However, the economic impact of lockdown means people have less money to spend. This is not such good news for Tinder, or any similar service."}, {"type": "image", "content": "https://miro.medium.com/max/1300/1*_hV0Kyfp-9vH8L2soRxbpw.png"}, {"type": "sentence", "content": "The other issue that will become clear with time is whether the popularity of virtual dating is here to stay, even when physical meet-ups with strangers become possible again. Tinder is planning to roll out its own video dating function in June, but it’s still unclear wherever online dating is the next big thing."}, {"type": "subtitle", "content": "Summary"}, {"type": "sentence", "content": "It’s obvious that the digital market is rapidly changing, and the pandemic will draw a new reality, where quality and stability of online services are playing an even bigger role… We still hope that Ryanair and other Air companies will remember that we were in this together, when weighing our luggages next time (preferably even this summer)."}, {"type": "sentence", "content": "Thank you for reading, don’t forget to wash hands, and don’t touch your face!"}, {"type": "image", "content": "https://miro.medium.com/max/1970/1*Eqqv58W6jFaSo8fryRXA-g.png"}], "topic": "business"}