{"title": "Joy", "data": [{"type": "sentence", "content": "SpeEdChange.at.Medium"}, {"type": "image", "content": "https://miro.medium.com/max/676/1*RAeNc0Nz1yvzOkTuM2KBvA.jpeg"}, {"type": "sentence", "content": "A couple of weeks ago, no, I guess it’s been longer than that in our ‘Pandemic Time,” our neighbors had a grandson over. He is eight. We have a dog who can be “a wild man” (to quote the people at ‘doggie daycare’). He is just over a year old."}, {"type": "sentence", "content": "When boy and dog met the two instantly began playing, petting and nuzzling at first, but very soon a high speed race around the yard broke out mixed with boy and dog tackling each other. Soon they were both muddy messes, and both I and grandpa knew we’d hear about that."}, {"type": "sentence", "content": "But here’s the thing. My neighbor and I both said that we’d just watched pure joy. The boy laughing, running, falling. The dog running, ears flying, rolling around. It was magnificent. Boy and dog were being “boy” and “dog” exactly, I might say, “as God intended.”"}, {"type": "sentence", "content": "And I began to wonder, where do we see this pure joy in our schools? When do we see kids just being kids without us intervening?"}, {"type": "image", "content": "https://miro.medium.com/max/2400/1*t4Xwh2cA-iu-siNGkhAXNA.jpeg"}, {"type": "sentence", "content": "We see far too little joy in our schools, whether school is face-to-face or virtual. Now, here’s the big issue: When your kids come back to school in August, September, whenever, I’m going to predict that students tolerance for ‘school’ will be at an all time low. This will be despite their joy in seeing both friends and trusted adults again. But now they’ve seen comfort, control of time, control of context, and prioritizing the intersection between the playful, joyful and the rigor that comes only from intrinsic motivation."}, {"type": "sentence", "content": "“When has school been anything but dystopian?” That’s a question Pam Moran and I wrestled with at the Illinois Digital Educators Alliance IDEAcon, because that is a real question. We might argue that a ‘traditional’ school, even for the students who say they love and do well in it, is a process of limiting learning and an interference in the learning of life skills. And, joy is often very hard to find. It also limits curiosity, and curiosity is not just the essential ingredient in childhood and adolescence, but a huge component of joy as well. Trying something and getting it for the first time is always joyful — and it is always the cognitive reward for being curious."}, {"type": "image", "content": "https://miro.medium.com/max/3628/1*HX2TkOVsjiLN8JeZ6BbFtw.jpeg"}, {"type": "sentence", "content": "I think about scenes of joy."}, {"type": "image", "content": "https://miro.medium.com/max/1864/0*rz2w5i148xBg1Rr3"}, {"type": "sentence", "content": "We’re not alone. This month’s Kappan magazine arrived with the cover “The Joy of School.” The opening article throws down a gauntlet by quoting from previous battles over humane learning:"}, {"type": "image", "content": "https://miro.medium.com/max/1800/0*qSBaIKfZUC-TYRtQ"}, {"type": "sentence", "content": "And then, quoting a May 1984 Kappan article by Peter Gray and David Chanoff, “Despite what students may have been told about being “responsible” for their education, they saw clearly that such was not the case.”"}, {"type": "sentence", "content": "“What makes children want to learn? According to research, it’s the joy of exploration — a hidden force that drives learning, critical thinking, and reasoning. We call this ability curiosity, and we recognize it in children when we see them exploring their environment, devouring books and information, asking questions, investigating concepts, manipulating data, searching for meaning, connecting with people and nature, and seeking new learning experiences,” Marilyn Price-Mitchell wrote on Edutopia in 2015. “Curious children often spend a great deal of time reading and acquiring knowledge because they sense a gap between what they know and what they want to know — not because they are motivated by grades. In fact, when kids are in curiosity’s grip, they often forget the immediate goals at hand because they are preoccupied with learning.”"}, {"type": "sentence", "content": "“Preoccupied with learning.” That reminds me of a debate we had when a wonderful conversion of a high school library led to kids cutting class to stay in that joyful space with a genius bar, a music construction studio, a hackerspace, a gaming arena, and films being screened through bluetooth headsets, yes, and quiet spaces too. “If that’s happening the solution isn’t in the library,” I told our leadership."}, {"type": "image", "content": "https://miro.medium.com/max/1366/0*e9fGo078W2w4bZV8"}, {"type": "sentence", "content": "In the Atlantic, Susan Engel wrote in 2015, “A look at what goes on in most classrooms these days makes it abundantly clear that when people think about education, they are not thinking about what it feels like to be a child, or what makes childhood an important and valuable stage of life in its own right. This may explain why so many schools that I visit seem more like something out of a Dickens novel than anything else,” as she notes that many youth coaches make even learning a game joyless."}, {"type": "sentence", "content": "“Many of our greatest joys in life are related to our learning, but, unfortunately, most of that learning takes place outside of school,” Steven Wolk wrote in Educational Leadership in 2008. And I think of a second-grader I met last year who, after telling us that he was the best student in the class, talked for a half-hour, with great joy, about all he was learning. At the end we realized that none of the learning he told us about was happening in school."}, {"type": "image", "content": "https://miro.medium.com/max/2430/0*B57d0JjiDHMrEaCz"}, {"type": "sentence", "content": "My point is simply this. Whether we are in classrooms in September 2020, or in virtual schools, or in a hybrid, we must return learning to its humane roots. Working with a large cohort of librarians, I watched them narrow their library rules down to two statements."}, {"type": "sentence", "content": "“Be Curious. Be Kind” their “rules” sign read. “Because,” as one librarian said, “do we actually need to say anything else?”"}, {"type": "image", "content": "https://miro.medium.com/max/2430/0*b0RpiU5OSj8hLx-k"}, {"type": "sentence", "content": "But to bring joy back we must stop spending six hours a day pouring pre-cast curriculum into kids. That’s both cruel and futile. The kids not only don’t learn anything deeply, the end up hating learning. And in order to convert our learning spaces back to places of curiosity we must stop debating whether curiosity is essential. As Iverson noted in 1982, “…depending on our perspective, curiosity can be alternately amoral, virtuous, or dangerous.”(2)"}, {"type": "sentence", "content": "Listen folks. Curiosity is never amoral or dangerous. Children either grow up with a sense of morality and responsibility — transmitted from the actions (not words) of adults — or they do not. Adults either focus on their children and help them understand morality and responsibility — or they do not."}, {"type": "image", "content": "https://miro.medium.com/max/1328/1*KMP8n_Gs7OrncfuKhT31-Q.png"}, {"type": "sentence", "content": "But claiming that (or operating as if) curiosity can be amoral or dangerous, well, if that works than reading was responsible for the Holocaust because people read Mein Kampf. Curiosity is how we learn, but maybe more importantly, why we learn. Like I always tell people, “if kids don’t want what’s in books, why would they ever learn to read,” and then I beg them to offer every child pretty much whatever they want to read, in whatever format works for them, because I think my goal is to inspire curiosity."}, {"type": "image", "content": "https://miro.medium.com/max/2430/0*9v_1gUMrv99DBOpc"}, {"type": "sentence", "content": "So, as we reimagine our learning structures, let’s make sure we build around joy, and build around curiosity. Because, joy is what all of our children need."}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*n0wmuHgScm4Ql8VH"}, {"type": "sentence", "content": "Note 1: The Phi Delta Kappan (June 1982) “Play, creativity, and schools today,” p. 693Note 2: The Phi Delta Kappan Vol. 93, №8 (May 2012), pp. 61–65 https://www.jstor.org/stable/23210377"}], "topic": "education"}