{"title": "Content Used to Be King. Here’s What’s Next", "data": [{"type": "subtitle", "content": "Simply sharing another article or video isn’t enough anymore"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*CluPIU5WB4xWOi-M1GL80A.jpeg"}, {"type": "sentence", "content": "If you have a brand — any kind of brand at all — you probably publish content."}, {"type": "sentence", "content": "If you publish content, people probably (hopefully) consume it: subscribers, followers, viewers, or readers. Ideally, they’re your customers."}, {"type": "sentence", "content": "This swath of people who likes your stuff, supports your brand, buys your products, hires your team, donates to your cause, and so on — this is your community."}, {"type": "subtitle", "content": "Every brand has a community"}, {"type": "sentence", "content": "After a marketer identifies their community, big or small, the next question is: How do we keep our community engaged?"}, {"type": "sentence", "content": "This is where a lot of companies can get stuck."}, {"type": "sentence", "content": "Many believe the answer is: produce more content. Because content is king, right?"}, {"type": "sentence", "content": "The theory goes like this: the more content you produce, the more your brand stays “top of mind” for your consumers, educating the user down the “conversion” and “re-conversion” funnels."}, {"type": "sentence", "content": "This has worked for companies for years, but in 2020, “more content,” by itself, is no longer the answer. More content makes sense if you’re a media company and your content is your business, but for a lot of brands, more content is only the beginning. The future of community engagement is connection, not content — it’s people, not posts."}, {"type": "subtitle", "content": "Content isn’t king — it’s commonplace"}, {"type": "sentence", "content": "In the decades since Bill Gates wrote the essay “Content Is King” in 1996, the blogosphere has exploded — in 1999, there were 23 blogs. In 2006, there were 50 million blogs. Today, there are more than 500 million blogs. Add to that the rise of social media, and we have gone from swimming in content to drowning in it."}, {"type": "sentence", "content": "This means just publishing another article or another video isn’t going to keep your community engaged — not when they can find a dozen articles or videos just like it somewhere else online."}, {"type": "sentence", "content": "It’s true that your content is what brought people together into your community in the first place — and you probably should remind them of that regularly — but people don’t just want more information."}, {"type": "sentence", "content": "There’s one company that’s known this for years: Facebook."}, {"type": "subtitle", "content": "What Facebook knows"}, {"type": "sentence", "content": "You can see the evolving trend of community in the roadmap of Facebook, a business that makes its money from both content and community. Whereas simply distributing content to users is a one-way street, Facebook has been moving toward more collaborative and social tools, features, and events:"}, {"type": "sentence", "content": "Community platforms like Slack and Twitter have made similar moves. And this shift addresses three problems with mere content for content’s sake."}, {"type": "sentence", "content": "Let me illustrate with an example."}, {"type": "sentence", "content": "Let’s say you post a video in a Facebook group of which I’m a member. There are three problems that prevent me from consuming this content in a way that easily translates to me becoming your devoted customer:"}, {"type": "sentence", "content": "What Facebook figured out is a solution to these problems is real-time connection with face-to-face, two-way interaction around a shared experience among a closed group of people."}, {"type": "sentence", "content": "In other words, it’s an event."}, {"type": "sentence", "content": "Think about it. Events are:"}, {"type": "sentence", "content": "The business event industry is a trillion-dollar game. People are willing to pay a lot to be part of an event. For example, the early-bird ticket for WSJ Tech Live, the Wall Street Journal’s premier technology event, starts at $6,500 a head. The economic impact on the Austin economy from SXSW in 2018 was $350.6 million. Burning Man and Coachella are bursting at the seams."}, {"type": "sentence", "content": "People want to connect with other people."}, {"type": "sentence", "content": "I had a recent conversation with an Amazon marketing manager who heads a paid program that offers support to sellers on Amazon.com. She said that she did a survey of her community members and found that 98% were interested in meeting so that they could learn tips from one another."}, {"type": "sentence", "content": "The opportunity here is for brands to facilitate this for their community — and events can be a great way to do that."}, {"type": "sentence", "content": "Events offer your brand a number of benefits, including direct market feedback, key partnerships, member satisfaction, and opportunities and leads. On the other hand, if you’ve ever hosted events, you know they’re hard work. They’re stressful. They’re expensive. Food and drinks. Travel. Venues. Cleaning. Security. Bad weather."}, {"type": "sentence", "content": "But what if you could remove these barriers?"}, {"type": "sentence", "content": "What if you could distill the benefits of an event down to the core value — new connections and great content — and make them accessible to the world without damaging it? (Events can take a severe toll on the environment, after all.)"}, {"type": "subtitle", "content": "Better live online events are coming"}, {"type": "sentence", "content": "If you’ve ever been to a virtual event or webinar, you know many of them can be terrible experiences. They’re one-sided, impersonal, and disengaging."}, {"type": "sentence", "content": "The problem is that the platforms powering them have focused far too much on the content side and have forgotten about the connection side. Good events have both. Centering an event around a Powerpoint is a step backward, whereas a good online event will feature people, a step forward toward connecting them. This is where the magic happens. This is where ideas spark, partnerships form, businesses launch, and inspiration soars."}, {"type": "sentence", "content": "To date, the experience of virtual events has sputtered, but as experiential technology improves, be prepared for a groundswell."}, {"type": "sentence", "content": "I’ve identified five business trends that show increasing demand and availability for better live online event platforms:"}, {"type": "sentence", "content": "Bonus: Safety. Many large conferences are canceling due to the coronavirus."}, {"type": "sentence", "content": "Bottom line? Start thinking about your online event strategy — not your content strategy — for your community. Keep an eye out for emerging “live connection” platforms (like the one I’m working on). Start hosting pilot events and test out what resonates with your community. This is especially pertinent to remote companies and companies with global audiences."}, {"type": "sentence", "content": "Soon, I believe every organization will have its own meetup, summit, or conference, whether it’s online or offline or some combination of both, to connect its community. Expect to see new and improved live online event platforms to support this trend. Expect to see environmentally conscious companies moving more of their events online."}, {"type": "sentence", "content": "For marketers, content was king and still has a foundational role. But with improving technology, better online events are coming soon — because community engagement is at the forefront now."}], "topic": "marketing"}