{
  "title": "How to Promote Your App: The Definitive Guide for 2020",
  "data": [
    {
      "type": "image",
      "content": "https://miro.medium.com/max/4500/1*sj7zV8mqRISQ3eDuWlHTPA.jpeg"
    },
    {
      "type": "sentence",
      "content": "Marketing an app isn’t easy. Four million apps exist and people only use nine apps a day. Not to mention, getting people to use your app, stick around, and tell their friends & family about it is even harder. However, having a great marketing strategy in place is the first piece in executing a million piece puzzle."
    },
    {
      "type": "sentence",
      "content": "At the end of the day, marketing is about experimenting. The only way to find out what works is to just do that thing. So I’ve compiled a list of the most effective app marketing tactics in the book in no particular order."
    },
    {
      "type": "sentence",
      "content": "This took me 14 hours and five years of first-hand, brutal experience in the industry to put together so please take all of this to heart rather than the regurgitated app marketing fluff articles you’ll probably read after you leave this article."
    },
    { "type": "sentence", "content": "[Last updated April 17, 2020]" },
    { "type": "subtitle", "content": "Focus on App Store Optimization" },
    {
      "type": "sentence",
      "content": "70% of app downloads come directly from the App Store search."
    },
    {
      "type": "sentence",
      "content": "They say the best place to hide a body is on the second page of Google search results. The same can be said for apps. If you’re not showing up within the top ten for relevant keywords, you’re practically dead."
    },
    {
      "type": "sentence",
      "content": "Throwing money at advertising is your only other option which is not sustainable. And if you plan on raising funds, it’s a massive red flag to not have a source of organic traffic. ASO is the foundation of any marketing strategy, so investing time, money, and energy into this strategy is one of the best things to do. If you’re looking to work with some amazing ASO people, Apptuitive is pretty great."
    },
    { "type": "subtitle", "content": "Make a Remarkable App" },
    {
      "type": "sentence",
      "content": "Again, and I quote, four million apps exist. True innovation, unique ideas, and great execution are getting harder and harder to come by. Just good isn’t enough anymore and having the “if you build it they will come” mentality is extremely detrimental."
    },
    {
      "type": "sentence",
      "content": "Marketing starts with the product itself. I can’t say it better than Seth Godin:"
    },
    { "type": "subtitle", "content": "Include Shareholders With Influence" },
    {
      "type": "sentence",
      "content": "The mindset of approaching marketing for anyone, especially bootstrappers, is to elegantly slide into existing communities. Elegantly slide meaning don’t kick open the door and immediately start screaming about your app."
    },
    {
      "type": "sentence",
      "content": "One of the easiest ways to do this is to get in touch with key community gatekeepers early, ideally as soon as you’re set on developing the idea. The earlier the buy-in and the more the other person feels included, the better. And when I say gatekeepers, I mean influencers, community organizers, established subject matter experts, and anyone with an engaged audience."
    },
    {
      "type": "sentence",
      "content": "You have the app and they have the people. Both can’t work without the other. This engagement might look like splitting shares, working on a fixed-price basis, or even for free if the other person truly sees the value of the app idea."
    },
    { "type": "subtitle", "content": "Don’t Flatter Yourself" },
    {
      "type": "sentence",
      "content": "“Founder’s ego” blows me away. I’ve witnessed countless amounts of founders stunt marketing endeavors in so many different ways, it’s actually insane. To name a few:"
    },
    { "type": "sentence", "content": "Pride cometh before a fall." },
    { "type": "subtitle", "content": "Run a Paid to Free Campaign" },
    {
      "type": "sentence",
      "content": "Paid to Free is exactly what it sounds like. The strategy is to launch as a Paid app, anywhere from $5–10, then make the app free a couple of days later. You’ll get on the radar of popular app directories and have word of mouth referrals as a byproduct."
    },
    {
      "type": "sentence",
      "content": "Some app marketing experts charge thousands to even share this basic information with their clients, but without further ado, here’s how to execute a paid to free campaign:"
    },
    {
      "type": "sentence",
      "content": "Before you run this, it’s key to ensure the app is working properly. The last thing you want is thousands of users onboarded onto a buggy app and getting bombarded with negative reviews, which is extremely hard to climb out of. Note that you cannot change a free app to a paid app on Google."
    },
    {
      "type": "sentence",
      "content": "Stuart Hall wrote a case study, “How I got 2.3 million app downloads (without spending a cent on marketing)” and outlined this exact strategy. TLDR: 216k+ downloads in 3 days, an average of 72k/day, up from an average of 28/day at paid, or over 2500x. The app became the #1 fitness iPad app in 68 countries, and the #1 fitness iPhone app in 49 countries."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/2800/1*SEq6hbgZ3h6VhH3BqtZMCw.png"
    },
    { "type": "subtitle", "content": "Cross-Promote" },
    {
      "type": "sentence",
      "content": "If your app is complementary to another app, consider cross-promotion. Of course, it’s ideal for both parties have to bring an equal amount of value to the table, but if you have the lower-hand in the situation, it’s probably worth doing more if the other app has an existing audience."
    },
    {
      "type": "sentence",
      "content": "The prime example of this is the Nike Training Club and Headspace partnership."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/3200/1*BgtGHPuzJ9SzUX1DnDUo2Q.jpeg"
    },
    {
      "type": "sentence",
      "content": "Headspace meditation was flawlessly integrated into NTC to provide athletes mindful guided runs and the partnership happened right when meditation started to take off in the app stores."
    },
    {
      "type": "sentence",
      "content": "Although I couldn’t find the ROI of the partnership, I imagine things are going extremely well as it’s been two years since the partnership has rolled out and it’s still in place."
    },
    {
      "type": "sentence",
      "content": "Plus, somewhat unrelated, the co-branded promotional and in-app graphics are just perfect. *Chef’s kiss*"
    },
    { "type": "subtitle", "content": "Invest in Search Ads" },
    {
      "type": "sentence",
      "content": "Apple Search Ads’ average conversion rate is 50% and for Universal Ad Campaigns, advertisers that optimize for in-app actions, on average, drive 140% more conversions per dollar than other Google app promotion products. App store search works people, it’s all about intent."
    },
    {
      "type": "sentence",
      "content": "Healthy advertising budgets start at $5k-$10k/month. If you don’t have that marketing budget, experimenting with $50/day is also interesting for kicks & giggles, but again, if you don’t have a marketing budget of at least $5k/month, you’re better off skipping this section and investing money in a different channel."
    },
    { "type": "subtitle", "content": "Hire an Intern" },
    {
      "type": "sentence",
      "content": "If you want something done right, hire a qualified intern that has a good head on their shoulders. Just give them defined instructions."
    },
    {
      "type": "sentence",
      "content": "Now there are paid internships and unpaid educational internships. If you have the money to pay that person, pay them. If you really can’t afford to, offer them an unpaid educational internship for college credit."
    },
    {
      "type": "sentence",
      "content": "Please note, unpaid does not mean you can exploit your intern. If you go down this route, you need to offer an amazing, resume-elevating, network opening, informative experience. Don’t risk getting sticky with the law, because there’s a very fine line when it comes to intern expectations. You can read more on unpaid internship rules here."
    },
    { "type": "subtitle", "content": "Recruit Brand Ambassadors" },
    {
      "type": "sentence",
      "content": "This is in the same vein of hiring an intern but recruiting brand ambassadors is different. Unlike interns who work part-time to gain real-world experience, brand ambassadors are solely responsible for spreading the word about and representing said brand."
    },
    {
      "type": "sentence",
      "content": "Brand ambassadors are extremely popular with dating apps, for example. What better way to reach hot & bothered singles than college campuses? Both Tinder & Bumble took off because their roots were established in sororities & fraternities at just the right time."
    },
    {
      "type": "sentence",
      "content": "One popular strategy both brands ran with was working with influential students to throw parties at bars and frat houses, the catch was that one couldn’t get in without downloading the app."
    },
    {
      "type": "sentence",
      "content": "Once Tinder and Bumble had the campus social butterflies within a 5-mile radius of each other having success with the apps, word of mouth took care of the rest."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/4064/1*ChG3I-8E1n2mOiwxOkGHNg.png"
    },
    {
      "type": "sentence",
      "content": "Having a strong presence on campus if your app is for students or 18–25-year-olds is a great strategy. Birds of a feather flock together, and if you know anything about network effects, you’ll know that there are few places like college campuses that are ripe for a word of mouth ripple effect."
    },
    { "type": "subtitle", "content": "Network" },
    {
      "type": "sentence",
      "content": "Shake hands with everyone. Your network is your net worth, and you literally never know who will be instrumental in the growth of your startup/side hustle."
    },
    {
      "type": "sentence",
      "content": "I’m actually extremely confident in saying success depends on the quality of people you meet. Getting non-fluffy, real answers from experienced people in the startup world will keep you from making the same mistakes they did."
    },
    { "type": "subtitle", "content": "Do the Things That Don’t Scale" },
    {
      "type": "sentence",
      "content": "“Doing the things that don’t scale” is a phrase popularized by Paul Graham, the co-founder of Y Combinator. It means exactly what it sounds like. It’s the most practical tip in the book because there’s no such thing as taking shortcuts when you’re building a business. There’s no growth hack or secret pill to reach success."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/2600/1*tScKjzSh-wRIRYizhyMhsw.png"
    },
    {
      "type": "sentence",
      "content": "If you’re looking for a list of ideas for inspiration there’s an entire crowdsourced list at dothingsthatdontscale."
    },
    { "type": "subtitle", "content": "Piggyback Off of Current Events" },
    {
      "type": "sentence",
      "content": "Rule of thumb for marketing, the more relevant your product is to today, the better."
    },
    {
      "type": "sentence",
      "content": "This is an extreme example, but a client of mine, SHOCK Women’s Fitness, revamped all marketing efforts when COVID-19 hit. The founders gave away the app for free and reaped extremely positive upsides because of it."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/4536/1*sfunIfNnDdQtLmSBPqojjA.png"
    },
    {
      "type": "sentence",
      "content": "Of course, there’s a difference between being relevant and opportunistic, but it all comes down to intent. The closer you can tie messaging or campaigns to holidays, current events, social trends, etc., the better."
    },
    { "type": "subtitle", "content": "Show Up in Google Search" },
    {
      "type": "sentence",
      "content": "Just like ASO, SEO is equally important for certain apps. Most relevant searches are obviously done in the app store, but if you can get ahead in Google search as well, why not?"
    },
    {
      "type": "sentence",
      "content": "There are literally thousands of articles on SEO so I don’t want to sit here and ramble on, however, here are a few pieces of SEO advice:"
    },
    { "type": "subtitle", "content": "Optimize for Ratings & Reviews" },
    {
      "type": "sentence",
      "content": "Ratings & reviews especially play a huge role in marketing as it signals to the app stores that there’s a demand for the app and that the user is having a positive experience."
    },
    {
      "type": "sentence",
      "content": "A key strategy is to prompt that “leave a review” pop-up after the user completes a main action in the app. For example, if you have a photo editing app you could prompt the user to leave a review right after the photo is successfully edited and saved to that person’s photo gallery."
    },
    {
      "type": "sentence",
      "content": "Matt Galligan wrote the best article on app ratings and these are the results he saw after implementing the advice laid out in “The right way to ask users to review your app”:"
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/3976/1*OFktUGk4P2Pa0xC_QTo1bw.png"
    },
    {
      "type": "sentence",
      "content": "In addition to just asking your users for app ratings & raving reviews, you need to make sure you’re actually walking the walking. Listening and personally responding to reviews shows your users that they’re appreciated."
    },
    {
      "type": "sentence",
      "content": "Lifehack in general, but mirroring the user’s language will show them that you’re listening and not just yes-ing them to death."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/1638/1*McKzAv_Es9xE60xDCmN5LQ.png"
    },
    {
      "type": "sentence",
      "content": "It actually improves the UX and your business as a whole, so it’s in your best interest to treat every user as you would your newborn child."
    },
    { "type": "subtitle", "content": "Get Press" },
    {
      "type": "sentence",
      "content": "Press is the best. If you land the right placements you’ll essentially start a massive snowball effect. I’ve been on both sides of pitching, so I can say first-hand that it is not easy. Here are the golden Do’s & Don’ts of pitching:"
    },
    { "type": "sentence", "content": "Dont’s" },
    { "type": "sentence", "content": "Do’s" },
    {
      "type": "sentence",
      "content": "Here’s an example of an app that got featured on The Next Web:"
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/2152/1*duYsPPcIPMsTW-GPMcWQJw.jpeg"
    },
    {
      "type": "sentence",
      "content": "Wakeout hit its goal of 10k new users from press alone. The app also went on to secure a worldwide Apple feature that lasted a week, driving 210k more downloads."
    },
    { "type": "subtitle", "content": "Use Your Brain" },
    {
      "type": "sentence",
      "content": "I don’t mean this in a sarcastic way at all, but in all honesty, the only person that will be able to figure the most effective, clever marketing strategies, if you don’t have thousands to spend on a marketing consultant, is you. The only way to get experience is to experiment. And again, there’s really no “perfect way” to go about marketing. It’s all trial & error and figuring out which channels work best."
    },
    {
      "type": "sentence",
      "content": "And don’t be stupid with money. I once went to a launch party where a couple of hundred dollars was spent just on having an eye-piercing, red sports car by the entrance for three hours. To this day, I still can’t believe it was real."
    },
    { "type": "subtitle", "content": "Don’t Have a Selling Mentality" },
    {
      "type": "sentence",
      "content": "Marketing does not equal selling. In fact, the easiest way to sell something is not selling anything. If people really need your app, they’re going to be interested just based on the value proposition."
    },
    {
      "type": "subtitle",
      "content": "Facebook Advertising, Not Facebook Regular Posting"
    },
    {
      "type": "sentence",
      "content": "If you’re posting from a Facebook page in hopes of gaining traffic, you are going to be posting on Facebook until the end of the world. Using Facebook for organic reach is the equivalent of standing in the middle of a desert talking to yourself about your new app. Organic reach is hovering around 1% these days."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/1276/1*t-SxUFB0-rfIoX2avBD_Tg.jpeg"
    },
    {
      "type": "sentence",
      "content": "However, if you do have an advertising budget, Facebook is obviously a great platform. It helped elect a President!"
    },
    {
      "type": "sentence",
      "content": "If you want to learn more about running effective app install campaigns check out this blog post by Branch Metrics."
    },
    { "type": "subtitle", "content": "Post on Instagram — With Purpose" },
    {
      "type": "sentence",
      "content": "If you just use Instagram for the sake of using Instagram, there’s no point in using Instagram. As of 2020, it’s still the platform to be on, however, you’re competing for eyeballs along with every other brand, friend, family member, and meme account."
    },
    {
      "type": "sentence",
      "content": "That said, you need to think of Instagram as your target user’s mood board. Disregard the notion that Instagram is solely aesthetic-looking photos because it’s not just that anymore. People love apps that are intertwined with their lifestyle and Instagram should reflect a broader understanding of that."
    },
    {
      "type": "sentence",
      "content": "Strava does a great job with their feed. The company boasts amazing, unique data and they show it through data visualization/shareable infographics."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/3832/1*umvtFhDzxpHp0Brvp3_5mA.png"
    },
    {
      "type": "sentence",
      "content": "There’s also a healthy mix of inspiring real-life marathon shots, motivational photos, and user highlights. It’s not obnoxiously branded or heavily self-promotional, it’s just right."
    },
    { "type": "subtitle", "content": "Use Twitter, You’re Relevant" },
    {
      "type": "sentence",
      "content": "If your brand is opinionated, which it should be, use Twitter. It’s a great place to converse 1–1 with potential users and be a part of relevant conversations."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/2020/1*HyVUozKHV_yenBGx6xEUVQ.png"
    },
    {
      "type": "sentence",
      "content": "Cash App probably isn’t the most relevant example to point to, however, it’s the most engaging example I could think of."
    },
    {
      "type": "sentence",
      "content": "Cash App promotes it’s own hashtag every so often, asking followers to tweet them their “cashtag” or username. They do this to choose a random person to send money to via their app. No one can say no to free money, so it’s prime marketing at it’s finest. Of course, not everyone has money to just give away, but coming up with clever strategies along the lines of Cash App pays off dividends."
    },
    { "type": "subtitle", "content": "Use Reddit if Relevant" },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/3526/1*VSPe6nXjr3XO76qXjWe17g.png"
    },
    {
      "type": "sentence",
      "content": "Reddit is the antithesis of spam. Only use Reddit if you plan on being an active part of the community. Ideally, you should be heavily vested in the startup community if you really want to get the most bang for your buck here. Each subreddit is highly-engaged and there’s always great information being poured into the ecosystem every day."
    },
    {
      "type": "sentence",
      "content": "It’s also good to note that Reddit heavily skews male, so if your target demo is guys 21–40 years old this is a nice place to chat it up."
    },
    { "type": "subtitle", "content": "Start a Youtube Channel if Relevant" },
    {
      "type": "sentence",
      "content": "Producing quality content is expensive, whether it comes at a time or monetary cost. Producing high-quality videos is definitely a mix of both."
    },
    {
      "type": "sentence",
      "content": "Youtube isn’t for everyone because it is a very saturated platform, however, if you’re running an ed-tech startup I’d highly recommend looking at either sponsoring relevant videos in your niche or starting a channel on your own."
    },
    {
      "type": "sentence",
      "content": "50% of people use YouTube to learn new things, making the platform practically a goldmine for education-based apps."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/2852/1*DVwmyNAccY4CKxtfZmsbTg.png"
    },
    {
      "type": "sentence",
      "content": "I worked on Mechanisms by Alchemie and we went forward with this same strategy. The majority of our target users who studied organic chemistry were going to YouTube to learn. So we started showing up where they were."
    },
    {
      "type": "sentence",
      "content": "Remember, 80% of people remember what they see, compared to 10% of what they hear, and 20% of what they read. The more visual content you put out, the better."
    },
    { "type": "subtitle", "content": "Tik Tok, Tik Tok, Tik Tok" },
    {
      "type": "sentence",
      "content": "Put on your Gen Z pants, because if your target audience is 24 yrs and/or younger, you need to use TikTok yesterday. The organic reach is off the charts and if you can create or sponsor great content, you’ll hit the jackpot."
    },
    {
      "type": "sentence",
      "content": "A handful of smart photography and visual-focused apps are killing the game. The key is integrating the app into the video in a non-salesy way. In fact, the best app-related content doesn’t even seem like selling at all, it’s purely entertainment. Let people organically ask what the app is because they’re so interested, without you even saying anything."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/900/1*_kvm0MTvmD2DO46mb7mmtg.png"
    },
    {
      "type": "sentence",
      "content": "Cole & Tezza, lovers & founders of the Tezza app, pull this off flawlessly."
    },
    {
      "type": "sentence",
      "content": "Tezza is a photo & video editing app with a target audience of 15–35-year-old women, most likely. The founders take advantage of the lifestyle angle that photo editing apps inherently have and intertwine it with their lives."
    },
    {
      "type": "sentence",
      "content": "The TikToks that mention the app are beautifully integrated in a non-intrusive, highly-entertaining way. It doesn’t feel like selling at all, and users are intrigued enough to actually download the app for themselves."
    },
    {
      "type": "sentence",
      "content": "Tezza is the absolute golden example of what any strategy should look like on TikTok. *Chef’s kiss*"
    },
    { "type": "subtitle", "content": "LinkedIn" },
    {
      "type": "sentence",
      "content": "This goes in hand with something I’ll touch on next, which is working on your personal brand, but I want to focus on LinkedIn."
    },
    {
      "type": "sentence",
      "content": "LinkedIn is the perfect platform to connect with professionals in the same vertical as you, and it’s also a great place to connect with fellow startup heads. LinkedIn organic reach is great, not as good as it once was, but it’s still effective. Document your startup/app journey and people will follow. People mindlessly consume anything these days."
    },
    {
      "type": "sentence",
      "content": "LinkedIn Sales Navigator, in particular, is fantastic, especially if you’re looking to raise money. You can search for anyone based on job titles, regions, countries, and more. It’s like Facebook stalking, but less creepy."
    },
    {
      "type": "sentence",
      "content": "It’s ideal to have a warm intro, but no matter who you’re cold messaging, a potential user, investor, employee, etc, you need to make sure you actually have a decent understanding of the person and personalize your intro message. There’s nothing that will trigger an immediate delete than a generic “Hi, I’d like to connect.”"
    },
    { "type": "subtitle", "content": "Work on Your Personal Brand" },
    {
      "type": "sentence",
      "content": "Who doesn’t love a good founder’s story? But really, any positive press you get as a founder pays off for whatever you’re building. One of the best tips I could possibly give anyone is to sign up for HARO, which stands for “Help A Reporter Out.” Journalists everywhere are always on the hunt for new stories to cover. So if you’re a subject matter expert in your field, take advantage of it."
    },
    {
      "type": "sentence",
      "content": "You’ll receive morning, afternoon, and evening inquiries in your inbox every workday. Checking on them needs to be a habit because you never know what you might miss."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/3568/1*lzO4s9SlP6pgxDcbyrCa7g.png"
    },
    {
      "type": "sentence",
      "content": "All you need to do is find pitches most relevant to your app, and reply with the information the journalist is looking for. Massive returns for little to no effort."
    },
    { "type": "subtitle", "content": "Go to Events" },
    {
      "type": "sentence",
      "content": "I wouldn’t say event crawling is the best use of your time, but I’m including it because I know a few people who have had success with this."
    },
    {
      "type": "sentence",
      "content": "You need to know what you want out of the event before you even step foot through the door. Are you trying to find a co-founder? Are you recruiting brand ambassadors? Are you looking for an investor? Having a clearly defined goal will allow you to focus and make sure your time is being spent wisely. Meetup is great."
    },
    { "type": "subtitle", "content": "Talk to Every Potential User" },
    {
      "type": "sentence",
      "content": "You really need to talk your face off and take advantage of every single relevant conversation you find yourself in as a startup founder. Again, you never know who you’re going to run into or who is going to tell who what. Just don’t turn into a car salesman every interaction you have."
    },
    { "type": "subtitle", "content": "Research Your Competitors" },
    {
      "type": "sentence",
      "content": "Marketing isn’t a mystical, magical thing. There’s no need to reinvent the wheel. Top apps get to where they are because they’re either funded out the wazoo or executed on the tactics listed in this article at the right time. That said, low-hanging fruit is stalking your competitors for ideas and executing them, but better."
    },
    { "type": "subtitle", "content": "Get an App Store Feature" },
    {
      "type": "sentence",
      "content": "If you have an iOS app, or even Android, one of the fastest ways to get a ton of downloads is to land an app store feature, which is easier said than done."
    },
    {
      "type": "sentence",
      "content": "The strategy you need to take here is the same as pitching the press. Stay straight to the point and keep it short, and then punch them in the face. Apple has to see hundreds, if not thousands, of feature pitches a day. You need to stand out."
    },
    {
      "type": "sentence",
      "content": "That said, it’s good to mention why iPhone users need this app, as well as mentioning any iterations the app has been through. Apple loves seeing real solutions and continual positive UX improvements."
    },
    { "type": "sentence", "content": "Here are key points to include:" },
    { "type": "subtitle", "content": "Figure Out Your Network Effect(s)" },
    {
      "type": "sentence",
      "content": "I’d highly recommend watching Niall Ferguson’s docu-series, Networld, or researching anything on network effects. Again, relying on advertising and dropping dollars is unsustainable. You need to focus on maximizing organic channels as much as you possibly can."
    },
    {
      "type": "sentence",
      "content": "I’m not using the word viral here because it has a negative connotation to me. The people who say they want virility mean they want an easy, quick way to a bajillion downloads and bam that’s it. That’s not realistic at all."
    },
    {
      "type": "sentence",
      "content": "Read this article by Eric Jorgenson for more information if you’re curious."
    },
    { "type": "subtitle", "content": "Experiment with Guerrilla Marketing" },
    {
      "type": "sentence",
      "content": "Guerrilla marketing is essentially a marketing strategy in which a company uses unconventional ways to promote their product. Think of it like extreme creative publicity. Foursquare pulled off a solid guerrilla marketing stunt back in 2010 at SXSW."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/1200/1*Xa8R5IDSPc2EePyKl1nKFA.jpeg"
    },
    {
      "type": "sentence",
      "content": "The startup didn’t have the traditional SXSW exhibit, so they were left to their own devices. Instead of setting up a booth or actual tech exhibit at the convention, Foursquare set up an actual game of 4-square with just a piece of chalk and a rubber ball."
    },
    { "type": "sentence", "content": "Dennis Crowley, Foursquare CEO said:" },
    {
      "type": "sentence",
      "content": "The company gained 100k users from this tactic and all it took was being at the right place at the right time with a ball and some chalk."
    },
    {
      "type": "subtitle",
      "content": "Surprise & Delight Anyone That’s Remotely Interested in the App"
    },
    {
      "type": "sentence",
      "content": "Everyone vividly remembers any time they were surprised. The same can be said for startup/app brands. Bumble once sent me a bouquet of flowers, and in that moment, I practically became a word of mouth slave of them."
    },
    { "type": "sentence", "content": "Screenshot from author’s twitter" },
    {
      "type": "sentence",
      "content": "You don’t have to go to the extent of sending every person flowers, however, going out of your way definitely leaves a lasting impression. When you’re especially onboarding your first 100 users, you need to treat them like royalty and I can’t stress that enough. McKinsey once stated that “word of mouth is the primary factor behind 20–50% of all purchasing decisions. Its influence is greatest when consumers are buying a product for the first time.”"
    },
    {
      "type": "sentence",
      "content": "You need to turn those first few people into brand warriors. I’d highly recommend reading Kevin Kelly’s, “1,000 True Fans,” as well. It’s almost in the same vein as this piece of advice."
    },
    { "type": "subtitle", "content": "Start Doing" },
    {
      "type": "sentence",
      "content": "If you’re not moving forward you’re moving backward. The faster you start networking, marketing, and doing everything mentioned in this article the better. There’s really no time to waste in this game, so what are you waiting for? Get out there and talk to someone about your baby."
    }
  ]
}
