{"title": "Jobs vs. Hoffman — which philosophy is best for designers?", "data": [{"type": "sentence", "content": "LinkedIn founder and former PayPal COO, Reid Hoffman famously said:"}, {"type": "sentence", "content": "Apple and Pixar founder Steve Jobs, on the other hand, had almost the exact opposite philosophy. He once said:"}, {"type": "sentence", "content": "He lived by this philosophy."}, {"type": "sentence", "content": "So, when it comes to UX and UI design, who was right?"}, {"type": "sentence", "content": "At my app agency, we help entrepreneurs launch new apps and the question “when is it ready for release?” comes up on just about every agile project. For clients, this is usually a more obvious consideration towards the end of development, when bugs are being ironed out and last minute tweaks are being applied. However, considering ‘readiness’ in the design phase can be equally important."}, {"type": "image", "content": "https://miro.medium.com/max/2660/1*OKJb-C7RbJh6V2UFEU_fhA.jpeg"}, {"type": "sentence", "content": "As a designer you can always keep working, keep refining and keep improving a design. But, at some point you have to put your mouse down and leave your precious baby in the hands of others. Is it OK to hand over a design you are embarrassed by if it means potentially getting to market quickly or should you take your time to perfect it?"}, {"type": "sentence", "content": "It all comes down to Hoffman or Jobs. Whose philosophy is the right one for designers?"}, {"type": "sentence", "content": "I don’t presume to have the answer and I don’t think there is an answer that applies universally but I can tell you how I choose to approach it."}, {"type": "sentence", "content": "Here’s why:"}, {"type": "sentence", "content": "Users will forgive you for the occasional bug. They’ll live with a lack of features or content. In fact, as long as you provide that one core service they need and can’t get anywhere else, they’ll tolerate all kinds of technical shortcomings."}, {"type": "sentence", "content": "In my experience launching over a hundred apps, I can definitively say that Reid Hoffman was right in a technical context. If you want the first mover advantage, getting a minimum viable product to market fast, bugs and all, is the way to go."}, {"type": "sentence", "content": "Nowadays, users have a very low tolerance threshold for poor design though."}, {"type": "sentence", "content": "PayPal was launched in 1998, at the height of the dot com bubble and LinkedIn a few years later. This was a gold rush era. Users didn’t have nearly as many choices as they have today. Web design was an entirely new concept for designers. Everyone was learning and nobody had truly mastered the art form. ‘UX designer’ wasn’t even a job title back then. Design sophistication just wasn’t as important. Things have changed though. User experience and interface design has come a long way and user’s expectations have moved with it."}, {"type": "image", "content": "https://miro.medium.com/max/1534/1*3ILu9iNqJFz63n84zjRQyA.png"}, {"type": "sentence", "content": "In 2020, these are some of the big impacts design can have when it comes to launching a new digital product:"}, {"type": "sentence", "content": "There’s no need to take my word for it though. Just spend half an hour exploring the App Store and Play store. Look at the top ranking apps. Look at the apps with the most positive ratings. Look at the apps Apple and Google are featuring. What do they all have in common? They look great."}, {"type": "image", "content": "https://miro.medium.com/max/2476/1*0ntuxJlDRWWqSwmdst97zA.jpeg"}, {"type": "sentence", "content": "Of course, look and feel is only half of the story when it comes to design though. At this point it’s worth recounting another of Steve Jobs’ memorable quotes:"}, {"type": "sentence", "content": "By definition, poor design equates to a poor user experience and I think we can all agree that when it comes to designing great experiences, Jobs was the master."}, {"type": "sentence", "content": "So, in adopting Jobs’ philosophy as a designer, does this mean you should abandon timelines altogether? Of course not. Designers still have deadlines to meet and clients to appease. What it does mean is using design time effectively to get the best design outcomes. It means suggesting time and budget extensions where you think they are necessary. It means being able to effectively articulate the reasons why spending more time on a particular screen, function or flow will affect the success of the product to stakeholders"}, {"type": "sentence", "content": "For every startup or new project, there will always be competing priorities. There will never be enough time or money to do everything. Knowing why great design is so important can help you to balance those priorities."}, {"type": "sentence", "content": "Reid Hoffman was right when it comes to development. Acting fast and getting a first mover advantage can be crucial to the success of a new digital product. But when it comes to design, Steve Jobs’ philosophy rings truer now than it ever has before. Details matter."}, {"type": "sentence", "content": "Originally published at https://dreamwalk.com.au on April 16, 2020."}]}