{"title": "Remember Quarantine?", "data": [{"type": "image", "content": "https://miro.medium.com/max/12000/1*zkRBPU2xSd7y_uCuRFhXvg.jpeg"}, {"type": "sentence", "content": "That was tough, huh? At first, no one took it seriously. And then it came our way. Governments worldwide announced unprecedented measures: the obligation for everyone to remain confined to their home for several weeks."}, {"type": "sentence", "content": "We were used to going wherever we wanted, whenever we wanted, as free people that we are. Suddenly, we had to reinvent our lives. Reinvent ourselves."}, {"type": "sentence", "content": "It’s been a long few weeks. We couldn’t see the end of it. We missed our loved ones terribly. We missed our friends. We missed going out for a walk. Even going grocery shopping."}, {"type": "sentence", "content": "We waited. The first week, we named them. Day 1. Day 2. Day 3. Day 7. Soon, we lost count."}, {"type": "sentence", "content": "Then, as astonishing as it may seem, when we were calm and attentive to our inner feelings, we felt some positive effects. We were centered. Focused on the present moment. Giving each day the importance and place it deserves."}, {"type": "sentence", "content": "And then. THEN! Finally."}, {"type": "sentence", "content": "On the news, it was announced that we would regain our freedom of movement in ten days. Ten days! It still seems too long, we’re so impatient, and at the same time, we’re finally seeing light at the end of the tunnel."}, {"type": "sentence", "content": "This time, we didn’t lose count of the days. The count’s reversed. Each day, I texted you or you texted me: only seven more to go! Only four to go! Two days left."}, {"type": "sentence", "content": "At last, our doors opened."}, {"type": "sentence", "content": "We stuck our nose out, cautiously, like wary animals out of their dens. As if we were no longer accustomed to reality. To the outside world. It takes 21 days for a human being to acclimatize to something."}, {"type": "sentence", "content": "It was a masked parade down the streets. A government obligation. Just because life was finally getting back on track did not mean we were out of it."}, {"type": "sentence", "content": "We have crossed a point of no return. This period has changed us, and we are starting a new era."}, {"type": "sentence", "content": "On TV, the cameras showed reunion scenes in train stations. Lovers, families. People separated for months, finally reunited. The happiness was palpable. They, too, would no longer take their loved ones for granted."}, {"type": "sentence", "content": "And, oh, remember that first sip of beer? We were sitting on the terrace of this bar, the one we used to go to all the time. The place where we met. It made us feel funny as if, at any moment, the police would come and order us to go home."}, {"type": "sentence", "content": "We opted for our usual pints of white beer. We were finally looking at each other for real, eye to eye, not separated by a screen. The sun was shining its last rays on our skins, while drops of condensation were dripping from our glasses."}, {"type": "sentence", "content": "From now on, we must keep in mind the positive realizations this event has brought to us. The beneficial changes. Cherish them in the depths of our being."}, {"type": "sentence", "content": "We’ve learned to seek happiness inside us."}, {"type": "sentence", "content": "We went through it. We stood together. We were strong. We were hopeful. Let’s savor this happiness. All this is now behind us."}]}