{"title": "How to Deal With Beginner Anxiety as a New Freelance Writer", "data": [{"type": "image", "content": "https://miro.medium.com/max/8960/1*WMQO5oqROj5hU_bUAjWCPw.jpeg"}, {"type": "sentence", "content": "There comes a point for most new freelance writers where they know the action steps they need to take, but they are still cemented by fear."}, {"type": "sentence", "content": "They love to write, but they are worried that others won’t want to pay them for their words."}, {"type": "sentence", "content": "If you feel this way, know that you aren’t alone. However, you do need to kick this fear and anxiety out of your business ASAP. Here are a few tips to help."}, {"type": "subtitle", "content": "1. Do Your Research"}, {"type": "sentence", "content": "Not sure what to pitch or write for a new freelance writing client? Research their site and answer these questions:"}, {"type": "sentence", "content": "Knowing these answers and reading through several articles on a potential client’s website can help you feel more confident in your abilities. If your freelance client is new to the content marketing world, this is when you ask them to provide a few sites or articles they love."}, {"type": "sentence", "content": "It is also good to know what their content goals are. For example, if they want to develop core content that is trustworthy, then adding trendy verbiage and Buzzfeed-style title is not a good idea."}, {"type": "subtitle", "content": "2. Think About the Worst That Will Happen"}, {"type": "image", "content": "https://miro.medium.com/max/12866/1*uhAhUaDNx7hM44YSSDED9g.jpeg"}, {"type": "sentence", "content": "Fear of failing use to cripple me from pursuing goals. Then I started thinking logically. What is the worst that can happen to me in this situation?"}, {"type": "sentence", "content": "Most of the time was that I would be embarrassed or I would get rejected. These feelings are crushing at the time, but they aren’t life-altering. If a client does not like my article, then worst that can happen is that they don’t pay me, I have wasted time, and my ego is bruised."}, {"type": "sentence", "content": "If your article is horrible, no one is going to take your kids away, burn down your house, or stop being your friend. This may seem silly, but the truth is that we put too much weight on failing and rejection in the business world."}, {"type": "sentence", "content": "Here is what will likely happen if your article is not great. Either the client will ask you to rework it and then be satisfied with the changes or they will tell you that your tone isn’t right for their company, and most of the time, they will pay you for your work."}, {"type": "sentence", "content": "They aren’t going to be calling up all of their to spread your name around or leave you a bad Yelp review."}, {"type": "sentence", "content": "Their rejection is either a reflection that you need to tweak your writing or that you just weren’t a great fit for the client. It doesn’t mean you can’t succeed in freelance writing."}, {"type": "subtitle", "content": "3. What’s the Best That Can Happen?"}, {"type": "sentence", "content": "The point of asking what the worst that can happen isn’t to put your mind in a negative space. Instead, it is to show you that the worst in your situation is not that bad at all. You can bounce back from rejection and criticism."}, {"type": "sentence", "content": "Now think about what the best situation that can happen from this one article. The cool thing about this exercise is that the sky is the limit. You really have no idea how far one article or client can take you."}, {"type": "subtitle", "content": "4. Just Start"}, {"type": "sentence", "content": "Anxiety as a freelance writer usually comes from the desire to write an amazing article from the beginning. The best articles are not penned on the first draft. It can take several rounds of self-edits to get a piece where you want it."}, {"type": "sentence", "content": "Instead of wasting time trying to come up with the best lede, just throw something on the page. Get the article written and then go back and make the tweaks you want."}, {"type": "sentence", "content": "It is hard to polish a table when you haven’t built it yet. The same principle applies to writing. You can’t start the editing and refining process if the words and ideas are still stuck in your head."}, {"type": "sentence", "content": "Many times you will find your article’s tone or direction in the middle of the article rather than the beginning. This is why it is better to get your writing out than hemming and hawing over each word. Don’t miss my post on getting started when you’ve never been published before."}, {"type": "subtitle", "content": "You Are a Freelance Writer"}, {"type": "sentence", "content": "So start acting like it. William Zinsser said that writing is a craft much like that of a plumber. You get better at your job by doing it. You get better at writing by writing."}, {"type": "sentence", "content": "There is no need to have beginner anxiety as a freelance writer because you are either good enough to break into the writing world, or you will be good enough after some polishing."}]}