{"title": "Salt and Vinegar", "data": [{"type": "sentence", "content": "The magazine on the coffee table has been on page six for over a decade now. It’s been frozen in time using the chips clip that once bound the bag of salt and vinegar chips in the pantry, one bag a week. Dave, setting out every Sunday morning between eight and nine, would always pull one bag off the shelf for his wife, Anne. The infernal things, he couldn’t quite understand the appeal. They burned on his tongue but she devoured them like candy."}, {"type": "sentence", "content": "Page six always brought him a smile, reminded him of a time when everything felt the way it was supposed to — Dave didn’t have any doubts about his life, or any wishes for things to change even the slightest. For Dave, a perfect evening always consisted of an iced-tea, sweetened, alongside Anne, hers unsweetened, on their back deck as they watched the sun sink below the neighbors treeline."}, {"type": "sentence", "content": "“Cotton candy sky in the morning,” said Anne, one warm evening in April, “and caramel apple at night.”"}, {"type": "sentence", "content": "“Nature,” said Dave, exhaling after popping his lips following a sip, “sure is sweet.”"}, {"type": "sentence", "content": "They both held their bellies in laughter."}, {"type": "sentence", "content": "The day the reporter, as Dave referred to him as, arrived was unusually cold for May. It was a Tuesday afternoon and the reporter had taken an extended lunch break from his day job in order to visit. When Dave answered the door he was half expecting to see a grown man, thick framed glasses, a collared shirt, perhaps a laptop tucked under one arm and a briefcase in the other. Instead he gestured in a young man, no older than twenty, who wore no glasses and had his hair tied up into a bun."}, {"type": "sentence", "content": "The reporter removed his shoes without being asked, which pleased Dave, and added them to the small collection on the rug in the foyer. Instead of a laptop the reporter only had a composition notebook and a pen behind his ear. As the made his way into the kitchen he removed his light jacket and placed it over a chair at the table, then removed something from the coat’s inner pocket and placed it beside the bowl of fruit at the table’s center."}, {"type": "sentence", "content": "“What’s that?” asked Dave."}, {"type": "sentence", "content": "“A recorder, in case my notes aren’t too good.”"}, {"type": "sentence", "content": "Dave smiled and gave a slight chuckle. He then called out to Anne, who’d been in the other room reading."}, {"type": "sentence", "content": "“Almost finished with this chapter!” she replied."}, {"type": "sentence", "content": "“So,” said the reporter, “how do you know the magazine’s editor Mary?”"}, {"type": "sentence", "content": "“I went to school with her mother, actually bumped into her the other day at the store. I was scanning the aisle for Anne’s chips and noticed Mary had taken the last bag.” Dave smirked. “I almost got down on hands and knees to beg her for it. We got to talking, and then this all transpired.”"}, {"type": "sentence", "content": "“Well I’m excited to hear the whole story,” said the reporter."}, {"type": "sentence", "content": "Anne emerged from the living room, a huge grin on her face."}, {"type": "sentence", "content": "“You won’t believe who the culprit is,” she said to Dave. “My bookmark is a few chapters ahead of yours but you’ll have to read a bit after dinner so we can talk about it.” She turned her attention to the reporter. “Pleasure to meet you.”"}, {"type": "sentence", "content": "When they were all situated at the table, and the red light was blinking on the recorder, Dave and Anne nestled into the story of how they met."}, {"type": "sentence", "content": "“How old were we?” asked Anne. “I must’ve been twenty, you’re five years older so you were…”"}, {"type": "sentence", "content": "“Twenty-five,” continued Dave, “and our parents had been trying to set us up since we were teenagers, we’d gone to the same church you see,” he said as he pushed his face towards the recorder. “And we’d seen each other in passing, talked briefly here or there, but we’d gone to different schools.”"}, {"type": "sentence", "content": "“Whenever I was single he’d be dating someone and vice-versa. It drove our parents crazy.”"}, {"type": "sentence", "content": "“Then one day, I think I’d skipped breakfast and just grabbed something on the way out,” Dave stroked his chin and looked up to the popcorn ceiling for the memory. “I had a bag of chips I was eating outside the church. I didn’t want to bring them in so I was eating in a bit of a hurry, and it was tough because they tasted quite terrible.”"}, {"type": "sentence", "content": "“I saw him eating,” said Anne. “His face was twisted into knots after each bite, it was hysterical. I was walking in with my parents when I noticed the bag and asked him for a chip. They were my favorite…”"}, {"type": "sentence", "content": "“Salt and vinegar,” said Dave, “and she helped me finish the bag so we could go in. That was the first time we’d really spoken to each other, aside from the polite how-do-you-dos. Both our usual spots had been filled in, so we sat together and ended up going out for drinks afterwards, well, tea.”"}, {"type": "sentence", "content": "“He takes his extra sweet,” said Anne, wrapping her fingers around her husband’s wrist, “and I like mine just as nature intended.”"}, {"type": "sentence", "content": "“She likes it to taste like sewer water.” Dave threw his head back and cackled."}, {"type": "sentence", "content": "“At lease he has good taste in women,” added Anne."}, {"type": "sentence", "content": "The photographer stopped by the day after they’d told their story to the reporter. She snapped a few pictures, and that was it, she was in and out in less than ten minutes. Dave couldn’t contain himself, he felt like a celebrity, and couldn’t believe their little memory would make its way into print."}, {"type": "sentence", "content": "The magazine was bi-monthly, so they waited until July for the issue to turn up at the grocery store. Dave placed it into his cart, right alongside Anne’s chips. When he arrived home he read it aloud and watched his wife revel in the memories of their meeting. He displayed it on the coffee table, the cover becoming crinkled as he’d push it on anyone who’d visit to check out page six."}, {"type": "sentence", "content": "As the years went on, and Anne resided somewhere beyond the popcorn ceiling, he used the bright green chip clip, the one he’d always see in use in the pantry, to leave page six open, on display for everyone to see, where he could always be reminded day after day of how he’d managed to be so lucky, and the greatest breakfast he’d ever had."}]}