{"title": "6 Endings To My Personal Pandemic Movie", "data": [{"type": "sentence", "content": "We’re all living our own version of Steven Soderbergh’s movie Contagion, a 2011 thriller about a killer virus that has become a sort of new classic."}, {"type": "sentence", "content": "My personal pandemic movie started in early March. The coronavirus had spread to Europe from China and was finally in America. But I was still riding the New York City subway train to therapy. I went and saw a new production of West Side Story on Broadway. I ate a yellow cheese omelet with a side of coleslaw at a diner. I didn’t know at the time how good I had it."}, {"type": "sentence", "content": "The next part of my movie is also probably familiar to many. Empty grocery store shelves. Frantic calls to pharmacies. Closed doors. Panic attacks over the toaster. A morning phone call with terrible, world-breaking news. A test. Weeks in a room, alone, scared. A growing rage at dithering leaders too concerned with saving face than lives. We are all in a life-and-death battle with the plague. Our movies are both different and the same."}, {"type": "sentence", "content": "I humbly present six potential endings to my personal pandemic movie. It’s tentatively titled Contagion 2: DeVoravirus. These minutes are not the beginning, nor the second act, nor the climax. I am pretty sure I’m not going to write a screenplay about these strange, dark days but if I did, here are the brief scenes and montages I’d consider before typing FADE OUT. THE END. FYI: I am portrayed by Academy-Award winning actor Matt Damon in each."}, {"type": "sentence", "content": "1.I slowly open the door but the chain lock stops me. “Go away,” I whisper through the crack before shutting the door. There is silence. Then the sound of two heavy deadbolts sliding into place. Then silence, again. A Sunday morning quiet. The sound of statues weeping. The entire apartment building, silent. The hallways, the staircases, unblinking eyeballs stare through peepholes."}, {"type": "sentence", "content": "2. I kick open my door. I am ripped after months of pushups in my 500 square-foot Harlem apartment. I am wearing nothing but star-spangled short shorts. I’m also wearing an American flag like a cape. I found it in a trashcan during a 3 AM walk. I tie it around my neck and God bless. There will be more capes in this brave new world! My muscles glisten and glean. I walk outside and inhale the sunbeams. Then I start strutting down the middle of the street singing James Brown’s classic ’80s hit ‘Livin’ In America.’ It’s a soulful locomotive of an anthem about freedom and road-trippin' and rock and roll and great cities like New Orleans and Atlanta and Pittsburgh. The song is rude and jazzy and I am pumped. You may remember the song from 1985’s Rocky IV, a classic drama about an average man versus communism, Karl Marx’s enduring political theory that says sharing is nice. Anyway, America finally kicked the coronavirus’ ass the way Rocky clobbered Ivan Drago! Fuck yeah. Cars pull over for me. Construction workers stop their jackhammering. People see me from their windows and run to join my march of total awesomeness. I lead a diverse parade of human beings fueled by funk and love, truth and beauty. In Central Park, we all dance naked around a bonfire."}, {"type": "sentence", "content": "3. I wear a mask and patiently stand in line. The mask is an Amazon Prime respirator. You can buy them by the dozens now, along with Super Soaker-sized water guns filled with hand sanitizer. Capitalism didn’t break, it just mutated, slowly. When I get to the head of the line I show off a new ID card with my proof of vaccination. I am allowed in by security guards wearing sophisticated respirators and I get into another line where I will eventually order a burrito bowl with chicken, pinto beans, pico de gallo, and extra guacamole."}, {"type": "sentence", "content": "4.“I’m too old to be drafted,” I shout into the phone. It turns out, I’m not. The war with China is going as well as the initial pandemic response. In the future there are three choices: fight the reds or contract the virus during one of America’s now famous ‘freedom outbreaks.’ Oh, the third choice is hard labor at a coronavirus colony. Our elected officials thought the nation would forgive and forget their shockingly inept handling of the plague if they started a land war in Asia. They were wrong, again. I tell the recruiter that I’m middle-aged and chubby and have high blood pressure and he told me to cheer up, there’s a Pizza Hut on the transport ship. Uncle Sam needs new meat, even if it’s past the expiration date. I am then told to report to New York’s Javits Center for immediate processing or face exile to Florida."}, {"type": "sentence", "content": "5.I sit on a park bench by a pond. The sun is out. Normally, I sit in the dark in front of three screens: to my left is an endless scroll of updates and information from social media, and to the right real-time readouts of my vital signs: temperature, pulse, respiration rate, and blood pressure. The middle screen is playing Will Smith’s 2007 classic I Am Legend, about a war between nocturnal vampires and the last man on Earth, on a loop. I sometimes feel like the last man on earth but I can hear other last men shuffling around in their rooms above and below me, and to both my sides. But today is special. There is a breeze. I feed pigeons crackers I pick up from a local grocery store that is heavily subsidized by the government. I call them my “Soylent Greenies” but no one gets the reference. I am allowed to sit at this park once every three months for one hour. When I am done I put the bulky suit back on and head underground."}, {"type": "sentence", "content": "6. We finally get together. It has been a couple of years, but no more. This is not the funeral. That will happen soon enough. He waited this long, he can wait a little longer. The table is full of food: pasta and brisket and fresh rye bread, his recipe or as close as we could get it. A knife is shared. The butter is soft. An old man tells a corny joke. A toddler runs on new legs. There is a brief talk of vaccines and drug cocktails, but we’ve all had enough of that conversation. I say ‘hello’ to someone I haven’t seen in a long time. We hug and move on to other friends. Everyone is greyer, more wrinkled, a truth everyone points out. We talk about football and movie theaters and for a few hours, we are not afraid. There is warmth and light and those we’ve lost watch us from outside through the window and they smile because we’re safe and happy for now and so, satisfied, they put their hands in pockets, and walk into the darkness, the glowing window growing smaller and smaller behind them until the only light are the stars underfoot, a midnight stroll to a peaceful place and many, many years from now I’ll walk that same twinkling path and they’ll be waiting for me. All of them. And we will hug."}]}