{"title": "Why Stadia is More Important to Google than You Think", "data": [{"type": "image", "content": "https://miro.medium.com/max/10266/0*vWGi3ilo2DlS4zh0"}, {"type": "sentence", "content": "In case you are wondering: yes, the thumbnail is correct! Let me explain why you should look at Stadia as a Netflix competitor."}, {"type": "subtitle", "content": "Google’s Cloud challenge"}, {"type": "sentence", "content": "Creating, maintaining and growing a public cloud business is an enormous investment, but it can be worth it if you believe (like I do) that public cloud infrastructures will be the key element for any future of computing."}, {"type": "sentence", "content": "Google has been investing in GCP since 2008, they started after AWS and were never able to catch up in global market share. AWS leveraged the startups and the SMBs to gain immense popularity and traction, Microsoft leveraged their relationship with Enterprise and the power of their “lock-in” towards CIOs to enter the public cloud business. Google's cloud market share is about 5%."}, {"type": "image", "content": "https://miro.medium.com/max/2048/1*mwPzrPtT09u7sMhjK8G2-w.png"}, {"type": "sentence", "content": "A very simplified way to frame the current public cloud market is that AWS started from startups & SMBs, then raised the target bar towards enterprises, while MS is doing the opposite, starting from enterprises and trying to scale down. Google? Google has been squeezed in the middle with less adoption than the other 2 vendors and less traction on both small and big companies. Google has to find a way to drive hordes of developers to their service and their best chance is to bet on a different, disruptive approach because the “standard businesses” have been already taken by either AWS or MS."}, {"type": "subtitle", "content": "Videogames business model has evolved over time"}, {"type": "image", "content": "https://miro.medium.com/max/12000/0*euxv2YmCDOrOahY6"}, {"type": "sentence", "content": "Let me switch context for a while. Videogames used to be something you bought once and you could play them forever. Piracy was a problem back then and complex copy-protection schemes were engineered to try to reduce the problem but it was not very effective and it was also expensive to implement, adding costs to an already very expensive development cycle."}, {"type": "sentence", "content": "The first game that I remember implemented a different approach was Quake from ID Software. Quake forced users to activate the game online, by registering a product code and users needed to get online to be able to validate that code. It was not good enough at the time, because ID Software couldn’t rely on the fact that users would have Internet connection whenever they wanted to play: the Internet was a very scarcely available resource, almost luxury in some countries."}, {"type": "sentence", "content": "As the Internet became widely distributed more companies relied on “online” authorization to let the players access their game. Don’t be fooled, this was not to increase game appeal or accessibility, it was to reduce piracy and to increase revenues."}, {"type": "sentence", "content": "As the requirement of Internet connection became more common, new business models became viable. World Of Warcraft is a very well known example of a subscription-based game: players would pay every single month to access their game, and it was MASSIVE. WoW lasted more than 10 years and had way more than 10 million players in its peak seasons, every single one of them paying about 30$ each month (360$/yr). Do the math."}, {"type": "sentence", "content": "Today, mobile games and modern desktop games implement a similar strategy, it’s not a mandatory monthly payment anymore but a series of “optional” microtransactions that you are, more often than not, forced to buy to stay competitive. So it’s a subscription-based model masked as a free-to-play model. 30% of gamers pay for subscriptions (source Gamasutra)."}, {"type": "image", "content": "https://miro.medium.com/max/890/1*zOaoMn54homWupYnrd5JCg.gif"}, {"type": "sentence", "content": "Supercell’s Clash of Clans, a very popular mobile game has been generating over 1M$ revenues PER DAY for years (source gamerevolution)."}, {"type": "subtitle", "content": "Modern games are expensive"}, {"type": "sentence", "content": "The catch with modern popular games is that in order to serve that amount of users and the low latency expected, companies must invest an immense amount of resources in infrastructure, often cloud infrastructure. The good news is that the “server” part of the game is the same (or almost the same), regardless of the different client platforms accessing it. The “client” part of the game, however, is usually totally different from platform to platform and it requires to be heavily re-engineered to be available on multiple smartphones, consoles or desktop operating systems. This cost is a mandatory cost to increase market size."}, {"type": "sentence", "content": "I’m pretty sure you understand where this is going…"}, {"type": "subtitle", "content": "Stadia reduces game development costs"}, {"type": "sentence", "content": "Stadia is a streaming service that allows players to play a game without having a client platform. It’s basically a controller that interacts directly with the game server. There is no client, no android, ios, ps4, ps5, Xbox, pc version of the game… it can be accessed by “any” platform as long as you are part of the service."}, {"type": "sentence", "content": "There’s also the increased accessibility: players won’t need to upgrade their hardware to access the best and the greatest visual and sound effects, because it will all be just based on bandwidth alone."}, {"type": "sentence", "content": "Stadia brings game development studios a way to develop the game just once and lets players access it everywhere, as well as a way to completely stop piracy and decide the visual/audio quality based on the publisher’s budget for the server architecture, not forcing customers to upgrade their systems."}, {"type": "subtitle", "content": "Why Stadia can be the flywheel to drive GCP adoption"}, {"type": "sentence", "content": "Google has YouTube, a 15B$/yr business, twice as much as Google Cloud (source Alphabet earnings report). YouTube 20 million paying users are a very interesting market for game publishers."}, {"type": "sentence", "content": "Sounds too good to be true? Think harder, it is even better than this. Multiplayer games will not have lag since everyone will be playing on servers, lag can be “easily” controlled. Game developers and publishers can push systems to their limits without caring about “porting”, piracy, and lag. At the same time, they will have the widest gaming market ever created, because every single person with a good internet connection will be able to play, without having to pay an upfront fee to buy hardware that will become obsolete in 2 years."}, {"type": "sentence", "content": "This power Google will have can be used to force publishers to accept a different business model: Stadia could apply the same strategy Netflix used to disrupt movie industries."}, {"type": "subtitle", "content": "Survival of the fittest"}, {"type": "sentence", "content": "Nintendo (consoles) and Valve (Steam) will be forced to reinvent themselves or perish because their businesses are not sustainable once a StadiaTube is out the."}, {"type": "sentence", "content": "Nvidia (hardware) and Sony (consoles) are trying to compete with Google with their own services but they are both late and lack the distribution channel (Google has YouTube, Amazon has PrimeVideo)."}, {"type": "sentence", "content": "Microsoft is the biggest threat to Google’s Stadia success because they have the infrastructure and they already are in the gaming industry (with Xbox), the Xcloud project has all the prerequisites to win, but it lacks the distribution channel."}, {"type": "sentence", "content": "Amazon has the technology, the distribution and also a strong presence in the gaming community through Twitch, but it didn’t show plans to participate in the game-streaming market, yet. My guess is that they will first try to win the Apple-Netflix-Disney battle via better content and market share (Amazon Prime)."}, {"type": "sentence", "content": "Will Google be able to leverage this advantage and find new oxygen for its Cloud & Services business?"}]}