{
  "title": "Finding the Right Role in Tech",
  "data": [
    {
      "type": "sentence",
      "content": "This post is not meant for those looking to enter engineering or people management roles."
    },
    {
      "type": "image",
      "content": "https://miro.medium.com/max/5376/1*nJMz9q0aD9vCtcDFKz74eg.png"
    },
    {
      "type": "sentence",
      "content": "When you click into the “open roles” tab on a tech company job page, you may at first be overwhelmed by the sheer number of niche positions. Which one should you apply to? Or should you simply apply to all of them and see which ones extend an interview? Maybe you somehow know you want to go into, let’s say, product. But is this the right role for you?"
    },
    {
      "type": "sentence",
      "content": "Over the past few years, I worked across both the business and product sides of tech, which gave me a holistic view of how these teams interact with each other and what the benefits are for each. I’ve had countless phone calls with classmates, colleagues, friends and acquaintances who have reached out asking about which role they should choose or whether they would enjoy working on a certain team."
    },
    {
      "type": "sentence",
      "content": "It’s stressful thinking about what job to pursue — who wants to get stuck in role they don’t like?"
    },
    {
      "type": "sentence",
      "content": "These conversations, as well as my personal feedback from past managers and mentors, sparked me to share my insights such that others can benefit as well."
    },
    {
      "type": "sentence",
      "content": "When I started my senior year in college, I was constantly irritated thinking about which roles to apply to. Most of my classmates flocked to finance and consulting jobs, which never really appealed to me. The e-commerce venture I had started in college renewed my entrepreneurial spirit, and I was determined to get a job in tech. Since many of my peers didn’t share the same sentiment, there were few people I could go to for advice."
    },
    {
      "type": "sentence",
      "content": "I went into the industry blind. At that time, I optimized for acquiring as many diverse skillsets as possible to start my own venture again (which I would realize later is not my goal)."
    },
    {
      "type": "sentence",
      "content": "Over four years, I would work as a data scientist, a product manager, a business strategy associate, and a growth manager (on both the product and marketing sides). I joined two companies pre-IPO (Dropbox and Lyft) and witnessed both companies change after the public offering. I’ve taken on a new role almost every year, which is not very common within tech, and it taught me a lot about the functions of each role, as well as its merits and limitations."
    },
    { "type": "subtitle", "content": "Cost / Benefit of Roles" },
    {
      "type": "sentence",
      "content": "Keep in mind that roles are unique to that company, and each company is different. For example, a growth position at Lyft may not operate the same as a growth position at Facebook, and a growth position at a startup is like a foreign planet compared to the other two."
    },
    {
      "type": "sentence",
      "content": "Before you decide to take on a role, it’s important to ask the hiring manager which projects and/or products you would be held responsible for. What you own inside a company will vastly influence your experience."
    },
    {
      "type": "sentence",
      "content": "Here I’ve summarized the high-level merits, limitations, and skills gained for four roles across business and product. It’s a reflection of my personal take on the roles, and hence, you should also form your own judgement based on your preferences."
    },
    { "type": "subtitle", "content": "Business Strategy & Ops" },
    { "type": "subtitle", "content": "Product Management" },
    { "type": "subtitle", "content": "Data Science" },
    { "type": "subtitle", "content": "Growth Product" },
    { "type": "subtitle", "content": "Growth Marketing" },
    { "type": "subtitle", "content": "Key takeaways from my experience" },
    { "type": "subtitle", "content": "Evaluating the company" },
    { "type": "subtitle", "content": "So how do you approach role-changing?" },
    {
      "type": "sentence",
      "content": "Finding the best fit may take time, and it’s okay to engage in some trial and error. Even after four roles (or five, if you count my time working on economics research within tech), I am still on a quest to find the role that I want to dedicate the next few decades towards. But so far, I’m enjoying the learning journey across different teams and am very grateful for the opportunity to do so."
    },
    {
      "type": "sentence",
      "content": "There is no wrong role — every role will teach you something new, and as cliche as this sounds, it’s the learning process (about the job and yourself) that really matters. Depending on who you are, here’s some recommendations on how to approach roles:"
    },
    { "type": "subtitle", "content": "If you are…" },
    {
      "type": "sentence",
      "content": "a) A college grad looking to enter tech"
    },
    {
      "type": "subtitle",
      "content": "b) Looking to switch from another industry into tech"
    },
    {
      "type": "sentence",
      "content": "Here are some examples of what my colleagues in other industries have switched from:"
    },
    { "type": "subtitle", "content": "c) Looking to switch roles within tech" },
    {
      "type": "sentence",
      "content": "I’m only speaking to the roles I’ve personally worked in. There are plenty of other roles within tech that not covered in this post (e.g., FP&A, product design, product marketing, user research, partnerships, and so forth)."
    },
    {
      "type": "sentence",
      "content": "Good luck, and hopefully this adds a bit of color to your role search!"
    },
    {
      "type": "sentence",
      "content": "For more posts like this, you can subscribe to me on substack or my website and follow me on twitter."
    }
  ]
}
