{"title": "Stories That Have Little to Do With Life as We Know It", "data": [{"type": "image", "content": "https://miro.medium.com/max/4180/1*lf4ZNplK3WcEGzH6HGO4jQ.jpeg"}, {"type": "sentence", "content": "At Human Parts, we spend our days scouring the Medium platform for essays and perspectives we think our audience would love. Along the way, we stumble upon countless stories that surprise us — proof of the internet’s ability to deliver what we didn’t know we needed. Each week, we’ll share a few of our favorites, along with recommended reading from across Medium, in a roundup we call ‘Reading Roulette.’ If you come across anything we missed, let us know in the responses!"}, {"type": "sentence", "content": "While we tend to have a more generous view of the much-maligned Gemini, we nonetheless applaud Molly Mulshine’s thorough and entertaining study in astrological archetypes, as portrayed on the AMC hit series Mad Men."}, {"type": "sentence", "content": "Quarantine homework: Watch all seven seasons of Mad Men, paying particular attention to your sign brethren. Leave a comment below detailing any psychological breakthroughs experienced along the way."}, {"type": "sentence", "content": "Is the news giving you whiplash? Why not tune into something more timeless, like this bizarre tale of a Norwegian black metal singer whose skull sold for thousands in 2018 (just one of many odd circumstances surrounding his almost 30-year-old death)? Erica Ciko Campbell tells the story behind the $3,500 price tag."}, {"type": "sentence", "content": "Quarantine homework: Read the fairly epic Wikipedia entry on the origins of the Norwegian black metal scene."}, {"type": "sentence", "content": "Extra credit: Listen to Last Podcast on the Left’s three-part series for an explicit and well-researched deep dive into the tragedy-laced Norwegian black metal scene."}, {"type": "sentence", "content": "Modern First-Person Shooters are such a cultural staple in America that it’s hard to remember the genre really rose to prominence in the years following 9/11, often invoking the wars in Afghanistan and Iraq as they played out in real time. It’s interesting to note this now, as the cult of Animal Crossing snowballs in strength and influence. What does it say about us? Maybe: All we really want in this moment is to fish and collect firewood. To move to an isolated island, one with no military and no government. We wanna pick fruit, and cook meals, and do all the simple, quiet things that were always within our power to do — the things we took for granted while we were playing war."}, {"type": "sentence", "content": "In this essay, Assad Abderemane explores how virtual meal prep in Breath of the Wild gives him comfort and hope for the analog future."}, {"type": "sentence", "content": "Quarantine homework: Search your pre-Corona life for a person, hobby, idea, or responsibility you regret neglecting. Reintroduce yourself."}, {"type": "subtitle", "content": "Highlights from Human Parts"}, {"type": "sentence", "content": "Stories you may have missed this week"}, {"type": "subtitle", "content": "Selections from across Medium"}, {"type": "sentence", "content": "Our favorite stories from Medium’s flagship publications"}, {"type": "sentence", "content": "Previous issues of Reading Roulette:"}]}