{"title": "Master the French Omelet the Julia Child Way", "data": [{"type": "image", "content": "https://miro.medium.com/max/6018/1*3Amn7pmgVKGBRQ764Fb96g.jpeg"}, {"type": "sentence", "content": "This time last year, we were making omelets in Julia Child’s kitchen."}, {"type": "sentence", "content": "“Swirl, jerk, flip!” we chanted the three steps of Child’s 20-second omelet technique, inhaling the aroma of melting butter in the kitchen of the cook’s former Provençal vacation home."}, {"type": "sentence", "content": "“It’s ready. Flip!” our instructor prompted as my brightly yolked eggs coagulated before me. I held the handle of the piping-hot pan with my palm facing up, as Child instructs in The French Chef, and maneuvered my omelet onto a warm plate."}, {"type": "sentence", "content": "In La Pitchoune, the name of her cottage tucked in the peaceful hills of Châteauneuf de Grasse in the south of France, Child cooked and shared meals with M.F.K. Fisher, James Beard, and other figures who helped introduce French cuisine to American home cooks in the 1970s."}, {"type": "sentence", "content": "Now affectionately called La Peetch, the house is available as a vacation rental, wedding venue, or — as my mom, grandmother, and I enjoyed it last April — the Courageous Cooking School, where up to six guests can spend a week living in Child’s enchanting former home, cooking anything from bouillabaisse to boeuf Bourguignon in a relaxed, recipe- and rules-free setting. There is also plenty of time to enjoy the pool, garden, and neighboring donkey with French wine, cheese, and a good book in hand."}, {"type": "sentence", "content": "For us, day one of the Courageous Cooking School started with omelets. Before we entered the kitchen, we had a lecture of sorts in the living room: the omelet episode of Child’s cooking show, The French Chef."}, {"type": "sentence", "content": "“How about dinner in half a minute?” Child practically sings, a pan of eggs bubbling before her. She cheerfully describes the standard omelet as flat, French, and “very lovely and tender and soft.”"}, {"type": "sentence", "content": "From the time the eggs hit the hot buttered pan, it really does take only 20 seconds to cook."}, {"type": "sentence", "content": "The dish is simple in composition; the only ingredients are butter, two to three eggs (any more, and the omelet takes longer to cook and becomes leathery), salt, and pepper, plus a teaspoon of water whisked into the eggs. (Child doesn’t say why, but it’s likely to create steam to make the eggs fluffier.)"}, {"type": "sentence", "content": "The secret is really in the choreography of the swirl, jerk, and flip. To master the three-step movement, you need confidence, speed, and the right pan, which must have a handle. A good nonstick, preferably one with sloped, two-inch-high sides and a sevenish-inch diameter, does the trick."}, {"type": "sentence", "content": "But this will all be for naught if the pan is cold. For the fluffiest eggs, Child says to place the pan over maximum heat, then add the butter, which should sizzle and foam right away. When there’s an even coating of melted butter and the bubbling has subsided, the pan is hot enough for the eggs."}, {"type": "sentence", "content": "Then it’s time for the movement. The swirl is easy enough; you simply maneuver the pan in clockwise circles on the burner."}, {"type": "sentence", "content": "The jerk requires a bit more grit."}, {"type": "sentence", "content": "“Don’t be shy!” the instructor encouraged as I timidly swung my elbow back and forth in Child’s kitchen, the eggs unmoving. With only 20 seconds to cook the omelet, there was no room for hesitation."}, {"type": "sentence", "content": "Trying to embody Child’s confidence, I took a deep breath and yanked my elbow backward, willing the eggs to fold onto themselves like hers."}, {"type": "sentence", "content": "Success."}, {"type": "sentence", "content": "For an omelet that is baveuse, or moist and soft, you should flip it onto the plate while the topside still looks a bit runny. This will result in what Child calls “lightly coagulated eggs with a little cloak around, holding them together.” Hold the panhandle with the palm of your dominant hand facing up, then turn the pan to invert the omelet onto a plate."}, {"type": "sentence", "content": "Due to the delay caused by my initial lack of jerking valor, my omelet was a bit past baveuse by the time I flipped it. But brushed with a pat of butter for shine, garnished generously with chopped parsley, and arranged on a lime-green plate, it could have passed for Child’s from afar. And it tasted pretty darn good."}, {"type": "image", "content": "https://miro.medium.com/max/6048/1*RBRpYNTSWdPs3wzWNp6BNw.jpeg"}, {"type": "sentence", "content": "When we Courageous Cooking School students parted ways after our week at La Peetch, we practiced 20-second omelets at home, sending each other photos of our progress."}, {"type": "sentence", "content": "One of us tried a fines herbes version with fresh chives, tarragon, and chervil beaten into the eggs. Another made Child’s hearty version with cooked bacon, potatoes, and scallions, sprinkled onto the omelet between the swirling and jerking steps."}, {"type": "sentence", "content": "A year later, I find myself living alone during the coronavirus lockdown. With plenty of free time for cooking failures and successes—and no roommates to listen to the unbearable scratching sound of a pan swirling on the stove—it feels like the perfect opportunity to make a 20-second omelet."}, {"type": "sentence", "content": "Child offers plenty of solutions, of course, if you falter on your first few tries. You can use two forks (or your hands) to groom any messy bits on the plate. If you have trouble swirling and jerking, you can practice with uncooked beans."}, {"type": "sentence", "content": "And if you’re still not satisfied, you can always try again tomorrow. It’ll only take two eggs and 20 seconds of your time."}, {"type": "sentence", "content": "Makes: 1 servingTime: 20 seconds"}, {"type": "subtitle", "content": "Ingredients"}, {"type": "subtitle", "content": "Instructions"}, {"type": "sentence", "content": "Whisk eggs, salt, pepper, and water until the yolks and whites are just combined; do not over-beat."}, {"type": "sentence", "content": "Heat a nonstick pan over high heat. Add the butter, which should sizzle immediately, and move the pan around to coat. When butter is completely melted and all bubbling and foaming have subsided, add the eggs."}, {"type": "sentence", "content": "The eggs should begin to bubble right away. Allow them to set for about 5 seconds, then swirl the pan clockwise, keeping the pan in contact with the heat. Continue swirling until the eggs begin to coagulate into a flat circle that lifts from the pan, about 3 seconds."}, {"type": "sentence", "content": "Jerk the pan toward you a few times until the omelet folds over itself, becoming about a third of its original diameter."}, {"type": "sentence", "content": "Rotate the pan 90 degrees, holding the handle with your dominant hand with your palm facing up and your thumb facing out. Turn the pan over (with the edge of the pan touching the plate) to fold the omelet onto a plate so that the smooth bottom side of the omelet is facing up. Brush with extra butter, if desired, and garnish with parsley. Serve immediately."}]}