{"title": "Trying to write during lockdown? Here are 6 practical tips", "data": [{"type": "image", "content": "https://miro.medium.com/max/2160/1*2cJtpRDxsXtwY5ZpSCPHfA.jpeg"}, {"type": "sentence", "content": "As most readers of this blog would know, a few years ago, I took a sabbatical from my job to learn screenwriting at the New York Film Academy."}, {"type": "sentence", "content": "While I struggled to find my way back into the corporate world for the next 18 months, this writing sabbatical opened doors for me as a columnist for publications such as Mint, Maxim and FilterCopy. And then, after 3 failed screenplays and a sixty-thousand manuscript that’s still not impressed my wife, Penguin India offered me a contract for my first short story collection titled ‘Buffering Love’."}, {"type": "sentence", "content": "I hadn’t set out to write short stories but ended up with a book that I am (reasonably) proud of and now have completed another short story collection that I am hoping finds favor with a publisher."}, {"type": "sentence", "content": "But initially, what I really wanted to write was a screenplay that gets made into a film and one that people hopefully remember. So while that book was not the end-goal, that journey was immensely cathartic and fulfilling. I also learnt along the way that principles of great storytelling do not change with the medium. Fundamentally, the audience must be hooked to your story. Every page must turn with intent and every end must be gratifying."}, {"type": "sentence", "content": "Given the context of the current lockdown in India and interest exhibited by a few of my friends to experiment with writing, this is as good a time as any for me to share some of the practical tips around writing that helped me transition from a columnist to an author. By no means exhaustive, this is a list of things I follow every time I start on a new writing project."}, {"type": "sentence", "content": "So now, without much ado."}, {"type": "subtitle", "content": "1. Showing up on the writing table is as important as churning the pages"}, {"type": "sentence", "content": "It was Woody Allen who said that ‘80% of success is showing up.’ For a straight 8 months during my sabbatical, I woke up every morning, got dressed and sat at the writing table for a specified period of time. Some days, I gave it 6 hours and some days 2 hours."}, {"type": "sentence", "content": "A lot of people emphasize on the big creative idea/breakthrough for someone to write well. If there is one myth around writing that I’d like to bust, it is this. Yes, the idea is important but before that comes the discipline. Earmark a time (or times) during the week that you will write and then show up on the writing table. You’ll be amazed with what happens."}, {"type": "subtitle", "content": "2. Five hundred words is a good target"}, {"type": "sentence", "content": "I’ve often heard from people, that they want to write more. To be blunt, it doesn’t mean anything without a quantifiable goal."}, {"type": "sentence", "content": "Every time I sat to write during those 8 months I mentioned above, I wrote at least 2,000 words. That was when I had no job. Now, with an intense job that occupies me every weekday and sometimes spills over on weekends, I have dropped my goal to 500 words anytime I sit to write."}, {"type": "sentence", "content": "This quantification helps because discipline combined with 500 words can eventually lead to something bigger."}, {"type": "sentence", "content": "A back of the envelope calculation of five hundred words a day for 20 days would land at a substantial 30,000 words in three months. That’s a manuscript longer than Of Mice and Men, The Old Man and the Sea and Breakfast at Tiffanys."}, {"type": "subtitle", "content": "3. Fall in love with editing your own words"}, {"type": "sentence", "content": "One of the first pieces of advice that Joyce Carol Oates gives in her Masterclass is that one must power through the first draft of a project the soonest possible. Ishiguro, when asked about his secret to winning a Nobel Prize, said that when he writes he allows himself to write bad pages."}, {"type": "sentence", "content": "The first draft, you can take it from me, is s**t."}, {"type": "sentence", "content": "Give yourself time to go over it again, and again and again and keep cutting the flab. More importantly, think about the characters and conflicts that can be enhanced. Think about the different ways it could end. This might mean sometimes a new direction altogether. Allow yourself to be open about it."}, {"type": "sentence", "content": "Like my screenwriting teacher at NYFA used to say, ‘Write like a King. Edit like a Nazi’."}, {"type": "subtitle", "content": "4. To each his own pace"}, {"type": "sentence", "content": "There is no right pace for creative output and there is no point fretting about being slow. I often hear aspiring writers say that their pace is slow. There is nothing wrong with it. Do you have the discipline? Are you making your output quantifiable in some way? Can you go back and ruthlessly edit and kill your darlings if you need to? If the answer to all of that is yes, pace can go take a hike."}, {"type": "sentence", "content": "Of course, studio and streaming commissioning folks and publishers have their own targets by which they need you to get back with revised drafts. But like everything else in life, you will have a say in some cases and in some cases you won’t. Largely, it’s better to focus on your story than on the pace at which you will finish the story."}, {"type": "subtitle", "content": "5. Iteration is a friend. Don’t resist it"}, {"type": "sentence", "content": "We all know what a brilliant film, Up (Pixar, 2009) was."}, {"type": "sentence", "content": "Now, here’s the first synopsis of Up from Ed Catmull’s book Creativity Inc."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*VxJJPX7Hwsi-1Yt3b2l6XA.jpeg"}, {"type": "sentence", "content": "For those here who have seen the final film, can you imagine this is where Up started? Catmull goes on to describe in detail the different versions that were iterated upon. He says it took years to revise upon changes one after the other."}, {"type": "sentence", "content": "To cut a long story short, as you go about your third and fourth drafts and take inputs from your trusted inner circle of friends and family, a lot of fresh ideas will come to mind. Some will mean re-arranging plot, characters and in some cases even the ending. Give these a fair chance. If a film like Up could begin at a place which was so vastly different than what eventually won two Oscars, should you be really worried changing things? That question answers itself."}, {"type": "subtitle", "content": "6. Read"}, {"type": "sentence", "content": "This is a tip I struggle with myself and with good reason."}, {"type": "sentence", "content": "In the streaming era with over a hundred apps designed to let you sit back and make an addict out of you to watch videos, it’s tempting AF to not read. But reading good books gives you better return on your time in improving your writing than watching stuff."}, {"type": "sentence", "content": "There is no exception to this. The world’s best screenwriters, novelists, storytellers, columnists read a lot. Don’t be the person who thinks just watching films and series will help you write better."}, {"type": "sentence", "content": "Here’s Stephen King’s final advice in his seminal book on writing also called On Writing. ‘Write a lot. Read a lot.’"}, {"type": "sentence", "content": "So that’s that for now. I hope you find these useful."}, {"type": "sentence", "content": "Are there other tips that have worked for you? Let me know in the comments. I’d love to hear."}]}