{"title": "Skyrim Has Problems On PS4 Pro", "data": [{"type": "sentence", "content": "When Skyrim first launched in 2011, it became an overnight phenomenon. Like it or not, it’s one of the seminal examples of the fantasy RPG. I played it to death across the Xbox 360, PC, and PS3, racking up hundreds of hours of thrilling viking dragon adventures and tens of hours of hitting zombies in caves with various axes."}, {"type": "sentence", "content": "A current generation re-release was inevitable, considering Skyrim’s rampant sales success, and sure enough the game launched on PS4, Xbox One, and PC in 2016 in a new “Special Edition.” At the time, both consoles ran the game at a rock solid 30 frames per second in standard HD resolutions, and brought along new volumetric lighting inherited from Fallout 4, new textures and materials, and newly enhanced shadows and visual effects."}, {"type": "sentence", "content": "The PS4 release had some obvious sound bugs, though. The surround sound mix and channel placement wasn’t right for any sound effect in the game, most notably voices. They sounded fine if they were in front of you, but the second a character’s voice panned out of the center channel, it became omnipresent in all the other speakers, as if they were a mythical god shouting at you from all directions."}, {"type": "sentence", "content": "Any sound in the game that’s made up of multiple sequential samples had its ending deleted, too. This meant that when a dragon stopped breathing fire, there was no flourish or smoke noise at the end of the sound, just a sudden awkward cut. Similarly, every single spell your character can cast awkwardly cut off in the middle of playing its sound, instead of finishing the full effect."}, {"type": "sentence", "content": "These might not seem like outright deal breakers, but they were immediate and annoying bugs to anyone that had played the game even a little bit before. A quick Google search turns up countless threads like this one about these very issues, dating all the way back to the launch of the game. I hoped for a quick fix. Sometimes Bethesda promised vaguely to look into it, other times the reports were met with silence."}, {"type": "sentence", "content": "That silence was a big hint about the further PS4 Pro mess that was coming."}, {"type": "sentence", "content": "In 2017 and 2018, when the PS4 Pro and Xbox One X launched respectively, Skyrim Special Edition was one of the few older releases to receive an enhancement patch to take advantage of the new hardware. Both upgraded consoles run the game at a full 4K resolution, and the new art assets look as good as they do on a high- end PC."}, {"type": "sentence", "content": "Unfortunately, when running the game at 4K, the PS4 Pro can almost never sustain a solid frame rate. The game runs well enough inside smaller rooms, but any time you’re outside or in combat, it regularly stutters and lags. It feels deeply unsatisfying and hampers controller feedback, similar to the recent issues with Borderlands 3. It’s constantly noticeable since you’ll spend about 70 percent of your possibly hundreds of hours in the game engaged in the sorts of activities that tank the performance."}, {"type": "sentence", "content": "In a revelation that may not surprise the long-time Bethesda fans out there, the sound bugs mentioned above were never fixed. So, if you play this classic game on PS4 Pro, you’ll witness constantly lagging performance and hear sound that doesn’t work correctly. Both of the Xbox One consoles and even the Switch run the game more consistently, and sound correct. The issues on PS4 Pro are simply inexcusable."}, {"type": "sentence", "content": "Bethesda has had almost four years and numerous patch opportunities to fix up the PS4 version of Skyrim, but has instead used its regular updates to implement new microtransactions through their Creation Club. Now that the company is focused on updating Fallout 76 and working on two new large single player games, I doubt that they will ever get around to fixing this older release."}, {"type": "sentence", "content": "It’s a shame, because the Pro’s performance issue could be quickly fixed by slightly lowering the resolution, or implementing the dynamic scaling from the Switch version. The sound bugs don’t appear anywhere else so they shouldn’t be too hard to isolate, either."}, {"type": "sentence", "content": "Skyrim has been a perfect way for me to fool my brain into thinking I’m outside during the current stay-at-home orders. But while its visuals, design, and general scope represent Bethesda at their finest… the lingering obvious issues and sad performance on PS4 Pro represent the company at its worst. Every Bethesda fan has to swallow their pride and accept this awkward compromise of ambitions and technical muck every time they release a new game, but I hope that some day we no longer have to make excuses in order to enjoy their games."}]}