{"title": "A Chronicle of How I Escaped the Coronavirus", "data": [{"type": "image", "content": "https://miro.medium.com/max/10368/1*slKv63fq8AfCwq5gmtCbnw.jpeg"}, {"type": "sentence", "content": "Day 1: I have made the difficult decision to move to a deserted island in order to escape the novel coronavirus. The natives here, though friendly, are obsessed with buying, selling, and trading. They will pay island currency for anything; fruit, rocks, even grass plucked from right outside their own doors. Through a series of bizarre, tedious transactions, I managed to trade in my tent for a small, shoddily constructed house without spending a single cent. It felt dishonest, but everyone exchanges their principles for a little comfort sometimes."}, {"type": "sentence", "content": "In addition to being die-hard capitalists, all the residents of this island are talking animals. Indeed, that is why I selected this particular island to escape to. So far as I know, talking animals cannot get the novel coronavirus. Dating seems impossible for now. Otherwise, this island is the best life I can ask for. The talking animals are friendly. I am full. I am safe. Nothing can harm me."}, {"type": "sentence", "content": "Day 4: Built a bonfire. Listened to some avant garde jazz on a cheap, baby-blue radio I bought with a bag of island currency, which I got from selling moths to some raccoon entrepreneurs. Had a nice time."}, {"type": "sentence", "content": "Day 6: Received a message in a bottle that simply said “Beware!” Also in the bottle was a news article about a non-talking tiger in the Bronx Zoo who tested positive for the novel coronavirus. I didn’t even know tigers could read. Gladys, a talking hippo who recently settled on my island, assured me that talking animals cannot get the virus. So far, I do not know of any non-talking tigers here, but if I see one, I plan to keep my distance."}, {"type": "sentence", "content": "Day 10: Just learned that the “novel” coronavirus has nothing to do with novels at all. I did not bring any books, not even the ones on the list I made especially for deserted islands. I could have been reading this whole time. At least I have peach-picking, fishing, and bug-collecting to occupy my days."}, {"type": "sentence", "content": "Day 11: It’s official: Barkley, a talking badger, has been diagnosed with COVID-19. Isolation measures have been imposed, something I never expected here on this deserted island. God knows when we’ll get the supplies we’ll need. I called the rescue service. No answer."}, {"type": "sentence", "content": "The talking raccoon who runs the supply shop says he can build us a 20-bed hospital if we bring him 100 pieces of softwood, 200 pieces of hardwood, and 300 gold nuggets. This is impossible, and the son of a bitch knows it. Last week, in a peach-induced haze, I smashed all the rocks on the island so he could have his precious corner store. He gave us a DIY recipe for ventilators, but those raw materials, too, are in short supply; they require 100 iron nuggets each and the helium from balloons we sometimes see flying overhead. I have not yet figured out how to catch the balloons. Do ventilators even work on badgers?"}, {"type": "sentence", "content": "Day 16: I have started a postcard correspondence with Agnes, who lives on the other side of the island. She says the kinds of things you’d expect from a talking pig. “I’m so lonely, snuffle, I leave antique chairs and lava lamps on the sidewalk for my friends, snuffle, but I yearn for true connection, for the warmth of contact, for the touch of a hand on the small of my back, snuffle.” I see her out gathering shells every morning through my window. After a few fermented peaches, she becomes considerably less unattractive."}, {"type": "sentence", "content": "Day 19: Moved an inflatable couch from the left side of my house to the right side. Moved an electric guitar from the right side of the house to the left side. Put some succulents on a table I made out of tree branches. Boxed up three thousand cherry blossoms I gathered for use as toilet tissue. Moved an inflatable couch from the right side of the house back to the left side. Took the succulents off the table and stuffed them in my pocket. Sat in a chair."}, {"type": "sentence", "content": "Day 22: Two little raccoons came to the house today, looking for payment owed the big raccoon. I pretended not to be home. How am I supposed to earn income when I’m supposed to be social distancing? Come to think of it, how am I supposed to be social distancing on a tiny island at all? Every time I walk outside there’s a fucking walrus or something trying to get my attention. We’re all about to die and they want to talk about exercising, or scrapbooking, or some bullshit. I spent so much time picking fruit, getting stung by wasps, selling fruit, collecting wood, getting stung by more wasps, and for what? To line their tiny pockets? If I weren’t so afraid of getting near them, I’d punch them in their masked faces. (I don’t mean to perpetuate raccoon stereotypes; they are actually wearing masks, per island rules.)"}, {"type": "sentence", "content": "Day 24: Crucian carp are becoming scarce. I have five kinds of fruit but no sources of Vitamin D or B. I called the rescue service again. No answer."}, {"type": "sentence", "content": "Day 26: Visited the talking dodo at the airport to see if he would smuggle me out of this miserable hell and to the relative safety of Doodlebug Island, some 12 miles away. The miserable bastard wouldn’t do it. “Oh, drumsticks! That won’t do ya any good!” he squawks, barely visible for all the condensed sweat in his shield visor. “Everyone on Doodlebug Island is dying of the novel coronavirus, too. They burned all the books in town last week, but still no good! It’s the end times!” He gives an air of someone cognizant of his own imminent extinction, as you might expect from any essential worker these days."}, {"type": "sentence", "content": "Day 27: I’m almost certain I have rickets. I spend a lot of time fantasizing about eating my isle-mates. Cannibalism seems natural on an island full of anthropomorphic versions of things I used to eat back home, but it’s out of the question now. You don’t know who could be infected."}, {"type": "sentence", "content": "Still, there the raccoon sits in his gilded gift shop, lording his wealth over the rest of us, squeezing every last drop from the common islander. If there is one who deserves to be skinned and eaten, it is he. “They will perish, all the factions that rely upon their power in order to destroy our freedom.” Robespierre said that. Robespierre was a man, not some stinking, horrible beast. If he had been an animal, he would have been a good one, like a wolf or a Tasmanian devil. Not some stupid hedgehog, not a skunk, not a strangely alluring pig. Certainly not a raccoon."}, {"type": "sentence", "content": "Day 29: Donated my last bit of island currency to a singing dog’s Patreon."}, {"type": "sentence", "content": "Day 30: The tanuki suit has been removed. I dare not write any more on this topic. Suffice it to say: I am full again, I am safe again, yes, yes! Safe from viruses, safe from the laws of man, safe even from the laws of nature. Here on this island, nothing can harm me."}]}