{"title": "The Binding Freedom of Letting Go", "data": [{"type": "image", "content": "https://miro.medium.com/max/1500/1*hbW7ayYLhSWtW2N3rxWtQg.jpeg"}, {"type": "sentence", "content": "Prakash held the receiver loosely by his right ear, letting everything flow through his left. Film Producer Kalanidhi was strict with deadlines, and Prakash knew that if the deal fell through, he would have to hunt for a routine 9–5 job. This would be his last stint as a composer. There were bills to be paid and in the war between passion and practical needs, he refused to let passion lose."}, {"type": "sentence", "content": "It had been a month of inspiration hunting, but every time he turned the knob, not a drop of inspiration fell. He listened to Mozart, Beethoven, Rahman and every other legend that he worshipped, but their blessings didn’t seem to reach him either. Now he was running out of time; his head had started to ache. As he gulped down an analgesic, he wished there was a pill for creativity as well."}, {"type": "sentence", "content": "Prakash looked outside his studio window. It was late evening, yet the humidity of his city made him wish there was room for a human being inside his refrigerator. ‘It is early June, where are the clouds hiding?’ he thought as he scanned the darkening sky."}, {"type": "sentence", "content": "The analgesic was working, he felt drowsy. Praying one last time to his idols, he switched off the studio systems and rested his head on the table."}, {"type": "sentence", "content": "It was the thunder that woke him up. He looked outside the window and saw that the clouds had finally arrived and were showering upon one and all in the city. ‘Thank God’ he thought groggily. The leaves danced as the raindrops hopped over them. The trees swayed in celebration as the winds nudged them to do a jig or two."}, {"type": "sentence", "content": "Prakash descended the staircase of his studio so that he could get a whiff of the earth that had just been graced by the showers from above. Children danced in glee; Prakash felt a strong urge to undress and join them. For a moment, he felt that he was free from deadlines, free from money constraints, free from everything else bothering him. It was just this moment that mattered."}, {"type": "sentence", "content": "The sound of the drops of water hitting the asbestos rooftop at the adjacent building had a distinctive and continuous rhythm. This combined with the sound of the leaves, and the shouts of joy from the children ignited the spark that Prakash was searching for. He ran upstairs and switched his studio systems back on."}, {"type": "sentence", "content": "“Brilliant. Absolutely Brilliant. I don’t care which Korean song you jacked this rhythm from, but I loved it!” Kalanidhi agreed to clear the rest of the payment within a week; Prakash let out a sigh of relief."}, {"type": "sentence", "content": "Inspiration is a gift from nature, for anyone willing to listen, Prakash learned."}]}