{"title": "The Definitive Guide to Webinar Sales Funnels for Startups", "data": [{"type": "image", "content": "https://miro.medium.com/max/5572/1*hCP4y573tS5Ig_mmFgUr7w.png"}, {"type": "sentence", "content": "As mentioned in “4 Organic Questions That Move Us Close to Product-Market Fit”, the prerogative for any startup is to be relentless. Relentless in their pursuit to provide value for their customers."}, {"type": "sentence", "content": "However, qualifying leads, responding to emails and meeting ad-hoc requests is incredibly time-consuming. This is even more true if you consider the duration of traditional B2B sales cycles, especially if you are an unknown startup."}, {"type": "sentence", "content": "A small ticket item can take around three months to close, with higher contract values taking about six to nine months. If you’re one of many startups who have a limited run rate and need to close customers to raise your next round successfully, you should be seriously considering how you can accelerate your sales funnel. An undervalued tool that any startup can use is the webinar sales funnel."}, {"type": "subtitle", "content": "Webinars, like your dream startup, scale incredibly well."}, {"type": "sentence", "content": "On a high level, a webinar sales funnel enables you to reduce time spent qualifying in, and equally as important, qualifying out prospects."}, {"type": "subtitle", "content": "Our webinar"}, {"type": "sentence", "content": "We had an idea to sell internal resources we had developed over the year as a service. Three weeks later, we closed our first sale."}, {"type": "sentence", "content": "We emailed around ~1000 prospects with a free ticket to our webinar. We had 97 sign-ups after two follow up emails. 69 people attended the webinar on the day. 28 engaged in further activities including thank you emails, survey completions and opening a proposal document."}, {"type": "sentence", "content": "We’ve so far closed a sale worth £3,000, and have another three sales in the pipeline."}, {"type": "subtitle", "content": "What you need"}, {"type": "sentence", "content": "All you need for a webinar sales funnel is:"}, {"type": "sentence", "content": "Given most startups use Google Suite, you’re probably already paying for Google Hangouts and 1. is ticked off."}, {"type": "subtitle", "content": "There are ten steps in our sales funnel."}, {"type": "image", "content": "https://miro.medium.com/max/5572/1*6QX7mEt2hKQcFxwocA7-sA.png"}, {"type": "subtitle", "content": "Step 1: Create your event"}, {"type": "sentence", "content": "To execute, I’m going to assume you have a service you know you want to sell. You also have expertise in the domain. This knowledge is what you’ll be providing in the webinar. In exchange for the value you’re offering to your prospects, you can plug your startup as the solution."}, {"type": "sentence", "content": "First, create your event on either EventBrite or Universe. You want to use one of these tools because they’re free, and allow you to collect money on tickets sold and manage attendees very easily."}, {"type": "sentence", "content": "You’re going to need to decide your event title, description, the agenda and any other bits you have to act as social proof."}, {"type": "sentence", "content": "For the event title, go for some variation of [topic of interest] Masterclass Webinar. It’s important to communicate; this is a digital event from the go."}, {"type": "sentence", "content": "For the event description, sell the value you’re providing, use statistics to provide a strong context."}, {"type": "sentence", "content": "The agenda should be structured as simple bullet points that target customer pain points that the target customer needs and can include a singular point regarding your company and how it is the answer to all problems."}, {"type": "sentence", "content": "Finally, add some social proof. Why is your webinar important? Why are you an authority in this space? Communicate social proof through testimonials, speaker biographies, links to press releases — whatever floats your boat."}, {"type": "sentence", "content": "You’re also going to need to create event posters. You don’t need to hire an exclusive graphics designer, you can either whip out Photoshop or if you’re less inclined — hop on to Google Slides or Powerpoint."}, {"type": "sentence", "content": "Here are some simple posters which you can try to emulate, just copy the color schemes and make it yourself."}, {"type": "image", "content": "https://miro.medium.com/max/5644/1*cy5w4cXVaddmOj5IKjGqag.png"}, {"type": "sentence", "content": "Just remember you’re going to have to create several versions of the poster with dimensions correct for a) the website on which you are hosting the event b) LinkedIn and c) as in-line images in any emails you send."}, {"type": "subtitle", "content": "Step 2: Set up your ticketing"}, {"type": "sentence", "content": "Feel free to use your intuition here. For our event, we created two ticket classes, early-bird and general, priced at £30 and £50. We then created a discount code that gave all the prospects on our mailing list 100% off."}, {"type": "sentence", "content": "There are arguments to even charging your prospects a small token fee. We wanted to maximize our audience given our webinar was an education piece and was a way for us to publicize the rollout of a new service."}, {"type": "sentence", "content": "You’re also going to want to use this opportunity to add checkout questions. These can act as great tools to help you qualify prospects. We asked:"}, {"type": "sentence", "content": "We then used 4. to help structure the webinar."}, {"type": "subtitle", "content": "Step 3: Email prospects"}, {"type": "sentence", "content": "I’m going to assume you have some sort of mass mailing function — we used Streak since we already had the tool to track our pipelines. There are lots of services, including Yesware and GMass."}, {"type": "sentence", "content": "You’re going to send your mailing list three emails. The first one is an invitation, and the second and third are follow-ups."}, {"type": "sentence", "content": "Make sure you don’t send follow up emails to prospects who have purchased a ticket."}, {"type": "sentence", "content": "I’m not going to spend a considerable amount of words telling you how to write useful invitation emails, but here are my summarised points."}, {"type": "sentence", "content": "In your second email, repeat the above — but make the email body look different. Here I used a version of the event poster (which was optimized for email dimensions) and pasted it in-line."}, {"type": "sentence", "content": "In the final third email — tell them in the subject line that this is their last reminder. This will reduce the number of unsubscribing prospects and create a sense of urgency."}, {"type": "subtitle", "content": "Step 4: Linkedin"}, {"type": "sentence", "content": "In tandem with emails, your team should be posting the event on Linkedin, and supporting each other’s posts with comments and likes. Utilize your poster tailored to LinkedIn’s image dimensions! Sharing on LinkedIn will extend the event beyond your initial prospect list and generate entirely new leads."}, {"type": "subtitle", "content": "Step 5: Send out calendar invites"}, {"type": "sentence", "content": "You’re going to need to inform all your attendees of the online webinar link after they purchase their tickets. You also want to ensure it’s in their calendar, so they don’t miss it."}, {"type": "sentence", "content": "Too many webinars fail to communicate their event with their prospects calendar tool smoothly."}, {"type": "sentence", "content": "In my opinion, the best way to do this is to create a calendar invitation for the event. Every night add new attendees as guests to the calendar invitation (which should include joining instructions)."}, {"type": "subtitle", "content": "Step 6: Trial run"}, {"type": "sentence", "content": "This is probably your first time running a webinar. It was ours as well. We organized for a private mock webinar."}, {"type": "sentence", "content": "Send out calendar invites and run the event as if it was the real deal. You may need to delegate tasks, including someone to manually mute attendees as they join. You’ll also need to make sure everyone can see the speaker and their screen (if they are going to present a PowerPoint)."}, {"type": "sentence", "content": "Make sure your team tries to watch the webinar from non-work emails. Sometimes there may be issues. It’s important to simulate every aspect of the event! Finally, make sure everyone provides detailed feedback on the webinar so that it will run smoothly."}, {"type": "subtitle", "content": "Step 7: Webinar day"}, {"type": "sentence", "content": "Email all your attendees, using the inbuilt tool on Universe or Eventbrite, reminding them the event is happening today. Send them the calendar link in case they haven’t seen it. Also, tell them you’ll be emailing them again 1 hour before the webinar as a short reminder."}, {"type": "sentence", "content": "Numerous emails may seem like overkill, but you want to make sure that your attendees attend your event. You don’t want all the hard work to go to waste simply because they forgot."}, {"type": "subtitle", "content": "Step 8: Send out feedback surveys"}, {"type": "sentence", "content": "Well done. You’ve successfully run your webinar — but it’s not over yet. Within the day, make sure you send out a thank you email with a link to a survey. The feedback you receive can help shape future engagement with leads. There are lots of free survey tools such as Survey Hero. Don’t forget to collect email addresses."}, {"type": "sentence", "content": "You’re going to want to use this opportunity also to tell your attendees that you’ll be sending out your proposal/services document shortly."}, {"type": "subtitle", "content": "Step 9: Feedback results, proposal document, mailing list"}, {"type": "sentence", "content": "Once you’ve gathered some feedback, you can now send another email. Use the results of your survey to help craft your story. For us, 67% of attendees intend to change their marketing strategy after the webinar, and 30% are planning to increase their budget."}, {"type": "sentence", "content": "These are great metrics to be using while you also send out your proposal document. Make sure you use a tool like DocSend to track who is opening the document."}, {"type": "sentence", "content": "Finally, invite your attendees to a mailing list specifically for SEO."}, {"type": "subtitle", "content": "Step 10: Hyper target engaged prospects"}, {"type": "sentence", "content": "If executed well, you’ve probably already entered the negotiation stage with some leads. You can now also use all the data you’ve collected to target prospects specifically."}, {"type": "sentence", "content": "Focus on those that filled out your survey, those who opened your proposal document, and anyone who asked questions during the webinar."}, {"type": "subtitle", "content": "Conclusion:"}, {"type": "sentence", "content": "Webinars are highly effective sales funnels if used correctly. The key is to provide value and always collect emails and measure interactions."}]}