{"title": "Reinventing Your Career is Possible…And Easy", "data": [{"type": "sentence", "content": "Believe me when I say I’d have rathered gouge out my eyes with an acetylene torch than work in the same job the whole of my career. I run fleeing from job descriptions that require fifteen years of me running on a hamster wheel day in and day out. And I know recruiters have majored in missing the point when they look at my background and don’t get why I deliberately chose each role, and how the sum of those roles contributed to the work I do today."}, {"type": "sentence", "content": "I would not be as confident and successful if I only knew how to put widget A into box B. I wouldn’t have the language to navigate companies with ease if I was myopic, fluent only in the dialect of my department."}, {"type": "sentence", "content": "People always want to put you in a box. Categorize and define you in a way they can understand. But they’re simple-minded, unable to think strategically and make the connections to tell the story of you."}, {"type": "sentence", "content": "Here’s a fact: I haven’t been doing brand marketing since the womb. I started out my career in investment banking and soon hated it because I craved a life where I didn’t have to wear pantyhose and run financial models all day. In 1999, I mailed out my paper resume (yes, this was a thing — so was the abacus) to find another job and recruiters told me the only job I could get was one in finance."}, {"type": "sentence", "content": "So, I went on weekend interviews at Merrill Lynch, worked my alumni connections to break into Berkshire Hathaway, and I would cry in the lobby because the selling point of each bank was the convenience of having showers in the building."}, {"type": "sentence", "content": "SURELY, YOU JEST."}, {"type": "sentence", "content": "Frustrated, I decided to manufacture experience where I had none. I built an e-commerce site where I sold designer clothing and accessories that I’d purchased from outlets and sample sales in New York. Back then, you didn’t have The RealReal or Nordstrom Rack online, and there was a demand for designer clothing on the cheap for people who didn’t have access."}, {"type": "sentence", "content": "I completed the LLC paperwork, did my own books, put in an application to be a payment processor so I can accept credit cards, designed and built a website, bought the clothes based on trends I’d analyze in magazines, TV shows and what I’d see on the streets, wrote sales copy, used my status as an eBay power seller to market my website, and managed all the shipping and customer service in an apartment over a barn out in Long Island. I even got my pop into the act and a man who broke and exercised thoroughbred horses soon became fluent in Prada and Dolce & Gabanna."}, {"type": "sentence", "content": "You should know except for the writing part, I’m horrible at everything I’ve just described. I’ve no head for visuals. Up until last year, I couldn’t balance my checking account. But I did it because I’ve learned that if you want something and people keep denying you that something, there’s nothing you won’t do to get that something. If you’re hungry enough. Tenacious enough. And realize that done is better than perfect."}, {"type": "sentence", "content": "My work caught the attention of the burgeoning Oxygen network and a woman came out to the horse farm in which my pop worked and we lived and interviewed the scrappy duo selling Badgley Mischka gowns online. That interview caught the attention of my future boss, who would hire me to be a project manager for a luxury dot.com that would soon be sold to LVMH."}, {"type": "sentence", "content": "Fuck finance. A new career was born. And I’ve been making lateral and upward moves ever since. Because I viewed my career as a set of tools in a toolkit. If there was something I wanted to learn, I would take a job or build a side hustle in that something. I took a job in marketing and business development at Time Warner because I wanted traditional consumer marketing experience. I shifted to book publishing because I was intrigued by the intersection of commerce and art and how to understand customers to market books to them."}, {"type": "sentence", "content": "I had side hustles where I published an online & print literary journal from 2002 to 2007 because I was intrigued by bringing content online and understanding the entire editorial, publishing, and marketing process surrounding words. I was an equity partner in a small social/digital agency in New York because I wanted to get my hands dirty and work with a slew of brands across industries and categories so I could be nimble enough to work in any company, fast. I worked at a global agency as a VP Strategy to understand bigger brands, bigger budgets, and more sophisticated ways of learning about customers and using data and insights to build brands and tell stories."}, {"type": "sentence", "content": "All of these roles (either taken or designed by me) were in pursuit of following what made me curious. And the confluence of understanding customers, products, and businesses and my background as a novelist found me merging the two seemingly disparate worlds of marketing and storytelling to captivate, capture and convert customers."}, {"type": "sentence", "content": "I didn’t know in 2014 I would start building brands for clients, but all of the work I was attracted to gave me a full spectrum of experience that not only informed the work that lights me up today but didn’t trap me too much in the discipline so I was unable to critique it and design a process rooted in discipline and reality."}, {"type": "sentence", "content": "Last week, I was coaching a client who has a decades-long career in CPG (consumer packaged goods) marketing and sales. Anyone familiar with CPG knows that this particular category has a lexicon and a type of marketing specific to the category. I won’t torture you with the details, but my client wanted to make a leap to help businesses be better citizens. But she didn’t know what a consulting practice could look like because it wasn’t something she’d ever done before."}, {"type": "subtitle", "content": "Create & Define The Future State"}, {"type": "sentence", "content": "So, I asked her to do three things:"}, {"type": "sentence", "content": "Then, I asked her to review all the exercises and write the story about a day or week or future project she’d be working on in two year’s time. Whether it was designing a business model that centered on impact, or designing marketing strategies and campaigns that connected cause and product, or created a mission-driven culture internally in an organization — the thread line was she didn’t want to work with companies that were garbage humans, putting profit over people."}, {"type": "sentence", "content": "Do this for yourself. Once you have a working idea of what you want to do, define what your new role entails."}, {"type": "subtitle", "content": "Map Out Your New Role"}, {"type": "sentence", "content": "This is the moment when you need to be a CIA operative. You have to show up and do the work. This isn’t a time to be lazy, friends. Research your desired role and what it entails by:"}, {"type": "sentence", "content": "The objective here is to understand what would be required of your new role and the gaps you need to fill."}, {"type": "subtitle", "content": "Work Your Toolkit"}, {"type": "sentence", "content": "Inventory your career against your dream role. Even if the job descriptions don’t match, get creative. When you’re inventorying your career, bullet out all of the things you had to do on a daily basis (hard and soft skills), the technology you used, other departments or resources you were directly exposed to. The idea is to pull relevant experience and expertise (even if it isn’t directly correlated) that will help in your new role."}, {"type": "sentence", "content": "I firmly believe most people aren’t stupid, and given the chance, they can bootstrap their pivot or dream role if they’re hungry enough and ego-free."}, {"type": "sentence", "content": "For example, I worked in marketing in book publishing (a non-fiction imprint at HarperCollins) and I’m also an author and writer. Both experiences inform my work in brand strategy and content development because:"}, {"type": "sentence", "content": "Pull the related experience that makes sense for your new dream career."}, {"type": "subtitle", "content": "Fill the Dream Role Gaps"}, {"type": "sentence", "content": "Now, there will be aspects of your new role that are foreign to you. Back in 2013, one of my closest friends was a traditional brand strategist and marketer — MBA from Stern, a dozen years of experience doing what I wanted to do. But she lacked digital and social acumen and expertise, and she knew she needed that to stay competitive."}, {"type": "sentence", "content": "So, we decided on an informal cross-mentorship. We would shadow each other’s projects (for free because we were learning but also providing assistance — think of it as bartering that’s mutually beneficial) to learn terminology, process, format, and methodology. We’d work together to build a brand platform and a digital marketing strategy. We did this for about a year on our respective projects. It wasn’t a huge leap for me to learn my gaps because I already had a career in marketing."}, {"type": "sentence", "content": "Consider it a fast-tracked MBA, but in real life without the fuckton of student loans."}, {"type": "sentence", "content": "Maybe there’s someone in your network where you can partner up for a time to shadow one another on real projects."}, {"type": "sentence", "content": "Or you can take online courses, do pro-bono work (and being transparent with your client that you’re learning as you go), offer to intern or shadow someone you admire (or a peer) to help them on a project while gaining real expertise and mentorship."}, {"type": "sentence", "content": "There are so many ways you can fill the gaps and gain experience for your dream job as long as you show up and do the work."}, {"type": "sentence", "content": "Don’t think you have to be deadbolted to your current job because it’s familiar, safe. If I manage to crawl out of working three years in finance to shift to a career in marketing while the internet was still a shiny object, you can do it now with the plethora of easily-accessible resources."}, {"type": "sentence", "content": "So, if you’re forced to find a new role or want to seize the opportunity to drop-kick your current job in favor of something other, know you can do it if you’re hungry, curious, agile, smart, and willing to do the work."}]}