{"title": "This Thing of Timing", "data": [{"type": "sentence", "content": "The night we met, I kept wandering into the darkest corners of the bar to check my phone behind your back."}, {"type": "sentence", "content": "The night we met, I slipped outside with the smokers and kissed someone else while you weren’t looking. Or perhaps you caught a glimpse of it, I never asked."}, {"type": "sentence", "content": "Yet, the night we met, I left that dark, crowded bar with you."}, {"type": "sentence", "content": "At first, it felt to me like a compromise. Like it was still too early, and I was too tipsy to go home alone, to not have the night I had set out to have. But as soon as you held me, as far away from another living soul as we managed to get, I knew I had made the right choice."}, {"type": "sentence", "content": "After we kissed, I went to bed as giddy as a teenager in love."}, {"type": "sentence", "content": "No, I wasn’t in love. I was in lust. I lusted for your embrace and your kiss and how much I thought we had in common and, finally, someone I could talk to. Someone who didn’t bore me to tears, who sounded enthusiastic about life, and who seemed genuinely happy to see me."}, {"type": "sentence", "content": "I was horny for how well I thought we got along."}, {"type": "sentence", "content": "Except it seemed like we got along only until we didn’t. Until it became painfully clear your schedule didn’t match my needs; and my immediate dreams were in direct conflict with your long-term goals."}, {"type": "sentence", "content": "Until it became clear that, had we met at some other point in life, we’d be perfect together."}, {"type": "sentence", "content": "Not good, not great, perfect."}, {"type": "sentence", "content": "You made me see bad timing for what it was: a trick of fate."}, {"type": "sentence", "content": "You made me see it for the painful wake-up call that is it: the one that tells you chemistry is not enough, and that two people can have the same overall dreams, but a very different understanding of how to go about achieving them."}, {"type": "sentence", "content": "Two people can have the same destination in mind, but a different idea of what’s an appropriate pace to get there — and which detours are reasonable to make along the way."}, {"type": "sentence", "content": "And then you said I smothered you. I made you feel trapped, which to me was code for, “I can’t do this — right now.”"}, {"type": "sentence", "content": "So you walked away to go do what you had to do, and I distracted myself texting and kissing other boys in dark bars and back alleys in between cigarette breaks."}, {"type": "sentence", "content": "I had given you up until it seemed, for a fleeting moment, that we were possible again."}, {"type": "sentence", "content": "You texted “hi.” I texted “hi” back, and it took everything I had to keep everything else from spilling right out."}, {"type": "sentence", "content": "You were doing fine, and so was I."}, {"type": "sentence", "content": "You were still you, and I was still me, and we still had all those things in common that had brought us together to begin with, the only difference was time."}, {"type": "sentence", "content": "Time had passed, our situations had changed. The ever elusive timing seemed like it might just be on our side. Barely. One wrong move and it would slip away, forever beyond our reach."}, {"type": "sentence", "content": "And then the world shut down on us, and it placed what it feels like thousands of miles between you and I."}, {"type": "sentence", "content": "I used to fear what I might say next, now I fear saying anything at all."}, {"type": "sentence", "content": "I fear this is definitely not the time to restart something that was so fragile the first time around. I’m afraid to rekindle a flame that can’t survive this storm. Now is not the right time for us. Again."}, {"type": "sentence", "content": "This thing of timing. It might have won us over, at last."}]}