{"title": "How To Start a Six-Figure Website This Year", "data": [{"type": "image", "content": "https://miro.medium.com/max/5356/0*mGr97-T7SwGXCkI3"}, {"type": "sentence", "content": "In 2013, I was out of work and had a lot of time on my hands. When I wasn’t taking care of my daughter, who was a baby at the time, I spent my mornings and evenings studying SEO and content marketing, and I accidentally started an online business. It took a while for that site to translate into earnings, but it eventually paid off."}, {"type": "sentence", "content": "I didn’t predict a recession in 2020, but I was more prepared for it than previous ones. I built up a reserve of cash in my business that will hopefully see me through the next few months."}, {"type": "sentence", "content": "I’ve learnt the hard way not to depend too much on one source of income."}, {"type": "sentence", "content": "If you haven’t started an online business yet, now is an ideal time to start. Over the past few months, I’ve studied or interviewed successful niche website owners like Canadian lawyer Jon Dykstra."}, {"type": "sentence", "content": "During the early 2000s, he faced a unique challenge."}, {"type": "sentence", "content": "His employer wanted him to attract more clients through blogging and content marketing. So Dykstra began writing about legal topics that interested clients, based on their search queries."}, {"type": "image", "content": "https://miro.medium.com/max/1920/1*siC6rDnxoE9IRWTVaSuVHw.jpeg"}, {"type": "sentence", "content": "He says,"}, {"type": "sentence", "content": "Inspired by how content marketing helped grow the practice, Dykstra began building niche websites on the side."}, {"type": "sentence", "content": "When these niche sites began attracting website traffic and earning revenue, he found balancing a law career with an online one more challenging."}, {"type": "sentence", "content": "“Eventually you’re forced to choose. It’s hard to do both. I seemed to like the blogging side and the writing online more and opted to go that route,” Dykstra says."}, {"type": "sentence", "content": "He quit the practice, where he was a partner, in 2012 to focus on growing niche websites full time. A niche site typically focuses on a single subject like sports cars and attracts traffic through high-quality articles optimised for search. A hyper-niche site dives down into a topic even further."}, {"type": "sentence", "content": "He told me,"}, {"type": "subtitle", "content": "1. Invest In Quality Content"}, {"type": "sentence", "content": "Dykstra grows his niche websites by publishing in-depth articles about specific topics, at scale. Dykstra relies on agencies to supply much of his content, something that forms a significant chunk of his monthly overhead. He also recently hired a content strategist."}, {"type": "sentence", "content": "“I liken content to a widget. If you’re in manufacturing, you produce widgets. If you’re an online publisher, you produce content. And so yes, there are multiple workflows. I have a couple of in-house writers that I work with,” he says."}, {"type": "sentence", "content": "Today, Dykstra runs nine profitable niche sites, but he doesn’t disclose their URLs. He also started several more niche and hyper-niche sites over the years. Some of these sites haven’t taken off, while others represent long-term bets."}, {"type": "sentence", "content": "“Several of them are very small and don’t do anything. I call them my rainy day sites. I publish maybe one, two, three articles a month on them,” he says. “I don’t expect them to do well, but I like to have some aged sites with some good content sitting there in case down the road I get some time and some more resources.”"}, {"type": "subtitle", "content": "2. Pick One Niche (For Now)"}, {"type": "sentence", "content": "Considering the potential return of a niche site, it’s tempting for an aspiring entrepreneur to start several sites at once and hope for the best. However, Dykstra offers this warning,"}, {"type": "sentence", "content": "Running more than one site also presents additional technical challenges and issues. For example, if a WordPress plugin breaks on a site, the owner will probably have to fix the same issue across all of their sites. Similarly, investing in high-quality content for multiple sites at once could become a huge expense with no immediate returns."}, {"type": "subtitle", "content": "3. Exercise Patience"}, {"type": "sentence", "content": "It takes many months if not years of hard work before an online publisher will see a proper return on a niche site project. Ranking highly in Google search results requires a significant amount of quality articles or backlinks. Domain age and authority are important factors too. Changes to the Google search algorithm also present business risks."}, {"type": "sentence", "content": "“These things don’t happen in six months. The growth takes a long time unless you get very, very lucky, or you really know what you’re doing. I can’t make them happen in six months,” says Dykstra. “You don’t want to pull the plug early, but at the same time you don’t want to just keep throwing money at something that has absolutely no future.”"}, {"type": "sentence", "content": "Dykstra is running a profitable business built around publishing. His success isn’t unique though. The Wirecutter is the most high-profile example of a successful niche site. It focused almost entirely on Amazon product reviews and Amazon bought the site in 2016 for over $30 million."}, {"type": "sentence", "content": "For anyone interested in creating content, a niche site represents a profitable career opportunity. If you’ve got extra time on your hands right now, take advantage."}, {"type": "sentence", "content": "Want a free book for accomplishing more? Join my newsletter, and I’ll send it to you alongside weekly advice about creativity, productivity, and leadership."}]}