{"title": "Deadlines Are the Best Thing Since Sliced Bread", "data": [{"type": "image", "content": "https://miro.medium.com/max/11520/0*EDNr-CHF3zCfPYQ4"}, {"type": "sentence", "content": "If you read the headline of this article and finished the thought with “…said no one ever, ” this one is definitely for you."}, {"type": "sentence", "content": "I suppose I used to feel the same way. Having entered college thinking I wanted to be a journalist, I quickly learned the importance of a deadline. But at the same time, unless something immediately pressing was happening in the world, deadlines felt sort of arbitrary."}, {"type": "sentence", "content": "“They’re just trying to be in control”, is what my non-conformist, all-knowing, early 20-something self would think about anyone who put my work on a deadline. This was true for any sort of job or assignment I crossed paths with. Even when I was waiting tables, being told I had 10 minutes to deliver someone their lunch made me tingle with frustration. How dare they interrupt my day with their urgency?"}, {"type": "sentence", "content": "Fast-forward to me launching my own copywriting business, and my opinion of deadlines changed quickly and dramatically. Here’s what shifted my mindset."}, {"type": "subtitle", "content": "Deadlines let you know if a client is worth your time."}, {"type": "sentence", "content": "In the beginning, when clients would book a call with me, I would always get excited. “They want to work with me!”"}, {"type": "sentence", "content": "Then I learned the real question is “do I want to work with them?”"}, {"type": "sentence", "content": "One sure-fire indicator that I don’t want to touch a project with a 10-foot pole is “oh, you know, we have the idea but there’s no pressure to hurry.”"}, {"type": "sentence", "content": "Their deadline apathy tells me a few things."}, {"type": "sentence", "content": "Zero thought about a project timeline is my queue to tell them they may not be ready to work with me yet. I’m a copywriter, not a business coach."}, {"type": "sentence", "content": "Being willing and receptive to recognizing this saves me my biggest asset. Time. And that brings me to my next point."}, {"type": "subtitle", "content": "Deadlines let you have a life."}, {"type": "sentence", "content": "I have, admittedly, accepted projects with those willy-nilly deadlines a few times. I have, admittedly, suffered the scope creep-slash-rape that comes along with it."}, {"type": "sentence", "content": "It all starts out innocently enough."}, {"type": "sentence", "content": "“We don’t want you to stress yourself out!”"}, {"type": "sentence", "content": "“There’s no rush!”"}, {"type": "sentence", "content": "“Take your time.”"}, {"type": "sentence", "content": "Meanwhile…"}, {"type": "sentence", "content": "“Oh hey, I know it’s Saturday and we don’t want to overload you, but we really need this email to go out Monday morning because…”"}, {"type": "sentence", "content": "And I’m caught deciding between canceling my weekend camping trip and telling them every client’s favorite word. No."}, {"type": "sentence", "content": "Or, “we’re not really in a hurry to get this up so we’ll give you our feedback next week.”"}, {"type": "sentence", "content": "And I’m caught staring at the block of time I reserved in my calendar to review their feedback and make edits when I could have filled it with another project or client call."}, {"type": "sentence", "content": "Despite any safeguards you may have in your business to convey your project process and timeline to your clients, some won’t comprehend it and you’ll have to break it down 17 different was until it clicks. Others will completely disregard it because some people always think they’re entitled to be the exception."}, {"type": "sentence", "content": "In reality, the only one who decides the exception is the one behind the wheel of your business: you."}, {"type": "sentence", "content": "So remember this: deadlines give you freedom. Set them and honor them so you can live your best damn life, or whatever the kids are saying these days."}, {"type": "sentence", "content": "If you do get caught in the habit of accepting wishy-washy client work, here’s some good news: you can break the cycle by implementing deadlines."}, {"type": "subtitle", "content": "Deadlines help define you as a professional."}, {"type": "sentence", "content": "Imagine a drain has clogged in your home. You try the usual drugstore fixes, but nothing works so you call a plumber. They tell you their rates, and you agree. When they show up, they take a look at the issue. Then they ask you how long it should take them to fix it."}, {"type": "sentence", "content": "You’re not the expert in the situation, so how should you know? Time to hire a new plumber."}, {"type": "sentence", "content": "The same is true in any business. Serious clients who truly need your skills want to see that you have a system to deliver their work on time and that you have some idea of how long it’s going to take."}, {"type": "sentence", "content": "Yes, some clients will be busy and barely give you enough of a brief to get started, and reading their feedback will be like trying to decipher ancient Egyptian hieroglyphs. But others will have some idea of what the process should look like, and if you aren’t ready for that, it’s quickly going to become clear to them that your services are amateur hour."}, {"type": "subtitle", "content": "Here’s how to set a deadline."}, {"type": "sentence", "content": "If you don’t have a project timeline, develop one. Do this for each of your services. It doesn’t have to be fancy. It could be a simple Google doc or pdf that explains how and when you get started, how and when you provide edits, and how and exactly when the final work will be delivered. What matters is that the client knows when they’re going to get what they paid for."}, {"type": "sentence", "content": "Even better than delivering work on time is delivering work early. When you’re your own boss, there’s no real reason that you shouldn’t give yourself a nice, long project timeline to make this possible. Double or triple how long you think the project will take you so you have plenty of time to make yourself look great with an early delivery."}, {"type": "subtitle", "content": "Here’s how to change a deadline without being a jerk."}, {"type": "sentence", "content": "I’ll save the Honor Your Deadlines speech, because I have, in fact, pushed back deadlines. I hope someday I never have to, but for now, if I change a deadline, I follow these 2 rules:"}, {"type": "sentence", "content": "In my experience, moving a deadline has been due to new information or current events. If a new study came out that will strengthen an article significantly, or a global pandemic makes their email campaign feel insensitive, I wouldn’t feel right delivering the work as-is. Never has a client been unsatisfied with hearing “I’m looking out for you.”"}, {"type": "sentence", "content": "I haven’t had any personal emergencies get in the way of making deadlines, but if I did, I would make sure they were aware of the situation without burdening them with too many details. Clients don’t need to know the nuances of sick dogs or car accidents. They just need to know what it means when it comes to them receiving the work they paid for without. Leaving out the sob story shows you respect their time."}, {"type": "sentence", "content": "The magic of this approach is that when you respect their time, they’re more likely to respect yours."}, {"type": "subtitle", "content": "A writer on a deadline is a beautiful thing."}, {"type": "sentence", "content": "As a writer or creative, deadlines come with the territory. Will there be days where you’re guzzling coffee and taking your meals hunched over your keyboard? Absolutely. But that’s a whole lot better than getting caught in a cycle of attracting low-paying clients who expect you to put your life on hold at their every whim. That’s a surefire way to prevent yourself from reaching your goals for many years to come."}, {"type": "sentence", "content": "The moral of the story? Your time is money. Use deadlines to help you budget accordingly."}]}