{
  "title": "Is This How It's Going to Be?",
  "data": [
    {
      "type": "image",
      "content": "https://miro.medium.com/max/1260/1*eHP5PjmVLwh74ExZ7uLLdQ.jpeg"
    },
    {
      "type": "sentence",
      "content": "Our new human better figure out how to do his job!"
    },
    {
      "type": "sentence",
      "content": "Our new sitter, Steve, was turning out to be a pretty good human. He was trying to follow all the instructions barked out to him by Mandy, the firefighter who had to leave in a hurry. And I was doing my best to help him. Help he desperately needed again, on his second day with us."
    },
    {
      "type": "sentence",
      "content": "It was midafternoon. Riva and I followed Steve over to the home of Wombles, Rhonda, and Dottie. Those three know not to mess with the chickens so he let them and Sissie out. If he was a smarter human he would have kept them close. Maybe he thought they were like me."
    },
    {
      "type": "sentence",
      "content": "Steve could see that I’m a good girl. I know my job and how to behave. I don’t go to the neighbors and harass them. I don’t have to be on a leash. That’s not true for the others. Steve was about to learn that. He should pay more attention to me. I tried to warn him."
    },
    {
      "type": "sentence",
      "content": "The silly human got distracted again. To his credit though, Steve heard me tell him the others had run off to the neighbors. He called them back and they responded. For a moment. But Steve was busy with something and took his eyes off them. Big mistake."
    },
    {
      "type": "sentence",
      "content": "I wasn’t surprised when Diane pulled up. Of course, with the shenanigans going on at her house, I was expecting her."
    },
    {
      "type": "sentence",
      "content": "I like her. She always pets me when she comes over. Diane is one of the humans that live next door. She and Jeff are the people who own our home."
    },
    {
      "type": "sentence",
      "content": "I could sense Diane was upset. She was not at all impressed with Steve. She informed him of that, along with her expectations of him and the dogs, and what would happen if they weren’t met. She made it clear he had messed up."
    },
    {
      "type": "sentence",
      "content": "Diane was right, and I could tell Steve knew it. If he had a tail, it would be tucked. I think what made it worse for him was that she was quite civil. I was impressed. She was cool, intelligent and straightforward. A real lady. Like me."
    },
    {
      "type": "sentence",
      "content": "To his credit, Steve accepted responsibility, apologized and promised to never allow the dogs out like that again. Diane left and I went in to get some water. Steve came in with me. That’s when we saw it; the mud tracked into the kitchen, on the walls, down the hallway into a bedroom, and then into the living room. I was so mad!"
    },
    {
      "type": "sentence",
      "content": "The house belongs to me. Well, and Riva, I guess. Those childish fools had made such a mess!"
    },
    {
      "type": "sentence",
      "content": "Steve let out a big sigh and asked me where the cleaning supplies were. I made a couple of tight circles around the closet. After grabbing the supplies, he plopped down to his knees and kept mumbling something about someone named “Cinderella”. I hope he starts paying closer attention because Sissy needs his help."
    },
    {
      "type": "sentence",
      "content": "You know, as much as I try to teach others to be good, they just don’t listen. Sissy wanted to play with the neighbors. She squirmed under the barbed-wire fence yesterday. But she didn’t get low enough and that fence ripped a two-inch gash into her side. I think she knew she would be in trouble because she didn’t tell Steve about it."
    },
    {
      "type": "sentence",
      "content": "The morning after Diane came to visit, I heard Steve hacking. It sounded like he had a furball stuck in his throat. Riva and I had to laugh at him for this. Serves him right, letting that cat into his room and not us. We would have kept her from climbing all over his face."
    },
    {
      "type": "sentence",
      "content": "We helped Steve with the morning chores. He found the gash on Sissie’s side when he went in to feed them. He liked to stop and pet everyone and say nice things to them. Sissie enjoyed the attention and turned her side to show him what had happened to her. Poor Steve. I could feel his concern. He circled around a couple of times like Riva does when she’s looking for a softer spot on her bed. With his head hung low, he went back to the house to get some medicine."
    },
    {
      "type": "sentence",
      "content": "After treating Sissie with some salve, and putting on ridiculous-looking strips of cloth, Steve asked me what he should do next. He had no idea that Sissie wasn’t going to keep those silly bandages on."
    },
    {
      "type": "sentence",
      "content": "“What do you think, Allie? Does Sissie need to see the vet?”"
    },
    {
      "type": "sentence",
      "content": "A vet? No way! I don’t like going to the vet and even though Sissie caused the problem herself by being a bad girl, I didn’t think she should have to go to the vet."
    },
    {
      "type": "sentence",
      "content": "I was relieved that because it was the weekend, the local veterinary office was closed. The next closest vet was over ninety miles away. Sissie was in luck."
    },
    {
      "type": "sentence",
      "content": "A few minutes later, I heard Steve talking to his friend, on the phone. He said he wasn’t about to contact our mom, Maya, to tell her he’s responsible for her friend being ripped open. At least not until he had some answers. Steve told me that his friend‘s uncle is a veterinarian. He would know what to do. He tapped on the phone again."
    },
    {
      "type": "sentence",
      "content": "“What?? $1500 for a few stitches? $900 if no stitches were required?” Steve growled."
    },
    {
      "type": "sentence",
      "content": "I’m not sure what that meant but Steve’s heart was thumping louder than usual. I guess it’s not what he wanted to hear."
    },
    {
      "type": "sentence",
      "content": "I moved over on the couch so Steve could sit. It helps me to sit so I can think. He kept whimpering about how he had never even spoken to Maya. He let his imagination of the pending disastrous conversation make him edgy. I think he was looking for a way to escape the country."
    },
    {
      "type": "sentence",
      "content": "He didn’t know our mom like we do."
    },
    {
      "type": "sentence",
      "content": "After a different vet told Steve that Sissie wouldn’t need stitches, his heartbeat slowed and his breathing became easier. He tapped on the phone again."
    },
    {
      "type": "sentence",
      "content": "“Hi, Maya.” I jumped up and danced around. I wanted to talk to her. I missed her so much. But all I could do was listen. Steve was being so rude to me."
    },
    {
      "type": "sentence",
      "content": "“Sissy should be fine with that cut. No need for a vet — they have had worse cuts when they used to work cows. ‘She probably doesn’t need anything beyond what you have done.” I heard Maya say."
    },
    {
      "type": "sentence",
      "content": "“Whew!” Maya is awesome! Steve howled. He was feeling so much better."
    },
    {
      "type": "sentence",
      "content": "Me, Steve, and Riva took our seats out on the deck. We crawled up next to him to let him know he would be alright. As we watched the sunset, I couldn’t help to wonder if this how things were going to be. Would this silly human figure out how to properly take care of us, or are we in for more trouble?"
    }
  ]
}
