{
  "title": "Why a Financial Crisis Is Actually the Best Time to Start a Company",
  "data": [
    {
      "type": "sentence",
      "content": "I started my digital marketing company in 2009 against the backdrop of a global financial crisis. Most people thought a young university graduate — like I was at that time — should play it safe and wait for the business climate to get better before starting a company. I’ll never forget the middle-aged business owner who approached me at a trade show and suggested I was “very courageous” to start a company in “the crisis,” and wished me well as if I were taking a trip to some dangerous place from which I would never return."
    },
    {
      "type": "sentence",
      "content": "My youthful ignorance turned out to be a blessing, although the first two years of bootstrapping were painfully humbling. My business card read “CEO,” but in reality, I was sleeping on an airbed under my desk. Two years later, armed with the proof of concept for our business model and bolstered by the tailwind of the improving economy, I raised my first round of financing. Eventually, I assembled a fantastic team of hundreds of people and later sold the majority of the company to a media conglomerate. It was a great ride, and I now believe that starting my company during a recession was the best move I could have made."
    },
    {
      "type": "sentence",
      "content": "According to a 2009 study by the Ewing Marion Kauffman Foundation, an extraordinary 57% of Fortune 500 companies have been founded in a recession or bear market, even though only 31% of all years since 1855 counted as “down years.”"
    },
    {
      "type": "sentence",
      "content": "If the majority of these companies got started during rough economic periods, it suggests that they may not be bad times to start a company. A “bad time to start a company” usually implies low consumer demand and limited access to funding. But that’s mainly a problem for startups that are already established. They have to manage the decline, after all."
    },
    {
      "type": "sentence",
      "content": "With no legacy costs, no draining layoffs, and no bank calling you to cut the credit line, entrepreneurs who start companies now can focus on building a great new product or service. Starting with a blank slate is your advantage in 2020. This year, the competition is weak, and you can gain an advantage that might last for years."
    },
    {
      "type": "sentence",
      "content": "In the world of startups, there is no guaranteed formula for success, but you need at least four ingredients to avoid failure: a good idea, an outstanding team, enough funding, and a way to find customers."
    },
    {
      "type": "sentence",
      "content": "Here’s what that looks like in the current crisis of 2020."
    },
    { "type": "subtitle", "content": "1. Painkiller ideas" },
    {
      "type": "sentence",
      "content": "Great ideas usually either solve a real, significant problem or make life considerably easier. Think of great startup ideas as painkillers: People need them and are willing to pay. The year 2020 will produce a whole range of “painkiller-category” problems that will translate into entrepreneurial opportunities."
    },
    {
      "type": "sentence",
      "content": "Millions of children can’t attend school. How can you solve that? Visit any quarantined household with small children. Those parents surely have a litany of new problems in need of a solution. Tens of millions of workers have gotten laid off. Hundreds of thousands of urban storefronts will be left empty by shuttered restaurants and struggling retailers. What will fill the voids in 2021?"
    },
    {
      "type": "sentence",
      "content": "Problems create opportunities, and 2020 is not lacking in problems. It’s no coincidence that companies like Uber or Airbnb were founded and thrived after the last financial crisis. They solved real problems (“I need extra cash”) and made life easier (“I want a cheaper, easier option”) at the right time."
    },
    { "type": "subtitle", "content": "2. Hiring during a recession" },
    {
      "type": "sentence",
      "content": "Finding great employees has historically been one of the biggest bottlenecks for startups. Here’s the biggest reason to start a company in 2020: For the first time in the last five years, you’re going to have access to an abundant pool of amazing talent. In 2019, companies had to bend over backward to attract great people. Outstanding employees were spoiled by poaching offers from competing companies. That drove rising salary levels and the frequency of job-hopping."
    },
    {
      "type": "sentence",
      "content": "Today, the pandemic has forced millions of qualified, hard-working employees to be let go by their firms. Some of them — maybe you among them — will take matters in their own hands and create a startup. Others will be thrilled to be working for one."
    },
    {
      "type": "sentence",
      "content": "In 2020 it will get much easier to compete for talent and retain employees. Perks like free kombucha, Disneyland furniture, and daily yoga classes at work suddenly sound so “2019” now. This year, offer meaningful work with good pay and possibly some stock options and people will gladly assemble their own Ikea furniture to work for you. Add to that the possibility of worldwide recruiting, which the work-from-home explosion has accelerated, and your inbox will be overflowing with applications."
    },
    { "type": "subtitle", "content": "3. Finding funding" },
    {
      "type": "sentence",
      "content": "Now you might be thinking, “This sounds all well and good, but it will be impossible to raise any money in 2020.”"
    },
    {
      "type": "sentence",
      "content": "I don’t agree. But before I address why, let’s clear something up: I think the last five years were a fake environment of fundraising. It felt like anybody and their dog could raise a $1 million seed round if they walked straight and put together 20 PowerPoint slides. There was so much money available that a company was able to raise $120 million dollars to build a $400 machine to squeeze juice from a plastic bag."
    },
    {
      "type": "sentence",
      "content": "These times are probably over, but venture capitalists and angel investors are still here and still have money to invest. It will undoubtedly become harder to raise funds in 2020 compared to 2019. The 2020 funding environment will favor outstanding founders. They will still raise rounds, and the mediocre startups will suffer. But who wants to be mediocre anyways?"
    },
    {
      "type": "sentence",
      "content": "Let’s consider a temporary shortage of capital a good thing. Less funding means the quality of entrepreneurship will rise again. Fewer dollars will force everyone to work harder and get better. In my first two years after starting up, I would think three times before spending a dime. For example, we would never pay for any sales leads datasets but instead hack together a script to scrape such data from public sites for free. This instilled a culture of frugality that lasted much longer than the actual bootstrapping phase."
    },
    {
      "type": "sentence",
      "content": "In normal times, nobody needs a $50 million Series A round six months after starting their company. A lot of such rounds led to premature scaling and created more damage than value. Potentially good companies like WeWork blitzscaled straight into trouble."
    },
    {
      "type": "sentence",
      "content": "Use the temporary shortage of capital to your advantage and foster a culture of frugality and wits. No business-class flights or $1,000 office chairs. The leaner you operate, the better."
    },
    { "type": "subtitle", "content": "4. Finding customers" },
    {
      "type": "sentence",
      "content": "When I started my digital marketing company in the financial crisis, a lot of companies had shredded their advertising budget. So needless to say, our products didn’t sell like hotcakes. But we knew there were still businesses out there that were doing well and who needed our services. Our job was to be smart and find them."
    },
    {
      "type": "sentence",
      "content": "As a founder, your job in the first year is to build something that 100 people love, rather than something that 10,000 people kind of like. If you do an excellent job of creating something valuable, you’ll find those 100 people, no matter if it’s the year 2020, 2009, or 2001. That is the first stage for most startups, and during this stage, the macroeconomic environment just doesn’t matter so much. It will easily take one or two years until you have genuinely figured out product-market fit."
    },
    {
      "type": "sentence",
      "content": "Take advantage of the low advertising prices as well. If you truly offer something that people need, now is the best time to attract users cheaply. With marketing budgets cut down to almost zero in a lot of cases, you’ll be able to buy low-priced ad inventory, especially in digital channels."
    },
    {
      "type": "sentence",
      "content": "The next couple of years in a downturn environment will be your training day. The sales you make will be the hardest of your life. The fundraising will be slow and cumbersome, especially if you’re a first-time founder. You will get scars. But those kinds of scars will make you great in the future."
    },
    {
      "type": "sentence",
      "content": "Fortune hunters who are just in the game for easy money are likely to leave the scene during this crisis. But real entrepreneurs will enter the arena and stick around. Entrepreneurship is always a tough game with limited resources, no matter when you start. One of my mentors would always say: “As a founder, you have to eat concrete.” You’ll face a thousand setbacks in your journey. So you might as well start now when everyone else is too scared to join the race. You’ll have a head start."
    }
  ]
}
