{"title": "The Helpful, Harmful Sounds of Thumper", "data": [{"type": "sentence", "content": "I somehow extricate my eyes from the screen, feeling the mental drain and shortness of breath of a marathon-runner even though I haven’t left my living room. Has it been two hours? It’s been ten minutes. I trudge off to sleep, almost certain that the jarring percussive tones and red-upon-red hues of Thumper will pay me a visit after my eyes and brain are shut off for the night."}, {"type": "sentence", "content": "Thumper is an intense, tightly-designed rhythm game where you play as a chrome-tinted beetle racing down otherworldly highways and have to correctly match inputs to remove obstacles in your way. Due to its highly abstract yet laser-focused nature, the game can be studied through many different lenses. I could discuss how it does a great job walking the tightrope of game flow, or how its long levels are broken into bite-sized chunks that keeps players engaged even after they’ve failed an inordinate number of times."}, {"type": "sentence", "content": "But — perhaps unsurprisingly, given it’s a rhythm game — I’d like to focus on the role sound plays in Thumper, beyond just providing the background beats for every level."}, {"type": "sentence", "content": "Headphones at the ready?"}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*PkB3Lu1qDxpiSFjwwWKTBQ.jpeg"}, {"type": "subtitle", "content": "Sound as Guidance"}, {"type": "sentence", "content": "Thumper is not an easy game, especially during the later levels. The split-second timing required to get past breakneck processions of barriers from hell can make for some controller-throwing moments. To ensure players stayed engaged and didn’t tap out too early, it was vital for the game to ease them in and introduce elements in a manageable environment early on. Thumper does this very well in its first level, and sound plays an important part."}, {"type": "sentence", "content": "The first action you’re introduced to is the ‘thump’: pressing a button right as a small, square hue shows up on the track."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*hLKD-qed--nimIbA63vXow.gif"}, {"type": "sentence", "content": "The next element is a crimson side panel that you have to bypass by banking a turn at the last second."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*eXEfjx52gUaptsneb2xiuA.gif"}, {"type": "sentence", "content": "The third major element is a hurdle on the track that you have to break through."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*P49AhcaEMih9R4v5RJ7s3w.gif"}, {"type": "sentence", "content": "Now these elements start showing up together in various permutations. Here, Thumper uses sounds call-outs for every element as it shows up on the track. A thump sounds different than a side-panel that sounds different than a hurdle, and this sequence of sounds gives the player a few vital sub-seconds to prepare for the succession of button presses ahead."}, {"type": "sentence", "content": "If it wasn’t already clear from the GIFs above, Thumper is a cacophony of colors at first glance, which can make it difficult for new players to differentiate the elements on the track from the general background. The sounds of Thumper hold your hand here, providing a vital source of secondary stimulus that shape your muscle memory for the more challenging levels to come."}, {"type": "sentence", "content": "The video clip below shows a 10 second example."}, {"type": "subtitle", "content": "Sound as Feedback"}, {"type": "sentence", "content": "Auditory feedback is the spinal cord running through most rhythm games, and Thumper is no different. If you saw the video above, you’d have noticed the sounds that accompany every successful button press, a satisfying mirroring of the call-out sounds of each element."}, {"type": "sentence", "content": "The sounds also change as the player’s timing changes. If you time a turn ‘good enough’, there’s pleasant but muted musical feedback. But if you time a turn ‘just right’, you get a heightened ping as your controller shakes and the beetle glows with glee, telling you beyond doubt that you’ve just done something right."}, {"type": "sentence", "content": "What I find really interesting about Thumper’s auditory feedback, however, is when you get something wrong. The player can get hit twice in the game before they have to go back to the start of the stage, and that first hit is like a vermilion vignette of horror."}, {"type": "sentence", "content": "The video below shows an unsuccessful banked turn. Metallic sparks envelop the screen as the beetle explodes into red dust. For a second, the background percussion and your attempts at rhythm fall silent, replaced with the grating sound of machinery gone wrong. And then the game continues as if nothing happened, resuming its pace while unmindful of your presence. You’re just about able to overcome this setback and get back to the rhythm of the level."}, {"type": "sentence", "content": "Sound is your enemy here, yanking you out of the game’s flow and then plunging you back in like a sword being heat treated. Whenever I get hit once in Thumper, I usually get hit again soon after because the auditory whiplash of the first hit is still fresh in my brain."}, {"type": "subtitle", "content": "Sound as Difficulty Curve"}, {"type": "sentence", "content": "Thumper doesn’t have selectable difficulty levels on the main game menu. This is a risk because the designers have nowhere to hide if players can’t get past a level after finding it too tough. One of the ways Thumper walks this difficulty tightrope is by making the main path (relatively) easy but having a ‘high risk high reward’ path running in parallel for more experienced players to tackle."}, {"type": "sentence", "content": "This branching path technique is something platformers use quite often. In the screenshot below, Mario can take the path on top for safe passage across the pit of spiky circular cacti, but he’ll have to forego the row of coins and tantalizingly placed power-up brick on the lower path. Younger or more inexperienced players will still be able to complete the level, while Mario veterans will still have challenges to sink their teeth into."}, {"type": "image", "content": "https://miro.medium.com/max/3712/1*FBP3zNW78t53e2Ur5leCkg.png"}, {"type": "sentence", "content": "Thumper replicates this idea almost entirely, although its base difficulty is much higher than for most Mario games. Your main path won’t have many things that can kill you (after a bit of practice, at least). You can miss some blocks and not time your turns to perfection and still complete levels. But there are always optional elements on your track to interact with, like rings floating in the air, blocks that require you to change the track you’re on, and alternating sets of blocks and hurdles."}, {"type": "sentence", "content": "Where does sound come into it? You take the more difficult path because that’s how you match the rhythm and beats of the level. You feel a lingering inadequacy upon finishing a level with ‘C’ scores, barely scraping by without really doing what the sounds of the game have asked you to do."}, {"type": "sentence", "content": "So you go back and jump above some spike pits at the last second, bounce up and down to break through rings and hurdles with unerring accuracy, and finish up with a gratifying combination of thumps and banked turns to the beat of the level. Like the video below shows."}, {"type": "sentence", "content": "As you continue hitting every note, you’ll notice other incentives that Thumper provides. Correctly timing a few beats and bouncing down on a block after you’re in the air gives you a health pick-up. In the video below, you can see a block light up in the distance after a successful bounce, which is the health pick-up and restores the beetle’s outer layer of armor."}, {"type": "subtitle", "content": "Sound as (Lack of) Music"}, {"type": "sentence", "content": "You’d be forgiven for thinking that rhythm games usually get more melodious and musical as you get better at them. But something remarkable happens in Thumper if you start making perfect runs through long stretches of a level. The beats get less musical and more violent, every bounce shakes the primordial soup your track and beetle are on, time signatures get warped, and one beat starts before the previous beat can finish. The game doesn’t feel like you belong in its world, and the sounds are making this clear to you."}, {"type": "sentence", "content": "To understand the influences behind this, it’s important to look at how Brian Gibson and Mark Flury, the creators of Thumper, met and started the project. Both Flury and Gibson worked at Harmonix together: Gibson was an effects artist for Rock Band and Flury did UI and menu programming for games like Guitar Hero and Rock Band. But Gibson (who also played in a noise rock band called Lightning Bolt) had some ideas that were too unconventional for Harmonix to consider."}, {"type": "sentence", "content": "In this video on Noclip, Gibson says:"}, {"type": "sentence", "content": "Thumper removes the trappings of conventional rhythm games and goes for something different because it wants you to feel something different, something oppressive and overpowering as you enter a world that’s either outer space or inside your head (or both). Its Lovecraft-meets-hightech visuals are unlike anything you’ve seen before, and its disconcerting music that lacks music is unlike anything you’ve heard before."}, {"type": "sentence", "content": "Gibson says:"}, {"type": "sentence", "content": "In 2015, Flury hosted an experimental gameplay GDC session where he had this to say:"}, {"type": "sentence", "content": "And that’s a perfect way to put it. There’s no better way to sign off than by watching 30 seconds of rhythm hell. Musical? No. Cathartic? Thumping yes."}, {"type": "sentence", "content": "For more stuff on game design, you can visit my Medium profile to read my other articles or follow me on Twitter. Thanks for reading!"}, {"type": "image", "content": "https://miro.medium.com/max/1996/1*rtSuIivUYxMjvgfmwpOiZw.png"}]}