{"title": "The Chamar’s Wife — A Short Story", "data": [{"type": "image", "content": "https://miro.medium.com/max/10018/1*et0MU9Ggf0Mhyf3Cx8BMNQ.jpeg"}, {"type": "sentence", "content": "Chamar: widespread caste in northern India whose hereditary occupation is tanning leather; the name is derived from the Sanskrit word charmakara (“skin worker”)."}, {"type": "sentence", "content": "At first, I thought it was magic: the Earth suddenly crying. I thought I’d finally found something to make my father and I rich. A creature that cried like a human, one I could sell to the circus in the city. But it wasn’t. It was just a baby. I didn’t tell anyone. I left it there, crying and drowning in the dirt again. I was a few years older when I learned that many fathers here chose to bury their girls. It was old news — centuries-old — but it was still new to me. I must have wondered over a hundred times what had stopped my father from doing the same. I’ve never asked. I soon learned he doesn’t do the same things as all the other fathers: he refuses to lower his head when the Thakurs talk back to him, he rarely pauses when he enters a sacred space not meant for us and he never accepts money from uncomfortable men even when he’s got nothing but the clink of a few rupees in his shirt pocket."}, {"type": "sentence", "content": "His defiance has become an annoyance."}, {"type": "sentence", "content": "“Father, please. Do as they tell you.” I plead. The sun bleeds hard, consuming me with its severity."}, {"type": "sentence", "content": "“Beta.” He rests his thumb on my chin. “You’re too young to understand and that’s okay but please don’t involve yourself in this."}, {"type": "sentence", "content": "“Father, I don’t think less of you.”"}, {"type": "sentence", "content": "“I know you don’t but they do.” My father spits and it lands on the officer’s polished shoe. The officer looks at the froth, his steady breath turns hard and heavy."}, {"type": "sentence", "content": "“Get rid of these creatures. Clear the road!” The officer’s eyes refuse to meet my fathers."}, {"type": "sentence", "content": "“No.” Father insists."}, {"type": "sentence", "content": "The pack of bodies around us murmurs to themselves, the meek ones walk away. I stay because I’m his daughter."}, {"type": "sentence", "content": "“You should listen to your daughter, old man. Instead, you are choosing to make the situation ugly.”"}, {"type": "sentence", "content": "“Do your worst. Today, I refuse to pick up carcasses. If you want them gone, you do it,” my father replies."}, {"type": "sentence", "content": "The officer looks down at his shoe. The froth has slid into the mud, revealing again the pristine leather that protects his feet. “So be it,” he says. He tells me to step aside."}, {"type": "sentence", "content": "I’ve seen it happen before, so I let go of my father’s forearm."}, {"type": "sentence", "content": "The officer provides a hand signal to the two others behind him. As they approach us they shake off their lathis and begin hitting them against my father’s brittle body. A series of white lines appear — flashes of lightning — as the wood bounces off brown skin. The lines become pink, and red spots begin to appear where the lathis have met the skin more than a few times. My father alternates from holding his lifeless palms together to ramming flying hands at my feet instructing me to stop watching. But all I can do is watch and teach myself not to do as my father does."}, {"type": "sentence", "content": "Once the men realize my father is nothing more than a sack of sore skin, they walk off, leaving me to carry the burden back to our shack. The rice and milk father earns will soon be gone. What will we eat tomorrow? He brings problems to our door and I have to endure the consequences. I’m angry at him for making me think of my mother in such a way: only wishing she were alive so that she’d have to take responsibility for his actions. I know I should look after him but he makes it feel like a chore. If I don’t have a problem with him picking up carcasses then why does he?"}, {"type": "sentence", "content": "I put my father down softly on the charpoy. He muffles a groan for my sake. It still hurts."}, {"type": "sentence", "content": "“Try to rest. You’ve done enough for one day,” I scold."}, {"type": "sentence", "content": "He coughs as he tries to speak but still he persists. “Beta, if I don’t try to change our situation, it won’t change.”"}, {"type": "sentence", "content": "“Why you, father? There are lots of other men in the village. Let them change things.”"}, {"type": "sentence", "content": "“Who? Who else is willing?” He coughs again, this time with full force."}, {"type": "sentence", "content": "I hand him the last pot of water. “They won’t listen to you. The policemen don’t even look you in the eye.”"}, {"type": "sentence", "content": "“I don’t want them to look at me. I need them to hear me.”"}, {"type": "sentence", "content": "“Well, they don’t.”"}, {"type": "sentence", "content": "“Disobedience isn’t respectful and disrespect is worse than death for them”"}, {"type": "sentence", "content": "“You keep disrespecting them and they’ll keep beating you. Is that what you want?”"}, {"type": "sentence", "content": "“If it changes our — ”"}, {"type": "sentence", "content": "“— You won’t be able to change anything, father. No-one will ever swap jobs with us. Just look after yourself and do as you’re told.”"}, {"type": "sentence", "content": "“I’m doing it for you.”"}, {"type": "sentence", "content": "“And I’m trying to look out for you.”"}, {"type": "sentence", "content": "“It’s my job. I’m the parent.” He looks at me, opening his lips as if to say something but closes them again. He looks down at his blood-spotted bare feet. “It’s my duty,” he says, softly."}, {"type": "sentence", "content": "“You and your duty. Duty won’t protect you, father.”"}, {"type": "sentence", "content": "“Beta, we are slaves, and slavery in every scope of the word is a sin.”"}, {"type": "sentence", "content": "“I don’t want to know what is a sin and what’s not. I’ve already lost my mother. The least you can do is look after yourself.”"}, {"type": "sentence", "content": "He doesn’t respond. Instead, he turns his head toward the brick wall. He wants me to know he would like to rest. Although, he’s far from resting. He may think he’s perfected the art of silent weeping but I’m not oblivious to it. Again, I’m forced to think of my mother in a peevish mood. My father didn’t have much to offer her but his integrity, except, I had always felt as though she too had wanted him to be like the other men in town. “Suraj earns twice as much rice as we do just for cleaning the lavatories on time and I heard Anil earns money now,” she’d tell him. I think her envy made him feel inadequate; “I don’t even get to shit in peace,” he’d reply. He used to get called away mid-shit. Not that smell is something he’d have to worry about because our village is shit-scented. He used to tell her that’s why Goddess Lakshmi doesn’t call upon us. Said he tried his best to keep things clean but in doing that, it made him feel far dirtier. “Standing up for oneself trumps asking Goddesses for Wealth,” he’d mutter before going off to work. I think mother died from resentment as much as from having a fever."}, {"type": "sentence", "content": "I sigh, deeply."}, {"type": "sentence", "content": "“Father, you say you have to look after me, then…it must be my duty to do your job when you cannot. If I were a boy, you wouldn’t refuse.”"}, {"type": "sentence", "content": "“You are not a boy.” He turns his head."}, {"type": "sentence", "content": "“And, yet, look: hands and legs to do the job.” I shake my limbs in front of his face."}, {"type": "sentence", "content": "“Listen to me. You’re not strong. You cannot deal with that kind of weight.”"}, {"type": "sentence", "content": "“You manage.”"}, {"type": "sentence", "content": "“Don’t get smart with me, child.”"}, {"type": "sentence", "content": "“Well, you can barely breathe. So, try and catch me.”"}, {"type": "sentence", "content": "As I run out into the mud-ridden street, I can hear my father cough and yell out: “Akku, don’t let them beat you. Akku. Akku!”"}, {"type": "sentence", "content": "The difference between dead birds and dead cattle, aside from the weight, is it’s difficult to ignore the faces of larger animals. The calf I stand over has a bewildered look; death dared to consume it. The only consolation it had was to be considered divine. Whereas, no-one ever cared about the birds in the first place. Not that it’s a problem. The real problem lies in moving the large creatures. I cannot think how to do it alone. I want to prove I can do the job. Prove to father that it wasn’t in vain keeping me alive. I can be valuable instead of expensive. Except, it’s far from easy. I can’t drive a vehicle and if I’m spotted dragging it, I’ll probably get accused of wanting to eat it. I don’t want to be a menace like my father. I don’t want to be beaten. I struggle to push the dead calf into the grass. I’ll come back for you, I whisper, to nothing but flesh that ripens under the sun."}, {"type": "sentence", "content": "The community farmer tells me he cannot financially afford to burn cows this month. He tells me to go and make a deal with the local Chamar. “Tell him I sent you,” he says, giving me directions. Twice. As though my visit would somehow benefit him too."}, {"type": "sentence", "content": "The Chamar’s place is a long walk; past the tin shanties of our neighborhood and the row of clumsy market stalls that squat in the center of the city. A little further from the smoky highway sits an introverted building in the middle of a large open field — as though it’s hiding on purpose. As I get closer, a nauseating stench leads me to the perforated, brick-topped structure. It’s housed behind an unlocked heavy-wooded gate that tries to test my strength as I push it open. I’m met with two doorways: one has a charpoy placed outside it. Heavy tan-colored fabrics sit on top. A mud-covered scooter lays on the floor, unloved."}, {"type": "sentence", "content": "I walk through the other doorway. The tangy odor becomes so thick, I’m forced to hold my nostrils shut. Inside, a grey-haired, wrinkle-cheeked man rubs hard at the red on his yellow-stained vest. Fabric, the same as that outside (although not as shiny) lay beside his bare feet. Hardened white bits peek out from the sides of the fabric. Behind him stands another man: younger and emaciated. He sees me and taps the older guy on his shoulder, who upon noticing me, throws down the rag from his hands. “Hey, get away. This is no place for a girl.”"}, {"type": "sentence", "content": "“What are you doing?” I ask."}, {"type": "sentence", "content": "“I told you once, get away from here.”"}, {"type": "sentence", "content": "“I was asked to come here.”"}, {"type": "sentence", "content": "“We are skinning dead cows! Happy?” The younger guy pipes up."}, {"type": "sentence", "content": "“Why?”"}, {"type": "sentence", "content": "“What, why? There is no why?. This is our job. Stop asking silly questions and go home.” The old guy says."}, {"type": "sentence", "content": "“What are you going to do with them?”"}, {"type": "sentence", "content": "“Again, with the questions. Get lost, go on,” he says. But after muttering something to himself, he walks off."}, {"type": "sentence", "content": "The younger one, his son. The one who has been eyeing me as if I were his dinner, walks toward me."}, {"type": "sentence", "content": "“Hey, why are you asking all these questions?” He demands."}, {"type": "sentence", "content": "“I want to know why your father is skinning the cows.”"}, {"type": "sentence", "content": "“Are you stupid? Do you not know where you are?”"}, {"type": "sentence", "content": "I let his commentary slide after reflecting upon it."}, {"type": "sentence", "content": "“He makes money, you know. And he’s not my father, he’s my uncle. But I still get the business when he dies.”"}, {"type": "sentence", "content": "“How can you stand by and let him do this?”"}, {"type": "sentence", "content": "“Skin the cows?” He smirks."}, {"type": "sentence", "content": "“Do you kill them? You could get beaten, you know.”"}, {"type": "sentence", "content": "“People from Ahmedabad come to buy the hide. The bones and hooves go to merchants in Rajasthan. And…we take the meat. Happy?”"}, {"type": "sentence", "content": "“So, you ravage their entire body?”"}, {"type": "sentence", "content": "“Hey, it’s our job.”"}, {"type": "sentence", "content": "Why do the men around me insist on reminding me they have a job to do?"}, {"type": "sentence", "content": "“They make pottery out of bones, you know. Not that you can afford it.” He runs his hand through his hair as if he were a Bollywood stud instead of a dusty-haired boy who pounces on dead meat."}, {"type": "sentence", "content": "“That’s disgusting,” I say."}, {"type": "sentence", "content": "“It’s just bones.”"}, {"type": "sentence", "content": "“It’s just bones.” The urge to mimic him creeps up on me like a swarm of mosquitoes after the rain."}, {"type": "sentence", "content": "“Hey, know your place, girl. You can’t speak to me like that.”"}, {"type": "sentence", "content": "The boy looks me in the eye and holds his stare. He knows I don’t have anything more to say, and I’ve had enough of this sad place so I leave."}, {"type": "sentence", "content": "I don’t tell them about the dead calf."}, {"type": "sentence", "content": "Father is asleep but he’ll be up soon."}, {"type": "sentence", "content": "I put the rice to cook on a fire outside the shack so the clatter doesn’t wake him."}, {"type": "sentence", "content": "When the dish is prepared, I call out to him."}, {"type": "sentence", "content": "“Father.”"}, {"type": "sentence", "content": "“Father.”"}, {"type": "sentence", "content": "“Father! The rice is ready.”"}, {"type": "sentence", "content": "He doesn’t respond."}, {"type": "sentence", "content": "After my father’s death, I took our possessions, along with my newly-found independence and laid them out in different parts of the town. The worst had happened and I no longer had no-one to worry about. I thought solitude would be liberating but it’s overwhelming. So I’ve set up on a small patch of balding grass near a block of suburban flats. I like to observe the life of its female residents. Their daily routines bring me comfort. Although, their maidservants do most of the hard work. Every morning, their glass balconies are adorned with freshly-washed clothing: vibrant salwars and sarees, fancy undergarments and white shirts that hang beside different styles of school uniforms. Toward the top of the building, I can hardly make out whether the clothes belong to a girl or boy. I also get to speak with other women — of my kind, who go about tending to the communal gardens outside the flats. The building’s white walls provide relief from the midday sun when I bathe. Sometimes, I notice the female residents watching me from their balconies. What pleasure they get I do not know. Perhaps, they wonder why I bathe outside. I’m sure they can see how small my shack is, it barely fits a charpoy and a few cooking utensils let alone space to freshen up. Still, I don’t mind the women, it’s when their husbands look that I wish I could crawl into myself. The wives are pretty, I can only imagine their butter-soft skin. Some wear gold necklaces that glide down the middle of the curves of their chest. Curves that look like they’ve been obtained from feasting on more than a healthy amount of food. The sight could make you believe goddesses lived on earth. Mother used to tell me I have a nice face. “You have the perfect amount of space between your eyes that when it comes to marriage, no one will even notice your stick-thin form. Just stay away from those city men. They want nothing from you except your vagina.” Mother wouldn’t be too pleased with my setup here."}, {"type": "sentence", "content": "I don’t pick up dead animals anymore. I didn’t refuse. I just left it. Who’s going to come and find me? No-one. Only the men get hassled to take such jobs. Lucky for me, the government doesn’t care about me. Also lucky for me that my father kept my mother’s old sewing kit. Only a few items remain now: a slightly-curved needle, black, red and white thread — the essentials, and a few bobbins. Not that I’d need them because they are no use without a machine. Father brought them for mother on what he thought was her birthday. Even my mother didn’t know the date of her birthday. He’d promised that one day he’d buy her a sewing machine, a second-hand one, of course, but he’d buy her one nonetheless. It doesn’t matter now. The threads I own are enough to make the money I need. The work comes in bits and pieces from the women who tend to the building. A little wear and tear don’t bother them, it’s only when the holes in their blouses reveal more flesh than they’d like that they are forced to have them mended. Once in a while, they’ll bring around their husband’s clothes; missing shirt buttons and unruly trouser hems. Small things that they can afford to get done. I’m sure they can do it themselves but they take pity on me. And I’m grateful because their clothing calamities are enough for me to buy myself some rice. The boy whose vegetable stall I pass on the way to buy the rice saves me leftover scraps of coriander and spinach. Gives them to me for free. When his father mans the stall, I come back with just the rice. Last week, the boy gave me a few tomatoes. I don’t like tomatoes but I can hardly tell him that when he’s kind enough to give them to me, so I threw them to the stray dogs when he wasn’t looking."}, {"type": "sentence", "content": "“Ey.”"}, {"type": "sentence", "content": "I look up to find a formal figure standing over me. He’s a resident of the building, I recognize him because he’s the only man who has a personal driver; one that picks him up in the morning and drops him home late in the evenings. Most of the men drive themselves. He wears a white band around his neck and a black gown which means he works for the government. What he does, I don’t know."}, {"type": "sentence", "content": "“Ey.” He snaps his fingers."}, {"type": "sentence", "content": "Whoever he is, he’s aware of his importance. “What is it?” I ask politely, hoping it might buy me mercy."}, {"type": "sentence", "content": "“You need to move from here.”"}, {"type": "sentence", "content": "“But this isn’t your land. That’s your land. I point to the flats.”"}, {"type": "sentence", "content": "“Don’t get smart with me, girl.”"}, {"type": "sentence", "content": "“But…I’m not a nuisance.”"}, {"type": "sentence", "content": "“Hey, just leave from here. Leave before I beat your ass.”"}, {"type": "sentence", "content": "He peels open his black gown and pulls out a white napkin from his trouser pocket. He shakes it out and walks to my shack. He lifts my utensils using the napkin as protection and starts to throw my belongings out onto the mud. Doesn’t he know that I probably have more chances of catching his goodness than he does of catching my broken identity? The laying stray dogs rise from their resting positions."}, {"type": "sentence", "content": "I decide to leave voluntarily before he beats me."}, {"type": "sentence", "content": "“Leave my stuff. I’m going.” I tell him."}, {"type": "sentence", "content": "“Good. Don’t dare to come back,” he says as he drops the napkin at my feet. The dogs bark at him. He tries to kick one from the group but it runs off. I shake off the white napkin and keep it. It’s far from dirty. Leaving my possessions behind, I head to the Chamar’s place."}, {"type": "sentence", "content": "Even though I haven’t been here since my father died, the place feels familiar. Even the stench of cattle death reminds me of him. I wait at the heavy gate feeling it’s weight in my chest. I want to go in but my father’s voice won’t leave my ears. ‘Never take decisions based on the wrong motive.’ I have to reassure the voice that what I’m about to do is precautionary, not careless. Surely even my dead father would understand, this is not a matter of morality but one of survival. And with that thought, I step inside."}, {"type": "sentence", "content": "“What are you doing here? This time of night,” the boy says, rubbing his eyes. He keeps looking back to make sure he doesn’t wake his uncle who is sleeping on the floor a few feet away from the drying cow skins."}, {"type": "sentence", "content": "“I have something to ask you,” I tell him."}, {"type": "sentence", "content": "“Then ask.”"}, {"type": "sentence", "content": "“Why were you staring at me when I first came?”"}, {"type": "sentence", "content": "“What else am I supposed to do?”"}, {"type": "sentence", "content": "“Well, does it mean you might like me?”"}, {"type": "sentence", "content": "He grins. “I might,” he says."}, {"type": "sentence", "content": "“Then…Do you want to marry me?”"}, {"type": "sentence", "content": "“You can’t ask, you’re a girl.”"}, {"type": "sentence", "content": "“And?”"}, {"type": "sentence", "content": "“You have no father, you have no dowry.”"}, {"type": "sentence", "content": "“How do you know about my father?”"}, {"type": "sentence", "content": "“Your father used to come here long before you, now he’s stopped coming. He’s either dead, or he’s skipped town.”"}, {"type": "sentence", "content": "“He’s dead.”"}, {"type": "sentence", "content": "“Fine. I’ll marry you if you skin my cows.”"}, {"type": "sentence", "content": "My heart climbs its way to my throat as if it were trying to warn me of a decision I would soon regret. I’m not being forced or ordered. Why does it need reassurance? It’s my choice. I have the choice to be a woman and not an orphan. I can have company instead of roaming these streets alone. I can have a roof over my head instead of being kicked out of one. It’s not like this house is any bigger than mine but it’s stable, even with its hole-ridden exterior."}, {"type": "sentence", "content": "“Fine.” I hold my clammy hand out for him to shake."}, {"type": "sentence", "content": "“Put your hand away and kiss me.” He gathers his lips."}, {"type": "sentence", "content": "“No.” I shriek, as if this request was somehow worse than his previous one."}, {"type": "sentence", "content": "“Hey, this is not a business deal. You’re not a vendor. You’re asking to be my wife. You do understand what a wife’s duties are, don’t you?”"}, {"type": "sentence", "content": "“Yes, I do.” I say it with authority because I don’t want him to think I’m a silly little girl. I move forward and kiss him on the lips as he’d asked."}, {"type": "sentence", "content": "He smiles, as though he’d been blessed with something he’s never prayed for."}, {"type": "sentence", "content": "It’s been six months since our wedding; a small affair: Manoj, me, his uncle and his uncle’s girlfriend — he had a few but this one was brave enough to be seen with him in public. Not that anyone would have recognized her because the ceremony had taken place in the next town. The girlfriend: Sheetal, was more than happy to help me get ready. She told me it was the first time Manoj’s uncle had invited her to a family function. She said it was a sign that their relationship could also end in marriage. Whatever the reason, I was happy to have female company. Plus, Sheetal had brought make-up with her. It was all half-used stuff. She had either found it in the scraps or stolen it from somebody’s home. I had a feeling it was stolen. She seems like the sort of lady who could pull off a robbery, one with a daring look in her eyes — the look of someone who tested her capabilities. Manoj’s uncle had also instructed Sheetal to go and pick up an outfit for me. The saree was an explosion of crimson with burnt gold embroidery; the prettiest piece of clothing I have worn in my life. We sold it after the ceremony. I would have liked to keep it but Manoj said we need the money more than we need an attachment to memories. “You want to eat life when all we taste is death,” he’d repeated. Sometimes, I think he awaits the liberation of death just so he’ll be free from having to decipher his existence. Unlike father, he has no desire to fight. Not that he has to fight much. These days, he roams around town a lot more than usual. Mostly, he is out with Sheetal. After his uncle died the two of them became close. They drink a lot when they are together because I can smell it on his breath and his clothes. The first time he came home drunk I told him I didn’t like it and that he shouldn’t do it again. I told him how my father never drank. Father said that men who had troubles shouldn’t drink because every glass will add more trouble and subtract none. Father never had a death wish either — at least not from alcohol. It’s dangerous in a dry state like ours. Who knows where it comes from or how it’s made, especially for people like us. Manoj didn’t appreciate me looking out for him because he told me to stay out of his business. “You’re lucky you were born a girl, otherwise you’d get a slap,” he’d said. I didn’t push him on the topic again."}, {"type": "sentence", "content": "I focused my efforts on getting better at skinning. The trick lies in a sharp knife and steady hands. Although, my hands are never steady anymore. The knife helps pull the skin away from the muscle and bone. The skin becomes rough after the animal is dead. Since becoming pregnant, though, the smell has become unbearable. The oils and salts do not carry distinct scents anymore; they have merged together, with the further smell of sour meat. I dare not close my eyes when I’m working, I’m afraid to wake up in something worse than an apocalyptic warehouse. But the leather brings us money — for now, at least. Manoj says the government will soon stop us from skinning for leather. They want to make sure the reputable tanneries in Chennai take care of it. Manoj is furious. I’m glad. The few times I’ve asked him if he can do the skinning he reminds me that I came with no dowry. Sometimes, I get into a rage and the only solace I can offer myself is to spit in his tea but I soon regret it. After all, he gave me somewhere to call home. Ingratitude would be a sin."}, {"type": "sentence", "content": "As usual, Manoj rushes in and sits down cross-legged. Ready to be fed."}, {"type": "sentence", "content": "“Give me something to eat.”"}, {"type": "sentence", "content": "“I’m just finishing up,” I tell him."}, {"type": "sentence", "content": "“Well, hurry it along. I’m hungry.”"}, {"type": "sentence", "content": "My heart beats the fastest when he sits for dinner because my cooking abilities fail to meet the urgency of his hunger."}, {"type": "sentence", "content": "“It’s ready,” I assure him."}, {"type": "sentence", "content": "As I take the rice off the heat I learn that I have picked the pot up with my fingers. I slam it down. Beads of rice bounce and land on the floor. I scoop up the white blobs and place them in the dish with the tea and pickle. I catch Manoj watching me. He’s angry. I know it’s not because I’ve put dirty rice on his plate — we can’t afford wastage. He’s angry because of the bursts of stupidity I’ve been displaying lately. How do I explain to him the pregnancy is making me forgetful when he struggles to understand why my morning sickness interferes with the job of skinning."}, {"type": "sentence", "content": "I hand him his food."}, {"type": "sentence", "content": "He hands me a paper parcel that he kept hidden behind his back. “Take”. He shoves the parcel at me."}, {"type": "sentence", "content": "“What’s it?” I ask."}, {"type": "sentence", "content": "He doesn’t say and begins eating. Fingers deep inside his mouth."}, {"type": "sentence", "content": "I unwrap the newspaper. It holds a crumbled-apart piece of laddu."}, {"type": "sentence", "content": "“Sheetal told me to give it to you. Because…” He looks at my stomach as if he weren’t a part of what we’d made. “…You are pregnant.”"}, {"type": "sentence", "content": "“Sheetal sent? You didn’t think to buy?”"}, {"type": "sentence", "content": "“What difference does it make? You got extra food today. You should be happy.”"}, {"type": "sentence", "content": "“I am happy.”"}, {"type": "sentence", "content": "“Let me eat in peace.”"}, {"type": "sentence", "content": "We eat in silence. Not that I’m complaining, this is my life. Slightly altered but the same. It’s not the same as my parents’ evenings, of course. Mother loved to talk a lot and Father never asked her to stop. He listened to her stories so that he’d have someone to listen to him. They exchanged conversation which often led to arguments. The arguments were hardly bitter even though the talk was not all sweet. They are the reason I like to talk, but no-one likes to talk to me. Not unless they want to tell me what to do. Manoj doesn’t have any stories. If he does, he chooses to tell Sheetal them instead. He’ll probably tell her how I got offended because she sent food. She’ll laugh but understand why another woman chooses to dislike her. Then she’ll comfort him in ways I cannot. It’s not funny but I giggle because he’s clumsy in the bedroom. A boy trying to imitate a man. I don’t have anyone to compare him to but she will. Manoj looks at me, his thick eyebrows turned up out of irritation rather than curiosity. “It’s nothing,” I tell him. He continues with his dinner. Suddenly I realize marriage hasn’t made a woman out of me, it’s just stripped me of the naivety I possessed. Maybe that’s what it means to be a woman."}, {"type": "sentence", "content": "I have a recurring dream: my mother hovers over my body, as ghosts do. I’m always in labor. It’s going to be a girl. “You’ve put on weight everywhere”, she tells me. “I don’t want it to be a girl”, I say. “How do I raise her how a girl is supposed to be raised? Help me, ma,” I cry out, but every time, she ignores me."}, {"type": "sentence", "content": "In last night’s dream, my mother laughed hard at me before morphing into Manoj. He was shouting at me: It’s a girl. It’s a girl. You stupid woman. We cannot have her. He snatched her by her legs as if she were made of rubber; unable to be broken. He threw the baby to Sheetal who let her fall on the floor. She wasn’t Sheetal anymore. She was a wild predator who sank her teeth into the plastic doll that lay under her. I let no more tears fall; I’d given birth to a doll, not a baby, what use was it? The animal shot me a look with its piercing black eyeballs, smug, as if they saw something I didn’t. As if the doll would bring the creature sudden prosperity."}, {"type": "sentence", "content": "I wipe sweat the dream left off my forehead and chin with the corner of my saree but the fabric is slippery and leaves a sticky film of wetness over my face. Manoj is sleeping on the floor beside me, breathing heavily through his mouth. He doesn’t have the best of profiles, his prominent nose makes his small chin appear nonexistent. I wonder what Sheetal sees in him. Is she the reason he hasn’t taken an interest in this baby? It’s been so long I can’t remember his reaction to hearing I was pregnant. I try to recall it but it doesn’t come. But you remember people being happy, don’t you? Manoj has never been happy. I place both hands over my bump. What if you’re a girl, I whisper to it. If your father is anything like the Manoj I dreamt about, he’ll probably bury you where the cattle bones are kept or he’ll ask Sheetal to sell you. God knows we need the money more than we need the attachment to unwanted babies, he’d say. And what will your mother do when your father is getting rid of you? I whisper again. The women my mother knew held their stomachs up and carried on with their days, tending to the cooking and cleaning, frantically erasing the nine months gone. Not long after, they’d be pregnant again. They’d ask my mother to pray for them: Pray for a boy. What use was that when her own prayers hadn’t worked. Most had girls again that would soon disappear. The mothers would too if they had a girl three times in a row. I don’t want anyone to pray for me. Whoever is inside, it’s mine. There’s nothing else in this world I can call mine. I’m disposed to it. But does it trump the duty I have towards my husband? Without an elder present, I have no-one to ask. No-one to confide in. Perhaps I should be glad. There are elders who offer ill-intentioned advice. Mothers who side with their son’s choices, no matter how gruesome. I’ve heard stories."}, {"type": "sentence", "content": "I sigh."}, {"type": "sentence", "content": "The duty I’ve been fulfilling as a wife feels airless and violent. It feels different to the duty my father had shown toward me. Even though it was filled with pain it seemed as though his rebellion had inflicted some satisfaction that couldn’t be understood."}, {"type": "sentence", "content": "A pang of remorse — or maybe desperation, finds me. Question upon question fills my head: where will I go? How will I live? What if it’s a boy; do I need to go? What if it’s a girl? Will Manoj care? Despite them, I scan the room for a clue to where Manoj keeps all the cash, but he shuffles and begins to peel open his eyes, as though he knows what’s going through my head. I let the idea evaporate as I lay back down. I cover my belly with my saree. I arrive at the conclusion that Manoj wouldn’t care that I’ve gone, just that I’ve taken the money."}]}