{"title": "Kaleidoscope Girl", "data": [{"type": "image", "content": "https://miro.medium.com/max/5476/1*CZ2FVl7aQ85dYbR3qCJRbg.jpeg"}, {"type": "sentence", "content": "I bought a mobile home ‘cause I was recovering from heartbreak. That’s what I said, anyway. Because there were questions, you know. Not very common to see a 20-year-old single gal move into a mobile home park. It was a tight-knit crew at Eden Springs Mobile Home Community and they were rather nosey. I would tell one thing to Cheryl from Unit #27 and Louisa from Unit #44 would casually ask me about that very same thing. So I was light with the detail, heavy on the “yes ma’am” and “no ma’am” and I had my signature line “recovering from heartbreak” that I could use when they were really prying."}, {"type": "sentence", "content": "It wasn’t the normal kind of heartbreak, at least the ones Cheryl, Louisa, and Mari were familiar with, anyway. But calling things different names didn’t make it hurt any less."}, {"type": "sentence", "content": "It had to be hard, loving someone like me. I was an amalgamation of sitcoms my Nana used to watch, songs I heard on the radio and lines other people told me that sounded nice enough to repeat. I was a kaleidoscope of references I couldn’t place and opinions that didn’t belong to me. I had no fixed personality or preferences of my own, so I reflected those around me."}, {"type": "sentence", "content": "That’s why I felt for Travis, because it had to be hard, loving someone who wasn’t a real person at all. He had to be content with forever being my #2. Because no matter how many summer afternoons he and I spent kissing on the couch, no matter how many times he would grin down at me that I was his very favorite girl, no matter how many days he worked on cars to provide for me, it was never really about him."}, {"type": "sentence", "content": "It used to be so fun."}, {"type": "sentence", "content": "It was Fourth of Julys and bottles of Jim Bean being passed in the back of pickup trucks. It was running from car to car at the drive-in with brown bags and drinking until dawn with all of my friends in the Motel 6. It was the first sip of white wine in the summertime down by the lake and drunk kissing behind a tree. It was pouring vodka into water bottles with my gal pal Charlie to bring to school and giggling all through geometry."}, {"type": "sentence", "content": "Charlie and I thought we were hot shit because we could spit back the rhetoric the older guys we drank with had told us about how school was devised to combat our original thoughts and turn us into cogs in the machine. But Charlie and I really didn’t have any original thoughts of our own. We had submerged them in so much Burnett’s they didn’t have a fighting chance to emerge. So we repeated their thoughts and we thought we were cool for it."}, {"type": "sentence", "content": "And we were. Cool, that is. No one else in our grade was drinking with the older boys, riding around in Mustangs, raising hell all around Savannah. They picked us and we were special for it."}, {"type": "sentence", "content": "I don’t remember ever deciding to be with Travis. I was wasted, he was interested in me and he was old enough to get me any kind of alcohol I liked, so I let him press his lips to mine. He was a mechanic and he had a car, which was mighty impressive when I was 15. Best of all, he was in love with me, so he would do anything for me."}, {"type": "sentence", "content": "Charlie went away to school once we graduated, which I thought was just the silliest damn thing I ever heard. All that talk we were always spitting out about how school is an establishment designed to entrap us and here she was, all chipper in her Georgia State gear, all jazzed up for rush week."}, {"type": "sentence", "content": "“Charlie, promise me,” I asked her while we were drinking by the riverbank with the boys for her going away party, “Promise it’ll be just like it is now when you come back to visit?”"}, {"type": "sentence", "content": "“It will be, I swear it” she giggled, that signature toothy Charlie laugh I loved so much. It was the soundtrack to the best memories of my life, “We’re always going to be best friends. I promise.”"}, {"type": "sentence", "content": "We pinky-promised while the boys shot fireworks into the sky. I embraced her while they popped above us into the inky night and the boys howled at the moon."}, {"type": "sentence", "content": "I really thought it would all be the same when she came back, with the Motel 6 parties, the brown bags, and the mischief."}, {"type": "sentence", "content": "It was different the next summer, though. She was different. She had all of these stories and all of these new friends. She was taking online classes. Her hair was straightened from the brown mop of curly brown hair she used to let run wild. She would stop drinking every night by 11pm to make sure she was in the right frame of mind for studying the next morning."}, {"type": "sentence", "content": "And she asked me questions about me, which was the worst part."}, {"type": "sentence", "content": "“What about you?” she asked when she picked me up in her Buick to go meet up with the guys at the drive-in, “What have you been up to?”"}, {"type": "sentence", "content": "I shrugged, “Y’ know. Drinking. With Travis. Figuring it out.”"}, {"type": "sentence", "content": "There was something in her eyes I couldn’t figure out. She had her sorority, her passion for nursing, her preppy friends, her frat boyfriend. I was a nothing girl, no stories beyond the ones I saw on television, nothing to show for the past year besides a hell of a lot of empty bottles. I wanted to plead with her, to ask her why she would leave me, why didn’t she tell me we were supposed to move on with our lives? We had made a pinky promise, didn’t that mean anything?"}, {"type": "sentence", "content": "But rather than say anything of the sort, I just drank myself into darkness and I was told by Travis later, I screamed at her about how she forgot me. These screaming fits were becoming more and more common when I drank, spitting venom at whoever was in front of me just like my mama used to do."}, {"type": "sentence", "content": "That was the last night I saw her."}, {"type": "sentence", "content": "When Charlie moved to Atlanta, I moved in with Travis to his condo in Pooler, which was about 10 minutes from where I lived with Nana in Savannah. He was a mechanic, a mighty good one too. He could just put his hands on a vehicle and know what the hell was wrong with it. With women, he didn’t exactly have the same ability. When it came to putting his hands on my body, that is."}, {"type": "sentence", "content": "I loved living with him anyway, because he didn’t ever ask me to figure it out. He let me drink all day to watch television programs and listen to records. He let me talk nonsense to him when I was wasted about how the clouds looked like the color lilac, when he knew very well they were just grey. He would nod when I told him about my dreams of becoming an actress. When you’re drinking, you can turn grey clouds into lavender, a day watching television into an adventure and a girl into an actress. He was fine with letting me live in my dream world, so long as I was there when he got home from work and I still grinned up at him, his girl, his sanctuary after dealing with the long, hard days of his work."}, {"type": "sentence", "content": "I wasn’t a complete piece of shit, okay. I cleaned, I grocery shopped for the two of us, I cooked him dinner every day. I called my Nana every afternoon. I had a glass of Jim Beam waiting for him once he returned every night, exhausted and covered in grease. I sat on his lap while we watched television and I tousled his hair with my fingers. We were dirt broke but we had each other, we had a television that worked most of the time, the oven was out but the stovetop worked just fine. We cuddled on the couch we bought at a yard sale at the side of the road. He didn’t tell me what the money was really like, but he always managed to pass me two twenties to get the groceries and the alcohol for the week on Fridays with my fake ID. He didn’t ask me to get a job or to limit my drinking. So it suited me just fine."}, {"type": "sentence", "content": "And that was it — we had drinking. Doesn’t matter where you are if you’re drinking. Our little universe, with game shows, records, dreams that would never come true and Jim Beam, made us feel like we were royalty. Weekends we would drink by the river or set fireworks in the fields with his friends, bottles in hand and electricity through our veins."}, {"type": "sentence", "content": "I used to think we could be anywhere, we could get through anything if we just had each other. I now think it’s just cause we had booze."}, {"type": "sentence", "content": "I dunno when exactly I realized I was in love with alcohol. I loved Travis, our little home and our little life."}, {"type": "sentence", "content": "But I loved drinking so much more. It was my real first love. Pressing my lips to the bottle was the truest form of home I’ve found. I got butterflies every Friday when Travis left out $40 bucks and I could go buy more alcohol with my fake ID. Drinking, I felt more confident, more sure of myself, more like a real person than just a combination of sitcoms I half-heard and lyrics I remembered incorrectly. You’re telling me something that makes you feel more like yourself isn’t true love?"}, {"type": "sentence", "content": "All I knew is I began to love drinking more than I loved anything in my life and it was the only thing I ever felt like doing. I got increasingly anxious waiting for Travis to get home so I could pour us glasses and get back to the living, until I just started drinking before he got home."}, {"type": "sentence", "content": "Nana could hear the inebriation in my voice for our 2pm balcony calls, I’m sure of it. Both of her daughters had gone down this path and I’m sure it broke her heart to see me fall in love myself."}, {"type": "sentence", "content": "I knew I had a problem on my 20th birthday. I drank because I was nervous that Charlie would call to wish me a happy birthday, or maybe it was because I was even more scared she would forget. By 11am I was shitfaced, stumbling down the hallway singing happy birthday to myself. I laughed when I realized it. Houston, we’ve got a problem. It struck me incredibly funny to have an alcohol problem when I was still below the legal age of drinking in this country. So I giggled and drank, giggled and drank, and I was passed out by the time Travis got back from work."}, {"type": "sentence", "content": "When I got the call Nana passed away, I was wasted. I tried to remember the last time she and I had talked and the last conversation we had. I tried to remember the last time I had Travis drive me out to see her. I couldn’t grasp anything firm, it was so waterlogged in all of the boozey memories."}, {"type": "sentence", "content": "It made me feel so helpless, like that last night I saw Charlie. I wanted to scream at Nana — why didn’t you tell me you were going to die? Why didn’t you tell me you were getting older?"}, {"type": "sentence", "content": "But hell, maybe she did. I couldn’t remember the last damn conversation we had. Her last thought here on planet Earth must have been the disappointment that I was going the same path as her daughter, my mama. That she failed as a mother twice, losing both of her daughters to alcoholism then taking in her granddaughter who was seduced by the very same demon. Watching me fall in love with Jim Beam and partying just like her daughters did. Wondering if her years in rearing me and loving me when my mom wasn’t able to was a waste."}, {"type": "sentence", "content": "It took some time, some legal matters and family disputes, but it was decided I was getting some money from Nana’s estate, which I didn’t know she even had one. I grew up thinking we were dirt poor, but Nana was actually fairly smart with money, squirreling it away. She taught me you could live on bread and oranges while you’re waiting on social security. Her mama had lived through the depression so I guess she was good like that."}, {"type": "sentence", "content": "When my check came in the mail at Travis’, I was terrified. I had never had that kind of money in my life. I didn’t even have a bank account to cash that big ass six-digit number into. But once I learned how to turn that paper to cash, all I could think about is how many damn bottles I could buy with it. I dreamed of getting so obliterated that I could jut suspend myself in that perfect abyss of nothingness."}, {"type": "sentence", "content": "And y’know, that’s honestly how I planned on spending it. I didn’t have to wait for Fridays when Travis handed me money for the groceries and the drinking anymore. I could buy my own bottles, each day of the week if I wanted to. I could drink as much as I wanted to."}, {"type": "sentence", "content": "But since Auntie Margaret got Nana’s house, I knew she was going to drink in that damn house until she died. I could just picture Nana’s frown looking down from heaven. And this check, plus the butterfly mobile I swiped from the house I grew up in, were the last parts of my Nana I had."}, {"type": "sentence", "content": "And I missed her. The only useful memories I could pull out of my television static of a brain were the memories we had when I was much younger. When I was five and she took me to the ice cream parlor the first night I moved in to let me know that my Mama was going away for a while to straighten herself out. When I was 8, when she took me to the fair, bought me cotton candy and took care of me when I threw it all up from the Tilt-a-whirl. When I was 12, when I got my period at school, and she picked me up to wipe my tears and take me to the drug store to tell me what was what. She threw in chocolate and a face mask in with the pads as an extra treat."}, {"type": "sentence", "content": "Since I met alcohol, sure, she and I had talked every afternoon, but there was nothing to grab onto. It was last the last three years of my life, nothing significant. Just hazy blurs things that feel like they’re funny but you never remember in the morning. Ideas that evaporate into nothingness. Mornings that are tinged with dread. And now I had no idea what exactly her stories were, what her legacy was, what her life was. And it was too late."}, {"type": "sentence", "content": "That’s the trouble with drinking. You don’t know how much life you’re missing out on."}, {"type": "sentence", "content": "I hadn’t the damnedest idea of what to do with the money besides drink. Go to college as Charlie did? What would I study? What was I good at besides drinking and watching television?"}, {"type": "sentence", "content": "Paying rent on a new apartment scared me too. It wasn’t a lot in Pooler and that left too much money in my hands for reckless behavior. I wasn’t to be trusted. The responsible thing to do would be to give it to Travis, probably, but then he would just hand me that $40 every Friday. I would stay with Travis because he bought the alcohol and he would keep buying me alcohol so I would stay."}, {"type": "sentence", "content": "My only remaining decision, in my head at least, was to buy something big, all at once so I wouldn’t have direct access to it and I wouldn’t spend it on alcohol. So I bought a trailer home in Eden, bout 20 minutes from Savannah. Garden of Eden, I thought to myself. Paradise. I think I heard that in one of Nana’s television shows."}, {"type": "sentence", "content": "After buying the canary yellow mobile home and the lot, I still had some leftover, to cover me a couple of months for the $150 lot fee and the groceries. I had to be strict, though, because it wasn’t much, but Nana had taught me how to get by close to nothing. I left Travis in the middle of the night and took the bus with a duffel bag of my clothes. I kissed him on the cheek but the saddest part was my last sip of Jim Beam."}, {"type": "sentence", "content": "Life was different here in Eden Springs. I couldn’t afford a television so all I could do for entertainment was read the bible the previous owner Larry left in the closet of my canary yellow trailer. I liked to sit on the patio to watch Nana’s butterfly mobile dance in the wind, casting sunbeams like disco lights all over. I liked to walk to 7/11 to buy a hot dog and a slurpee every Friday afternoon."}, {"type": "sentence", "content": "I woke up most mornings at dawn at Eden Springs mobile home park. I had bad anxiety from quitting the alcohol cold-turkey — anxiety that shot me out of bed, heart racing. I began to love the mornings I felt sleepy because I got so sick of springing out of bed as though I was on fire. It was such a hectic way to start a day of doing nothing at all and I could never get back to sleep."}, {"type": "sentence", "content": "I thought about taking up smoking just to have something to do with all of the nervous energy I had cooped up in the body, but I was too broke for that. So in the mornings I woke up in a panic, I would sit on my patio and wait for the sun to come up, singing to the radio softly so I wouldn’t feel so alone."}, {"type": "sentence", "content": "That’s how I got to see my neighbor Howie, ’cause he was always heading off to work at that time. Whistling, this guy, at like 5am, like there was anything to be cheerful about at that hour. Then he would always tip his hat to me and say good mornin’ as though a bleary-eyed 20-year-old gal was just the most normal thing in the world to see on s scoop of a motor home in Eden, Georgia. After a couple of times of these silent exchanges, I asked him how he was and he always said “better than I deserve.”"}, {"type": "sentence", "content": "I don’t know what he had done to not deserve to feel good. He seemed like a nice fellow. If I thought about it, I knew I didn’t deserve to feel good — neglectful granddaughter, shit girlfriend, alcoholic by 20 years of age. I deserved eternal damnation for all of that. So maybe I was doing better than I deserved too, with my empty days in the hot mobile home, watching my butterfly mobile spin in the breeze, singing along to the radio and reading passages from the bible to feel closer to my Nana."}, {"type": "sentence", "content": "I had been doing nothing when I lived with Travis too, so I was awfully good at it, but this sort of nothing felt different. It felt so much more still without the alcohol. There was so much more time in the day. There was so much more space in my brain. It had taken up the largest part of my days since I was 14 years old, and without it, I just felt so empty. My heart ached for it, the confidence, the happiness, the joy it brought me."}, {"type": "sentence", "content": "The anxiety and the heartache made me want to drink until I couldn’t see. I wanted to every damn day. I dreamt about it, visualized myself drinking in the trailer park until I just croaked and I could just be suspended in nothingness."}, {"type": "sentence", "content": "But I didn’t want Howie or Cheryl or my next-trailer neighbor Mari to find me. They didn’t deserve that. And my Nana, looking down at me and my canary yellow trailer, certainly didn’t deserve that."}, {"type": "sentence", "content": "The first thing I noticed about my next-door neighbor Mari were her nails. The trailers were awfully close to one another, so when she watched television, she would drape her cigarette out of the window, bout a foot away from my patio. She had the most glamorous nails with her cigarette placed in between, pink tiger stripes with palm trees on them, diamonds on her thumbs that caught the sunlight on her thumbs. Then two weeks later, I saw her nails had alternating lavender and celery green nails with little easter eggs on ’em for Easter. I didn’t even realize it was Easter."}, {"type": "sentence", "content": "It gave me something to look forward to, week after week that blisteringly hot spring and summer when all I could afford to eat was bread and oranges — well, what’s Mari’s nails going to look like this week?"}, {"type": "sentence", "content": "“I like your nails,” I told her when she caught me looking at her latest creation, the white butterflies on a hot pink background, “They’re always so pretty.”"}, {"type": "sentence", "content": "“Thank you,” she exhaled her smoke, “I’m a hairdresser, so I figure, if I’m gonna have my hands on your head, they might as well be pretty.”"}, {"type": "sentence", "content": "“Makes sense.”"}, {"type": "sentence", "content": "“Y’know, hat mobile always catches my attention,” Mari said, pointing up at Nana’s butterfly mobile with her long pink nails, “The light goes all over.”"}, {"type": "sentence", "content": "I blushed. When the wind picked up, that mobile spun so fast it shot sunbeams all over it would nearly make your eyes roll trying to follow it."}, {"type": "sentence", "content": "“Does it bother you? I can take it down.”"}, {"type": "sentence", "content": "“Not at all,” she grinned at me, with a little bit of lipstick on her teeth, “Don’t you dare. It just is funny to me, is all. This mysterious girl who don’t say much has damn near a disco ball on her front porch. I can’t tell if you want attention or you don’t.”"}, {"type": "sentence", "content": "I smiled back at her, “It was my Nana’s. She loved butterflies.”"}, {"type": "sentence", "content": "“That’s the name of my salon,” Mari said, “Monarch Beauty, you seen it? Just down the street on Montgomery Avenue. You oughta come by for a trim, I can spot those split ends from here.”"}, {"type": "sentence", "content": "I ran my hands through my long light brown hair self-consciously. Nana used to take me for my haircuts. When was the last time I got my hair trimmed? I couldn’t even remember."}, {"type": "sentence", "content": "I told Mari I would love that but I was broke as all hell. She told me not to worry, we could work something out."}, {"type": "sentence", "content": "I didn’t know what that meant exactly but I took her up on it a couple of weeks later because I didn’t have anything else to do. It felt so comforting to see the faded butterflies painted all over her salon, to get wrapped up in a black smock like an embrace and to have her long nails work through my hair."}, {"type": "sentence", "content": "“You mind if I put a little color in it?” she asked me as she shampooed her long nails (bumblebees today) through it."}, {"type": "sentence", "content": "“I’m your doll,” I told her, “Whatever you want.”"}, {"type": "sentence", "content": "She hummed to the Fleetwood Mac pumping over the speakers as she mixed the colors. My heart sped up as I imagined what she could do. Maybe when she turned me around in that black apron, I could finally look like myself. Feel like myself. Talk like myself. Whatever “myself” was."}, {"type": "sentence", "content": "She spun me around and it took my breath away. I had long hair since I was a girl and now it was to my shoulders, with golden highlights caressing my light brown hair. My eyes looked a little bit brighter, the dimples in my cheeks looked a little more pronounced, I felt a little more sure."}, {"type": "sentence", "content": "I couldn’t even form words. I just sobbed."}, {"type": "sentence", "content": "Mari and I worked out a deal where I would be the receptionist for her salon, fixing all of the hairdressers and manicurists' schedules when folks called or walked in. I loved being there, hearing all of the gals gossip about Eden’s drama. I liked seeing those faded butterflies painted all around the salon. I liked remembering going with my Nana to her salon in Savannah every other Thursday when I was young. The smell of the chemicals and the nail polish brought me right back to those times waiting on Nana, listening to my grandma banter with the hairdresser she had for decades, Sue and seeing how much she sparkled when she left with a brand new perm."}, {"type": "sentence", "content": "I was so captivated with the Georgia beauty queens who strolled into Monarch Beauty on Montgomery Avenue. They just seemed so glamorous, so sure of themselves, so content to spend their afternoons being meticulously groomed to become a more beautiful version of themselves."}, {"type": "sentence", "content": "Mari paid me $450 a month to be the receptionist four days a week and threw in a free cut and color every month. We experimented with layers, going lighter, going darker, just trying to figure out when I would reach that color where I could look at the mirror and say yes. This is who I am. This is my final form."}, {"type": "sentence", "content": "“Whaddaya think about auburn, Miss Lily?” she asked me, running her (polka dot) nails through my hair after my shift one September afternoon."}, {"type": "sentence", "content": "“I’m open to it,” I told her, “You think it’ll fit me?”"}, {"type": "sentence", "content": "“We won’t know until we tried it.”"}, {"type": "sentence", "content": "“Mari?” I asked her as she leaned my head back into the water basin, “Will there ever be a time that I’ve found the right hair color? The one that is just like — yes. This is who I am.”"}, {"type": "sentence", "content": "“Takes some experimenting to get there, sweets,” she said while working her long, glamorous nails through my scalp, “None of us have it really figured out. Even at my age. Try auburn while you’re still young. It takes trying ’em all out until you know which colors are yours”"}, {"type": "sentence", "content": "I was redefining love. It was no longer when he fixed my drink just right. It wasn’t the jitters and butterflies I got in my tummy when I walked to the supermarket on Friday afternoon. It was no longer the anticipation before my lips made the first kiss to the glass."}, {"type": "sentence", "content": "It was when Mari and the other hairdressers would call me sugar and when our regulars would come in all excited about her upcoming date on Friday night. It was the consistency I could count on from Howie to give me a wave and a smile when I was up at dawn for no reason. It was the times I talked to my Nana on my walks to 7–11 for a Slurpee and a hot dog and spotted a butterfly, feeling more connected to her than ever."}, {"type": "sentence", "content": "I was redefining fun. It was no longer drinking on the couch watching television. It was no longer setting fireworks, sneaking into dive bars, raising hell all around town just to feel alive. It was no longer laughing at those things that never strike you as just as funny the next day."}, {"type": "sentence", "content": "It was now answering calls at the salon and finding just the perfect time to fit the clients in. It was the thrill of turning around in the chair for my monthly cut and color to see what version of myself I saw that day. It was seeing what wacky nails Mari was going to have for her two-week fill."}, {"type": "sentence", "content": "I was redefining me. I was still a kaleidoscope girl, spitting out the sights and the fractals and the sound bites I picked up from the world around me, but I felt like I was getting closer every day, figuring out which colors were mine. I had my butterfly mobile, my sack of oranges and loaves of bread, my radio that played the songs I sang along to, my little canary yellow mobile home. My little life here, empty without the alcohol, but peaceful all of the same."}, {"type": "sentence", "content": "And I had something else, something that felt like pride. I had survived heartbreak from the most devastating love of my life, alcohol. And my heart still tinged with nostalgia when the girls asked me to go to the bar after their final clients at Monarch or when I saw Cheryl bring home wine coolers to her trailer. But I don’t think first love fades that quick, so I’ll be gentle on myself on that."}, {"type": "sentence", "content": "I had so much here at Eden Springs, which many would say wasn’t much at all. It felt like a lot to me. The rest — the goals, the personality, that perfect hairdo that just encapsulated who I was — would come eventually. I was sure of it."}]}