{"title": "There Is A Story In All Of Us", "data": [{"type": "image", "content": "https://miro.medium.com/max/3840/1*DeaLbRnhX9mcVV4AfWioow.jpeg"}, {"type": "sentence", "content": "I remember my non-fiction writing class starting off with a room full of skeptics. Everyone in there — minus that one student — were wondering the same thing. How the hell do you make compelling non-fiction?"}, {"type": "sentence", "content": "Now, it’s not to say we were all so far removed from the writing world that we didn’t understand there are plenty of great non-fiction pieces. We were just under the impression that to write one of those there were certain criteria that had to be met. You’re either an expert or professional in the field related to the book or you are the primary source of the material and you were helped by an expert. Regardless, our skepticism soon washed away. As I learned one of the most important lessons for writing ever."}, {"type": "sentence", "content": "I don’t think I’ll ever be known as a non-fiction writer. If it does happen, we can reference this in the irony and ribbing that follows. But the activities we did and theory we discussed will be in all of my writing."}, {"type": "sentence", "content": "The teacher — whose name I again can’t remember — would have us do a couple activities. These activities are still with me today."}, {"type": "image", "content": "https://miro.medium.com/max/1820/1*OgcmRCZeYfbzS0OOtBvDRw.jpeg"}, {"type": "sentence", "content": "It’s funny, because when we first did this exercise, we all looked at him like he was nuts. I mean, you have to have some idea of a story before you begin writing. That’s at least what we all thought. As we did this exercise each week, I began to see a pattern where my writing flowed more naturally. It started in an action and came off like a story. I was very surprised and happy. It was the first time I felt like a writer."}, {"type": "sentence", "content": "And now I know that, that is the feeling I want forever. I write these article pieces and feel alive. I’m having fun and I don’t care how they are received or even if they are received. That is the most freeing thing to me."}, {"type": "sentence", "content": "Writing for the sake of writing."}, {"type": "sentence", "content": "I hope I can give just an ounce of this feeling to another writer one day. It’s invigorating. And to me one of the most important tools you need as a writer."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*fUQjNvgZJCM9jdaZXDCH5Q.jpeg"}, {"type": "sentence", "content": "This one was a lot more straight forward. Everyone understood it easier and went to town. I wrote something using this and it was terrible, but to be fair all my writing is terrible."}, {"type": "sentence", "content": "What I found is that I didn’t feel as natural doing this one and I wasn’t alone. While the teacher said this is a perfectly good way to also find a starting point, I still felt something missing from this."}, {"type": "sentence", "content": "Later, I would discover that I gravitated to the first exercise because of the freedom it gave me in my writing. I have a wandering mind and imagination. The worlds I create typically never stop getting created. It’s just all about preference."}, {"type": "sentence", "content": "Now, to bring this all together. These two exercises are not the only ones. They are just the two that opened my eyes. If you have others then share them. it’s the feeling that I want to get across. That’s the beauty of all of this. There is no one way. I write now more than I ever have in the past. I just started one night after work and finally couldn’t stop. And I love it."}, {"type": "sentence", "content": "Stories are in everyone."}, {"type": "sentence", "content": "There in every moment and event you move through. There in every smell and sight. They come from the rain hitting a little harder and the beer going down a bit smoother."}, {"type": "sentence", "content": "When you feel as if all the ideas have been taken or you will never produce anything on the scale of the greats or even a peer, try something for me. Do one of these exercises and see what you create."}, {"type": "sentence", "content": "Because, the best part of writing is that there will always be more waiting to get out."}]}