{"title": "I Tried All the Mac Apps for Designers. Here Are the Ones I Can’t Live Without.", "data": [{"type": "image", "content": "https://miro.medium.com/max/5200/1*7We2n9VGm8cDE47oXa7HOw.png"}, {"type": "sentence", "content": "My Mac is my design studio, writing room, communications center, and remote office. I’m always interested in finding better tools for my job — tools that are as beautiful as they are functional. Many people hate switching apps, but I love it. A few months ago, I was a loyal user of the collaborative interface design app Sketch; now I use Figma. A couple years ago, I was creating flow diagrams in Omnigraffle; now it’s Overflow. I’ve used every email app under the sun and switched note-taking apps more times than I care to admit."}, {"type": "sentence", "content": "Here are the Mac apps I’m using all the time these days, in alphabetical order."}, {"type": "sentence", "content": "$2.99/month (individual); $4.99/month (family)"}, {"type": "sentence", "content": "You’re using a password manager, right? Right? If you’re not, this is the one to get. 1Password recently switched to a subscription model (who hasn’t?), a move that frustrated some users. Still, for something as important as the security of your password data, I think it’s worth it to know the app is up to date on all the latest threats. I use 1Password to store everything from logins to software licenses, credit cards to important documents. It has robust browser integration and cross-platform, cross-device support. Sort of a very secure Swiss Army knife for your personal data."}, {"type": "sentence", "content": "Free"}, {"type": "sentence", "content": "Anytime I use a Mac without the search app Alfred, I feel sad. Relying on the Mac’s native Spotlight feature isn’t exactly awful. In fact, it’s pretty nifty. But once you realize how much more efficient and productive you can be with Alfred, you’ll never look back. Every search I do starts with Alfred, whether it’s for a file on my Mac, the weather forecast, someone in my contacts, products on Amazon, movies nearby, Google—really, anything. I recommend leveling up with a PowerPack purchase (£25, single user; £45, single user with free lifetime upgrades) so you can get the most from powerful workflows and utility add-ons."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*BusooWFovnxwil0q"}, {"type": "sentence", "content": "$1.49/month; $14.99/year"}, {"type": "sentence", "content": "Last year, Apple Notes won me back from other note-taking apps. Recently, however, I gave the latest version of Bear a try, and I switched yet again. Bear isn’t necessarily more powerful than Apple Notes, but it’s a helluva lot prettier. I know some people are into the more robust newcomers like Agenda or Notion, but I like my notes how I like just about everything else: simple."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*KTDBk4_eoWEqsTCbHmtnzw.png"}, {"type": "sentence", "content": "$19 (single license); multi-license discounts available"}, {"type": "sentence", "content": "I take a ton of screenshots, and I’ve tried a ton of screenshot utilities. But for the past couple years I’ve been quite happy with CleanShot. It has some killer features, like floating previews that let you add annotations and edits. You can save screenshots wherever you like or copy to the clipboard, record video or animated GIFs, hide all desktop icons, change desktop color, and more. CleanShot is really simple to use and quite powerful to boot."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*ObRg4uNQY7Vj91y2"}, {"type": "sentence", "content": "$9.99"}, {"type": "sentence", "content": "Here’s another menu bar utility I find myself using daily, if not hourly. Grab colors from anywhere on your monitor, and ColorSnapper saves the values in whatever format you prefer — RGB, hex, HSL, and others. When you capture a color, the code is copied to your clipboard, ready for you to use wherever you like. The menu bar shows your recent color snaps, and the floating palette shows you even more details and includes the ability to mark colors as favorites for future use."}, {"type": "sentence", "content": "$6.99"}, {"type": "sentence", "content": "Contrast is a really simple yet powerful menu bar utility that checks colors for accessibility. Like most good menu bar utilities, it does just one thing but does it really well."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*cETCKiimGbyb57Aa"}, {"type": "sentence", "content": "Free (basic); $2.92/month (premium)"}, {"type": "sentence", "content": "I keep journals to capture everything from project ideas to memories to inspiration, each in their own journal. DayOne is a simple but powerful cross-platform journaling app that supports syncing, multiple journals, images and videos, reminders, and more. By the way, this is another app that switched to a subscription model, with the attendant user frustration. But, again, I like supporting the developers who make my life just a little bit better with their products."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*FFJ0MaqEc0j8x2fz"}, {"type": "sentence", "content": "$4.99/month; $39.96/year"}, {"type": "sentence", "content": "I have a love/not-so-love relationship with Fantastical, but I keep it around because it’s by far the most elegant cross-device calendar app available. It can be a bit of a memory hog, different calendar systems sometimes don’t play nicely with it, and it’s not cheap (compared to a free calendar app, say). On the other hand, the fact that I can use natural language to enter items is just so huge that I feel like I can’t live without it. Fantastical is an example of Charles Eames’ dictum, “The details are not the details. They make the design.” Here it’s epitomized by lovely unexpected touches, like a weather view for today and a few days going forward."}, {"type": "sentence", "content": "Free (basic); $12/month per editor (professional); $45/month per editor (organization)"}, {"type": "sentence", "content": "I could write an entire post about my team’s switch from the collaborative interface design app Sketch to Figma, but there are enough of those already. I’ll make it short: Where Sketch was revolutionary, Figma is evolutionary. Features like group collaboration and cloud storage make Figma feel like the modern app Sketch should have become — or where it’s trying to go. There’s no doubt Figma has had a huge impact on how we work together — for the better."}, {"type": "image", "content": "https://miro.medium.com/max/2100/0*Ty2pa9VhCWgXcUbW"}, {"type": "sentence", "content": "$29.99"}, {"type": "sentence", "content": "If you write, you need an environment that lets you focus on just the words in front of you. That’s why I love iA Writer. It’s a dead-simple text editor that supports markdown and not much else. One feature I particularly like is the ability to publish directly to Medium, WordPress, or Ghost from within the app. It also has focus modes, including sentence, paragraph, and typewriter, to keep you, well, focused."}, {"type": "sentence", "content": "$0.99"}, {"type": "sentence", "content": "Remember, kids, if you’re a designer, you must never use filler text. Okay, back to reality: We all have to use filler text sometimes. LittleIpsum is a menu bar utility that lets you select words, sentences, or paragraphs, and then instantly copies them to your clipboard as plain text for use wherever you need them. Shhh… don’t tell the UX gurus."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*IAlD91xWiAI2ZOER"}, {"type": "sentence", "content": "Free (basic); $12.50/month or 119.88/year (professional)"}, {"type": "sentence", "content": "Milanote is a great tool for organizing creative projects into beautiful visual boards. It feels like the old days when we’d post all our notes, ideas, inspiration, and sketches on the studio wall. Organic. I use Milanote for everything from mood boards to outlining product requirements and a bunch of stuff in between. And like any decent modern app, it lets you share and collaborate with others. Bonus: The basic plan is free. Once you get in the groove, you’ll be surprised at all the ways you can use Milanote."}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*fUMU8kZp8ysSRPrU"}, {"type": "sentence", "content": "Free (basic editor); $2.49/month or $19.99/year (MindNode Plus)"}, {"type": "sentence", "content": "A lot of people are talking about the power of mind-mapping. Truth be told, I don’t do enough of it, but whenever I do, I find it to be an incredibly powerful way to get my thoughts out of my head and into the world. The problem is that most mind-mapping apps feel unwieldy and bloated, like Microsoft Word for ideating. As a longtime if infrequent user of MindNode, I admire that the developers have exercised restraint, keeping the app as basic (and beautiful) as possible. I love the outline view for jotting down words and then stringing them together into a map afterward. Support for iOS means you can get your mind map on wherever you like."}, {"type": "sentence", "content": "$9.99"}, {"type": "sentence", "content": "Noizio is a white-noise utility that, like other white-noise utilities — shuts out the rest of the world and lets you focus. It’s also pretty. Noizio offers a wide variety of sounds like Deep Space, Campfire, October Rain, and Paris Café. Despite the options, Pink Noise is still my go-to ambient noise. (And it always makes me wonder: Why does no white-noise app include the sound of a real-world white-noise machine?)"}, {"type": "image", "content": "https://miro.medium.com/max/2400/0*VvQnpxiv-Ix6GgDc"}, {"type": "sentence", "content": "$15/month; $144/year"}, {"type": "sentence", "content": "I was invited to beta test Overflow a couple years ago, and my mind was blown: Here was the flow diagramming software I’d always wanted. Since then, the developers have continued to make it better with each release. I use it for everything from user journeys to state diagrams to wire flows. You can share your flows with others and collect feedback. The presentation mode is really nifty as it lets you swoop around your diagrams, focusing on specific areas as you like."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*H3qKTx9SEVTrxEEe"}, {"type": "sentence", "content": "$0.99/month; $9.99/year"}, {"type": "sentence", "content": "Yes, I’m paying a subscription fee for a clipboard manager. Yes, that’s probably nuts. But Paste is like magic. Everything you copy is captured to a dock-like ribbon at the bottom of your screen. You can see your clipboard history, which is highly visual and organized in nature. You can even search your clipboard history (“I just know I copied a recipe for caramel corn last week!”) or save and organize specific clips you think you’re going to use on a regular basis. Support for paste as plain text is helpful, too."}, {"type": "sentence", "content": "$20.99/month (standalone)"}, {"type": "sentence", "content": "No matter how I try, I can’t pry myself away from Photoshop. I tried Affinity Photo because Affinity Designer was such a great alternative to Illustrator, but Photoshop just won me back. And yes, I use and admire Pixelmator, but something about Photoshop has cast a spell on me. Maybe it’s just the fact I’ve been using it longer than almost any other software — 25 years. Before it even supported layers! It’s like an old friend. It’s second nature to me, and nothing else has felt as complete yet intuitive."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*S-MeR6fETKGeh3iuosUc9Q.png"}, {"type": "sentence", "content": "$39 (single user)"}, {"type": "sentence", "content": "From the same people who brought us CleanShot (see above), PixelSnap is the most powerful screen measurement tool I’ve come across. You can take detailed measurements of almost anything on your screen by clicking and dragging, plus you can drag around objects to get their precise dimensions. It also supports saving your measurements as screenshots. Bam!"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*ZM1E2x-FsGdMx74w"}, {"type": "sentence", "content": "$11/month (individual); $42/month (team); enterprise available"}, {"type": "sentence", "content": "This is a hard one to write, because for two years I was absolutely smitten with Flinto for prototyping. ProtoPie is not necessarily more elegant or easy to use than Flinto; in fact, it’s a little more complex. But that complexity brings power. ProtoPie is not without quirks, like allowing you to import only one screen from your design at a time or rasterizing everything instead of retaining vectors. But it makes up for those quirks by letting you create incredibly robust interactive prototypes you can view on your device, share on the web (with comments and collaboration), or preview in the app itself. (Yes, I know Figma supports prototyping, but it supports it the same way Sketch, Studio, and XD do, which is to say, basically not at all. If you need to create even slightly complex interaction mockups, more than a click-through, you’ll need a tool like ProtoPie or Flinto.)"}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*8NBYYACGmX5TCiWp"}, {"type": "sentence", "content": "$39"}, {"type": "sentence", "content": "Rotato is another tool I have a love/not-so-love relationship with. It’s a mockup generator like none other I’ve used. It lets you create some of the most gorgeous 3D mockup stills and animations I’ve seen, but its interface can be frustrating and buggy. And yet I keep coming back to it when I need to create a polished device mockup because of the quality of the mockups it creates. It’s pretty intuitive overall, but again, it’s not without its quirks. On the other hand, every time I launch Rotato, it prompts me to update to the latest version, so clearly the developers are committed to improvement."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*AGxNfxmKoZSWDj-3"}, {"type": "sentence", "content": "Free"}, {"type": "sentence", "content": "I’m a committed inbox zero person, so I’m pretty finicky about my email experience. Having used and fallen in love with many email clients over the years, including AirMail, Sparrow, Mailbox, and Thunderbird, I can say without equivocation that Spark is the best, most elegant email client I’ve used thus far and, in my opinion, the best available at the moment."}, {"type": "sentence", "content": "Free (with ads); $9.99/month (premium)"}, {"type": "sentence", "content": "I include Spotify only because when I’m not using Noizio (see above), I’m listening to music on my Mac. And, again, another love/not-so-love relationship. I love the library and the recommendations Spotify provides, but the UI isn’t exactly intuitive. And, hey, Spotify? Leave my podcasts alone. Yes, I’m a subscriber, but I don’t like walled gardens. (If you’re looking for a great podcast app, I recommend PocketCasts.)"}, {"type": "sentence", "content": "Free for starters; $3/month (premium); $5/month (business teams)"}, {"type": "sentence", "content": "I quite literally live by Todoist. Every single thought that comes into my brain is categorized into things I need to take action on or not. List-making is how I’ve learned to manage my ADD. If action is needed, I add it to Todoist with a keystroke. It’s an example of a powerful utility that’s also simple and beautiful. Little touches like Karma Goals and natural language input are icing on the cake."}, {"type": "sentence", "content": "So, what did I miss? What Mac apps are you loving these days? Let me know below. And thanks for reading."}]}