{
  "title": "The Most Under-Appreciated Slide in a Pitch Deck",
  "data": [
    {
      "type": "subtitle",
      "content": "And What It Tells Me About You as an Entrepreneur"
    },
    {
      "type": "sentence",
      "content": "The conventional wisdom about startup pitch decks is that the most important sections are the team and money slides. And the conventional wisdom is not wrong. Research shows that investors spend more time on these slides than any others."
    },
    {
      "type": "sentence",
      "content": "But having met hundreds of startup entrepreneurs (and their pitch decks), I find I can glean a lot of information about you as an entrepreneur from your competitor slide. Here’s what your thoughtful competitive research tells me, as captured in your competitor slide or simply from a conversation with you about your startup’s competitive landscape:"
    },
    { "type": "subtitle", "content": "You Do Your Homework" },
    {
      "type": "sentence",
      "content": "A comprehensive, detailed list of competitors shows me, first and foremost, that you dig in and do your homework. Competitive research is essentially research into how much of your opportunity has already been seized by others, not a topic most entrepreneurs are passionate about immersing themselves in. Your diligence about competitive research tells me that you’re a professional about the less gratifying tasks in an entrepreneur’s portfolio. I can also expect other facets of your strategy will be similarly backed up by substance and attention to detail."
    },
    { "type": "subtitle", "content": "You’re a Realist" },
    {
      "type": "sentence",
      "content": "If you’re a startup, by definition you are trying to prove your startup hypothesis. Generally speaking, your hypothesis is that customer demand will scale. If you’re really early stage, your hypothesis may be that customer demand exists. Some of the data crossing your desk will be beneficial to your startup hypothesis, and some, such as evidence of a strong competitor, will be detrimental."
    },
    {
      "type": "sentence",
      "content": "How do you handle data that doesn’t favor your business case? Do you filter it out? Do you bury it? Is your head in the sand (or the clouds)? When you share thoughtful research into your competition, including strengths as well as weaknesses, that’s a strong signal the answer is “no”."
    },
    { "type": "subtitle", "content": "You’re Up for a Challenge" },
    {
      "type": "sentence",
      "content": "There are many bummer days in an entrepreneur’s life. The day you say to yourself about the competitor you just looked into, “Dang, they’ve actually done a pretty good job of this” is one of those days. If you’ve properly identified and acknowledged the competitive pressures facing your startup AND you’re still excited about your prospects, that tells me you’re more likely to be in it for the long haul. Which is a must for any successful entrepreneur."
    },
    { "type": "subtitle", "content": "You’re Not a BS Artist" },
    {
      "type": "sentence",
      "content": "Entrepreneurs should be able to paint a compelling picture of their startup. I worry if you haven’t. But I also worry how much of that picture is embellished."
    },
    {
      "type": "sentence",
      "content": "When you acknowledge your competitors’ strengths, you give me confidence that you’re not trying to put a positive spin on everything. “We’ve figured out how to design a smart phone people will want to use, unlike those clowns at Apple and Google” — not what I want to hear. Unless I’ve worked with you before, I’m looking for reasons to believe your narrative. Your clear-eyed competitive research is a very good reason."
    },
    { "type": "subtitle", "content": "Your Opportunity is Real" },
    {
      "type": "sentence",
      "content": "Nobody can be an expert in every domain. Like many others I’m a “T” — shallow in a lot of areas, deep in only a few. I’m probably not an expert in your particular niche and its ecosystem at this moment. I bet most investors aren’t either. More than your idea or your optimistic financial projections, a few minutes looking into your competitor list gives me a quick education on your space, the opportunity, and your (or anybody’s) prospects for success."
    },
    {
      "type": "sentence",
      "content": "Even though I’m a technologist, one of my favorite classes in high school was social studies class junior year, where we debated different sides of an argument (often not the side we started out believing). Competitive research is like a pro/con debate on “I have a great startup idea”. Use it to challenge your assumptions. Your startup strategy and execution, as well as your pitch deck, will be the better for it."
    },
    {
      "type": "sentence",
      "content": "This post was originally published on Shulman Rogers NEXT."
    }
  ]
}
