{"title": "A Rose For Everyone", "data": [{"type": "image", "content": "https://miro.medium.com/max/9216/1*d8PVYwmbyEgn20TaULgQmQ.jpeg"}, {"type": "sentence", "content": "On the morning of the coffee taste-off, Joe’s Café was jammed with customers. Sarah stood behind the counter with her co-workers, pleased that her idea had taken off. Now she would get that well-deserved promotion to shift supervisor. With the extra money she would be able to buy her daughter the prom dress she’d been talking about for the past month."}, {"type": "sentence", "content": "Making ends meet hadn’t been easy since the untimely death of her husband two years ago, but now it seemed like things were changing for the better."}, {"type": "sentence", "content": "Sarah counted twenty people already in line, each waiting to taste one of the special coffee drinks named after the employees. As the posters announced, the first thirty customers would each receive a free cup of coffee for the next seven days. Whichever drink received the most orders would then be a regular offering on the menu."}, {"type": "sentence", "content": "Tightening her apron, Sarah greeted the first customer. “Good morning. What would you like to try?”"}, {"type": "sentence", "content": "A handsome man with eyes the exact color of his blue shirt met her gaze. “I’ll have …” His gaze moved to the nametag on her shirt. “The Sarah Special.”"}, {"type": "sentence", "content": "Sarah smiled as she wrote her name on the cup and set it down on the counter for her co-workers, Megan and Lisa, working the bar this morning. Her drink consisted of one shot of espresso and sweet milk brought to a light foam."}, {"type": "sentence", "content": "After paying, the man wished her good luck. She handed him his free drink coupon. He smiled and took his coffee to a table in the corner of the coffee shop."}, {"type": "sentence", "content": "On the thirtieth customer, the register dinged, indicating the last of the winners. “Congratulations,” Sarah said to the teenaged girl on the other side of the counter. She had a bright smile and warm eyes. “You are our last winner of the day.”"}, {"type": "sentence", "content": "“But we’re all number thirty,” the teenager said, waving her arm to include her three friends. “I’m buying all the drinks.”"}, {"type": "sentence", "content": "“So, then, you’re all winners,” Sarah replied."}, {"type": "sentence", "content": "After taking their orders, she handed each of them a coupon for their free coffees."}, {"type": "sentence", "content": "“Thanks,” said one of the teenage girls. “You know, what goes around, comes around.” She flashed Sarah a big smile, reminding Sarah of her own self-assured daughter."}, {"type": "sentence", "content": "Several times during the hour, Sarah caught Blue Eyes staring at her. Each time her heart sped up a little. He appeared to be about fifty, a few years older than her. He didn’t carry a laptop or have one of those funny ear things connected to his head like so many of the younger customers."}, {"type": "sentence", "content": "He sat reading the paper, or sometimes just looking out the window. Maybe he was even widowed, like her."}, {"type": "sentence", "content": "Before leaving he came up to the counter. “That was very nice of you to give all those girls free coffee,” he said."}, {"type": "sentence", "content": "“It didn’t seem right not to,” she answered. “How’d you like yours?”"}, {"type": "sentence", "content": "“Delicious. Just like it says, the richness of coffee with a touch of love.” His eyes sparkled as he spoke."}, {"type": "sentence", "content": "“Next time you should try the Megan Special,” Sarah suggested."}, {"type": "sentence", "content": "“Maybe I will,” he answered."}, {"type": "sentence", "content": "She wondered if he meant that maybe he’d try Megan’s drink or maybe he’d be back. She hoped he meant that he would be back tomorrow for his free coffee."}, {"type": "sentence", "content": "He was. And he came back the next day and the day after that. Every day until the end of the week. Each time he ordered the Sarah Special, even though it wasn’t even on the menu anymore."}, {"type": "sentence", "content": "Every day he sat in the same corner. He would sip his coffee, read the paper, glancing at her every so often, but never saying more than a few words. Oh, he did introduce himself. But other than knowing his name was Ken, that he had just started working at the bank across the street and liked sweet coffee, she knew nothing else about him. Except that he made her heart speed up like a crazy teenager in love."}, {"type": "sentence", "content": "At 8:50 every morning, he folded up his paper, tossed his cup in the trash and waved to her as he pushed open the glass door of the Café and walked out."}, {"type": "sentence", "content": "Tomorrow he would have to pay for his coffee and Sarah feared he might not return."}, {"type": "sentence", "content": "The next morning, she woke up earlier than usual and arrived at work fifteen minutes before her scheduled time. She had half her mind on preparing lattes and blended mochas. Well, maybe one fourth."}, {"type": "sentence", "content": "The other three-fourths kept watching the doorway, willing Ken to walk through and into the café. But today, her will just wasn’t strong enough."}, {"type": "sentence", "content": "She promised herself that if he did, she was going to say more to him than their usual “hello”, “how are you?” and “goodbye.” But where was he?"}, {"type": "sentence", "content": "During a lull in customers, a deliver boy walked in carrying a half a dozen roses. Their sweet scent drifted the throughout the sitting area and through the work stations."}, {"type": "sentence", "content": "“Oh my,” Megan cried. “Look at those flowers. I wonder who they’re for.”"}, {"type": "sentence", "content": "“They’re for all of you,” the boy said, as he handed one long stemmed rose to everyone working that day."}, {"type": "sentence", "content": "When he had two flowers left to pass out, he asked which one of them was Sarah."}, {"type": "sentence", "content": "“That’s me,” she said."}, {"type": "sentence", "content": "The boy handed her the remaining roses. There was a note attached to one of them."}, {"type": "sentence", "content": "“Dear Special Sarah,"}, {"type": "sentence", "content": "Will you have dinner with me tonight?”"}, {"type": "sentence", "content": "Sarah looked up. Sitting at his usual table was Ken, giving her a smile that touched her soul like a bonfire."}, {"type": "sentence", "content": "On shaky legs she walked over to his table and sat down. “That was sweet of you, to send us all flowers,” she said."}, {"type": "sentence", "content": "“It didn’t seem right not to,” he said. “You all work so hard.”"}, {"type": "sentence", "content": "What goes around, comes around, she thought. Her staff certainly deserved the recognition."}, {"type": "sentence", "content": "“So, about dinner?” Ken reached over and lightly touched her hand."}, {"type": "sentence", "content": "Stay healthy and happy. Keep your loved ones close."}]}