{"title": "How to adapt your UX for China", "data": [{"type": "sentence", "content": "Having started MING Labs in China in 2011, we have seen a big development from the old-internet world of overladen landing pages, to digital products of world-class defining design today. In parallel, we have seen the move from clunky desktop applications with small user bases, to the mobile-first B2C revolution to the rise of the super apps that are the new all-encompassing ecosystems in the market."}, {"type": "sentence", "content": "Throughout those major shifts in digital products and behaviors, some preferences have remained constant that differ from those in Western markets. Understanding what is actually different, and what is just a different stage of development, is an important factor when launching your product in the market. From key differences in UX requirements, to the preference for larger ecosystems and a different understanding of value, China is unique in many aspects (as are other markets, to be sure)."}, {"type": "sentence", "content": "Over the years, we have helped many startups and MNCs to launch their products, built and validated in their home markets, into the Chinese market."}, {"type": "sentence", "content": "This article is therefore mainly aimed at those thinking about, tasked with or actively working on expanding into the Chinese market, and who are wondering what that means for their digital products and services."}, {"type": "image", "content": "https://miro.medium.com/max/1400/1*7bEqnMfdlSOcrOB5KpADPw.jpeg"}, {"type": "subtitle", "content": "Three Options In Adaptation"}, {"type": "sentence", "content": "When launching in a new market that has some important dissimilarities from your home market, essentially you have three choices in product adaptation:"}, {"type": "subtitle", "content": "Minimal:"}, {"type": "subtitle", "content": "Localized:"}, {"type": "subtitle", "content": "China Business:"}, {"type": "sentence", "content": "The trade-off here is that with an increasing China customization you are reducing your Economies of Scale, as a very localized business will not be scalable into other markets and will need a lot of local, dedicated resources, whose learning you can’t leverage in your global expansion. At the same time, a low level of customization will stay highly scalable, yet might not yield success as it is a very specific market."}, {"type": "sentence", "content": "That trade-off and decision is by no means trivial. Finding a good answer typically requires taking on a beginner’s mindset (going back to the Exploration stage) and first testing your product and value proposition locally."}, {"type": "sentence", "content": "In the next parts, we will assume that you have come to your conclusion and you are opting for a Localized approach (as Minimal is straight-forward and China Business goes to Business Design). What exactly then are the differences in UX design and local platforms you should be aware of and adapt to?"}, {"type": "subtitle", "content": "Cultural Differences That Matter"}, {"type": "sentence", "content": "Some of the preferences in design and interaction are rooted in the Chinese culture. There are few things to be aware of that make a big difference:"}, {"type": "subtitle", "content": "Collectivism:"}, {"type": "subtitle", "content": "High-Context Culture:"}, {"type": "subtitle", "content": "Complex Language:"}, {"type": "subtitle", "content": "UX In China — Some Pointers"}, {"type": "sentence", "content": "The cultural differences manifest in different preferences regarding UX and service design, which produce the services you see on the Chinese internet today. While they often have Western inspirations or counterparts, they work differently in some key aspects. Including:"}, {"type": "subtitle", "content": "Practicality > Aesthetics:"}, {"type": "subtitle", "content": "Social Anywhere:"}, {"type": "subtitle", "content": "Everything Connected:"}, {"type": "sentence", "content": "These are a few guiding principles to consider when redesigning your digital experience for China. Driven by cultural differences, these are expectations that exist with consumers today towards any product or service."}, {"type": "subtitle", "content": "Rise Of The Super Apps"}, {"type": "sentence", "content": "Any thoughts on product adaptations for China would be incomplete without the considerations of local platforms — first and foremost super apps. These are applications owned by the biggest ecosystem players in China (Alibaba, Meituan, Tencent), which aggregate many different services into one touchpoint, offer foundational layers of identity and payments to tie them together, and allow for third parties to write small applications that can be pulled into that powerful context."}, {"type": "sentence", "content": "As their platforms essentially monopolize consumer attention across verticals, the companies owning them generally let new trends play out, invest in them and later buy them out. Therefore, creating larger and larger kingdoms that lock in consumers. They are therefore a great distribution channel and are very open to partner with and enable new entrants. It also means that without them, you are facing a heavy up-hill battle."}, {"type": "sentence", "content": "Of course, there are trade-offs to be aware of. Where on Amazon you run the risk of the marketplace introducing their own brand of products to price you out, Alibaba essentially owns the consumer and their data, with a stark indifference to who wins the battle for their wallet. If you enter with a novel product, Chinese competitors will soon copy you and there is no one to protect you from it."}, {"type": "sentence", "content": "In terms of platforms, probably everyone is more or less familiar with WeChat and Alipay. Some of the key ecosystems that are open to a degree to integrate with. The way to get in there, except for acquisition, are mini programs. This is a rising trend of apps-in-apps that are becoming very important for business."}, {"type": "sentence", "content": "Mini programs account for the majority of customer interaction already in all major consumers verticals. They have only really been launched in their current shape about over a year ago but are taking over quickly . They are becoming entry points into engagement with brands — from shared content, over quick entry to the official accounts. Mini programs are the new beachhead to customer interaction."}, {"type": "sentence", "content": "They are not great for retention. Usually they underperform other owned touchpoints, such as native apps and web applications, in terms of retention. Tencent has invested a lot of effort to make them stickier and they are improving already. With high barriers to get people to install native apps though, Mini Programs are a great entry point to then lead people over to install native apps."}, {"type": "sentence", "content": "Mini programs are ideal for simple and low frequency use cases. Entry is easy, retention is low. Yet they are powerful at mitigating media breaks and reducing friction. So, identifying the right use case is key. Like order to the table at a restaurant. The more complex or frequent a use case is, the stronger the need for an app or web app."}, {"type": "subtitle", "content": "The Epitome Of VUCA"}, {"type": "sentence", "content": "Competition is happening at a breakneck pace, with today’s lauded innovation being the next spectacular failure tomorrow. To successfully launch into this environment, it is paramount to keep an explorer’s mindset, be aware of underlying foundational differences and iterate quickly. And to keep iterating and adapting even after a successful launch, as the market and the customers will keep moving on, in a country where change has been the only constant for decades."}, {"type": "sentence", "content": "If you have any thoughts, responses or questions to add, I would love to hear from you in the comments below, or feel free to reach out to me directly via LinkedIn. Thank you for reading!"}]}