{"title": "The roles and responsibilities of a startup CEO and its founding team", "data": [{"type": "image", "content": "https://miro.medium.com/max/1256/1*hpBJLe7LGwIKT4xtjHDmGw.png"}, {"type": "sentence", "content": "After three years of running my startups and advising various new ventures, I have learned the hard way — mainly from mistakes and failures — that there is a direct link between the founders’ leadership skills and the success of their startups. A capable and strong startup CEO and its founding will need two different skills sets to deliver success:"}, {"type": "subtitle", "content": "Being a great manager — a loop of tasks"}, {"type": "image", "content": "https://miro.medium.com/max/1066/1*M9bqZYxBmTN27TIi4ZJNqw.png"}, {"type": "sentence", "content": "As managers, a startup CEO and founding team need to perform five sets of circular and repetitive activities:"}, {"type": "sentence", "content": "While in established and mature companies, these cycles can be monitored and checked quarterly, in a startup, this needs to happen on a weekly or bi-weekly basis because a startup is functioning under a great number of hypotheses and unknowns and therefore needs to be continuously be learning and making small or large pivots."}, {"type": "subtitle", "content": "Being a great leader — a loop of soft skills"}, {"type": "image", "content": "https://miro.medium.com/max/954/1*DFHOAiSirEY3gJHd5dT63Q.png"}, {"type": "sentence", "content": "While managerial activities are more mechanical, leadership is more soft skills and harder to acquire and execute. A CEO and founding team’s leadership tasks can be summarized under three main buckets:"}, {"type": "sentence", "content": "Leadership is tough to execute because a CEO can not achieve it by just speaking it — it needs to be behaved and presented in action. Leadership depends on the example that a CEO or the founding team set themselves as to the values they want their company to be run by and if they’re not going to behave based on those values, it will most likely fail."}, {"type": "sentence", "content": "Becoming a successful startup CEO and founding team, is a difficult. It requires patience, constant learning from mistakes, and adaptation to new circumstances."}]}