{"title": "without title", "data": [{"type": "sentence", "content": "I had the pleasure of seeing Lost Words: Beyond the Page during its development more than two years ago. At that point the game had a different art style, but the vertical slice that I was able to play immediately captivated me with its unique gameplay style and interesting story concept."}, {"type": "sentence", "content": "Lost Words: Beyond the Page seeks to tell the story about a young girl struggling with the loss of a relative. This heartfelt narrative is delivered through an interactive diary come storybook, with the player guiding the young girl through its pages."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*k-30EWByeVmeDVB_"}, {"type": "sentence", "content": "Recently, I had an opportunity to speak to founder of Sketchbook games, Mark Backler. I asked some questions about both the game’s approach to storytelling, and more pragmatic decisions made in releasing the game (such as Stadia exclusivity)."}, {"type": "sentence", "content": "We started out by talking about the narrative inspiration for the game, where Mark talked about different narrative projects from both game and film that interested him and the team."}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "So, we tried to draw inspiration from lots of different areas and kind of films like The Labyrinth that we all liked. And games like Edith Finch and Gone Home kind of really interesting narrative projects. They’re kind of borrowed from all over the place really."}, {"type": "sentence", "content": "Our writer — Rhianna — knew she wanted to write something that could make a difference to people and that was also a powerful and universal topic."}, {"type": "sentence", "content": "When I asked about how they tackled the challenge of representing loss and grief in a video game, Mark spoke about how they consulted with a mental health expert."}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "So, we met up with Caitlin Hitchcock from Cambridge University — a researcher on the various approaches to psychological treatment. She had a meeting at the Welcome Trust in London and kind of talked her through the game, the concept and showed her what gameplay we had."}, {"type": "sentence", "content": "Then when we wrote the script, we sent that over to her to look over and she gave us feedback on it. Then we put that in the game and then sent her videos of that, which she gave us more feedback."}, {"type": "image", "content": "https://miro.medium.com/max/1200/0*Dzoy3sV1IoVOyHO-"}, {"type": "sentence", "content": "Mark went on to talk about how the game incorporated current psychotherapy techniques into the games narrative presentation"}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "Caitlin talked about a therapy technique called the Compassionate Image which involves looking back on difficult moments through your present self. And so, we tried to incorporate that into the narrative of the game itself."}, {"type": "sentence", "content": "So this influenced when Izzy (the games playable character) is older and looking back on things. Also how the process of grief isn’t just a linear thing and you can backslide into different stages of grief. That was something that we tried to cover with some of the final level revisiting past stages that you’ve been on your journey throughout the game."}, {"type": "sentence", "content": "Moving on from the game’s design, I wanted to speak to Mark about the decision to publish Lost Words as a Stadia exclusive."}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "It was through our publisher, Modus, they they met with Google. We were showing Lost Words at E3 and Google came around to look at all the games that were being showcased by Modus. I got to speak to them a little bit then but Modus secured the deal."}, {"type": "sentence", "content": "Mark spoke about how difficult it can be for smaller studios to get their games noticed, highlighting the importance of partnerships and marketing."}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "It can be tricky these days to get a game noticed and even really awesome games don’t necessarily sell the kind of units that they need to to kind of recoup the development cost. It’s getting harder and harder. Marketing is more and more important, but it’s tricky and expensive and not guaranteed to get you x number of sales or anything."}, {"type": "sentence", "content": "I think we’re lucky right now to have new platform holders like Google with Stadia and Apple with Apple Arcade and Epic with Epic Game Store. They’re looking for exclusives and are interested to fund games to be first out on their platform."}, {"type": "image", "content": "https://miro.medium.com/max/3200/0*dw_-5vv22FGXAYCv"}, {"type": "sentence", "content": "Something I’m personally invested in is game accessibility and looking at ways that can help more people to play. To close out our interview I asked Mark about accessibility and any steps they took to help ensure that the game was accessible."}, {"type": "sentence", "content": "MARK BACKLER:"}, {"type": "sentence", "content": "I think accessibility is something more developers and players think about these days. Some of the feedback our user testing showed was around the color of text and ways that we can make things easier for people to see."}, {"type": "sentence", "content": "Being a small team, it is tricky because some of the options can be a bit harder to implement. It would be nice to have some kind of a full suite and we’ve got lots of options so you can play with keyboard or different controllers. Supporting fully customisable remapping is something we wanted but so far haven’t managed to do, but we’d like to look at that in future updates."}, {"type": "image", "content": "https://miro.medium.com/max/300/0*tuYB-pw0_YQQSoJy"}, {"type": "sentence", "content": "After the interview Mark also let me know that the studio had managed to figure out a means to add custom key bindings into the game for both the Steam and console releases. This feature will be introduced via an update and should go a long way towards making the game more accessible for players that like to play with atypical control layouts or custom controllers."}, {"type": "sentence", "content": "Lost Words: Beyond the Page is currently available exclusively on Stadia, but the studio have plans to release on other platforms at some point in the near future. You can check out the trailer above and it’s also available to wishlist on Steam here."}]}