{"title": "Bootstrapping Your Business Is the Most Important Thing You Can Do Right Now", "data": [{"type": "sentence", "content": "If ever the was a time to bootstrap your business it's now. Are you bootstrapping your business or just thinking about it?"}, {"type": "sentence", "content": "Whether you’re a startup or an established firm, bootstrapping your business has lots of benefits."}, {"type": "sentence", "content": "On the other hand, venture capitalists (VCs) have plenty of money to invest. A lot of cash."}, {"type": "sentence", "content": "Is it worth it?"}, {"type": "sentence", "content": "Before you get caught up in the dream, read on."}, {"type": "sentence", "content": "Entrepreneurs dream about reinventing, dominating or conquering markets. The one thing that stands in the way of these dreams and making them become a reality is … capital. Or so we think."}, {"type": "sentence", "content": "At this moment Entrepreneurs envision their company accelerating. Growth and profits soar in their mind's eye. The days of struggling, self-financing capital, to just stay afloat, can be a distant memory in the stroke of a pen."}, {"type": "sentence", "content": "The only thing standing in the way is … signing on the dotted line."}, {"type": "sentence", "content": "It’s decision time:"}, {"type": "sentence", "content": "What to do?"}, {"type": "subtitle", "content": "Decisions Decisions"}, {"type": "sentence", "content": "From my experience, there is no right or wrong answer."}, {"type": "sentence", "content": "What I do know is that by not bootstrapping your startup, you miss out on experience — valuable life lessons."}, {"type": "sentence", "content": "Business lessons."}, {"type": "sentence", "content": "Lessons that may unlock the biggest self-discovery of your life:"}, {"type": "sentence", "content": "Hungry for more? Keep reading."}, {"type": "subtitle", "content": "Bootstrapping Benefits"}, {"type": "sentence", "content": "Bootstrapping your business today retains your control for tomorrow."}, {"type": "sentence", "content": "Yes, VCs will tell you that you’re better off having a smaller slice of a big cake rather than the whole of a small pie. They’ll even tell You that bootstrapping your business will impede growth and profits."}, {"type": "sentence", "content": "Are they right?"}, {"type": "sentence", "content": "The answer can be either “yes” or “no”, depending on where you are on your journey."}, {"type": "sentence", "content": "VCs do have a time and place. Somewhere down the line. They have no place at the start or in the middle of your journey."}, {"type": "sentence", "content": "Tasting VC money too early means you have to give up control of your startup. Fact. You have to divide up the pie. A small pie in the early stages."}, {"type": "sentence", "content": "Industry giants today started out bootstrapping their business. Think of Airbnb, Intercom, even Apple or Microsoft."}, {"type": "sentence", "content": "Here’s what you could miss out on by selling out too early:"}, {"type": "sentence", "content": "Bootstrapping brings one thing to the table that VCs can’t:"}, {"type": "sentence", "content": "Far too many Entrepreneurs share ownership, relinquishing control of their fledgling startup too soon."}, {"type": "sentence", "content": "If you think VCs have come to the table for a small slice of the pie, so you can retain control, think again."}, {"type": "subtitle", "content": "Strings Attached"}, {"type": "sentence", "content": "Remember, strings are attached any time you accept money from others. Not that there's anything wrong with this. Arguably, smart money is when you spend other people’s money."}, {"type": "sentence", "content": "But at the right time."}, {"type": "sentence", "content": "Operating a thriving startup business is challenging in and of itself. Adding other stakeholders into the mix, with different agendas, ties your hands. You have to deliver their objectives too."}, {"type": "sentence", "content": "Your control is gone. At least in part for now."}, {"type": "subtitle", "content": "Control"}, {"type": "sentence", "content": "Control of your company gives you control of your future."}, {"type": "sentence", "content": "Bootstrapping keeps you in the cockpit. In Control."}, {"type": "sentence", "content": "Bootstrapping protects something much more valuable than money. The one thing money can't buy. The thing that allows you to learn, conquer and win in your space."}, {"type": "sentence", "content": "What’s this one thing that bootstrapping protects?"}, {"type": "sentence", "content": "Bootstrapping your startup keeps your time focused on growing your baby."}, {"type": "sentence", "content": "Chasing external money steals your focus and time away from your startup."}, {"type": "sentence", "content": "Your full-time job becomes something new — meeting with banks, investors, lawyers, and accountants."}, {"type": "sentence", "content": "These investors will want to know how you do what you do. Along the way, you’ll spill your “secret sauce”."}, {"type": "sentence", "content": "It's likely that you’ll have the same meetings with lots of different people."}, {"type": "sentence", "content": "Time spent chasing outside finance means that you have less to invest in other things, better things."}, {"type": "sentence", "content": "Like what?"}, {"type": "sentence", "content": "Like brainstorming the next problem. Solving or creating market disruption."}, {"type": "subtitle", "content": "Investing Time"}, {"type": "sentence", "content": "Time is fixed. An equilibrium. It levels the playing field for all. You can spend time chasing investment or chasing consumers, clients, a key account to grow your business."}, {"type": "sentence", "content": "When you focus on your startup, you acquire clients, grow your business, your market share and increase profits."}, {"type": "sentence", "content": "When you chase outside investment, you do none of the above."}, {"type": "sentence", "content": "Oh, don’t be fooled into thinking that when you get outside financing you can refocus on your business again soon thereafter."}, {"type": "sentence", "content": "Nope."}, {"type": "sentence", "content": "Other people’s money means rules:"}, {"type": "sentence", "content": "Investors want assurances. They want to know exactly what you’re doing with their money. Is it protected and is it growing?"}, {"type": "sentence", "content": "Weekly, monthly, quarterly and annual reports, presentations and meetings are the trade-offs for external money."}, {"type": "sentence", "content": "You’ll drown in financial reports if you’re not careful."}, {"type": "sentence", "content": "Creating presentations will consume your time too."}, {"type": "sentence", "content": "At least not yet!"}, {"type": "subtitle", "content": "Easy Street"}, {"type": "sentence", "content": "Bootstrapping a business isn’t easy."}, {"type": "sentence", "content": "Doing what’s right rarely is."}, {"type": "sentence", "content": "Bootstrapping your startup though means that your resourcefulness today will feed your offspring tomorrow."}, {"type": "sentence", "content": "Neither solution is perfect. Bootstrapping or external finance."}, {"type": "sentence", "content": "Gains from outside finance is a trade-off with control. Pie-sharing."}, {"type": "sentence", "content": "VCs are always very clear — their money gives you what you need to gain market share to win."}, {"type": "sentence", "content": "VCs aren't shy either. No, they're forthcoming telling you all the things you gain with their money."}, {"type": "sentence", "content": "The same VCs are eerily quiet when you don't deliver, or worse, fail."}, {"type": "sentence", "content": "VCs are in business to win. Period."}, {"type": "sentence", "content": "Don’t be surprised that VCs want their money, with interest plus a pound of flesh. Although your sanity will do. All within three to five years."}, {"type": "sentence", "content": "External finance means that VCs, not you, the founder, dictate how your startup grows and exits."}, {"type": "subtitle", "content": "Make it Count"}, {"type": "sentence", "content": "Statistically, the likelihood of creating another successful company is slim to none. One that VCs drool over."}, {"type": "sentence", "content": "As I said, doing what’s right isn’t easy. With your future in mind, bootstrapping a startup is the right thing to do, initially."}, {"type": "sentence", "content": "Bootstrapping gives you one thing that you won’t get from VC cash."}, {"type": "sentence", "content": "Control over your startup, your actions, your destiny."}, {"type": "sentence", "content": "Your time."}, {"type": "sentence", "content": "Bootstrapping your startup brings peace-of-mind. VC funding removes peace-of-mind."}, {"type": "sentence", "content": "That said, there are no guarantees in life or business."}, {"type": "sentence", "content": "The same holds true by bootstrapping your business. It brings challenges and risks. That’s par for the course, so be prepared to suck it up."}, {"type": "sentence", "content": "But navigating challenges build character, leadership, and a skill that you can only learn by doing — Entrepreneurship."}, {"type": "sentence", "content": "You’ll still have sleepless nights. I guarantee that, but bootstrapping your business means that you succeed or fail on your terms."}, {"type": "sentence", "content": "There are no regrets. Period."}, {"type": "sentence", "content": "The choice is yours and always will be. Certainly to begin with."}, {"type": "sentence", "content": "When it comes to building a business, you have one chance to get it right. Of course, you can start again, but you still have one chance with each venture."}, {"type": "sentence", "content": "Don’t blow it by selling out too soon."}, {"type": "subtitle", "content": "Final Thoughts"}, {"type": "sentence", "content": "When it comes to starting and running a business, you have a choice. One that determines your future. Your destiny."}, {"type": "sentence", "content": "You either bootstrap or seek outside finance. Neither is perfect, each has downsides."}, {"type": "sentence", "content": "Thousands of entrepreneurs, fall under the VC trance, to their detriment."}, {"type": "sentence", "content": "Bootstrapping instills resilience and resourcefulness, true entrepreneurial traits."}, {"type": "sentence", "content": "As with all things in both life and business, there’s a time and a place for everything."}, {"type": "sentence", "content": "So, who are you? Are you an Entrepreneur?"}, {"type": "sentence", "content": "Know this — Bootstrapping a startup today sets you up for tomorrow. Your success empowers you to invite external finance on your terms, down the line."}, {"type": "sentence", "content": "Here’s the best part — The how, when, where, what and why is up to you? It’s in your hands."}, {"type": "sentence", "content": "I know you can do it. Here’s to your success."}, {"type": "sentence", "content": "Your Biggest Fan!"}, {"type": "sentence", "content": "Paul"}]}