{"title": "Why you shouldn’t expand your market, but narrow it down", "data": [{"type": "sentence", "content": "An ailment I see at a lot of startups is something I’d call “new-product-itis”. Symptoms include: wanting to build a new product, expand to new geographies or into new industries. Severe cases include several symptoms at the same time — and I’ve suffered from it."}, {"type": "sentence", "content": "Creating new products or expanding into new markets seems like the kind of thing-a-company-should-be-doing. However, in many, many cases, this is a bad idea. In fact, here’s a rule of thumb: if you are fewer than 10 people, you should not have more than one product, one market, one industry. If you’re around 50, it starts being something you may want to consider — but by no means a surefire hit."}, {"type": "subtitle", "content": "Why you should remain in a narrow market"}, {"type": "sentence", "content": "In many cases, the value of remaining in a narrow market makes intuitive sense. Let’s take an example: who makes more money between 1) a neurosurgeon and 2) a general practitioner?"}, {"type": "sentence", "content": "Let’s add a third category: who makes more money between a 2) general practitioner and a 3) general practitioner who also does web design?"}, {"type": "sentence", "content": "It seems clear for everyone that 1 will make more than 2, who will themself make much more than 3, even though a naive analysis could indicate that the total addressable market is the largest for the physician-cum-web-designer."}, {"type": "sentence", "content": "Of course, considering the size of the market is not really helpful in this case. While more people have health problems than brain problems, the neurosurgeon brings a critical and specialized help for those who do, and is able to charge more for her service."}, {"type": "sentence", "content": "This intuition seems to break down when we stop thinking about people and start thinking about companies: there, larger feels like better. But that’s not true, and there are two main benefits of keeping a narrow focus."}, {"type": "subtitle", "content": "1. It’s easier to sell to a narrow market"}, {"type": "sentence", "content": "When you advertise something to a narrow market, your target audience will immediately know if it’s something for them or not. Your value will be clear to them, and depending on how that market perceives you, you will know whether you’re on the right track or not."}, {"type": "sentence", "content": "Of course, the many people outside of your target market will see that what you do is not right for them. But you don’t care about them: focus on your core market."}, {"type": "sentence", "content": "That’s something even the largest companies understand: Nestlé rarely sells under its name but operates thousands of brands which can each have a message targeted to their audience: from Nespresso to affluent middle-aged professionals to Purina for pet owners or Nescafé for people who like to live in misery."}, {"type": "subtitle", "content": "2. You won’t be able to serve several markets well"}, {"type": "sentence", "content": "Different geographies have different cultural norms which will translate in different sales strategies — not to mention different languages for your product. Different customer sizes will not have the same requirements. Early in my last company, Teleport, we had decided that we would be B2B, selling to large enterprise accounts. This changed completely our development roadmap: out were things like credit card processing, since our customers would be settling few, large bills. In were security audits and stuff like single sign-on."}, {"type": "subtitle", "content": "Make something few people love"}, {"type": "sentence", "content": "With that in mind, if you try to juggle all of your markets, you will end up with a half-baked product for each one of them. How could it be any different, since by definition a startup has resources to do only a tiny fraction of what is on its radar?"}, {"type": "sentence", "content": "As Sam Altman from Y Combinator said in his great How to Start a Startup lecture:"}, {"type": "sentence", "content": "One other thing that Sam Altman doesn’t say is that if you create something some people love, they will also have a much higher tolerance to any bugs or shortcomings with your product. They will stick with you and help you make it better. No one who just “likes” something ever does anything like that."}, {"type": "subtitle", "content": "Bad reasons for staying unfocused"}, {"type": "sentence", "content": "Do the previous points make sense? I hope they do. They usually do. But they are usually not enough to convince anyone that they should stay focused. People will find reasons why in their particular case, the alternative approach is the one that makes sense. I hear three main counterarguments that need to be addressed right now:"}, {"type": "subtitle", "content": "1. We want to keep our market as large as possible"}, {"type": "sentence", "content": "First of all, if you are a 5-people start-up, any market is large enough. Anywhere you can get half a million per year, you can survive. But you want to grow, right? And you need to show your investors that you’re going to conquer a billion-dollar market? That’s fine. Explain in your pitch how your initial, small market, will allow you to understand and expand into a much bigger one. Explain how your laser focus in the beginning will allow you to create the best product in the industry. If that’s still not enough, remind whoever you’re talking to that Mark Zuckerberg started by making a social network only for Harvard students."}, {"type": "subtitle", "content": "2. We don’t know which market to focus on"}, {"type": "sentence", "content": "I get that. You have an idea, a hundred possible applications, how can you pick one and say no to the others? That’s bound to generate massive FOMO."}, {"type": "sentence", "content": "So you’ll have to do something drastic…"}, {"type": "sentence", "content": "You’ll have to go talk to your target audience."}, {"type": "sentence", "content": "And they don’t even have to be actual users of your product, they just have to be people in your target market. Talk to them. Ask them how they work, what their problems are, what they need. Pitch them your product. Ask them to test some early prototypes. And then get the feedback."}, {"type": "sentence", "content": "This is qualitative research so you will never be “done”. Time-box it, get insights, iterate on your idea, and then test it again. If need be keep repeating, as a mantra, that picking any market is better than picking none of them."}, {"type": "subtitle", "content": "3. Facebook/Google/Uber/whoever is not so narrowly focused"}, {"type": "sentence", "content": "This is the most challenging one, and it comes from the availability bias. At every stage, you will compare your company not to relevant competitors, but to the most visible ones. The most visible companies are very large. Very large companies have different imperatives than you do."}, {"type": "sentence", "content": "You should be comparing your 5-people start-up to other 5-people start-ups, and not to 50'000-people juggernauts, but you can’t do that because 5-people start-ups tend to be invisible."}, {"type": "sentence", "content": "So just try to keep in mind that a company like Facebook both needs to address several markets, because none of them is large enough on their own, and that they have the resources to do it. You don’t. But even companies like Facebook started laser focused on a small and apparently insignificant market. So for the moment, just don’t ask yourself “What would Facebook do?”"}, {"type": "subtitle", "content": "How a value proposition evolves"}, {"type": "sentence", "content": "As your company progresses, in its early stages (let’s say until you hit 20–50 employees or so), your value proposition should become more and more complex and narrow."}, {"type": "sentence", "content": "For instance, you may start with some experience with web analytics or a hunch that it’s a domain that is lacking something. So your early value proposition will be very broad."}, {"type": "sentence", "content": "You can’t operate with that. Lots of companies are in that space, with complete and advanced products: you won’t be able to come out and compete with the Mixpanels and Amplitudes of this world. So you have to narrow down."}, {"type": "sentence", "content": "Talk. To. Users."}, {"type": "sentence", "content": "Talk to users. There’s no way about it. Talk to as many people as you can, representing as many different industries. You will discover things. Perhaps you will discover that large companies already have analytics solutions in place, but that small companies are struggling. That’s great. Here is your new value proposition."}, {"type": "sentence", "content": "Ok, but small companies are still very broad. In the US a company of up to 500 employees still qualifies as “small”. And they also represent lots of different industries, each one with more or less to gain from web analytics. So talk to more people, and you’ll come up with more insight, and with a new version:"}, {"type": "sentence", "content": "That’s good. You now know you’re targeting retailers, and you aren’t interested by the ones selling through Ebay or Amazon."}, {"type": "sentence", "content": "Going forward, you will keep refining your value proposition until you reach something really, really narrow. I’m thinking out loud here:"}, {"type": "sentence", "content": "Does that VP make sense? I have no idea. Probably not. But then again I’m part of the general audience regarding that: I don’t operate an online store. Chances are that whatever truly valuable idea you come up with will look weird to anyone but your target audience. But if you did your job correctly, your target audience will love it."}, {"type": "sentence", "content": "So then you can go pitch these clients. You won’t be wasting time talking with larger companies or people selling through Ebay. And you won’t be sending them weak-ass messages promising “web analytics”: you will be able to tell them “hey, I know you have a problem of spending money on search terms only to have the carts get abandoned. I can solve that”. If you identified a real problem people will react to it."}, {"type": "subtitle", "content": "Wrapping up"}, {"type": "sentence", "content": "Think again about the bad reasons for not going that path. Wanting to keep your market as large as possible is going to lead you to try to do too many different things at the same time, thereby not doing any of them well. You will never know what market is the best but it doesn’t really matter, as long as you have a clear focus and find a valuable proposition for them. And don’t compare yourself to what the largest companies in the world are doing: their example is not relevant."}, {"type": "sentence", "content": "When you have found your tiny little niche, you will be able to sell to it efficiently, you will be generating revenue and, more critically, you will be getting with each passing day additional insights into your market. You will then be able to expand into neighboring markets, other industries, etc. But leave that for when you have exhausted the potential of your tiny starting market — but that’s a story for a different time."}, {"type": "image", "content": "https://miro.medium.com/max/2132/1*AOEYPTCBX_0IIdS1jMMPIA.jpeg"}, {"type": "sentence", "content": "About me"}, {"type": "sentence", "content": "I’m a product manager, 500 Startups alumnus, consultant."}, {"type": "sentence", "content": "I’m program manager at a growth company and consult on product management in large companies and start-ups alike."}, {"type": "sentence", "content": "The rest of the time, I read random books and cook vast amounts of food."}, {"type": "sentence", "content": "Connect with me through my website, Twitter, LinkedIn."}]}