{
  "title": "Are you a Depressive Freelancer During a Pandemic?",
  "data": [
    { "type": "sentence", "content": "Behold the trifecta of doom, right?" },
    {
      "type": "sentence",
      "content": "Please allow me to tell you a little story. I lost five years to chronic depression then spent almost two rebuilding a life word by word, trusting I could write my way out of anything. Because desperation always needs a hint of hubris to function. Mainly, you hope curiosity will override shame and embarrassment."
    },
    {
      "type": "sentence",
      "content": "For those five years, I couldn’t think so I couldn’t write. I sought solace in the words of others so I wouldn’t forget my own. I hoped words weren’t gone for good, just for the moment."
    },
    {
      "type": "sentence",
      "content": "And the moment happened to linger and loiter inconveniently."
    },
    {
      "type": "sentence",
      "content": "When I recovered my ability to string words together, I reasoned it was only a matter of time until I processed what had happened and moved on. So when I arrive in the Netherlands at the end of 2019, I’m looking forward to the next chapter of a narrative never not tentative but still ongoing, against all odds."
    },
    {
      "type": "sentence",
      "content": "I’m thousands of miles away from the Pacific Northwest, where I started."
    },
    {
      "type": "sentence",
      "content": "Better health is almost within my grasp."
    },
    {
      "type": "sentence",
      "content": "There are exciting editorial adventures ahead."
    },
    {
      "type": "sentence",
      "content": "Soon, I’ll stop falling off my bike."
    },
    {
      "type": "sentence",
      "content": "Overnight, the pandemic upends everything and life stalls."
    },
    { "type": "sentence", "content": "Lockdown happens." },
    {
      "type": "sentence",
      "content": "One day, my main challenge is how to re-enter staff employment so I no longer have to rely on freelancing and can eat more than once a day. The next, my main challenge is how to keep freelancing so I can eat at a time when language has become more elusive than ever."
    },
    {
      "type": "sentence",
      "content": "I’ve been here before, this is terrifying."
    },
    {
      "type": "sentence",
      "content": "I can’t afford to lose my words again as they’re vocation, livelihood, and how I deflect rumination. I’m carrying one big omelette in a basket and it’s leaking all over my shoes. Still, coaxing my depressive brain into producing or editing copy doesn’t give it time for existential angst. And editing other people means spending hours in their universe, an experience that always enriches my own."
    },
    {
      "type": "sentence",
      "content": "I second-guess myself far more often than I used to though. This reality is such a curious mix of familiar and off the wall it keeps slipping through my fingers. The brain that spent years trying to kill me makes sure I know it hasn’t given up trying."
    },
    {
      "type": "sentence",
      "content": "It tells me now is the perfect time to check out."
    },
    { "type": "sentence", "content": "But I’m not done." },
    {
      "type": "sentence",
      "content": "At this rate, the transition process that was always going to take a while may well take forever. I’m more than OK with that. Although I still think about dying several times a day, it no longer happens daily. This counts as massive progress. ‘Not dead yet’ has been my good enough for a long time. Anything on top of that is extra."
    },
    {
      "type": "sentence",
      "content": "As many chronically ill folks will tell you, our lives have fallen apart countless times before. However, we’re shit show veterans, aren’t we? Many of us even freelance despite illness when it isn’t exactly the most obvious choice. We’re always worse off than employees, on either side of the Atlantic. No sick days, no paid leave, and precariousness as a frequent bonus."
    },
    {
      "type": "sentence",
      "content": "But hey, even if we’re freelancers by default and not by design, being able to work beats not being able to at all."
    },
    {
      "type": "sentence",
      "content": "If the pandemic has already chewed you, you might have failed to consider your greatest strength: ingenuity."
    },
    {
      "type": "sentence",
      "content": "Why would your imagination fail you when you’ve always been able to envision alternatives to what is? There’s so much freedom to be found in doing things we’ve never done before, if only because it shakes up our malfunctioning brains. And it lets our inner child run free, going from no to wow. If your livelihood is disappearing fast, go commit random acts of creative faith and see what sticks. The internet is an ideal sandbox, especially at a time when there’s an enormous captive audience."
    },
    {
      "type": "sentence",
      "content": "If you can help alleviate the general malaise and disquiet with something you make or do, go for it but maybe steer clear of turning panic into a pay check unless you want it to be your personal brand. It could be quite hard to pivot after that."
    },
    {
      "type": "sentence",
      "content": "Many post-pandemic surprises await humanity so you might as well start incubating the future now by embracing enthusiasm wherever you can find it."
    },
    { "type": "sentence", "content": "Remember, this moment is finite." },
    {
      "type": "sentence",
      "content": "I’m a French-American writer, journalist, and editor living out of a suitcase in transit between North America and Europe. To continue the conversation, follow the bird. For email and everything else, deets in bio."
    }
  ]
}
