{"title": "Take Your Writing to the Next Level With These 12 Free Tools", "data": [{"type": "image", "content": "https://miro.medium.com/max/10256/0*1gx6CbJB3MX96d3R"}, {"type": "sentence", "content": "When I was just starting out as a copywriter, I thought I had everything I needed. This included my MacBook, some legal pads, business cards that I’ve used exactly twice, and a whole lot of motivation to take my success into my own hands."}, {"type": "sentence", "content": "Oh, sweet, naive Nessa."}, {"type": "sentence", "content": "It wasn’t long before I started hitting small, albeit time-consuming and annoying roadblocks. Anyone writing for a living knows that time is money, and anything slowing you down has got to go."}, {"type": "sentence", "content": "I spent so many hours bowing down to my keyboard, second-guessing my word choice, sentence length, and headline selections. Once, it took me over 8 hours to write the first draft of a 1,000-word article—and that didn’t include editing or revisions."}, {"type": "sentence", "content": "Repeated moments of minor defeat had me wondering if I’d made the right choice."}, {"type": "sentence", "content": "Rather than throwing in the towel, I followed tips from my mentor and asked other successful writers what they used to solve these problems. It turns out, there are a lot of free tools out there that can make you a better, faster, more sought-after writer!"}, {"type": "sentence", "content": "To save you loads of time and probably some screentime-induced headaches, here are 12 indispensable tools that will help you level-up your writing skills and efficiency without spending a dime."}, {"type": "subtitle", "content": "Grammarly"}, {"type": "sentence", "content": "If you aren’t aware, Grammarly is like spell-check on steroids. Get it, use it, quit publishing stuff with typos and grammatical errors because that’s plain lazy. You’re welcome."}, {"type": "subtitle", "content": "Headline Analyzer(s)"}, {"type": "sentence", "content": "You may have heard that you should write at least 3, 25, or even 50 headlines before you settle on one. I don’t count my headlines, but I do write until I run out of ideas."}, {"type": "sentence", "content": "After taking some time to eliminate the ones that are total crap, I plug the top contenders into a headline analyzer like this one from Sharethrough. Generally, the one with the highest score wins, but I don’t let a few points skew my human judgment. If I’m truly on the fence, I take one of two approaches."}, {"type": "sentence", "content": "If this is for a client’s blog or email list, I suggest that they implement A/B testing, or ask them to pick what they prefer."}, {"type": "sentence", "content": "If this is for my work, I’ll go with the one that feels better in my gut—or I’ll implement the next free writing tool."}, {"type": "subtitle", "content": "Conversation"}, {"type": "sentence", "content": "Listen. Bouncing around ideas really works. Some of my best work happens when I’m not anywhere near my computer. If you catch yourself holding your breath trying to make a decision or get clear on an idea, get off your butt and go have a conversation about the subject with a real human."}, {"type": "sentence", "content": "Being a home-body and introvert, this is usually my husband. Go figure, he usually has some good ideas, and talking about things helps me take a conversational approach when I get back to writing."}, {"type": "subtitle", "content": "Capitalize My Title"}, {"type": "sentence", "content": "Do you ever look at a headline and think “should this word be capitalized?” Even the most experienced writers can lose sight of proper title casing when they’ve been spitting out words for hours on end."}, {"type": "sentence", "content": "This is where Capitalize My Title comes in handy. You can go for the standard title case or AP/APA/Chicago/MLA style, Wikipedia, Email and more."}, {"type": "subtitle", "content": "Yoga and Meditation"}, {"type": "sentence", "content": "You may have noticed a trend that these successful writers on Medium—you know, the ones who are raking in the G’s—talk about getting into a flow state. I’ve noticed gym workouts and showers are top tips for achieving this."}, {"type": "sentence", "content": "Don’t get me wrong—I completely believe those things work and understand the science behind it. But as a yogi, movement, breathwork, and meditation are my tried and true for entering a state of flow."}, {"type": "subtitle", "content": "Plagiarism Checker"}, {"type": "sentence", "content": "I admit I don’t always use this when the work is going to be published under my name. I do always use it for client work, though. How horrible would it be to learn that an article I charged someone money for was removed from publication or performed poorly because I failed to switch around some words and phrases?"}, {"type": "sentence", "content": "Plagiarism can happen accidentally, so check your work. This is such a simple way to add value to your writing services."}, {"type": "subtitle", "content": "Hemingway"}, {"type": "sentence", "content": "Here’s another tool I don’t always use, but I did rely on it a ton when I first started out. See, there’s this thing that can happen when you write where your normal conversation skills go out the window and you sound like"}, {"type": "sentence", "content": "a) a robot"}, {"type": "sentence", "content": "and/or"}, {"type": "sentence", "content": "b) an elitist douche."}, {"type": "sentence", "content": "Jargon-packed, long sentences with too many adjectives are a waste of everyone’s time. If you’re struggling to make your writing more conversational, use Hemingway. You’re welcome, again."}, {"type": "subtitle", "content": "Google Docs"}, {"type": "sentence", "content": "In my humble opinion, there’s no better place to write, format and share writing (before publication) than Google Docs. Have your beef with Google if you must—but you can’t beat a free tool with these capabilities."}, {"type": "sentence", "content": "Here are a couple of ways it helps me be efficient in my business."}, {"type": "subtitle", "content": "My Whiteboard"}, {"type": "sentence", "content": "I used to be a legal pad gal, but after tossing so many in the bin, I realized that I was being a wasteful jerk. Rarely were my legal pad ideas worth saving."}, {"type": "sentence", "content": "Since deciding to be an eco-friendly business, I use my giant whiteboard. This was an initial investment of around $60 USD and maybe a few bucks for pens and hardware to install it. I was probably spending $5–10 per month on legal pads. You do the math."}, {"type": "sentence", "content": "I’m not attached to any ideas ever—a mindset a highly suggest if you want to be a copywriter—but if I think something is worth saving, I’ll take a picture of the board before erasing."}, {"type": "subtitle", "content": "Podcasts"}, {"type": "sentence", "content": "Part of being a copywriter is being a detective and asking things like…"}, {"type": "sentence", "content": "What are experts in your industry up to?"}, {"type": "sentence", "content": "What keeps your clients up at night?"}, {"type": "sentence", "content": "What keeps their clients up at night?"}, {"type": "sentence", "content": "What might people object to about the product, service or idea you’re selling?"}, {"type": "sentence", "content": "What’s the next trend going to be?"}, {"type": "sentence", "content": "These and oh so many more questions can be answered by listening to podcasts while cooking, cleaning or driving. This off the clock research can help you learn about your niche, identify sub-niches, and become an expert in new subjects in your free time."}, {"type": "subtitle", "content": "Juicy crime novels"}, {"type": "sentence", "content": "Or whatever else you crave to read. I personally love crime novels because:"}, {"type": "sentence", "content": "My current favorite author is Tana French. She’ll give you plot twists that make your head spin, and you’ll love her for it."}, {"type": "subtitle", "content": "Medium"}, {"type": "sentence", "content": "You didn’t really think I’d forget to mention Medium, did you?"}, {"type": "sentence", "content": "Having a place to self-publish is a true gift to writers everywhere. It motivates and inspires me to not just write for clients, but for myself and audiences I might not otherwise reach. While I’m extremely grateful for the opportunity to help my clients reach their goals, having some artistic freedom is essential to keeping the creative juices flowing."}, {"type": "sentence", "content": "Ready to quit playing small and make real money writing? This is the exact course I took to launch a business that aligns with my values and quit my job in just six months. I believe in this course so much that I became an affiliate, meaning that if you follow that link and decide to go all-in, I’ll receive a commission on your investment at no additional cost to you."}]}