{"title": "Video Games & The Inevitable Becoming", "data": [{"type": "sentence", "content": "Going through Kevin Kelly’s book about the 12 inevitable tech forces that will shape our future, I was curious about how this might apply to the video games industry. In the first chapter of his book — The Inevitable — he speaks about this idea of “becoming”. A state of being that sounds contradictory at first, one of constant evolution — the idea of moving from fixed products to always upgrading services and subscriptions."}, {"type": "sentence", "content": "He opens up the chapter by stating how “…everything, without exception, requires additional energy and order to maintain itself”. I think he is right when he says that “…code corrodes…“. Us humans are never content for very long, and then we hunger for a feeling of progress. For example, video games need an updated to run on newer systems. If not, then they might rust, cease up and — one day — stop working."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*rGIj2VnydQcuZgbIfk580g.jpeg"}, {"type": "sentence", "content": "Everything is so interconnected now, “…upgrade this; then suddenly you need to upgrade that“. Kevin aptly likened the current need for incremental upgrades to personal hygiene, “…you do it regularly to keep your tech healthy”. If it is inevitable that fixed products become services, how has this, and how will this affect the video game industry?"}, {"type": "sentence", "content": "The platforms that a game releases on is the factor that influences the design of a game the most because it is the first point of contact for the consumer. Determining when, where, and who is playing because of its price, availability, portability, filters, features, etc. The business model of a platform, in turn, influences the business model of the games on it."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*LtecwvStvUWXH9YIvpNH3Q.jpeg"}, {"type": "subtitle", "content": "The Stadia Conversation"}, {"type": "sentence", "content": "I wrote the original version of this article shortly after Google revealed its new gaming platform called ‘Stadia’. A streaming centric platform which touted the ability to accessed the latest compute-heavy games through nearly every device you own that has a screen. Since then, Stadia launched with a very compromised vision. Something that is much more lacking and restrictive, as well as offering weak incentives to developers and consumers alike."}, {"type": "image", "content": "https://miro.medium.com/max/1570/1*OJc4R-ddHCgSspffFJ5RUQ.png"}, {"type": "sentence", "content": "However, I think it’s initial pitch is still telling of where industry leaders are headed."}, {"type": "sentence", "content": "Stadia had proclaimed that you [the consumer] never need to update hardware or software ever again because all of that is taken care of on the server’s side. Simply access the service through your pre-existing smart devices and use any of your pre-existing controllers. Even swap between devices with ease."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*4lPi4zR7F_Cwl82W1EfeEw.jpeg"}, {"type": "sentence", "content": "Xbox’s ‘XCloud’ service and PlayStation Plus are the closest analogue to Stadia at the moment. Notably Xbox’s parent company Microsoft has already invested heavily in their cloud computing Infrastructure."}, {"type": "sentence", "content": "Amazon is another big player in the space, with their cloud services gathering close to 50% of the market share. They are spending in the game development space too, having produced their own proprietary engine — Lumberyard, based on the acclaimed CryEngine — and have been steadily investing into game creation for many years."}, {"type": "sentence", "content": "Even beyond the platform holders, game publishers like Bethesda are already investing in creating better tools to help their studios build games for streaming."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*t4tuUFVgTavpfo5s7mqYiw.jpeg"}, {"type": "sentence", "content": "I must briefly acknowledge that a platform like Stadia does bring up a lot of questions around — the already dismaying issue of — ownership and preservation of games as an artistic medium. I don’t have much to say right now, but it’s worth taking note."}, {"type": "sentence", "content": "At the time, we didn’t know a whole lot about Stadia’s business model. There was reasonable speculation that it could operate much like Google’s Play Store on Android. With it being free to access the service and ‘Free To Play’ apps, but there are also premium apps and add-ons that require a purchase. Google would then get a cut of any item purchased or rented on the platform."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*1IVreuo6BG0MMM_xYGbnrA.jpeg"}, {"type": "sentence", "content": "As of now, Stadia demands a monthly subscription to access the service and also requires you to purchase games at the standard market rate, while also being limited to a few select high-end smart devices and reliably fast internet. There was a planned ‘free to access’ version, which would have fewer benefits, but that has yet to materialise."}, {"type": "sentence", "content": "Most folks seemed to have been hopeful that Stadia could have a subscription model that - like Xbox Game Pass - gives you access to the entire library of games on the service. I suspect that is because — if successful — it would have shaken up the market."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*4JWu1O5pm4S_Gx1qk7I26w.jpeg"}, {"type": "subtitle", "content": "LifeStyles"}, {"type": "sentence", "content": "On an episode of the Dude Soup podcast following Stadia’s announcement, Alanah Pearce predicted that Stadia (especially if it charges a subscription that grants access to every game on the service) would disrupt the current trend of lifestyle games. That being individual games that you’re expected to play as part of your routine and attempt to be a content delivery platform onto themselves with regular updates (a ‘live service game’). She suggests that this could incentivise many games to take on a similar business model to a lot the mobile market (referring to more short-form experiences). Since you — hypothetically — wouldn’t need to pay to access each game individually then you would be less compelled to stick around."}, {"type": "sentence", "content": "Likewise, on a similarly timed episode of the Game Informer podcast, Kyle Hilliard expressed concern that people won’t really get to love a game because it will be too easy to move onto something else."}, {"type": "sentence", "content": "I think those are reasonable concerns, but I don’t believe this will become the norm. Although there certainly will be growing pains."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*Nq5miHLKADPea25pBlVaTQ.jpeg"}, {"type": "subtitle", "content": "A Brief Disclaimer"}, {"type": "sentence", "content": "Before I go any further, I should stress that I am just one person and I have — what I imagine is — a rare perspective on video games compared to the breadth of the game buying public. I have worked in the industry, and I spent four years studying in a Game Art & Design degree programme. I know that I have my biases and — so — I invite you to share your thoughts with me! @RichToTheArdYo on Twitter or in the comments further down."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*DO2OJ4-VRQuOL3581sIaLw.jpeg"}, {"type": "subtitle", "content": "Existing Subscriptions"}, {"type": "sentence", "content": "I have a PlayStation Plus subscription that grants me the ability to play PlayStation games online, but it also gifts me at least two entire games a month. I don’t play most of them, but every now and again — and maybe I am the exception here — I do try out a game that I probably otherwise wouldn’t have bought. Sometimes I find that I really, really like it and then I buy some DLC to expand on what I liked and as a show of support."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*mcJgndl9SJ-HdHV0CMvX0A.png"}, {"type": "sentence", "content": "Maybe easy and instant access to a wide range of titles will not devalue every game, but will instead enable people to find those games that they would value the most and wouldn’t have realised otherwise."}, {"type": "sentence", "content": "That’s a little simplistic and probably over-optimistic. On the flip side, the games that would have excited me previously don’t have that same effect due to the sheer amount of well made unplayed titles in my PlayStation library."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*Q2jypU5rsIgxzMJzV4vrWQ.jpeg"}, {"type": "subtitle", "content": "Interface"}, {"type": "sentence", "content": "The user interface of the PlayStation 4 doesn’t help my perception of a game’s worth. The UI allows me to filter my game library to see every game at once or just the games I got through PlayStation Plus, but it won’t let me see only the games that I deliberately purchased. That alone seems to harm the perceived value of purchasable games for me. They no longer stand out once I buy them, they are more easily lost in the crowd, so why invest?"}, {"type": "sentence", "content": "My point here is to attempt to demonstrate how much power the platform has over your experience and the surprisingly large impact of such small design details."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*4VI_jMnwOoPDyYNxB6HHLA.jpeg"}, {"type": "subtitle", "content": "Free To Play & Your Back Catalogue."}, {"type": "sentence", "content": "The success found by FTP (‘free to play’) games cannot be understated. Regularly making up half of the top ten most played games on Steam."}, {"type": "image", "content": "https://miro.medium.com/max/2392/1*jY38Slplwn_LGkhJhsq1fw.jpeg"}, {"type": "sentence", "content": "Of course, Steam is missing many of the big core FTP hitters such as Fortnite, League Of Legends and HearthStone. But there are many other healthy FTP games out there for most genres. I’m personally enjoying Warframe on PC at the moment, yet I have 250 games (and counting) on just my Steam library."}, {"type": "sentence", "content": "Warframe is a lifestyle game. I hop into it for up to an hour every other day because I enjoy its core gameplay and making a little more progress on my extrinsic goals. It’s familiar, and that is comforting. Very comforting, in fact. To the point where I may put off playing other games that I might enjoy more at that moment in time."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*09NnG9xhYTWD5xY9P7nwRg.png"}, {"type": "sentence", "content": "Comfort is a powerful motivator. So I would argue that having access to more games does not mean you’ll play an individual game less thoroughly."}, {"type": "sentence", "content": "I would imagine that — if you are an avid player of games right now— your behaviour on that front will largely stay the same. I believe the most significant impact will be felt by those who have yet to embrace the medium."}, {"type": "sentence", "content": "I’ll discuss that idea more under the heading ‘Newbies’."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*_oRFwPJiD1c4LkSjuHIT2A.jpeg"}, {"type": "sentence", "content": "Admittedly, there is a period when you are adjusting to a game, and you are not very emotionally invested. It’s easy to walk away at that point, especially if you have are not financially invested too. Warframe was not a game that gripped me immediately. I actually gave it a go back in 2017 and bounced right off it. But I decided to give it another go recently because of what its community had to say."}, {"type": "sentence", "content": "I’ll discuss that idea more under the heading ‘Prosumers’."}, {"type": "sentence", "content": "In a best-case scenario, live service games would produce more of what the consumer likes. In a more worst-case scenario — as we have seen several times in even the last two years — it can encourage a practice of releasing an unfinished game experience to consumers. It can (hypothetically) be finished later, it’ll bring some money in the door now, and people will (hypothetically) return when it is much improved."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*_N6XPmZ-UN14fbKbDTMmAw.png"}, {"type": "sentence", "content": "A lot of this is because of growing pains as studios restructure and adapt their tools to support continuous post-launch content updates."}, {"type": "sentence", "content": "However, something else to consider as a consumer is that live service games are not typically designed to be finished. I would liken it to watching a TV show instead of a movie. Admittedly that line has become blurry in recent years…"}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*sZCKff5Bzvyx9ew1eEOppg.jpeg"}, {"type": "sentence", "content": "As the Motley Fool reported in a 2019 earnings call for Electronic Arts (EA), CEO Andrew Willson stated: “our entire marketing organization now is moving out of presentation mode and into conversation mode and change in how we interact with players over time.”"}, {"type": "sentence", "content": "EA intends to adopt a soft launch approach. Up until now, many live service games have been sold as completed mass-market products despite part of the sale pitch being the game’s future potential. A soft launch approach means that their games would be marketed as more bare-bones products initially and aimed at a niche audience that would enjoy riding the development wave. How a product was framed — through its marketing and pricing — had caused much of my frustrations with such titles in the past. Setting appropriate expectations is very important."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*1-4f06iD-oNR47iOpU5t9A.jpeg"}, {"type": "sentence", "content": "For game companies, this is a much safer bet. You no longer get only one chance to impress, you can get more use out of a game after launch, and the increasing need for post-launch support could ensure that employee jobs are more stable."}, {"type": "sentence", "content": "For the average consumer, I can’t see there being much of a change from now. The fear of missing out is potent, so there will always be big expensive ‘completed’ blockbusters that cast a wide net. Be it to get people onto a platform or to make a profit."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*qqrtwzPUcersmGhLnucTJA.jpeg"}, {"type": "sentence", "content": "However, those who are more engaged with the hobby will likely see more modestly budgeted niche titles emerge. I’ve seen a growing number of games find success through word of mouth. With decreasing barriers to entry and increasing online connectivity, this trend will undoubtedly continue to grow."}, {"type": "sentence", "content": "Going back to Kevin Kelly, he also touches on Prosumers and the idea of leveraging the audience to create content. As an interactive medium, this is a big topic to cover for video games. A Prosumer is someone who both consumes and produces content. As a topic, that could encompass Streamers, Modders, access to powerful developer tools (like Unity), or even games modes where the player can build their own levels or parts of it and — honestly — most media outlets. It’s a broad label. Staying somewhat on topic with what I already discussed, how do Prosumers fit into the live service business model? Influencers."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*V-JgntcnCkFa8pJt6D0OAg.jpeg"}, {"type": "subtitle", "content": "Evangelists"}, {"type": "sentence", "content": "An aspect of the soft launch approach is to foster evangelists in your audience. A live service game will never be finished in the strictest sense of the word, so I imagine its marketing budget has to be spread out more. Without that one final day where the product can be declared to be ‘ready for all to see’, I would think that it is more difficult for the marketing team to persuade people to hop on at any one point in time. That is where your friend’s recommendation comes in and that of influencers. Cultivating evangelists will increasingly become part of a game’s marketing and release strategy."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*TGJRgut1EssTFaXNJyDEqw.jpeg"}, {"type": "subtitle", "content": "An Exciting Routine"}, {"type": "sentence", "content": "During a talk titled Designing ‘Path of Exile’ to Be Played Forever at the Games Developers Conference (GDC) in 2019, Chris Wilson spoke about the importance of accepting that players will leave your game eventually. But that players can return if you release sizable new content at a predictable rate. He mentioned how he got this advice from the streamer, Kripparrian, who figured that a live service game is not so different from the business of live streaming."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*NCr51gimzVVtAwR9XVQxvw.jpeg"}, {"type": "sentence", "content": "I believe he has a point. You can increase your organic traffic by encouraging habits, getting your audience to say ‘oh it’s the first day of the month, that means there’s new content’. Regular updates also mean that more people will be paying attention to the game in the media or on your website even if they are not currently engaging with the game itself. They might be done with the current content but eagerly await the next."}, {"type": "sentence", "content": "Gaming can be an expensive hobby. A modestly powerful phone, console or PC can still be a costly barrier to entry for someone who isn’t sure if they’ll enjoy the experience. If someone does invest in a low-end device, they may have a poor experience and call it quits. A game might run poorly for them or not at all. They may have tried out poorly made games or had an uncomfortable setup."}, {"type": "sentence", "content": "Streaming won’t solve all of this with one fell swoop, but it does have the potential to enable more devices to deliver a more reliably consistent experience. You will have more of a say over when, where and — maybe — how you play a game. Doing what suits you better, pulling focus away from the device and towards the game experiences."}, {"type": "sentence", "content": "A subscription could also help bring new people in. A wide selection of experiences to try out off the bat, and it’s also a very familiar proposition — at least for people in the Western world. Many people already have subscriptions for music, movies and even groceries, likely expecting the same for games."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*OQAHZ3F6Uljp94gvKL9zig.jpeg"}, {"type": "subtitle", "content": "Old Newbies"}, {"type": "sentence", "content": "Kevin Kelly notes how — due to constant evolution — everyone will always be a ‘newbie’. A humbling notion worth keeping in mind."}, {"type": "sentence", "content": "Before finishing this piece, I opened up Apex Legends for the first time in about a year, and it immediately befuddled me with all the added bells and whistles (new art, additional progression systems and like, along with a series of pop-ups)."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*vb65d9yOm6w9IYJ3_1XTsw.png"}, {"type": "sentence", "content": "It isn’t even that different from the last time I played, and the core game is the same. Yet when I launched into a couple of matches and I was even more befuddled."}, {"type": "sentence", "content": "The game has a new map, new weapons and new characters with new abilities. Maybe I’m ageing faster than I realise, but I figure that my befuddlement was the result of expecting things to be the very same from the last time I played. It didn’t help my self-esteem to (due to not playing in a long time) be grouped with and defeated by people who had a much lower level than me. I had become a ‘newbie’."}, {"type": "image", "content": "https://miro.medium.com/max/3312/1*jS3KV-Yn584MsW8rCfphRQ.jpeg"}, {"type": "sentence", "content": "I got over all that and shucked some of the rust off before too long. But I was surprised that I was surprised by the changes. I spoke earlier about ‘comfort’ as a powerful motivator. I think I went to play Apex Legends because I sought an old comfort."}, {"type": "sentence", "content": "How do you keep your product friendly to new users and lapsed users while retaining your existing users? Managing that balance is going to be the biggest challenge for designers in the industry going forward."}, {"type": "sentence", "content": "With constant evolution and the increasing prevalence of algorithmically chosen content, it is easy to find ourselves in isolated echo chambers. Unaware of the sheer magnitude of change around us. There is no ‘THE Internet’. There is only MY Internet and YOUR Internet."}, {"type": "sentence", "content": "It’s easy to think of ourselves as being knowledgeable but — by ourselves — each individual actually knows very little. So I would hope that we can all be patient with each other in this ever-changing world."}, {"type": "sentence", "content": "Sh’laters,"}, {"type": "sentence", "content": "Richard."}]}