{"title": "Time is Money: How to Get a Better Deal For Your Work", "data": [{"type": "image", "content": "https://miro.medium.com/max/9184/1*MpXsoPWujEpZUr4HtacBtQ.jpeg"}, {"type": "subtitle", "content": "Don’t be afraid to talk money up front"}, {"type": "sentence", "content": "Sometimes a market may not mention a specific fee, or they may say they’d be happy to ‘take a look’ at something you’re writing. Don’t feel the need to follow their discretion; you’re a professional, so ask what they’d pay if they accepted the piece. If it’s much less than you’d hoped, and you still want to go ahead, you can at least tailor the time you spend on the piece accordingly."}, {"type": "subtitle", "content": "Think of time as a currency"}, {"type": "sentence", "content": "Work out how much you want to earn per hour and prioritise your writing commissions accordingly. Remember wordcount is not always the best guide here. Say you have two writing jobs to do: one is $300 for 1000 words; the other is 1500 words for $175. The first looks the better deal, only you know the second will take you 3 hours to write and will be signed off straight away, while the other is complicated and will take 10+ hours, plus loads of feedback and amends. Which one is the better deal really?"}, {"type": "subtitle", "content": "Prioritise regular work"}, {"type": "sentence", "content": "Consider the likelihood of further work from the same people. A regular supply of straightforward work from a market you trust is probably more valuable for your career than an extra $50 from a market that will sit on your work for three months before they even acknowledge it."}, {"type": "subtitle", "content": "Ask for something else you need"}, {"type": "sentence", "content": "If you can’t get any extra money, see if you get something else that’s of value to you. An extra week’s extension on the deadline or access to an expert to interview could be valuable if you have a pile up of deadlines or the expert can short-cut your research time. Or you might ask for retention of certain publication rights, extra author copies, or a cap on the numbers of rounds of amends (another time-saver, especially with content work!)."}, {"type": "subtitle", "content": "Look hard at payment times"}, {"type": "sentence", "content": "Bigger fees are all well and good, but if you they take months to arrive, and you have to keep chasing them, that’s a lot of time and effort wasted that you could otherwise have spent on new work. Often a fast, reliable, but relatively modest payer is better value for your career."}, {"type": "subtitle", "content": "Start high, and have a minimum number"}, {"type": "sentence", "content": "Sales trainers say you should always be prepared to walk away if you can’t get your minimum amount. This gives you lots of power in a deal, but sometimes there are places we are desperate to get published and would gladly do so for nothing (only never say that!). In such cases, you just have to own that fact and focus not on the tiny fee but on the side benefits, such as great exposure for your author brand in a prestigious market."}, {"type": "subtitle", "content": "Stay silent"}, {"type": "sentence", "content": "Another classic negotiation trick is to get the other person to go first when it comes to naming a number. Their minimum offer might be higher than anything you’d dared imagine, but you’ll never know if you blurt your rate first. Often the one who speaks first is the one who is prepared to concede."}, {"type": "subtitle", "content": "Remember the relationship"}, {"type": "sentence", "content": "Be firm and assertive in watching out for your own interests, but always stay polite and professional. You want to write more for this market ideally, and you never know where your opposite number might work next too."}, {"type": "sentence", "content": "Dan Brotzel’s debut short story collection, Hotel du Jack, is published by Sandstone"}]}