{"title": "My Surprising Takeaway From Being an Obsessive Time-Tracker", "data": [{"type": "image", "content": "https://miro.medium.com/max/8736/0*hRSDv64IEFHT3pYt"}, {"type": "sentence", "content": "As writers, it’s easy to feel like there are a zillion demands on our time all the time — and until I get that book deal, the book baby that I spend as much time as possible working on it essentially unpaid labor. To get control over my time and figure out what was actually worth it, I started tracking my time a couple years ago."}, {"type": "subtitle", "content": "How time tracking helped me figure out which clients were “worth it”"}, {"type": "sentence", "content": "One of the most important things all the time tracking has taught me is not how much time I spend walking the dogs or writing essays, but how once you start paying attention is really easy to figure out what’s worth and what’s not worth it — and that threshold is different for each of us."}, {"type": "sentence", "content": "My book baby may be unpaid labor right now, but it’s a top priority and I’ve organized my week around it. I will happily spend as much time on it as I can even though there’s no immediate return on investment."}, {"type": "sentence", "content": "Other projects need to earn their weight. One of my minor clients paid me $500 last year for what seemed like odds and ends here and there but turned out to be 17 hours over the course of the year. My hourly rate for them was around $30."}, {"type": "sentence", "content": "Once I did the basic math, it was obvious how I could have earned way more money had I spent that 17 hours working for a client paid me more."}, {"type": "sentence", "content": "I could have bought myself so much time freedom to work on what feels most essential to me rather than netting $500."}, {"type": "sentence", "content": "I dropped the client at the end of last year, and earlier this week I applied the same logic to the creative side of things, when I received a rejection letter that shifted the way I approached submissions."}, {"type": "subtitle", "content": "How I use time tracking with creative writing"}, {"type": "sentence", "content": "To get a break from a novel I will sometimes work on flash fiction, which is easier to complete a short story and easier to publish in literary magazines. I’ll also revise and send out snippets of older things I found on my computer or even scenes from abandoned stories. I’m always sending out a few of these shortform pieces to build publication credits and expose new audiences to my writing."}, {"type": "sentence", "content": "Sending this work out connected me to literary journal that rejected me earlier this week (let’s call it Snazzy Litmag). Snazzy Litmag set me back one of those coveted rejection letters that says “thanks, try us again.” So I did. I got the same letter. I tried again, and I got the same letter with an extra note that this time it was “really close.” I tried again, and I got an even more fawning rejection letter."}, {"type": "sentence", "content": "And then I decided I was done with Snazzy Litmag!"}, {"type": "sentence", "content": "That so-so-so close rejection letter was my $30-per-hour moment. It was the moment when it became abundantly clear to me that the returns of continuing to submit to Snazzy Litmag were diminishing."}, {"type": "sentence", "content": "Like Guy Raz said on his last episode of the TED Radio Hour, I wanted to leave the party while I was still having fun."}, {"type": "sentence", "content": "I didn’t want to submit again and get an even more fawning rejection letter. But I also didn’t want to submit again and get published. It didn’t feel worth my time to write new pieces to submit to a journal that would pay me nothing for publishing them when I could write an essay for an outlet that would pay."}, {"type": "sentence", "content": "Without the clarity of time tracking, I don’t think I would have come to this decision. My ego would have clung to the praise and I would have planned a future batch of submissions to Snazzy Litmag, hoping this time the writing was good enough."}, {"type": "sentence", "content": "But I really don’t need to be good enough for Snazzy Litmag. That’s not my goal. I need to spend my time in ways that feel meaningful to me. I need to do the work that feels most impactful."}, {"type": "sentence", "content": "Right now, that means closing a door so I can give more of my writing time to what’s most important to me."}, {"type": "sentence", "content": "Lindsey Danis is a Hudson Valley based writer and frequent traveler who loves telling stories about travel, personal growth, resilience, and LGBTQ communities. She’s on Twitter @lindseydanis and has a free submission strategy guide for writers."}]}