{"title": "Why the Internet Is a Mixed Bag for Writers", "data": [{"type": "sentence", "content": "Welcome to The Draft, an advice column about writing and life from Eileen Pollack, former director of the University of Michigan MFA Program. We’re here to answer your questions about storycraft, writing, and telling the truth."}, {"type": "sentence", "content": "Have a question? Share it with us."}, {"type": "sentence", "content": "Dear Too Young,"}, {"type": "sentence", "content": "I’m not sure anyone younger than 50 can appreciate how profoundly the internet has changed the way writers write. Until the late 1990s, every time you were stymied by a fact, you needed to consult your 32-volume Encyclopedia Britannica, which most writers were too poor to own, or dash off to a library, where you spent hours roaming around a reference room, then begging the librarian to pitch in and help."}, {"type": "sentence", "content": "Tracking down clues about a historical event or a person’s life meant you needed to raise the money to travel to whatever institution stored the archives. If you were trying to jog your memory about your family’s trip to the 1964 World’s Fair in Flushing, New York, you might leaf through your mother’s scrapbook, but you couldn’t spend an afternoon on YouTube disappearing into video after video of the same exhibits you visited as a child."}, {"type": "sentence", "content": "I bless the internet every day for making my life as a writer so much easier. As much as I wish my publishers didn’t push me to promote my books on social media, I am grateful for the audience I otherwise might never reach. At best, a few thousand readers might see an essay I publish in the print version of a literary journal, while tens of thousands — or even millions — might read an article that goes viral online."}, {"type": "sentence", "content": "Amazon threatens to put bookstores out of business. But thanks to online shopping, people who don’t live near bookstores can buy or download my publications. Facebook, Twitter, Medium, and other sites I am too old and tired to keep up with provide venues for writers who traditionally would have been ignored or silenced. While the internet is a home for every rumor, lie, and crackpot theory a paranoid stoner might dream up, many print publications didn’t have the resources to employ fact-checkers either. Sources have always varied in credibility—that’s why teachers try to instill the skills necessary to read critically and evaluate an author’s credentials."}, {"type": "sentence", "content": "And yet, I hate the way Facebook and Twitter have turned me into a shill constantly trying to push my products. Even when I post something seemingly unrelated to a new book or column, I am posting that photo of my trip to Greece or that account of my misadventure at the dry cleaner’s so my friends won’t think the only time I post is when I’m trying to sell my work."}, {"type": "sentence", "content": "In the old days, a writer mailed off a manuscript to an editor, at which marketing the essay or book fell to the company’s publicity department. Now, creating a literary work is seamlessly connected to promoting it. Right from the start, when we ought to be listening to our hearts, our minds, and our imaginations, we’re already thinking about how to get more views."}, {"type": "sentence", "content": "Some writers intentionally stake out extreme or contrarian positions to shock their readers. Others quiver in fear of unleashing a firestorm of threats from trolls. In the early 1980s, when I was a columnist for a newspaper in New Hampshire, I might publish a piece that drew 10 or 20 hateful letters to the editor. (Often, these came printed in block capitals on yellow legal paper or scrawled on a bag in crayon.) I might get an earful when I tried to cash a check and the salesperson saw my name. But I didn’t need to worry that thousands of strangers would clamor for me to be raped or crucified."}, {"type": "sentence", "content": "Nor did I live in fear that I might ruin my career by professing a view that wasn’t sufficiently progressive. Believe me, I am not railing against “political correctness.” When I started teaching, students ran too great a risk to hand in stories with queer protagonists, let alone come out to their classmates. Writers of color tended to populate their fiction with white, middle-class characters to avoid the pain that typically arose when stories featuring characters who looked like them were discussed in workshop. A student or professor could make a hurtful comment with little fear of repercussions. I have no desire to return to those stifling decades. And yet, when I teach nonfiction now, my students seem so afraid of offending anyone, especially members of their own community, they sometimes refrain from telling the truth about their lives."}, {"type": "sentence", "content": "In the old days, anonymity provided comfort. I could write about a classmate from elementary school, a distant relative, or a former lover, and I wasn’t likely to hear back from anyone, if only because few of my childhood friends, relatives, or former lovers read the obscure literary journals in which I published. Now? My third-grade classmates, distant cousins, and former lovers will read what I have written online and respond immediately."}, {"type": "sentence", "content": "On the positive side, my increased timidity is balanced by the pressure to be more responsible. Is my account of that childhood incident strictly factual or have I embellished it? Did I bother to get in touch with that former lover and ask about their side of our argument? In writing about my eating disorder or my position on pornography, did I take into account the most likely opposing arguments? Have I considered all the data? Am I clinging to outmoded views? Should I modify my opinions? Or should I stand up for what I believe and take the flak? By forcing me to pay more attention to the consequences, social media has made me — for better and worse — more circumspect than I once might have been."}, {"type": "sentence", "content": "The internet and digital media also have influenced the quality of our prose. An entire book can now be researched, written, and edited without anyone needing to print out a hard copy, which means the writer never gets to notice the awkward sentences and wordy passages that become apparent only when viewed on the printed page."}, {"type": "sentence", "content": "The first writers who tried to earn a living online were bloggers, and blogs were meant to feel conversational. When I tried to write as carefully, as lyrically, as thoughtfully as I might have written when composing an essay for a journal, my readers made me feel as if I had arrived in a cocktail dress and heels at a backyard kegger. The virtual world seems to offer an infinite amount of (cyber)space in which a piece of creative nonfiction can unfurl, but people who are reading on a computer, let alone a phone, seem less likely to want to keep scrolling than people who settled into their easy chair with a book."}, {"type": "sentence", "content": "Everything seems so ephemeral: what we write doesn’t physically exist, so we don’t feel we are writing for posterity. In the past, someone writing for a magazine might have been a member of the staff, poorly paid but with a salary. Now we dash off our essays and posts more quickly, trying to earn a few clicks — and dollars — before the public’s attention drifts to the next crisis, trend in fashion, or hot new restaurant. (As I edit this column, which I wrote before the pandemic hit, I feel the pressure to make it seem relevant to coronavirus. And yet, that very pressure is one of the differences between the era in which I grew up and the one in which I now find myself writing and trying to earn a living.)"}, {"type": "sentence", "content": "Often this means we write what we already know, or think we know, because otherwise, we would need to leave the apartment and do some research in the real world, which feels scarier and more expensive. Do you join the chorus of complaints about people hoarding toilet paper during the current crisis, or do you drive out to Costco to interview the people who are filling their carts with Charmin and ask them why? We fall into easy patterns, finding someone we can call out and criticize, deploring the absurdities we have discovered elsewhere on the web. We share whatever wisdom we have acquired about how to date, how to escape a relationship, how penises or vaginas function."}, {"type": "sentence", "content": "Much of this discourse has been liberating and/or enlightening. We know far more about our bodies than most of us used to know. We feel less ashamed of our secret habits. But hasn’t everything that previously seemed unmentionable already been mentioned by now? Does anyone really think they know more about dating than anyone else? Can’t we foresee a time when trading our most humiliating anecdotes will seem ho-hum?"}, {"type": "sentence", "content": "Even I have fallen into the trap of writing what I already know — advice about living as a writer — rather than going out and doing some new investigative research. But I have an excuse — I am exhausted from all the research I did in my first four decades as a writer. You have no excuse, Too Young. Go out and visit someplace you’ve never been, even if it’s only the tiny town across the river. Rather than emailing the subject of your interview a list of questions, why not spend a day with them and structure your profile around whatever they do that’s interesting? Or come up with a mystery that truly puzzles you, then try to solve it."}, {"type": "sentence", "content": "Walking around a new physical place, opening the dusty boxes in an archive and paging through a diary or a sheaf of census forms can reveal far more than viewing that location or those documents on your computer. Did you notice the way the ink on those census forms kept running out? Can you imagine the poor census-taker going door-to-door in a Brooklyn slum in the late 1800s, perhaps fearing he might contract cholera or tuberculosis, trying to pry information from suspicious immigrants, many of whom didn’t speak English, even as he needed to find a place to set down his inkwell and refill his pen?"}, {"type": "sentence", "content": "Have a question about writing? Ask The Draft here."}]}