{"title": "Acknowledging the Emotional Labor of Being the Boss", "data": [{"type": "sentence", "content": "The story below is from a time in my career 20 years ago, long before we were in the grips of the current global Covid-19 pandemic. I’m sharing it now because I thought it might help managers who are struggling with the emotional labor of being the boss."}, {"type": "sentence", "content": "I described this story in the section of Radical Candor about why caring personally about each employee is central to your job as a leader. That is more true now than ever before."}, {"type": "sentence", "content": "Showing compassion is real work, and, like all real work, it is rewarding and also taxing. All over the world, leaders are being called upon to listen to stories that are hard to hear and to respond to emotions that are hard to witness."}, {"type": "sentence", "content": "Caring for others starts with caring for yourself. Don’t beat yourself up if you’re feeling burned out. Give yourself the break you need. You can’t possibly Care Personally about others if you don’t care about yourself!"}, {"type": "subtitle", "content": "Understanding Emotional Labor"}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*bxbnv0qdRnpQf-c0.png"}, {"type": "sentence", "content": "In 2000, our engineers had been working nights and weekends on an early beta version of our product, which would be ready in a week. The sales team had gotten 30 big-name customers lined up for beta testing. If those customers were using our product, we’d be able to raise another round of funding. If not, we’d run out of money in six months."}, {"type": "sentence", "content": "There was one blocker: me. The night before, one of our angel investors, Dave Roux, had told me he thought our pricing was all wrong. I knew in my gut Dave was right, but I couldn’t go to my sales team or my board and change everything just based on a gut feeling. I needed to sit down and do some analysis — fast. I’d cleared my calendar of meetings for the morning so I could do just that."}, {"type": "sentence", "content": "I’d gotten only a few steps into the office when a colleague suddenly ran up. He needed to talk right away. He had just learned that he might need a kidney transplant, and he was completely freaked out. After an hour and two cups of tea, he seemed calmer."}, {"type": "sentence", "content": "I walked toward my desk, past an engineer whose child was in the ICU. Must check in. “How’d your son do last night?” I asked. He hadn’t improved — and as he told me how the night had gone we both had tears in our eyes. I convinced him to leave the office and go and take care of himself for an hour before returning to the hospital."}, {"type": "sentence", "content": "I left his desk drained, passing by our quality assurance manager. His child had better news: she’d just received the highest score in the entire state on a standardized math test. He wanted to talk about it. I felt emotional whiplash as I jumped from sympathy to celebration. This kind of emotional labor — feeling the need to suppress my emotions for the good of the organization — left me feeling completely wrung out."}, {"type": "sentence", "content": "By the time I got back to my desk, I had no time or emotional reserves to think about pricing. I cared about each of these people, but I also felt worn out — frustrated that I couldn’t get any “real” work done. Later that day, I called my CEO coach, Leslie Koch, to complain."}, {"type": "sentence", "content": "“Is my job to build a great company,” I asked, “or am I really just some sort of emotional babysitter?”"}, {"type": "sentence", "content": "Leslie, a fiercely opinionated ex-Microsoft executive, could barely contain herself. “This is not babysitting,” she said. “It’s called management, and it is your job!”"}, {"type": "sentence", "content": "Every time I feel I have something more “important” to do than listen to people, I remember Leslie’s words: “It is your job!” I’ve used Leslie’s line on dozens of new managers who’ve come to me after a few weeks in their new role, moaning that they feel like “babysitters” or “shrinks.”"}, {"type": "sentence", "content": "We undervalue the emotional labor of being the boss. But this emotional labor is not just part of the job; it’s the key to being a good boss."}, {"type": "subtitle", "content": "Set Yourself Up for Success"}, {"type": "image", "content": "https://miro.medium.com/max/2048/0*auOw-DZXSlSySAtf.png"}, {"type": "sentence", "content": "That being said, it’s important to recognize that being the boss can be exhausting during the best of times, and during times of crisis, it can feel downright paralyzing. If you don’t identify ways to take care of your emotional, physical and mental health, you won’t be able to be there for anyone else."}, {"type": "sentence", "content": "A 2018 study published in the Yonsei Medical Journal reported that the sustained stress of emotional labor can quickly lead to burnout, psychological distress and depression. Now more than ever, it’s important to find ways to manage that stress — to take care of yourself so you can lead your team through uncertainty. This means knowing what you need to stay centered and making sure you make time for it."}, {"type": "sentence", "content": "Since that day in 2000, I have learned to focus first on staying centered myself, so that I could build real relationships with each of the people who work for me. Only when I am centered and my relationships are strong can I fulfill my responsibilities as a manager to guide my team."}, {"type": "sentence", "content": "It’s also OK to admit that you don’t have all the answers. However, when you do have information that affects your team, commit to delivering it as soon as possible in a way that’s kind and clear."}, {"type": "sentence", "content": "Things are difficult right now, and there’s no doubt that it might get worse before it gets better. This is why it’s more important than ever to be kind and clear, not only with the people you work with, but with yourself."}, {"type": "sentence", "content": "Read more in Radical Candor: Fully Revised & Updated Edition: Be a Kick-Ass Boss Without Losing Your Humanity, e-book and audio version available."}]}