{"title": "How Valorant compares to CS:GO", "data": [{"type": "image", "content": "https://miro.medium.com/max/3200/1*iTICvOVXGj-WmfTl0yz-GQ.jpeg"}, {"type": "sentence", "content": "Having watched my fair share of streams during the Valorant closed beta, I’ll be comparing some of the differences and similarities between the two games. Mainly looking at the mechanics of the game, the maps and the classes and their utility/ability usage. Having not actually played the game yet, these are just my opinions based on observations."}, {"type": "sentence", "content": "The gun mechanics share a lot of similarities with CS:GO, with the spray patterns looking easily recognizable for all CS:GO players. It does look slightly easier to control though and things like penalties for moving and shooting, do not look to be quite as severe. Overall the skill ceiling for raw mechanics seems to be a bit lower than CS:GO."}, {"type": "sentence", "content": "Something I find very interesting about Valorant is how the movement mechanics remind me more of CS 1.6 than CS:GO. The models move slower — making holding angles a lot more viable, as well as the CS:GO wide swinging a lot less viable. The ‘tagging’ effect of being shot also contributes to this, (being slowed down when hit.) Basically you have more time to react to players coming around corners or swinging out at you, than you do in CS:GO."}, {"type": "sentence", "content": "In theory this seems better to me — if you have the option to choose your position and angle that you want to hold, you should be rewarded for that and have the advantage. I believe this is the solution to the ‘peeker’s advantage’ issue that CS:GO faces. The way the gun and movement mechanics interact with each other gives the game a familiar, yet different feel — when compared to CS:GO."}, {"type": "sentence", "content": "Moving on to the maps, they share obvious similarities — every map has at least two bomb sites and some kind of middle area. I phrased it like this because the map ‘Haven’ actually has three bomb sites. I must say I don’t like this idea — I don’t think the maps need to be overly complicated or have some kind of ‘gimmick’ to each of them. Having three bomb sites on a map or having a map with teleporters or whatever else, doesn’t feel necessary to me. The complexity of how the map is played should come from the way the players interact with the map and doesn’t need to be overly complicated."}, {"type": "image", "content": "https://miro.medium.com/max/4252/1*aes3ppaieFMCFRBNK6qaaQ.jpeg"}, {"type": "sentence", "content": "Map images courtesy of Blitz.gg"}, {"type": "sentence", "content": "Looking at the overviews of these three maps, it also looks like there is an excess of small areas and angles to clear, as you move through the map."}, {"type": "sentence", "content": "Having mentioned some of the things I don’t like about the maps, there is a lot I do like. The general aesthetic and clean feel to them is certainly a positive. There is no visual clutter and the angles and design definitely emphasize competitive play."}, {"type": "sentence", "content": "The differences between the abilities and CS:GO utility usage is where the games really differ the most. I’m not going to go into all the classes, as there are plenty of videos and guides available and I’m sure classes and abilities are going to be changing fairly frequently, as the game moves from closed to open beta."}, {"type": "sentence", "content": "Looking through all the abilities that each class has — some of these abilities bear a close resemblance to utility usage in CS:GO, while other abilities are nothing like anything in CS:GO."}, {"type": "image", "content": "https://miro.medium.com/max/3840/1*0OcgxHtXhRjQRE-RYw1jUQ.jpeg"}, {"type": "sentence", "content": "Many classes have a smoke or vision blocking ability that can be used to block off choke points or help you get into bomb sites. In terms of vision blocking abilities there are also walls that can be created. These walls cover a much larger area than the ‘orb’ like abilities and have other effects as well. There are flash type abilities, although far less than would be used in a typical CS:GO game. Not many classes have the ability to flash areas, putting more of an emphasis on aim when taking map control. There are also a few molotov/incendiary type abilities."}, {"type": "sentence", "content": "At the moment these abilities seem incredibly powerful when used properly. A well coordinated team can just steam roll their opponents when using their abilities together. I’m sure things will be balanced out though, as the game moves forward."}, {"type": "sentence", "content": "This brings me to a point I really don’t like about this class system so far — I think they are trying to make it more complicated than it needs to be. I feel like if they just keep introducing more and more classes with each update, the game will be incredibly hard to balance. Balance the existing classes and let players master them before even thinking about adding any more."}, {"type": "sentence", "content": "Based purely on observation, I really like the look of the game. Certainly more positives than negatives in my mind and I can’t wait to play it. My only concern is them making the game more complicated than it needs to be. The game itself should be fairly simple, the way it’s played should be complicated."}, {"type": "image", "content": "https://miro.medium.com/max/5120/1*Hui2e06r1uXCsgI-aPgNSg.png"}, {"type": "sentence", "content": "Class guide courtesy of RockPaperShotgun.com"}]}