{"title": "Block-Busting: Writing exercises for breaking writer’s block (Part 2)", "data": [{"type": "sentence", "content": "Today we’re looking at a couple of techniques for adding depth, filling in plot holes and getting your narrative moving! This is the second in my series of tips and tricks for beating writer’s block and creative slumps."}, {"type": "sentence", "content": "Read on and prepare to be inspired…"}, {"type": "subtitle", "content": "Journaling"}, {"type": "sentence", "content": "Journaling has always been a great way to keep your writing hand in and the words flowing but have you ever thought about having your characters write a few journal entries?"}, {"type": "sentence", "content": "I find this to be a great way for finding and injecting some extra depth into your stories. Sit yourself at the desk of your character (any character) and let them write from the heart, through you. Have them chronicle the events of your plot and how it has affected their lives in both significant and small ways. This is your character’s opportunity to work through their own feelings and their feelings towards their castmates. While you’re writing these entries, work on the individual voice and tone of your character. You might uncover some details and feelings which fit naturally into your main narrative, which you can use to add bonus detail and depth to your main narrative."}, {"type": "sentence", "content": "Now, I’m not suggesting you randomly start inserting diary entries into your book (unless they are supposed to be there!); this exercise is intended to be a little something extra, just between you and your character. Or, you could polish them up and use them as free promotional material for your readers."}, {"type": "image", "content": "https://miro.medium.com/max/2560/1*KvhDSMrpBuyLRFSJ68HuJQ.jpeg"}, {"type": "subtitle", "content": "Phone-Tap Your Characters"}, {"type": "sentence", "content": "This is a great one for getting yourself into the swing of a tricky scene. Most writers either love or hate dialogue — and by that I mean, most writers are either really good at dialogue or struggle with it quite a bit. Fortunately, this trick works just as well for writers in both camps."}, {"type": "sentence", "content": "Strip a scene back to only dialogue and nothing more, like a transcript. To help you keep track of who is speaking, you can add a name before each line of dialogue. To begin, write nothing else and focus only on what lies between the quotation marks."}, {"type": "sentence", "content": "This might be all you need to inspire your creative juices to start flowing more freely. If not, start to build up more layers. Go back and add some physical actions to the dialogue, insert notes about changes in the environment, plot points or the comings and goings of other characters. Gradually flesh out the scene until you have all the essential pieces in place."}, {"type": "sentence", "content": "Now move on and write the next scene. Come back and redraft during the edit or when you’re feeling inspired to tackle it again — don’t let it hold you back any further."}, {"type": "sentence", "content": "The answer to writer’s block is very rarely not to write but, in fact, to write more. Unless you’re working to a professional deadline, forcing yourself to work on something is not a universal solution — although it does work for some people. Have you ever heard the saying ‘A change is as good as a rest?’ If you’ve come to a writing roadblock and simply persevering doesn’t feel like it’s working for you, try changing tactics."}, {"type": "sentence", "content": "Switching to a different project or taking a break to work on a short writing exercise is a great way to sidestep a block without letting your good writing habits slip. Sometimes a good warm up exercise is all you need! Often, while you’re focusing on something else, your brain has a chance to bubble away in the background and work through whatever is holding your back. Today’s tips allow you to stay focused on your project whilst giving you a break from any problems in your main narrative."}, {"type": "sentence", "content": "There is no one-solution-fits-all answer to feeling blocked or uninspired, so my advice to you is to try different approaches until you find one that works for you."}, {"type": "sentence", "content": "Originally published at https://plotfactory.com on March 16, 2020."}]}