{"title": "FAQ: How to Translate Writing Skills Into Editing Skills", "data": [{"type": "sentence", "content": "A freelance editor answers 10 questions about transitioning from a freelance writer to a freelance editor."}, {"type": "subtitle", "content": "Q: Can any writer become an editor?"}, {"type": "sentence", "content": "The quick and dirty answer: no. BUT. If you’re willing to work at it, I’d say that any author can become an editor. I’d been writing for many years before I even thought about editing as a viable profession for me, and when I first started editing, I knew next to nothing about it. However, I knew that I had a good eye for recognizing when something didn’t work. Then, once I learned about the technical and creative skills I’d need to become a successful editor, I focused on improving those skills. This is #1 thing you need to do to become successful—be willing to learn and try new things."}, {"type": "subtitle", "content": "Q: How many types of editing services are out there?"}, {"type": "sentence", "content": "There are four basic editing services:"}, {"type": "subtitle", "content": "Q: What the most logical path to becoming an editor?"}, {"type": "sentence", "content": "My advice is to focus on what you feel you’re best at. For instance, if one of your superpowers is brainstorming ideas or problem-solving, developmental editing would be ideal for you because you will spend many hours looking at a sometimes-problematic manuscript to figure out what changes need to be made to make their narrative match their original vision for their book. However, if you’re one of those types of writers with an eagle eye who can spot a misspelled word from a mile away, you would do well as a copy editor and/or proofreader. And if you have an intense love for revision—don’t knock it … some of us absolutely love this part of the writing process—you would be an excellent line editor. This requires both a creative and a technical eye for sentences that don’t work or don’t flow as well as they could."}, {"type": "sentence", "content": "But you don’t have to limit yourself to one type of editing service! I do all four of them, which allows me to take an entire project from start to finish, helping new authors shape their narrative into their dream book. And being able to be this kind of editor can allow you to make quite a decent income. (One of my contracts I signed last year was a low five-figure income. Though, it’s a year later, and I’m still working on the project because I also started doing some book-promoting work for this author.)"}, {"type": "sentence", "content": "And beyond what type of editing service you want to offer, I’d also decide which types of books you feel you’re more suited to. Fiction or nonfiction? Business or self-help? Science-fiction or romance? Beauty or fitness? Technical or creative? Young adult or middle grade? And the possibilities go on and on. I’d recommend picking a niche, even though that doesn’t mean that’s all you’re going to edit."}, {"type": "sentence", "content": "Then, I recommend you start educating yourself, or at the very least, look for an editor who is happy to mentor you through the entire process. I do this through the editing group I’m a managing editor for, and if you want to learn more about it, you can click the image below to learn how I got started as a freelance editor."}, {"type": "image", "content": "https://miro.medium.com/max/2520/1*9kNn4afVKLDM7owtSMO1Og.png"}, {"type": "subtitle", "content": "Q: Can you really make a full-time income as an editor?"}, {"type": "sentence", "content": "Absolutely! Within a year of taking my first editing gig, I was making enough money to quit my day job to freelance full-time. That was in July 2019, and my business is continuing to grow, month by month. One other thing I love so much about the freelance life is that it also gifted me with the extra time to work on my writing projects when I wasn’t busy editing someone’s book."}, {"type": "subtitle", "content": "Q: What is the earning potential of a freelance editor?"}, {"type": "sentence", "content": "At maximum capacity, I take about four to five freelance-editing jobs per month. Many of these average around $1,000 to $2,000, but I also take jobs around $4,000 to $5,000 on occasion if their word count is a bit bigger. (I once edited a 120k-word-count memoir for around $7,000.) So, let’s say I take five projects in a busy month (generally during the summer) … one of those is $1,000, one is $1,500, one is $2,500, one is $500, and one is $4,000. That’s almost $10,000 in gross income per month. And if these are jobs I received through my editing guild, I’d pay somewhere between $1,000 and $2,000 in commission. Not bad at all for doing something you love! AND if you could do that for 12 months, you would have earned a six-figure income that year. It’s not an unreasonable goal."}, {"type": "subtitle", "content": "Q: How do you find editing leads?"}, {"type": "sentence", "content": "There are several ways you can generate leads for new clients:"}, {"type": "subtitle", "content": "Q: What is an editing guild?"}, {"type": "sentence", "content": "An editing guild is a professional group of editors and/or writers that receive opportunities to bid on editing projects through the guild they belong to. I am a managing editor for an editing guild, and I send regular projects out to my editors to bid on. Then, the author decides which editor to work with, they sign a contract, receive payment based on their set rates, and the editing process begins. And this is exactly how I became so successful as an editor. Some editing guilds have different requirements for entry—some of the editing associations out there even serve as editing guilds. The editing guild I work for requires each member to first take their online course and pay a yearly membership fee to retain their eligibility for editing (and ghostwriting) projects. Then, our editors pay a commission based on how much the editing contract is. And because we have a large network of authors who use our services, we get a fair amount of editing requests regularly."}, {"type": "subtitle", "content": "Q: How do you market editing services?"}, {"type": "sentence", "content": "Like any other business, you’ll need to market yourself regularly. I use my website, social media, and email marketing to reach clients, but since I receive enough work through my editing guild, I don’t have to actively market very often."}, {"type": "subtitle", "content": "Q: But aren’t editing services too expensive for most authors?"}, {"type": "sentence", "content": "They can be because most authors don’t understand the market value of a good edit, and they can sometimes get scammed by low-cost editors who don’t offer them much value. This is a huge problem in our industry, but it’s not prohibitive. You may run into quite a few authors on these freelancing-gig websites who only want to pay $50–$100 to have their book-length manuscripts edited, but those kind of gigs aren’t ideal for most professional editors. I think they are ok when you’re first starting out, but if you stay at those low rates, it will be hard for you to build a successful business making next to nothing. I have to turn down projects a lot on these websites, and I don’t feel the least bit bad about that because I am confident in the value I offer my authors. Rest assured, though, that there are authors out there who understand what a great editor can do, and they are more than happy to invest in the future success of their books."}, {"type": "subtitle", "content": "Q: So, how do I *REALLY* get started?"}]}